{
	"url": "https://www.novelupdates.com/series/transmigrating-into-the-big-boss-villains-white-moonlight/",
	"title": "Transmigrating into the Big Boss Villain’s White Moonlight - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/08/56197.jpg",
	"noveltype": "(CN)",
	"genre": "Romance   School Life   Shoujo   ",
	"tags": "Adopted Children   Beautiful Female Lead   Cold Love Interests   Female Protagonist   Handsome Male Lead   Second Chance   Transmigration   ",
	"rating": "(4.1 / 5.0, 26 votes)",
	"author": "小刺莓   ",
	"year": "\nN/A",
	"ranking": "#2000   #2000   #7649   #9319   #6972   ",
	"reviewcount": "6 Reviews sorted by",
	"description": "Only after Gu Yan died did she realize that she was a cannon fodder in a book. She was given a chance to be reborn, but the condition was to give warmth to the cruel villain in this book and prevent him from turning black. \n\nIn the beginning, she transmigrated to the time when the big boss was still young. At this time, he was still a poor little child who was abused by his adoptive parents and bullied by his peers. While protecting him, Gu Yan taught him: Good boys don’t fight. \n\nAnd Gu Yan returned to her high school days. Just as she was ready to study hard and start over again, she met the villain who had grown up. The little boy who used to call her (elder) sister back in the past had grown into a cool and cold boy. The boy was wearing a white shirt while his slender fingers clamped a metal lighter, his eyes were sharp and indifferent. \n\nWhen Gu Yan encountered him once again, he was holding a person’s collar condescendingly. He said indifferently without emotion, “Get out of laozi’s way.” \n\nSome onlookers said to Gu Yan with a bewildered look: This is the Third High’s big shot, so fierce and ruthless, he happens to be very famous, won’t you happen to know?\n\nGu Yan: “?” What’s wrong with this development? Wasn’t it said that you wouldn’t be allowed to fight? \n\nGu Yan never expected that the cutie she had raised would soon become a big boss whom everyone feared. Furthermore, she had not even thought that one day, he would clasp her waist tightly, with the corners of his eyes red, he would mutter in her ear, “You can only be mine.”>"
}