{
	"url": "https://www.novelupdates.com/series/poison-genius-consort-2-emperors-swallow/",
	"title": "Poison Genius Consort 2: Emperor’s Swallow - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/04/20180201134348_771.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Drama   Fantasy   Historical   Josei   Martial Arts   ",
	"tags": "Adapted to Manhua   Ancient China   Army   Arrogant Characters   Assassins   Beautiful Female Lead   Bickering Couple   Bodyguards   Carefree Protagonist   Caring Protagonist   Charismatic Protagonist   Charming Protagonist   Childhood Love   Comedic Undertone   Couple Growth   Court Official   Doctors   Female Protagonist   Handsome Male Lead   Heartwarming   Imperial Harem   Kingdoms   Medical Knowledge   Misunderstandings   Nobles   Popular Love Interests   Romantic Subplot   Strong Love Interests   Transmigration   Wealthy Characters   ",
	"rating": "(3.8 / 5.0, 32 votes)",
	"author": "Jie Mo   芥沫   ",
	"year": "\n2018",
	"ranking": "#2000   #2000   #7040   #3756   #6479   ",
	"reviewcount": "3 Reviews sorted by",
	"description": "She was a peerless genius in the way of medicine, holding the Medicine King Cauldron in her hand.\n\nOnce she transmigrated, she became a lowly little medicine slave in dispensary.\n\nPhysicians made her life difficult, princesses humiliated her, even her fiancé came knocking on her door to break off the engagement? \n\nWhat was that?!\n\nHowever, she had the cauldron in her hand; the top-notch medicinal herb was in her hands. She stole rare and precious herbs, punished the slanderous, plotted against the petty, treated the Emperor’s sickness, and saved the Crown Prince.\n\nThen, the imperial edict turned the medicine slave to a concubine and received endless doting. It was unbreakable. Wait… didn’t Prince Jun, who wielded great power in the imperial court, say she was a a detestable individual?\n\nAs the saying goes, the concubine was good in the way of medicine.\n\nHowever…>"
}