{
	"url": "https://www.novelupdates.com/series/marriage-of-the-di-daughter/",
	"title": "Marriage of the Di Daughter - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/05/Marriage-of-the-Di-Daughter-Cover.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Drama   Fantasy   Mature   Romance   ",
	"tags": "Ancient China   Beautiful Female Lead   Betrayal   Bickering Couple   Calm Protagonist   Clever Protagonist   Complex Family Relationships   Cunning Protagonist   Death of Loved Ones   Determined Protagonist   Devoted Love Interests   Familial Love   Female Protagonist   Handsome Male Lead   Hard-Working Protagonist   Heartwarming   Late Romance   Love Interest Falls in Love First   Marriage   Nobles   Politics   Rebellion   Reincarnation   Revenge   Royalty   Schemes And Conspiracies   Second Chance   Smart Couple   Strong Love Interests   Tragic Past   ",
	"rating": "(4.4 / 5.0, 141 votes)",
	"author": "Qian Shan Cha Ke   千山茶客   ",
	"year": "\n2017",
	"ranking": "#380   #941   #949   #398   #921   ",
	"reviewcount": "42 Reviews sorted by",
	"description": "The young lady from the Xue family was talented and beautiful, and married the dream husband at the age of 16. They had a loving and harmonious relationship and were together for 3 years when her husband attained the title of Imperial Scholar.\n\nNow that he had attained glory and honor, he was dissatisfied with his commoner wife. He craved power and wealth; in his quest to become prince consort, he regarded her as an obstacle to marrying the princess and was willing to murder both his wife and children.\n\nThe arrogant and willful princess stood before her and ridiculed her: “So what if you are exceptionally beautiful and have unparalleled talents? After all, you are only a small official’s daughter, for this princess to crush you – is just as simple as crushing an ant to death!”\n\nHer reputation was smeared, she committed suicide by hanging, her brother was murdered while seeking justice for her, and her old father fell ill from the chain of grievous news and passed away.\n\nDuring the 42nd year of Hong Xiao’s reign, Yanjing’s no. 1 beauty, Xue Fang Fei, passed away. She reincarnated into the body of the Grand Secretariat’s daughter, Jiang Li, who drowned and was granted new life!\n\nShe got into a prominent family and engaged in dirty, underhanded dealings non-stop. She came across all sorts of bad characters, be they monsters or freaks, she dealt with them accordingly. An eye for an eye, a tooth for a tooth.\n\nOnce she was soft-hearted, but now she has become heartless! Jiang Li swore never to be an insignificant character again, and never to allow anyone to trample over herself again. This lifetime, she would seek justice by having her revenge and resolving this blood feud!\n\nHe is Northern Yan’s youngest duke, he is unrestrained and beautiful, he is capricious, and he collects the world’s strangest flowers.\n\nEveryone said that the Grand Secretariat’s second daughter is spirited and lovely, pure and kind, and that she is likened to a white lotus.\n\nHe is clad in beautiful, red clothes, and retorted with a smile, “A white lotus? She is clearly a man-eating flower that eats people without spitting out bones!”\n\nJiang Li: “Duke, careful you don’t break your hand.”\n\nJi Heng: “Such a ferocious man-eating flower, of course I’m going to snatch it home to safeguard.”\n\nAn unrestrained hunk vs a daughter from an aristocratic family. The pair of wolves in sheep’s clothing join hands to tyrannize the world.>"
}