{
	"url": "https://www.novelupdates.com/series/kneel-to-me/",
	"title": "Kneel to Me - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/06/Kneel-to-Me_1655055174.jpg",
	"noveltype": "(CN)",
	"genre": "Drama   Fantasy   Romance   Tragedy   ",
	"tags": "Acting   Age Progression   Aristocracy   Beautiful Female Lead   Bloodlines   Calm Protagonist   Clever Protagonist   Contracts   Family   Fated Lovers   Female Protagonist   First Love   Flashbacks   Genius Protagonist   Hackers   Hard-Working Protagonist   Jealousy   Kind Love Interests   Kingdoms   Loneliness   Love at First Sight   Love Interest Falls in Love First   Love Triangles   Lovers Reunited   Mismatched Couple   Modern Day   Past Plays a Big Role   Prison   Protagonist Strong from the Start   Reincarnation   Second Chance   Siblings   Smart Couple   Suicides   Survival   Survival Game   Technological Gap   Time Skip   Virtual Reality   World Hopping   Writers   ",
	"rating": "(4.6 / 5.0, 14 votes)",
	"author": "Jiangshan Cang Lan   江山沧澜   ",
	"year": "\n2020",
	"ranking": "#2000   #6324   #8621   #9322   #11390   ",
	"reviewcount": "6 Reviews sorted by",
	"description": "After Song Juyao died and emerged from the virtual world, she learned that her entire life had just been a reality show which was led and controlled by others.\r\n\r\nOne billion viewers watched this live broadcast, all of them pointing fingers at her and ridiculing her life whilst the director team thought up every possible method to design setbacks for her, pulling her into the mud over and over again.\r\n\r\nThen, Song Juyao was reborn. This time, her memory was not suppressed.\r\n\r\nThis was a crazy world. People were discontent and bored of their lives. They had also lost their enthusiasm for various kinds of entertainment, falling to the point of seeking all sorts of thrills in order to arouse their emotions.\r\n\r\nLater, they found a precious treasure. She was perfect. They held her in the palm of their hands and went wild for her. They even regarded her as a God and worshipped her fanatically.>"
}