{
	"url": "https://www.novelupdates.com/series/cheat-magician-life-that-started-from-being-judged-useless/",
	"title": "Cheat Magician Life That Started From Being Judged Useless - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2018/10/BE842E93-8A82-4FCA-B9C4-9240DA2FA9A4.jpeg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Comedy   Drama   Fantasy   Harem   Romance   Slice of Life   ",
	"tags": "Adapted to Manga   Beautiful Female Lead   Caring Protagonist   Demi-Humans   Dense Protagonist   Devoted Love Interests   Fantasy World   Hard-Working Protagonist   Harem-seeking Protagonist   Love Interest Falls in Love First   Loyal Subordinates   Male Protagonist   Monsters   Multiple Transported Individuals   Naive Protagonist   Near-Death Experience   Nobles   Overpowered Protagonist   Perverted Protagonist   Polygamy   Royalty   S*aves   Strong to Stronger   Timid Protagonist   Transported to Another World   ",
	"rating": "(3.5 / 5.0, 46 votes)",
	"author": "Shinoura Chira   篠浦 知螺   ",
	"year": "\n2018",
	"ranking": "#150   #137   #3000   #174   #4389   ",
	"reviewcount": "10 Reviews sorted by",
	"description": "I am Kokubu Kento, an eighth grader. While I was sleeping in class, the whole grade was summoned to a different world. According to the princess who summoned us, we weren’t summoned as heroes. Instead, we were meant to be replacements for dead soldiers. As we were being checked for magic, I got a useless rating, and I was about to get exiled but was given a last chance… I have a bad feeling about it… I wonder if I can go back… a cheat that awakens in desperate situations? The evilest skeletons are my guards? I’m in a different country after leaving the forest? A life without cheats in the world where I was abandoned started. Dungeon? Still haven’t gotten permission. Today I will be working the whole day at the warehouse to carry sweet potatoes, getting 350 helt daily. The guild debt and the living money are… Well, I live in a restaurant so the food is delicious.>"
}