{
	"url": "https://www.novelupdates.com/series/the-starry-sky-the-starry-sea/",
	"title": "The Starry Sky, The Starry Sea - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/02/The-Starry-Sky-The-Starry-Sea_1612315775.jpg",
	"noveltype": "(CN)",
	"genre": "Drama   Fantasy   Romance   Tragedy   ",
	"tags": "Adapted to Drama   Fantasy Creatures   Female Protagonist   Handsome Male Lead   Modern Day   Poor to Rich   Short Story   ",
	"rating": "(3.7 / 5.0, 7 votes)",
	"author": "Tong Hua   桐华   ",
	"year": "\n2015",
	"ranking": "#2000   #2000   #11868   #12557   #10683   ",
	"reviewcount": "1 Review sorted by",
	"description": "Shen Luo used to think that because she had no expectations of romance and was unlovably practical, she would never fall in love with a man she should not. So it was hard to believe that even though puberty had ended many years earlier, she found herself in such a dilemma. Although Wu Ju Lan was not a scumbag, liking him was not much better than liking a wastrel. He was like a dandelion dancing in the wind; no matter how beautiful he was, it did not change the ugly truth that he was a man without roots, without family, without anything to his name.\n\nThe only necessities in life are clothing, food and accommodation, fire, oil and salt. These things, be it a house or a car, be it jewelry or clothes, can be bought with money. Even if one could not afford the pricier options, there were always cheaper alternatives. However, there would never be a second Wu Ju Lan in the world; she will never find a similar man to love. Since she had the courage to face the possibility of a lifetime of singlehood, why didn’t she have the courage to pursue someone she fancied?\n\nShe was not the sort of person who was able to abandon her pride for love. Neither was she the sort who was willing to harbour an unrequited love. If she loved the wrong man, even if it pained her tremendously, she would let go of her feelings for him. But, if that person refused to leave her side, her only choice would be to stay together till death parted them!>"
}