{
	"url": "https://www.novelupdates.com/series/the-whole-world-is-my-crematorium/",
	"title": "The Whole World Is My Crematorium - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/12/The-Whole-World-Is-My-Crematorium.jpeg",
	"noveltype": "(CN)",
	"genre": "Drama   Romance   Xianxia   Yaoi   ",
	"tags": "Amnesia   Ancient China   Androgynous Characters   Artifacts   Brother Complex   Calm Protagonist   Character Growth   Charming Protagonist   Cold Protagonist   Complex Family Relationships   Confinement   Cooking   Corruption   Couple Growth   Cruel Characters   Cultivation   Dao Companion   Death   Destiny   Doting Love Interests   Dreams   Family   Handsome Male Lead   Hiding True Identity   Love Interest Falls in Love First   Male Yandere   Marriage   Misunderstandings   Mysterious Past   Mystery Solving   Parasites   Past Plays a Big Role   Past Trauma   Poisons   Second Chance   Secrets   Shapeshifters   Sharing A Body   Siblings Not Related by Blood   Slow Romance   Souls   Stubborn Protagonist   Torture   Transformation Ability   Tsundere   ",
	"rating": "(4.4 / 5.0, 161 votes)",
	"author": "比卡比   ",
	"year": "\n2020",
	"ranking": "#852   #384   #3264   #1115   #3015   ",
	"reviewcount": "28 Reviews sorted by",
	"description": "Xiao Yuan bears a heavy responsibility. Because of certain restrictions, he has to get along with a group of scum people. When the mission was completed, the restrictions disappeared, and Xiao Yuan screamed in delight: Ah, this is the taste of freedom! The Demon Lord who treated him as a plaything and infected him with a Gu worm, the junior brother who disliked him, the young Pavilion Master who used his blood to save his own Senior Brother – forgive him for not accompanying them.\n\nLater, Xiao Yuan learned the “face changing technique” and could imitate anyone’s appearance. With this, he starts various businesses: he can become what the clients wanted as long as he got paid enough. The business of Xiao Yuan’s was booming. He earned a lot of money, and big shots from all walks of life came to him admiringly. Then…\n\nJunior Brother: Oh, I will never let Senior Brother leave me again!\n\nPavilion Master: Xiao Yuan, do you want me to take out my heart to show it to you?!\n\nDemon Lord: What do I need to do for baby to forgive me, how about I let you bully me back?\n\nWife chasing crematorium burning all over the world, Xiao Yuan smiles: Don’t ask, asking means you’ve never loved before.>"
}