{
	"url": "https://www.novelupdates.com/series/the-twelve-years-song-of-the-unsung-friends/",
	"title": "The Twelve Years: Song of the Unsung Friends - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/10/The-Twelve-Years-Song-of-the-Unsung-Friends.jpg",
	"noveltype": "(CN)",
	"genre": "Historical   Josei   Romance   ",
	"tags": "Ancient China   Beautiful Female Lead   Calm Protagonist   Caring Protagonist   Complex Family Relationships   Doctors   First Love   Handsome Male Lead   Hard-Working Protagonist   Hiding True Identity   Living Abroad   Long-distance Relationship   Older Love Interests   Secret Identity   Sickly Characters   Smart Couple   Tragic Past   Unconditional Love   Wealthy Characters   ",
	"rating": "(4.6 / 5.0, 23 votes)",
	"author": "Mo Bao Fei Bao   墨宝非宝   ",
	"year": "\nN/A",
	"ranking": "#3567   #3140   #8970   #12116   #7549   ",
	"reviewcount": "2 Reviews sorted by",
	"description": "A century and more ago, China was embroiled in turmoil and instability. Opium usage was rampant in the country. Foreign powers carved up China’s land into foreign-controlled concessions and leased out lands. The Qing Dynasty was on its last legs. Military warlords and cliques fought for power. People rose up to fight for change, some wanting reform and to institute a constitutional monarchy, some wanting a revolution, to completely change the political situation.\n\nThis is the backdrop of our story, which opens in the year 1911. It is truly a historical romance, with many references to historical events and people.\n\nShen Xi is a wanted criminal of the Qing Dynasty, not for any crime that she committed but because her father was charged as a reformist and punishment was doled out to the entire clan. She has been living hidden away in the dirtiest of places, until one day something happens and she is rescued by the Third Master of the House of Fu, Fu Tongwen. Third Master Fu, the romantic, suave young master known for his love of women and frivolity, whose wealth is countless, sends her abroad to study and guarantees the safety and well-being of the rest of her life. She thinks that the ties between the two of them are merely the letters she regularly posts to him and the replies he sends back, but one day he appears in the parlour of her townhouse in New York. During this time, her interaction with him increases until one day she abruptly makes the decision to return to China. In her travels and interaction with him, she learns that this man who on the outside appears to be (by a modern-day terms), a playboy in reality holds a heart for his country and its people and carries a longing to bring change—to see a China restored to splendour and prosperity.\n\nThe Third Master Fu of her first encounter with him was a rich, frivolous young lord who would reserve half of an entire venue for only the purpose of increasing the popularity of the entertainer he was fond of, a man who liked to sit with one ankle resting on the thigh of the other leg, his head tilted to the side to quietly converse with the wealthy young masters around him. In the glow of lamplight, the side view of his face exuded an air of dissolute suaveness. It was only later that she saw the real him: In the dim illumination, what he sat upon were actually piles of white skeletons and what he guarded were the vast, magnificent lands of the nation.>"
}