{
	"url": "https://www.novelupdates.com/series/i-will-become-the-ex-wife-of-the-beast/",
	"title": "I Will Become the Ex-Wife of the Beast - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/06/I-Will-Become-the-ExWife-of-the-Beast.jpg",
	"noveltype": "(KR)",
	"genre": "Comedy   Drama   Fantasy   Josei   Romance   ",
	"tags": "Aristocracy   Beautiful Female Lead   Curses   European Ambience   Female Protagonist   Love Interest Falls in Love First   Misunderstandings   Nobles   Obsessive Love   Reincarnated in Another World   Strong Love Interests   Transmigration   ",
	"rating": "(4.0 / 5.0, 31 votes)",
	"author": "Aperta   아페르타   ",
	"year": "\n2019",
	"ranking": "#2000   #2000   #7809   #2249   #6458   ",
	"reviewcount": "No Reviews",
	"description": "I possessed a 19+ novel character.\r\n\r\nUnfortunately, I became Bella, the younger sister of the first wife who was traumatized by the beast.\r\n\r\n\r\nWhat is this obscure position?\r\n\r\nNo! It can’t be!\r\n\r\n\r\nIf it goes like this, my eldest sister will have an affair and my life will come to an end.\r\n\r\nIn the end, I voluntarily sell myself as his bride instead of my sister, but I have a different goal.\r\n\r\n\r\nMy goal is to safely become the beast's ex-wife!\r\n\r\n\r\nI tried to become the best-divorced woman in the empire with beauty and wealth by receiving alimony from the devastated land that later emerged as a site for the reconstruction of the imperial palace, but this beast is not an easy one.\r\n\r\nHe said, 'Why do you think I'm going to give you a divorce?'\r\n\r\n'Yeah? Of course, that’s-”\r\n\r\n“… I think my wife is misunderstanding something.”\r\n\r\nThe Grand Duke slowly smiled and approached me. The face behind that mask was a decadent and charming smile that was unbelievable for a ferocious beast.\r\n\r\n“I am a beast. I am not stupid.”\r\n\r\n\r\n\r\n… Did you think I would give up if you said that?\r\n\r\n\r\nDid you say we can't get a divorce now that I managed to take care of the land, raised my younger sibling, and had a good life?\r\n\r\n\r\nExcuse me, Mr. Beast.\r\n\r\n\r\nI'm Bella, the legendary “soil-spooner”*! I think you got the wrong person!\r\n>"
}