{
	"url": "https://www.novelupdates.com/series/i-never-want-to-be-a-younger-brother-again/",
	"title": "I Never Want to be a Younger Brother Again - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/07/YoungerbrotherAgain3.jpg",
	"noveltype": "(CN)",
	"genre": "Drama   Romance   Xuanhuan   Yaoi   ",
	"tags": "Animal Characteristics   Beastkin   Charming Protagonist   Childcare   Cold Love Interests   Cold Protagonist   Comedic Undertone   Cultivation   Cute Children   Handsome Male Lead   Late Romance   Master-Disciple Relationship   Misunderstandings   Mpreg   Mysterious Past   Overpowered Protagonist   R*pe Victim Becomes Lover   R*pe   Special Abilities   Straight Uke   Strong Love Interests   Transformation Ability   Transmigration   ",
	"rating": "(3.9 / 5.0, 81 votes)",
	"author": "Jiu Pin   九品   ",
	"year": "\n2015",
	"ranking": "#6970   #6280   #5166   #7589   #4273   ",
	"reviewcount": "15 Reviews sorted by",
	"description": "Yang Mu was originally a transmigrated person, but unfortunately even though he transmigrated he did not get the life of a transmigrated protagonist.\n\nAfter witnessing Shi Dixuan’s brutal murder of an Elder with the same name, “Yang Mu,” as himself, Yang Mu was left with a deep mental trauma of Shi Dixuan.\n\nAfter becoming Shi Dixuan’s younger brother, Yang Mu was eventually framed by others and killed.\n\nThen Yang Mu was reborn as the “Yang Mu” elder who was killed by Shi Dixuan in his past life. This new body was even more special as it could not have emotional fluctuations otherwise it would emit a special fragrance.\n\nBut whenever Yang Mu is beside Shi Dixuan, it is impossible to have absolutely no emotional fluctuations.\n\nTherefore after waking up, Shi Dixuan thought Yang Mu had intentionally drugged him with an aphrodisiac and angrily left.\n\nYang Mu felt he was comparable to Dou’e* but he was too terrified to find trouble with Shi Dixuan.\n\nWhen Yang Mu was finally able to let go of the incident and move on, he suddenly discovered there was something abnormal with his body.\n\n* [Dou’e is] a child bride turned widow who is wrongly convicted of crimes by a corrupt court official for actions perpetrated by a rejected suitor, Zhang the mule.  (Wikipedia)>"
}