{
	"url": "https://www.novelupdates.com/series/after-transmigrating-she-became-the-mother-of-two/",
	"title": "After Transmigrating, She Became the Mother of Two - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/05/motherof2.jpg",
	"noveltype": "(CN)",
	"genre": "Drama   Fantasy   Romance   ",
	"tags": "Adultery   Affair   Celebrities   Childcare   Female Protagonist   Modern Day   Netorare   Showbiz   Transmigration   Weak Protagonist   ",
	"rating": "(3.2 / 5.0, 76 votes)",
	"author": "攀枝花   ",
	"year": "\n2018",
	"ranking": "#1983   #1129   #2320   #2276   #3625   ",
	"reviewcount": "18 Reviews sorted by",
	"description": "After waking up, she transmigrated into the body of a notorious actress with the same name as hers who was married to a wealthy man and had children.\n\nHer mother-in-law did not like her, her husband did not love her, and the children one five year old and the other one did not even recognise her.\n\nJian Yi’s head was filled with water.\n\nWhat was more stupid-\n\nShe actually wanted to participate in a reality show with the babies? Raising two kids?\n\nThen she had a lovely time being with the two children, but why did the legendary husband who didn’t love her get closer to her?\n\n‘Wait, this bed is too crowded, don’t come up!’\n\nSu Zixuan: I do things in my legal capacity, what’s wrong?\n\nWhen ‘Mom and baby’ show was not aired, the audiences were like-\n\nAAA: Do you want to restore your bad public image using your babies?\n\nBBB: Taking advantage of the child to get married, and now using the child to clean up your social media image. Jian Yi doesn’t your conscience hurt?\n\nCCC: Jian Yi, be yourself.\n\nAfter the program was broadcasted-\n\nDDD: Jian Yi, please marry me!\n\nEEE: Is that the nanny? Did she get a master’s degree from a world class university? She is so haughty!\n\nFFF: Mother-in-law, please accept the little girl.\n\nGGG: I can’t wait for the Goddess, but I can wait for the little male God and the little Goddess to grow up!\n\nWWW: Mom!>"
}