{
	"url": "https://www.novelupdates.com/series/limitless-sword-god/",
	"title": "Limitless Sword God - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2016/04/27.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Fantasy   Harem   Martial Arts   Mature   Xuanhuan   ",
	"tags": "Adapted to Manhua   Alchemy   Antihero Protagonist   Arranged Marriage   Assassins   Beautiful Female Lead   Broken Engagement   Cheats   Cultivation   Cunning Protagonist   Demonic Cultivation Technique   Demons   Dense Protagonist   Enemies Become Lovers   First-time Interc**rse   Ghosts   Gods   Handsome Male Lead   Immortals   Male Protagonist   Mysterious Illness   Mysterious Past   Past Plays a Big Role   Previous Life Talent   R*pe Victim Becomes Lover   Revenge   Romantic Subplot   R*pe   Ruthless Protagonist   Second Chance   S*xual Cultivation Technique   Shameless Protagonist   Spirit Advisor   Sword Wielder   Tragic Past   Underestimated Protagonist   Weak to Strong   ",
	"rating": "(3.7 / 5.0, 592 votes)",
	"author": "Fire God   Huo Shen   火神   ",
	"year": "\nN/A",
	"ranking": "#2000   #6213   #358   #11527   #580   ",
	"reviewcount": "50 Reviews sorted by",
	"description": "Su Yun was a prodigy who was blessed by the gods. However, life was not always so smooth sailing. After reaching the 6th stage in the Spirit Novice Realm, his progress stagnated due to having incurred a rare medical condition.\n\nA few years went by, and Su Yun spent all his time gambling and drinking, wasting his youth away, but one day everything changed. Qing Er, the only one who stood by him, was forced by her clan to be a sacrificial bride for someone she didn’t love, only to be executed by the groom on the wedding night for fleeing. Revengeful, he scoured the world for a cure for his rare medical condition from both the righteous and villainous sides.\n\nCountless years go by, and Su Yun not only finds a way to cure his rare condition but also gains immense knowledge of a myriad of martial techniques in the process.\n\nBut before he could fully cure himself, he receives news that the groom had suffered an assault that damaged his internal organs. Rather than wait for decades to become fully cured, Su Yun decided to hatch a plan for the assassination of the groom. Unfortunately, he underestimated the strength of the groom’s family and was killed instead.\n\nThen he regains consciousness. He comes to a realization that he had been taken back to 15 years in the past. This time, he vows to protect Qing Er, first curing his rare medical condition. Will he learn from the mistakes of his previous life or will everything still be set in stone?>"
}