{
	"url": "https://www.novelupdates.com/series/i-refuse-to-reject-his-proposal/",
	"title": "I Refuse To Reject His Proposal - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/02/I-Refuse-To-Reject-His-Proposal.jpg",
	"noveltype": "(KR)",
	"genre": "Fantasy   Romance   ",
	"tags": "Aristocracy   Beautiful Female Lead   European Ambience   Female Protagonist   Forced Marriage   Fujoshi   Handsome Male Lead   Marriage   Nobles   Obsessive Love   Omegaverse   Power Couple   Pretend Lovers   Reincarnation   Second Chance   ",
	"rating": "(3.3 / 5.0, 12 votes)",
	"author": "스크류뿅뿅   ",
	"year": "\n2021",
	"ranking": "#6970   #6364   #10721   #8229   #8177   ",
	"reviewcount": "1 Review sorted by",
	"description": "The moment I fell off the cliff, I returned to the time before all misfortunes began. Brother Ethan's terrible death, the fall of my family. And a violent pheromone shower every day. \r\n\r\nIn order to prevent all those misfortunes, Ethan's political marriage must be ended first... \r\n\r\nBy the way, what kind of situation is this? \r\n\r\n'isn’t your brother here?” \r\n\r\n“Yes”\r\n\r\n'Then I’ll take you instead of him.' \r\n\r\nIs this person crazy? \r\n\r\nEileen was in tears and forcibly calmed herself down despite her arguments. The opponent was Archduke Rihast. The incomparable dominant alpha whose linage came directly from the imperial family. \r\n\r\n'Why me? No matter how big the title of the Archduke is, kidnapping in broad bright daylight shouldn’t be pardoned at all!” \r\n\r\n'It's not kidnapping, it's a proposal. Please marry me.' \r\n\r\nA threateningly tall and hard body approached Eileen as if it were pressing her.\r\n\r\n'Having the right to refuse?' \r\n\r\nIt was clear that Ethan would get married if Eileen refused him like this. It’s going to be the beginning of another misfortune.\r\n\r\n'Fine, I’ll marry you.” \r\n\r\nThe previously terrible misfortune had to be prevented somehow\r\n\r\nEven if a new misfortune comes.\r\n\r\n'Let's get married.'>"
}