{
	"url": "https://www.novelupdates.com/series/ill-be-your-wife/",
	"title": "I’ll be Your Wife - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/11/I’ll-be-Your-Wife.jpg",
	"noveltype": "(KR)",
	"genre": "Adult   Drama   Josei   Mature   Romance   Slice of Life   ",
	"tags": "Beautiful Female Lead   Body Swap   Forced into a Relationship   Forced Living Arrangements   Handsome Male Lead   Marriage   Modern Day   Poor to Rich   R-18   ",
	"rating": "(3.1 / 5.0, 10 votes)",
	"author": "Jho Hyo-Eun   ",
	"year": "\n2006",
	"ranking": "#2000   #2000   #12481   #7243   #10836   ",
	"reviewcount": "No Reviews",
	"description": "Sang-hyeok will believe it anyway. I fell asleep and was taken to the hospital... When I woke up, it was a special room in the hospital. And people who asked me called my wife, so when I looked in the mirror, it wasn't my face but the face of a woman I had never seen before. And my soul and I changed... Seungwon unnie. came to my room and told me to live like this.\nAre you your wife? Are you not mistaken for people right now? One day\n\n, 23-year-old female college student Kim Mo-rae\n\nhas an absurd change of body with the wife of a chaebol family !!\n\nOh, but why is the man named husband so handsome?\n\nAt the house I went to pretending to be my wife, the husband of a handsome chaebol was\n\nwaiting for me… … .\n\nThe project of seducing the chaebol’s chaebol husband, Kim Morae, the young lady of the right life!\n\nWill her mother-in-law be successful?\n\nA story that goes from being absurd to funny and then sad to doubly happy.\n\nThe project of seducing the chaebol’s chaebol husband, Kim Morae, the young lady of the right life!\n\nWill her mother-in-law be successful?\n\nA story from absurd to funny and sad to doubly happy!!\n\n“What kind of person is your husband?”\n\n“… … artificial human.”\n\n“Yes?”\n\n“It’s a machine. I have everything, but I have no heart. I have no feelings.”\n\n“Think about money, only money. Billions of dollars.”\n\nThe sand smiled as he painted the profound smile of King Sejong on the 10,000 won bill.”>"
}