{
	"url": "https://www.novelupdates.com/series/the-senorita/",
	"title": "The Señorita - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2017/10/the-senorita.jpg",
	"noveltype": "(FIL)",
	"genre": "Historical   Josei   Romance   ",
	"tags": "Beautiful Female Lead   Time Travel   ",
	"rating": "(3.6 / 5.0, 22 votes)",
	"author": "Pinayblonde   ",
	"year": "\nN/A",
	"ranking": "#2000   #2000   #10387   #12294   #10985   ",
	"reviewcount": "1 Review sorted by",
	"description": "'Ever heard of this painting called ‘The Señorita’? I bet you haven’t. I never thought this painting existed until I visited the basement of the Manila Art Museum.\r\n\r\nIt’s a painting of a woman in a baro’t saya, with her back turned to the viewer. I asked the art director about the story of this painting. According to him, this was donated by a wealthy businessman after he lost his wife to an illness. The businessman was an avid art collector and he got The Señorita for an affordable price at a garage sale in Calamba, Laguna. He was obsessed with looking at it every day, until he realized that he was starting to go bankrupt and that his wife fell ill. When his wife died, he gave away the painting to the Manila Art Museum, and now it resides in the basement.'\r\n-anonymous \r\n\r\n...\r\n\r\nThe Señorita, also known as La Señorita.\r\n\r\nThe said painting seemed old. The colors appeared like they would fade away at any moment. And even its golden frames were giving off signs of crumbling.\r\n\r\nJust from the title itself, one would imagine the Señorita as a beautiful girl made into a masterpiece, even immortalized through that said exceptional painting.\r\n\r\nHowever, it was actually hiding a mystery. No one knows about the said painting’s history, especially about the model and its painter. It was also said to be jinxed, never failing to bring misfortune on whomever's hands it would fall to. But, who was the maiden being called the Señorita and are the stories revolving around her true?\r\n\r\nWas the painting really accursed?>"
}