{
	"url": "https://www.novelupdates.com/series/clearing-an-isekai-with-the-zero-believers-goddess-the-weakest-mage-among-the-classmates-ln/",
	"title": "Clearing an Isekai With the Zero-Believers Goddess – the Weakest Mage Among the Classmates (LN) - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/12/Clearing-an-Isekai-With-the-ZeroBelievers-Goddess-the-Weakest-Mage-Among-the-Classmates-LN.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Comedy   Fantasy   Harem   Romance   Shounen   ",
	"tags": "Adapted to Manga   Adventurers   Angels   Average-looking Protagonist   Calm Protagonist   Cheats   Childhood Friends   Clever Protagonist   Conditional Power   Couple Growth   Cunning Protagonist   Demi-Humans   Demon Lord   Demons   Dense Protagonist   Depictions of Cruelty   Determined Protagonist   Devoted Love Interests   Discrimination   Dragons   Elemental Magic   Elves   Evil Gods   Fallen Nobility   Game Elements   Goblins   God-human Relationship   Goddesses   Hard-Working Protagonist   Heroes   Hidden Abilities   Human-Nonhuman Relationship   Loli   Loner Protagonist   Lost Civilizations   Love Interest Falls in Love First   Magic   Magic Beasts   Male Protagonist   Monster Girls   Monsters   Multiple POV   Multiple Realms   Multiple Transported Individuals   Mythology   Near-Death Experience   Nobles   Polygamy   Quirky Characters   R-15   Reincarnation   Religions   Royalty   Saints   Secret Relationship   Skill Books   Slow Growth at Start   Slow Romance   Special Abilities   Spirit Users   Spirits   Strength-based Social Hierarchy   Strong Love Interests   Sword And Magic   Thieves   Transported to Another World   Underestimated Protagonist   Unique Weapon User   Unique Weapons   Vampires   Weak to Strong   ",
	"rating": "(4.3 / 5.0, 103 votes)",
	"author": "大崎アイル   ",
	"year": "\n2019",
	"ranking": "#2000   #6204   #3712   #4636   #3891   ",
	"reviewcount": "7 Reviews sorted by",
	"description": "Makoto Takatsuki is a normal high school student and a hardcore RPG player. However, “normal” goes out the window when his whole class is involved in a bus crash and whisked away to another world! Powerful gods rule this strange new land of magic and monsters, and every newcomer is blessed with strong stats and unique skills. Well, not quite. Makoto’s stats turn out to be pathetic, and his skills are super weak compared to his classmates’...he’s even stuck as an apprentice mage. Worse still, he’s given only ten years to live! Luckily, Makoto soon meets a minor goddess named Noah, who appears in Makoto’s dreams and asks him to become her first believer. With the help of Noah's blessings and a divine weapon, Makoto seeks to become strong enough to rescue his goddess from the dungeon where she’s been trapped. By training hard and using his weak skills in unorthodox ways, Makoto proves that, even when playing on hardcore difficulty, an RPG player always makes it to the end!>"
}