{
	"url": "https://www.novelupdates.com/series/boyfriend-for-hire/",
	"title": "Boyfriend For Hire - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/12/Boyfriend-For-Hire.jpeg",
	"noveltype": "(CN)",
	"genre": "Comedy   Drama   Josei   Romance   ",
	"tags": "Beautiful Female Lead   Confident Protagonist   Contracts   Cute Story   Devoted Love Interests   Familial Love   Female Protagonist   Handsome Male Lead   Hard-Working Protagonist   Love Interest Falls in Love First   Modern Day   Revenge   Slow Romance   Younger Love Interests   ",
	"rating": "(4.3 / 5.0, 23 votes)",
	"author": "Mò Lǐ   莫里   ",
	"year": "\n2019",
	"ranking": "#1326   #4157   #8928   #11314   #9577   ",
	"reviewcount": "4 Reviews sorted by",
	"description": "【Who says money can't buy love? —— You just haven't found the purchase link yet!】\r\n\r\nYang Xiao is charming, beautiful and makes a lot of money, but unfortunately, her eyes aren’t very good. Her first two boyfriends were nothing but beasts in human clothing. \r\n\r\nHer first boyfriend was a domineering CEO from a prestigious family. His only requirement? For her to get pregnant before marriage. A marriage license in exchange for giving birth to a son. \r\n\r\n——Yang Xiao: “Scram.” \r\n\r\nHer second boyfriend was a talented and highly respected university professor. However, this scholarly young man also had dozens of secret girlfriends and lovers on WeChat.\r\n\r\n——Yang Xiao: “Get lost.”\r\n\r\nIn order to deal with her concerned parents and stop her relatives from gossiping, Yang Xiao opened the “Rental Boyfriend” app, planning to hire a fake boyfriend to take home for the holidays.\r\n\r\nThe next day, a guy wearing a sports uniform and holding a basketball appeared outside Yang Xiao’s house. He was tall, young and very handsome with short, fluffy hair on his head, and eyes that curved into beautiful arcs when he smiled. Even the sky seemed to brighten up when he grinned.\r\n\r\n——“Thank you for hiring me! I’m Meng Yufan, your boyfriend.”>"
}