{
	"url": "https://www.novelupdates.com/series/apocalypse-meltdown/",
	"title": "Apocalypse Meltdown - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2017/11/meltdown2.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Comedy   Harem   Mature   Psychological   Sci-fi   Seinen   Supernatural   ",
	"tags": "Aggressive Characters   Apocalypse   Army   Army Building   Artificial Intelligence   Beautiful Female Lead   Calm Protagonist   Cannibalism   Cautious Protagonist   Clever Protagonist   Dark   Depictions of Cruelty   Determined Protagonist   Evolution   Firearms   Game Elements   Gore   Handsome Male Lead   Hard-Working Protagonist   Leadership   Loyal Subordinates   Male Protagonist   Military   Modern Day   Past Plays a Big Role   Post-apocalyptic   Reverse R*pe   R*pe   Ruthless Protagonist   Schemes And Conspiracies   Second Chance   Special Abilities   Strong to Stronger   Sudden Strength Gain   Wars   Zombies   ",
	"rating": "(3.5 / 5.0, 261 votes)",
	"author": "Twenty-Two Knife Flow   二十二刀流   ",
	"year": "\n2015",
	"ranking": "#6970   #6339   #704   #1783   #1976   ",
	"reviewcount": "57 Reviews sorted by",
	"description": "The day a mysterious darkness enshrouded the world. It was theorized that the earth’s magnetic field had been changed, the data that corresponded to it also changed. The previous academic knowledge had been overturned, and numerous things had to be re-explored.\n\nThe science that humanity was familiar with had been disrupted, including the genes of human beings. One of the largest disasters brought by the change was that 80% of humanity transformed into zombies. After years of struggling, a few lucky survivors would evolve and awaken a power inside themselves. Chu Han was never that lucky.\n\nWhile holding on against the first wave, humans weren’t the only ones getting stronger. Soon, stage 1 zombies evolved into stage 2 then 3 and so on. 10 years after the mysterious meltdown, the world of man belonged to the zombies. Humanity was nearing the of the end of the eschatology.\n\nOne day, Chu Han consciousness came back ten years before the end of the world came. He was awakened by a loud noise in a dormitory in Minqiu University. With only 1 day to prepare before the meltdown begins, he slowly begins to realised that he had undergone a rebirth. A power was awaking inside of him now despite never appearing in the hellish future. It calls itself the meltdown system.\n\nDespite losing the monstrous strength gained through years of harsh training, this system claims to trade kills for talents. This is a story of a collapsing world, a meltdown system, and Chu Han being on stage as he travels to save those he could not save before.>"
}