{
	"url": "https://www.novelupdates.com/series/sorry-ive-been-invincible-for-a-billion-years/",
	"title": "Sorry, I’ve Been Invincible for a Billion Years - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/12/Sorry-Ive-Been-Invincible-for-a-Billion-Years.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Xianxia   ",
	"tags": "Arrogant Characters   Beast Companions   Clever Protagonist   Cosmic Wars   Cultivation   Dao Comprehension   Demi-Humans   Gods   Male Protagonist   Multiple Realms   Multiple Reincarnated Individuals   Mythical Beasts   Nobles   Overpowered Protagonist   Pets   Protagonist Strong from the Start   Schemes And Conspiracies   Secrets   Servants   Special Abilities   Strength-based Social Hierarchy   Strong Love Interests   Underestimated Protagonist   Villainess Noble Girls   World Travel   ",
	"rating": "(2.9 / 5.0, 7 votes)",
	"author": "一只小醉倾   ",
	"year": "\n2019",
	"ranking": "#2000   #2000   #10947   #12437   #12468   ",
	"reviewcount": "2 Reviews sorted by",
	"description": "'What are you talking about, you are a reincarnator? In the last life, you were a god, so I am not qualified to kill you?' Chu Lingxiao's eyes were full of contempt as he lightly waved his big hand.\r\nThis reincarnator, known as the Sword Immortal, dissipated into nothingness.\r\n'King of Assassins? Wealth comparable to a country? Also, a master who is number one in the Sky Ranking? The woman you’re interested in, let me stay away?'\r\nNext second.\r\nThe King of Assassins, dead!\r\n'You, a waste, got a cultivation system and became the patriarch of a royal martial family? I can’t afford to offend you?'\r\nChu Lingxiao coldly smiled: 'I'm sorry, people like you, I’ve killed no fewer than five hundred.'\r\nThe waste who thought he could soar, died with horror engraved on his face.\r\n'You travelled to the Realm of Cultivation, and in just a thousand years, you became a supreme power, titled the Imperial Monarch?'\r\nChu Lingxiao lightly said:\r\n'I'm sorry, 300,000 years ago, there was a peerless heavenly emperor who traversed the universe, his head is still buried on the moon.'>"
}