{
	"url": "https://www.novelupdates.com/series/the-sword-named-no-way-out/",
	"title": "The Sword Named No Way Out - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/02/The-Sword-Named-No-Way-Out.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Comedy   Mystery   Romance   Shounen Ai   Supernatural   Xianxia   ",
	"tags": "Adapted to Drama CD   Adopted Protagonist   Ancient Times   Appearance Different from Actual Age   Betrayal   Carefree Protagonist   Character Growth   Childish Protagonist   Cold Love Interests   Cultivation   Enemies Become Lovers   Genius Protagonist   Ghosts   Gods   Handsome Male Lead   Hiding True Identity   Love Interest Falls in Love First   Magic Formations   Magical Space   Master-Disciple Relationship   Misunderstandings   Obsessive Love   Parallel Worlds   Playful Protagonist   Possession   Power Couple   Puppeteers   Reincarnation   Second Chance   Time Manipulation   Unique Cultivation Technique   ",
	"rating": "(4.4 / 5.0, 91 votes)",
	"author": "Huai Shang   淮上   ",
	"year": "\n2020",
	"ranking": "#6970   #2829   #3743   #2765   #3180   ",
	"reviewcount": "21 Reviews sorted by",
	"description": "Legend has it that the world’s most formidable man Xu Shuangtze owned a cherished portrait of his deceased wife. But no one knew that on its back was another portrait of his arch rival who Xu Shuangtze had killed with his own hands.\n\nSixteen years ago, the Chief of Immortal Alliance’s Department of Discipline, Gong Wei, brought a blade with him on the Immortal Ascension Platform. His assassination of Xu Shuangtze failed and he was slain on the spot by the sword named No Way Out.\n\nSixteen years later, Gong Wei opened his eyes and found himself reborn in the body of a beautiful fool who even had to kneel down when talking to Lord Xu.\n\nThis was not the only disturbing thing for him.\n\nBecause of his ravishing good looks, remarkable power and status as well as his premature death in his previous life, he was now the beloved muse of countless writers. Books and stories featuring him as the main lead to all kinds of relationships were circulated far and wide. Even among the famous sects there were rumours of his forbidden encounters with every sect leader…>"
}