{
	"url": "https://www.novelupdates.com/series/domineering-ceo-is-my-son/",
	"title": "Domineering CEO Is My Son - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/08/Domineering-CEO-Is-My-Son.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Drama   Slice of Life   ",
	"tags": "Age Regression   Body Swap   Character Growth   Doting Parents   Familial Love   Family   Male Protagonist   Modern Day   Mute Character   Rich to Poor   Wealthy Characters   ",
	"rating": "(4.7 / 5.0, 23 votes)",
	"author": "Chengnan hua kai   城南花开   ",
	"year": "\n2021",
	"ranking": "#2000   #2000   #7218   #12113   #6913   ",
	"reviewcount": "6 Reviews sorted by",
	"description": "Xia Sheng and Yue Qin were a couple that would give others faith in love. They both fell in love at first sight in their first year of high school. The two dated in university and got married after their graduation. In the first year of their working lives, Xia Sheng became pregnant and delivered their son.\n\nWhen their son turned one, he was diagnosed with mutism. Life was tough for the little couple, but it was still sweet.\n\nYue Qin’s company welcomed its new boss. He was an insensitive fuerdai*. During their company’s annual event, where employees were invited to a meal with their family members, the new boss heartlessly fired Yue Qin just because his son didn’t say any words of blessing. He stated that Yue Qin’s mute son was detrimental to the company’s image.\n\n*Pinyin for the phrase “rich second generation”\n\nWhen Yue Qin returned home and saw his wife and son, he held back the fact that he had just been fired and immediately scoured for new jobs.\n\nThe next day, the new boss drank and drove. He brought himself into a car accident and fell into a coma on site.\n\nWhen the new boss opened his eyes again, he saw the employee he had fired a day ago. His eyes were filled with benevolence——\n\n“Papa’s good boy, papa’s going to work, don’t forget to take care of mama at home today.”\n\nAll he could do was whine in rage.>"
}