{
	"url": "https://www.novelupdates.com/series/a-mistaken-marriage-match-a-generation-of-military-counselor/",
	"title": "A Mistaken Marriage Match: A Generation of Military Counselor - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2015/07/cuojialiangyuan.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Comedy   Drama   Fantasy   Josei   Martial Arts   Mystery   Romance   Supernatural   ",
	"tags": "Ancient China   Appearance Different from Actual Age   Army   Arranged Marriage   Beautiful Female Lead   Bickering Couple   Clever Protagonist   Cold Love Interests   Cold Protagonist   Couple Growth   Crime   Dense Protagonist   Disfigurement   Female Protagonist   Investigations   Late Romance   Leadership   Love Interest Falls in Love First   Loyal Subordinates   Mature Protagonist   Military   Modern Knowledge   Multiple Reincarnated Individuals   Older Love Interests   Politics   Power Couple   Smart Couple   Strategic Battles   Strong Love Interests   Suicides   Transmigration   Transported to Another World   ",
	"rating": "(4.3 / 5.0, 583 votes)",
	"author": "Qian Lu   浅绿   ",
	"year": "\nN/A",
	"ranking": "#1732   #1306   #477   #110   #299   ",
	"reviewcount": "90 Reviews sorted by",
	"description": "She is an honorably retired SWAT officer with meritorious deeds and is a dashing detective who solves cases like a god.\n\nOne day, a strange golden board with eight divinatory trigrams brings her to a different world, where she is bestowed as a gift to a general’s manor.\n\nHe is a grim god of war whose power overwhelms six countries and the defender-general of the state with military power in his hands. An imperial edict brought him a delicate concubine. He turned and left. After returning, his second in command and soldiers ignored him. Instead, they kept on saying, “What does madam think?”\n\nWhen has the general’s manor changed its owner?\n\nSolving cases, training soldiers, night attacks, suppressing bandits, street fights, counter-terrorism operations, naval battles – one after another appeared on stage. She played with flourish, yet he was unable to resist even a little.>"
}