{
	"url": "https://www.novelupdates.com/series/transmigrated-into-the-villains-younger-sister/",
	"title": "Transmigrated into the Villain’s Younger Sister - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/05/微信图片_20200507101905.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Drama   Fantasy   Romance   Slice of Life   ",
	"tags": "Beautiful Female Lead   Bullying   Fat to Fit   Female Protagonist   Handsome Male Lead   Incest   Male Yandere   Multiple Transported Individuals   Possessive Characters   Siblings Not Related by Blood   Transmigration   ",
	"rating": "(3.9 / 5.0, 68 votes)",
	"author": "Xue Mo   雪默   ",
	"year": "\n2019",
	"ranking": "#4617   #6247   #3918   #6341   #3092   ",
	"reviewcount": "24 Reviews sorted by",
	"description": "Shen Yu unintentionally transmigrated into a melodramatic romance novel. She is now a miserable cannon fodder who shares the same name as her. Her adopted brother is the main BOSS villain in the novel who became more and more nefarious over time under the influence of the novel’s White Lotus. He fought tooth and nail with the main male lead and in the end, the villain faces utter defeat. \n\nShen Yu wiped the cold sweat off her forehead before letting out a sigh in relief. She transmigrated just in time!!!\n\nThe main villain has yet to entangle himself too deeply with the White Lotus and as such, hasn’t completely blackened. Shen Yu still has an opportunity to rescue him from the clutches of the White Lotus.\n\nHence, from the shadows, she plotted and conspired to destroy the relationship between the BOSS villain and the White Lotus.\n\nBut who could have guessed that this villainous brother is so abnormal? Not only did he force strawberries onto her and pulverized her house, but he even slashed his own arms without blinking an eye!\n\nWu wu wu, she’s sooo afraid!!\n\n*************************************************\n\nBOSS Villain: “Baby, do you have a crush on me?”\n\nLittle White Bunny: “I don’t have, I’ll never have one. I’m your younger sister!”\n\nBOSS Villain: “Stop creating trouble, you’re just a baby who was picked up from the garbage dump.”\n\nLittle White Bunny: ……………….\n\nIn brief: I treat you as my brother and tried rescuing you. But, you …. you turn around and try to eat me!\n\nDeranged ML X Terrified Bun FL>"
}