{
	"url": "https://www.novelupdates.com/series/princess-of-animals/",
	"title": "Princess of Animals - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/06/Princess-of-Animals.png",
	"noveltype": "(KR)",
	"genre": "Drama   Fantasy   Romance   Shoujo   Supernatural   ",
	"tags": "Aristocracy   European Ambience   Female Protagonist   Marriage   Royalty   ",
	"rating": "(3.6 / 5.0, 5 votes)",
	"author": "허라윤   ",
	"year": "\n2020",
	"ranking": "#2000   #2000   #12966   #10476   #9802   ",
	"reviewcount": "No Reviews",
	"description": "Princess of The Animals\r\n\r\nThe confined princess, Elysee.\r\n\r\nOutside the eyes of her father, she lives in isolation from people.\r\n\r\n“It’s okay, because I have you guys.”\r\n\r\nHowever, she was never lonely thanks to her ability to communicate with animals.\r\n\r\nOne day, even though Elysee thought she would just live her life like this… \r\n\r\n“Your marriage has been decided.”\r\n\r\nIn another word, she was sold off in a marriage.\r\n\r\nTo Kale Phinea, Prince of the Northern Continent, known as the Land of the Barbarians!\r\n\r\n***\r\n\r\nBy the way,\r\n\r\n[ “Are you feeling any better?” ]\r\n\r\n[ “The food was adjusted to suit your taste as much as possible.” ]\r\n\r\nThe rumors that they were savages were overshadowed, in reality, they were friendly and dignified.\r\n\r\nBesides~\r\n\r\nGreat stature, solid physique.\r\n\r\nKale Phinea, who has a beautiful appearance that doesn’t seem to match with the word barbarian. Oh, just looking at him, her heart was already fluttering.\r\n\r\n…Why are you so good to me? \r\n\r\n“Is it because of the marital responsibility of the Northern Continent?”\r\n\r\nContrary to Elysee’s straightforward question, his voice was passive.\r\n\r\n“That’s right. I feel a great responsibility for you.”\r\n\r\n“…” \r\n\r\n“But, you can’t do everything just because of the word responsibility.”\r\n\r\nShe stared at Kale blankly.\r\n\r\nHe seemed to be smiling, and at the same time, something soared from inside her that made Elysee’ throat sore.\r\n\r\n“You are stronger and greater than anyone I know.”>"
}