{
	"url": "https://www.novelupdates.com/series/haunting-spectre-road/",
	"title": "Haunting Spectre Road - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2015/08/hauntingspectr.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Drama   Fantasy   Horror   Mystery   Psychological   Supernatural   Xuanhuan   ",
	"tags": "Ghosts   ",
	"rating": "(3.6 / 5.0, 5 votes)",
	"author": "Tinadannis   ",
	"year": "\n2007",
	"ranking": "#2000   #2000   #13506   #13807   #13349   ",
	"reviewcount": "No Reviews",
	"description": "It was said that if someone takes this road during the dead of night, they will die a blood-covered death, their face filled with terror. She didn’t believe it and went there alone. And guess what happened? Before her death, she used all her remaining strength and said two sentences, “Death is inevitable! There is no escape!” Strange things kept on happening, people were dying, did it all start with the girl that committed suicide 50 years ago? He Jian Fei, Tian Yin Zhen, Dong Lu, Shen Fang, Shi Ting, Ah Qiang and Uncle Li will take you on a journey of no return. Suspense and horror, supernatural elements and magic, truth and reality vs. fake and false, love and fraternal bonds, humans and ghosts, evil and justice, love and hate. Tinadannis shows you a world of intertwined mystery and splendour.\r\n\r\n<em>Legends are a common thing for the university campus, or maybe it’s a secret established through common practice. When generation after generation of talented individuals leave, it alone remains behind, deeply rooted, continuous and never ending. Resentment, like love, can also be endless. Therefore, exists the never ending nightmare from rumours——a nightmare belonging only to the school campus. (excerpt from chapter one)</em>\r\n\r\nFirst of four books in the Haunting Spectre Road tetralogy brought to you by horror writer Tinadannis, the fast paced first book will leave you wondering about what’s to come next and the fate of the characters.>"
}