{
	"url": "https://www.novelupdates.com/series/the-male-leads-male-wife/",
	"title": "The Male Lead’s Male Wife - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/11/The-Male-Leads-Male-Wife.jpg",
	"noveltype": "(CN)",
	"genre": "Drama   Fantasy   Martial Arts   Romance   Slice of Life   Yaoi   ",
	"tags": "Ancient Times   Childcare   Cute Children   Devoted Love Interests   Dreams   Forced Marriage   Handsome Male Lead   Kidnappings   Lack of Common Sense   Late Romance   Long Separations   Mob Protagonist   Mpreg   Possessive Characters   R*pe Victim Becomes Lover   Reincarnation   Revenge   R*pe   Secret Identity   Strong Love Interests   Transmigration   Tsundere   Weak to Strong   ",
	"rating": "(3.2 / 5.0, 25 votes)",
	"author": "Fu Sheng Jie Wei Jin   浮生皆未尽   ",
	"year": "\n2019",
	"ranking": "#2000   #1930   #8079   #4970   #6789   ",
	"reviewcount": "6 Reviews sorted by",
	"description": "Yi HanZhi stayed up all night and read a martial arts novel. Because the plot was too bad, he swore at the author all night. And then, he found out the next day he actually transmigrated into that specific novel, and it was still the kind of dispensable passerby character.\r\n\r\nYi HanZhi said that if he transmigrated, then just let it be. Anyway, he was just a passerby. It was not his turn to accompany the male lead to fight monsters and upgrades. He would just stay at home and perform his role of unrestrained and romantic young master. When he was bored, he would stroll around the red-light district. Wouldn’t it be a happy life?\r\n\r\nWho knew that the protagonist would come to the door that day and ask him to hand over some martial arts secrets?\r\n\r\nYi HanZhi said ‘what the hell is it? I don’t know!’　\r\n\r\nSo, he drove the protagonist out and molested the protagonist by the way, because he was so good-looking, and thus Yi HanZhi couldn’t hold it back. As a result, he fell into a tragedy that night.\r\n\r\nHe had been single in the real world for more than 20 years, and once he transmigrated, he wanted to go to the so-called flower street in ancient times to take a look.\r\n\r\nIn a place called Furong Pavilion, he saw a woman with a devastatingly beautiful face, and his heart was full of joy. He wanted to spend a good night with her that night. Who knew that the beauty was actually a man?\r\n\r\nDamn it! He must really be blind to mistake a man for a woman!\r\n\r\nAs a result, that night, Yi HanZhi felt that he was in a nightmare.\r\n\r\nEven if he was fucked by a man, he just took it as being bitten by a dog. But after a few months, he actually found that his belly was slowly growing bigger?\r\n\r\n“You are pregnant.” The doctor’s extremely kind voice sounded in his ear.\r\n\r\nWhat’s the situation? He didn’t remember this setting in the novel. Hello? He is a man!! !>"
}