{
	"url": "https://www.novelupdates.com/series/meet-you-when-the-night-ends/",
	"title": "Meet You When the Night Ends - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/04/Meet-You-When-the-Night-Ends.jpg",
	"noveltype": "(KR)",
	"genre": "Adult   Comedy   Drama   Josei   Mature   Romance   Smut   ",
	"tags": "Aristocracy   Beautiful Female Lead   Carefree Protagonist   Character Growth   C*nnilingus   Different Social Status   Disabilities   Discrimination   European Ambience   Female Protagonist   Military   Misunderstandings   Past Trauma   Royalty   Seduction   Shameless Protagonist   Sickly Characters   Tsundere   ",
	"rating": "(3.9 / 5.0, 44 votes)",
	"author": "박소연   ",
	"year": "\n2021",
	"ranking": "#5262   #6224   #6927   #5810   #5076   ",
	"reviewcount": "3 Reviews sorted by",
	"description": "Leticia, the princess of the Kingdom of Levanstein, is to pay a penalty after losing a bet with her club members. The penalty for her is to dance with a man at the victory banquet—a man not easy on the eyes. This is an impossible task for Leticia, as she preys on handsome men. But since she had drunkenly bet even her throne, she resigns to her mistake and searches for a partner.\r\n\r\nA messy, shaggy haired man dressed in a captain’s uniform standing on the corner by himself draws her attention. She recognizes him as Les Kishir, born in a common household to an unreputable family and no accomplishments in the war. Thinking him to be the perfect candidate for the penalty, Leticia asks him for a dance. But to her utmost surprise, she is rejected.\r\n\r\nOnly after seeing him limping away, does she realize why she was rejected. She finds Les to apologize and ends up seducing him and spending the night with him. Satisfied with the night, she waits for his call, but it never comes…\r\n\r\nNot one to give up, she approaches him again but Les is a tough one to win over.  \r\n\r\n*\r\n\r\n“I like the relationship between a man and a woman. It can evolve into so many possibilities.”\r\n\r\n“And what do you think my possibilities are, princess?”\r\n\r\n“Hmm…let’s see.” \r\n\r\nHer finger touched his pale lips. As she pushed her finger down, he opened his mouth. \r\n\r\n“I think you’ll be able to kiss me until I lose my mind.”>"
}