{
	"url": "https://www.novelupdates.com/series/who-dares-slander-my-senior-brother/",
	"title": "Who Dares Slander My Senior Brother - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2017/06/2452808.jpg",
	"noveltype": "(CN)",
	"genre": "Adult   Adventure   Mature   Mystery   Romance   Xianxia   Yaoi   ",
	"tags": "Ancient Times   Animal Characteristics   Bestiality   Betrayal   Black Belly   Caring Protagonist   Charming Protagonist   Clingy Lover   Cultivation   Cunning Protagonist   Devoted Love Interests   Disfigurement   Handsome Male Lead   Hard-Working Protagonist   Love Interest Falls in Love First   Male Yandere   Misunderstandings   Mob Protagonist   Multiple POV   Mystery Solving   Older Love Interests   Pets   R*pe   S*xual Abuse   Strong Love Interests   System Administrator   Time Skip   Transmigration   Transported to Another World   Yandere   ",
	"rating": "(4.4 / 5.0, 458 votes)",
	"author": "Guyu Smell Incense   古玉闻香   ",
	"year": "\n2015",
	"ranking": "#874   #1123   #599   #1428   #217   ",
	"reviewcount": "78 Reviews sorted by",
	"description": "Transmigrating into a novel one morning, Wen Jing arrived at the side of the one he worshiped and admired the most, becoming a loyal hound that was willing to go through fire and water for his senior brother.\n\nEven the most arrogant cultivator said: “There is no one in this world who can enter my eyes, but only Jun YanZhi is truly noble.”\n\nWen Jing grew up alongside his senior brother, idolizing his senior brother beyond all means.\n\nUnfortunately, he was ignorant, and as for this novel, he had only read half of it.\n\nMidway through the storyline, he finally realized that things didn’t seem to be the way he thought they were.\n\nWen Jing: “Last night, Senior brother infiltrated Master’s abode. Master, please take heed.”\n\nHis master: “Nonsense! Your master was inside the abode all night last night, and did not see anyone else.”\n\nWen Jing: “Last night, Senior brother left on his own without permission to meet someone. Martial Uncle, please thoroughly investigate.”\n\nHis martial uncle: “Nonsense! Last night your senior brother and I were drinking and chatting merrily, all the way until morning.”\n\nWen Jing: “Last night, Senior brother was improper towards me……”\n\nHis senior sister: “Nonsense! How can your senior brother possibly do that kind of thing? Don’t tell me you’ve long held those kind of intentions towards him, and unable to obtain what you wanted, you’re now framing him?”\n\nMany years later.\n\nWen Jing: “There’s this evil brute, specializing in using his top-notch, exquisite looks and elegant disposition to fool people, and everyone is in the midst of danger while not even aware of it themselves.”\n\nJun YanZhi: “If it wasn’t for you, that evil brute would most likely still be struggling in pain and suffering.”>"
}