{
	"url": "https://www.novelupdates.com/series/silent-lover/",
	"title": "Silent Lover - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/09/Silent-Lover.jpg",
	"noveltype": "(CN)",
	"genre": "Drama   Fantasy   Mature   Romance   Tragedy   Yaoi   ",
	"tags": "Abusive Characters   Adapted to Drama CD   Adapted to Manhua   Ancient China   Androgynous Characters   Character Growth   Cold Love Interests   Cruel Characters   Cute Protagonist   Disabilities   Handsome Male Lead   Love Interest Falls in Love First   Male Yandere   Misunderstandings   Mpreg   Mute Character   Obsessive Love   Possessive Characters   R*pe Victim Becomes Lover   Royalty   R*pe   Sadistic Characters   Schemes And Conspiracies   S*xual Abuse   S*aves   Stockholm Syndrome   Weak Protagonist   Yandere   ",
	"rating": "(3.8 / 5.0, 173 votes)",
	"author": "Qiang Tang   羌塘   ",
	"year": "\n2018",
	"ranking": "#3710   #2269   #2487   #2960   #1877   ",
	"reviewcount": "42 Reviews sorted by",
	"description": "The Northern Garrison Prince possesses authority that reaches all the way to heaven, surpassing tens of thousands of people. The Northern Garrison Prince is licentious and lustful, not distinguishing between female and male partners, with a brutality beyond compare—though he has taken nine concubines as wives, not a single one managed to survive. This time, the Northern Garrison Prince is interested in the daughter of the prefectural magistrate.\n\nTo prevent her fate of being tormented to death by the Northern Garrison Prince—just as the crown prince was switched with a raccoon dog—a mute s*ave from the magistrate’s residence is sent as a substitute on the marriage sedan. The mute s*ave was born with the beauty of an exiled immortal, but also the disability of voicelessness; because of his appearance that might attract misfortune, he was locked away in the courtyard by his mother.\n\nSuddenly one day, the prefectural magistrate’s household bestows upon him the name of Shen Yu and sends people to teach him how to serve another before delivering him onto the bed of the “Living King of Hell.” Will he become the tenth ghost to die unjustly under the Northern Garrison Prince’s body?\n\nHE>"
}