{
	"url": "https://www.novelupdates.com/series/kiraware-yusha-ni-tensei-shitanode-aisare-yusha-o-mezashimasu-subete-no-%e3%80%8czamaa%e3%80%8dfuragu-o-heshiotte-kenjitsu-ni-kurashitai/",
	"title": "Kiraware Yūsha ni Tensei Shitanode Aisare Yūsha o Mezashimasu! ~ Subete no 「Zama~a」Furagu o Heshiotte Kenjitsu ni Kurashitai!~ - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/07/Kiraware-Ysha-ni-Tensei-Shitanode-Aisare-Ysha-o-Mezashimasu-Subete-no-ZamaaFuragu-o-Heshiotte-Kenjitsu-ni-Kurashitai.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Fantasy   Harem   Romance   School Life   Shounen   Slice of Life   ",
	"tags": "Academy   Adapted to Manga   Aristocracy   Beautiful Female Lead   Bullying   Childhood Friends   Demi-Humans   Demon Lord   Dragons   Dungeons   Elemental Magic   Engagement   Fantasy World   Heroes   Kingdoms   Knights   Maids   Male Protagonist   Misunderstandings   R-15   Saints   Sword And Magic   Transmigration   ",
	"rating": "(3.3 / 5.0, 21 votes)",
	"author": "Suzuki Ryuuichi   鈴木竜一   ",
	"year": "\n2020",
	"ranking": "#408   #423   #4168   #378   #7465   ",
	"reviewcount": "2 Reviews sorted by",
	"description": "In a certain popular web novel, the Hero Barrett repeatedly harasses the Protagonist Raul with malicious intent before eventually kicking him out of his party. \n\nHowever, after being defeated by the awakened Raul, he ends up losing his status, honor, as well as his cute childhood friend-cum-fiancée, and then he disappears from the story.\n\nThe readers only have hate comments for him: “You reap what you sow,” “Beat it, you piece of trash,” “Serves you right LOL.” \n\nHaving been reincarnated as Barrett, the hated hero, I will break all my destruction flags to overthrow my bleak future.\n\nI vow to myself that I’ll work hard without getting drowned in my talents to become a Hero loved by the people, prevent my childhood friend from being stolen by the Protagonist Raul, and lead a peaceful life with her.>"
}