{
	"url": "https://www.novelupdates.com/series/magic-gems-gourmet-ln/",
	"title": "Magic Gems Gourmet (LN) - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/07/magiggemsgourmet_v1b.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Fantasy   Harem   Romance   ",
	"tags": "Ability Steal   Academy   Accelerated Growth   Adapted to Manga   Age Progression   Beast Companions   Beastkin   Beautiful Female Lead   Betrayal   Bullying   Child Protagonist   Childhood Friends   Demi-Humans   Demon Lord   Doting Parents   Dragons   Elemental Magic   Elves   Fantasy World   Goddesses   Handsome Male Lead   Hard-Working Protagonist   Humanoid Protagonist   Incest   Level System   Love Interest Falls in Love First   Loyal Subordinates   Magic   Male Protagonist   Master-Servant Relationship   Monsters   Nobles   Overpowered Protagonist   Parent Complex   Polygamy   Reincarnated in Another World   Reincarnation   Royalty   Secret Identity   Sibling Rivalry   Skill Assimilation   Special Abilities   Sudden Strength Gain   Sword And Magic   Time Skip   Underestimated Protagonist   Vampires   Weak to Strong   ",
	"rating": "(3.8 / 5.0, 73 votes)",
	"author": "ore2gou   Yuuki Ryou   俺２号   結城涼   ",
	"year": "\n2018",
	"ranking": "#684   #762   #1581   #1138   #2041   ",
	"reviewcount": "8 Reviews sorted by",
	"description": "Thanks to the Goddess, he was reincarnated into nobility!　That should have been great―― but the skill he got, 【Toxin Decomposition EX】 was simply too plain, and he was made fun of everyday at home……\n\nHowever, at one time, he noticed he could eat the magic stones of monsters with that skill and absorbs their abilities, furthermore, he was informed he was the prince of the neighboring country!\n\nWhat awaited him at the royal castle was an environment where he could train and experiment with the abundant amount of magic stones, bringing out his strong potential――and finally, even acquiring the ability of the legendary monster, the Dullahan!\n\nSurrounded by an assertive fiancée and a clumsy knight girl, the new life for the boy who will become a “King” begins!>"
}