{
	"url": "https://www.novelupdates.com/series/monster-soul-online/",
	"title": "Monster Soul Online - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/05/Capture.png",
	"noveltype": "(TH)",
	"genre": "Action   Adventure   Fantasy   Martial Arts   Supernatural   ",
	"tags": "Artificial Intelligence   Character Growth   Cute Children   Dense Protagonist   Determined Protagonist   Dragons   Fantasy World   Hard-Working Protagonist   Honest Protagonist   Level System   Magic   Male Protagonist   MMORPG   Modern Day   Monsters   Mysterious Past   Mythical Beasts   Pets   Psychic Powers   Seven Deadly Sins   Virtual Reality   Wars   Weak to Strong   World Travel   ",
	"rating": "(3.8 / 5.0, 103 votes)",
	"author": "Persona   ",
	"year": "\n2011",
	"ranking": "#2000   #2000   #1604   #7465   #4175   ",
	"reviewcount": "14 Reviews sorted by",
	"description": "Monster Soul Online.\n\nA virtual reality MMORPG known primarily for one thing: there are no rules. It is a lawless world where humans can shed the masks they wear and unleash the cruel beasts inside. It is in this very world that our story takes place.\n\nAfter our protagonist, Sila, is defeated in a match that was in no way fair, he is forced to venture into this world after his master goes missing. The only clue? His opponent from the duel, Montra, says that he kidnapped Sila's master. Outside of the game, they are but two young men in a vast world filled with many kinds of people. Inside Monster Soul, however, Montra reigns supreme as the Magic Emperor, one of the top four players. Sila, on the other hand, is just starting out, and he has a lot of catching up to do if he wants to get answers from Montra.\n\nBut not everything is as it seems in this world, and what starts off as a simple journey to find his missing teacher turns into a quest of previously unpredictable proportions. Sila uncovers a world beneath the reality he thought he knew, filled with martial artists capable of incredible feats. From the legendary Tiger God to the peerless Sword Prodigy, Sila will learn about and even meet some of these figures that other martial artists both revere and fear. His quest will push him to his limits and bring out both the best and worst parts of his inner self. His light and his darkness. Whether he makes it out while retaining some part of his original personality or not, only time will tell.>"
}