{
	"url": "https://www.novelupdates.com/series/i-should-have-read-the-ending/",
	"title": "I Should Have Read The Ending - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/01/i-should-have-read-the-ending.jpg",
	"noveltype": "(KR)",
	"genre": "Adult   Drama   Fantasy   Josei   Romance   Smut   ",
	"tags": "Aristocracy   Beautiful Female Lead   Calm Protagonist   Clever Protagonist   Cruel Characters   Depictions of Cruelty   Devoted Love Interests   European Ambience   Female Protagonist   Handsome Male Lead   Kingdoms   Love Interest Falls in Love First   Manipulative Characters   Nobles   Pragmatic Protagonist   R-18   Reincarnation   Royalty   R*pe   Second Chance   Transmigration   Wealthy Characters   ",
	"rating": "(3.9 / 5.0, 134 votes)",
	"author": "Rosalynn   로사린   ",
	"year": "\n2019",
	"ranking": "#2000   #2000   #1651   #1317   #1182   ",
	"reviewcount": "25 Reviews sorted by",
	"description": "One day, out of the blue and without notice, a reader transmigrates into the body of an unfortunate Empress, Diana, who was caught in the midst of a blossoming love between her husband, the Emperor, and another woman, Trisha.\n\nDiana, her character, was destined for death and she thought it better to perish sooner than the intended time, but… there lays an issue. Reincarnation played a pivotal role in the book.\n\n“Since it’s like this, I’d rather die than become Crowned Empress again.”\n\nAnd she did. \n\nBut instead of escaping the book, she returned to the past as Diana. Caught in this bitter cycle, she was determined not to live a life of ignorance and unawareness.\n\nMeanwhile, a new figure emerged — the Crowned Emperor’s enemy. His name was Edwin, the Grand Duke who became infatuated with Diana. To Edwin, their meeting was love at first sight, at least he thought so.\n\n“I’ll prove I’m not a nobody. I’ll show you that I can make you happy. Right now, give me a chance, Diana.”\n\n“But… we’re still…”\n\n“Now and forever, I promise. I promise you that I’ll pick up your broken pieces and carry you to a land of bountiful happiness.”\n\nEdwin’s black eyes were wrought full of beastly desire and affection. His love was wild and unavoidable, and Diana could do nothing to get away.\n\n‘I should have read the ending,’ Diana thought.>"
}