{
	"url": "https://www.novelupdates.com/series/the-white-cat-that-swore-vengeance-was-just-lazing-on-the-dragon-kings-lap/",
	"title": "The White Cat That Swore Vengeance Was Just Lazing on the Dragon King’s Lap - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2017/02/shironeko1_cover.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Comedy   Drama   Fantasy   Romance   Shoujo   Slice of Life   Supernatural   ",
	"tags": "Adapted to Manga   Beastkin   Beautiful Female Lead   Contracts   Demi-Humans   Dragons   Fairies   Fantasy Creatures   Female Protagonist   Handsome Male Lead   Hiding True Abilities   Hiding True Identity   Human-Nonhuman Relationship   Identity Crisis   Magic   Male Yandere   Manipulative Characters   Misunderstandings   Overpowered Protagonist   Possessive Characters   Royalty   Seeing Things Other Humans Can't   Shapeshifters   Spirits   Sword And Magic   Transformation Ability   Transported to Another World   Underestimated Protagonist   ",
	"rating": "(4.0 / 5.0, 369 votes)",
	"author": "Kureha   クレハ   ",
	"year": "\n2015",
	"ranking": "#5262   #4159   #657   #1243   #302   ",
	"reviewcount": "43 Reviews sorted by",
	"description": "While on her way to college, Ruri and her classmates from her secondary school days were summoned to another world by a bright light that shone on the ground.\n\nThe summon was supposed to call forth a shrine maiden that would bring glory to the country. With ‘a’ being the operative word, It seems that she was just an unfortunate bystander that got mixed up in the summoning.\n\nLuckily for her, accommodations and other necessities were provided. Not so luckily, she was made into a criminal by the conspiracy concocted by her so-called ‘friends’ and was exiled to the forest.\n\nShe was saved by a witch after encountering an unknown being. She then swore vengeance on her former ‘friends’.\n\nStudying under the witch, she finally gained enough power to exact her vengeance… or so the story was supposed to go, other than the fact that she turned into a white cat, and was sleeping comfortably on the lap of the Dragon King.>"
}