{
	"url": "https://www.novelupdates.com/series/raising-babies-in-the-70s/",
	"title": "Raising Babies in the 70s - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/06/Raising-Babies-in-the-s.jpg",
	"noveltype": "(CN)",
	"genre": "Romance   Slice of Life   ",
	"tags": "Beautiful Female Lead   Blind Dates   Caring Protagonist   Childcare   Cooking   Couple Growth   Cute Children   Cute Story   Family   Farming   Female Protagonist   Handsome Male Lead   Love at First Sight   Military   Pregnancy   Transmigration   ",
	"rating": "(4.3 / 5.0, 33 votes)",
	"author": "松鼠醉鱼   ",
	"year": "\n2022",
	"ranking": "#488   #356   #5609   #734   #7037   ",
	"reviewcount": "11 Reviews sorted by",
	"description": "Qin Rou was a kindergarten teacher with a soft personality. In order to protect a child in the kindergarten, she was stabbed in the back by a wicked man, but accidentally she transmigrated as an arrogant and coquettish female supporting character whose personality was opposite of hers. The cannon fodder supporting character Qin Rou was an excellent female partner in the novel of 70’s  Art Troupe. She served as a comparison tool to the heroine Xue Tingting, who was gentle and kind, and was rejected by the leader.\r\n\r\nAfter transmigration, Qin Rou who after experiencing trauma of being murdered by a middle aged man got afraid of the fierce and tall military men who she performed for. How could she dare to stay? She just wanted to apply for discharge from the army as soon as possible.\r\n\r\nWho knew that Qin Rou was blessed, and the leader asked her to go on a blind date with a man with a prickly personality.\r\n\r\n'She has a fiery personality, so she’s just perfect for him.'\r\n\r\nThe ill-tempered Lu Yan, from a good family background, had made great contributions and was about to be sent to a certain island. He was asked to solve his personal marriage problems as soon as possible.\r\n\r\nLu Yan was arranged for several blind dates, and was famous because of his short temper, incomprehensible style, and countless beauties. Every girl who went on a blind date with him returned crying.\r\n\r\nTo give him a lesson, his father said bluntly, 'Choose a girl with the fiercest character for him!'\r\n\r\nThe tempered guy sat down with the hottest Chilli Pepper on a blind date.\r\n\r\nThe girl Qin Rou returned from blind date with red swollen eyes as well.\r\n\r\nBut in a couple days news came that just after one meeting they agreed to marry each other???\r\n\r\nGrandfather: (ノ=Д=)ノ┻━┻\r\n\r\nThe leader of the Troupe was dumbfounded: ... Really?\r\n\r\nQin Rou's fake sister: ...Really climbed the high branch?\r\n\r\nLu Yan and Qin Rou got married.\r\n\r\n'Look, they will divorce soon!'\r\n\r\n'Can Qin Rou go to the island with him to live a hard life?'\r\n\r\nThe sisters in the troupe and Lu Yan's comrades in arms all thought that after the two people got married, they would divorce in two years.\r\n\r\nWho would have guessed that two years later, the woman hugged the child, and the prickly man honestly changed the diapers.\r\n\r\nQin Rou x Lu Yan\r\n\r\nStepping on the silver beach, eating caviar, the warm daily life of husband and wife raising a baby on the island.>"
}