{
	"url": "https://www.novelupdates.com/series/the-price-of-confessing-to-the-wrong-female-protagonist/",
	"title": "The Price of Confessing To The Wrong Female Protagonist - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2018/12/45224-1.jpg",
	"noveltype": "(CN)",
	"genre": "Adventure   Comedy   Drama   Romance   Xianxia   Yuri   ",
	"tags": "Ancient Times   Beautiful Female Lead   Calm Protagonist   Cultivation   Female Protagonist   Love Interest Falls in Love First   Master-Disciple Relationship   Possessive Characters   Transmigration   Yandere   Younger Love Interests   ",
	"rating": "(4.2 / 5.0, 70 votes)",
	"author": "满城时光   ",
	"year": "\n2015",
	"ranking": "#4617   #2000   #3876   #5888   #3777   ",
	"reviewcount": "4 Reviews sorted by",
	"description": "Yun Ge learned a tragic lesson after transmigrating: You shouldn’t skip when reading a novel! Even if the chapter name says “The Death of Yun Ge”, you shouldn’t just immediately click it! And you definitely shouldn’t give it a negative rating out of anger just because the cannon fodder that happened to have your name was thrown into a brothel as the lowest of prostitutes. If you hadn’t given it a thumbs down, you wouldn’t have transmigrated! And if you hadn’t transmigrated, you wouldn’t be stuck without any foreknowledge of the events to come, in this undoubtedly tragic role of “Yun Ge” right now! \n\nYun Ge clenched her fists. It doesn’t matter. At least she knew that the female protagonist’s name was “Lin Yuan”! In the first part of the story, she was Yun Ge’s junior sister! As soon as that girl appears, Yun Ge should just stick to her and start currying favor. Hug her thighs! Shell definitely be able to change her own fate! \n\nIn the days and nights that passed as she waited for the protagonist to appear, the only comfort Yun Ge had was her cute and thoughtful little disciple. \n\nUntil one day… \n\nLittle Disciple: Master, why are you always so fond of Martial Aunt Lin Yuan? Is having this disciple not enough? \n\nYun Ge: Obedient disciple, please don’t mess around! She’s the female protagonist! Fate’s beloved! Whoever crosses the line will die a miserable death! \n\nThe Obedient-Looking Disciple: Since she’s the most important in Master’s eyes… it would be me if she dies, right? \n\nYun Ge: My disciple, don’t mess around!!!! This Master still needs to get in her good graces!>"
}