{
	"url": "https://www.novelupdates.com/series/i-became-a-guide-for-my-childhood-friend/",
	"title": "I Became a Guide For My Childhood Friend - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/01/I-Became-a-Guide-For-My-Childhood-Friend.png",
	"noveltype": "(KR)",
	"genre": "Comedy   Fantasy   Romance   ",
	"tags": "Aristocracy   Beautiful Female Lead   Charming Protagonist   Comedic Undertone   Cute Protagonist   Cute Story   Devoted Love Interests   Doting Love Interests   European Ambience   Fated Lovers   Female Protagonist   First Love   Handsome Male Lead   Jealousy   Love Interest Falls in Love First   Marriage of Convenience   Nobles   Obsessive Love   Possession   Possessive Characters   Reincarnated in Another World   Royalty   Strong Love Interests   Unrequited Love   ",
	"rating": "(3.2 / 5.0, 23 votes)",
	"author": "Yoo Woohee   유우희   ",
	"year": "\n2021",
	"ranking": "#1910   #1510   #6257   #2013   #6034   ",
	"reviewcount": "3 Reviews sorted by",
	"description": "'I told you. You have to take responsibility for me. We have to get married.”\r\n\r\nAn unexpected difficulty appears in front of Yernia, who tried to find love in her hopes to avoid a forced marriage, but then, she became a dedicated guide to her childhood friend. \r\nThe current events aren’t happening the way they should be, and they have become so twisted compared to the original novel.\r\n\r\n\r\n'I can't believe it.'\r\n\r\nShe was just a supporting character who tormented the Female Lead and then died from the Male Lead’s hands. \r\nYet, it is undeniable that Yernia is his guide from the pieces of evidence he had gathered so far!\r\n\r\nYena tried to stop herself from marrying her childhood friend, but it turned out she had no choice. \r\n\r\nHowever, unlike Yernia, who thought about divorcing him after being his guide for a little bit until the female protagonist arrives, Cassian seems to be serious about this marriage for some reason.\r\nEven...\r\n\r\n'I just can’t calm down today.' \r\n\r\n“You need more. Huh?'\r\n\r\nGuiding requires more contact.\r\n\r\nWell, is this what guides must do? \r\n\r\nIt felt strange, but the most bizarre thing to Yena was herself.\r\n\r\nWhy is her heart shaking so much?\r\n\r\nThe childhood friend, who she used to only see as a younger brother, begins to appear as a man.\r\n>"
}