{
	"url": "https://www.novelupdates.com/series/the-female-lead-has-no-cheats/",
	"title": "The Female Lead Has No Cheats - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/04/FLNC-novel-cover.png",
	"noveltype": "(CN)",
	"genre": "Comedy   Drama   Fantasy   Romance   ",
	"tags": "Amnesia   Beautiful Female Lead   Calm Protagonist   Celebrities   Childcare   Childish Protagonist   Cute Protagonist   Female Protagonist   Handsome Male Lead   Lazy Protagonist   Modern Day   Multiple Transported Individuals   Pregnancy   Shameless Protagonist   Showbiz   Transmigration   ",
	"rating": "(3.9 / 5.0, 115 votes)",
	"author": "Xuāncǎo Yāohuā   萱草妖花   ",
	"year": "\n2019",
	"ranking": "#2000   #2000   #969   #2378   #1926   ",
	"reviewcount": "34 Reviews sorted by",
	"description": "As the original heroine in the novel, Lin Yueqi’s life was made a complete mess by the traitorous female side leads: her top millionaire husband wanted to divorce her, her daughter became a villain, and the internet users wanted her to leave the entertainment industry. \r\n\r\nFemale side lead #1 brought her own magnificent and beautiful traitorous persona. Female side lead #2 transmigrated over and became the villain’s mother. \r\n\r\nFemale side lead #3 was even more extreme… In the end, her career and family were ruined and she died from excess of anger.\r\n\r\nLin Yueqi transmigrated to before the nightmares began, but she only had her memory up to when she was 17! She was dumbstruck. As an unfavorable heroine, Lin Yueqi found it more important to survive. She decided to give up her daughter and her top millionaire husband and retreat to being a stranger, staying far away from the goldfinger female side leads! \r\n\r\nShe spread rumors of her loveless marriage with her husband and how she picked up a child in order to swindle herself into a marriage. She decided to squander her luck with strangers and believed that she could almost successfully retreat from the heroine position when the negative news about her on the internet were cleared! \r\n\r\nHer husband, Lu Ting, came looking for her with their daughter, saying sternly, “Madame Lu, we have a loveless marriage? That’s not what you were saying when we were in bed.”\r\n\r\nHer daughter pursed her lips and sobbed, patting her stomach with her chubby hands. “Mummy, you said that you picked me up! This bun’s heart is aching!”\r\n\r\nLu Yueqi glanced at the little girl who hugged her stomach while crying, causing her heart to ache as well. \r\n\r\nHeh. How could she have given birth to such… a cunning little girl?! She must’ve picked her up! She refused to be the stepmother!  >"
}