{
	"url": "https://www.novelupdates.com/series/when-a-max-level-green-tea-becomes-the-heroine-of-an-abuse-novel/",
	"title": "When A Max Level Green Tea Becomes the Heroine of an Abuse Novel - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/08/When-A-Max-Level-Green-Tea-Becomes-the-Heroine-of-an-Abuse-Novel.jpg",
	"noveltype": "(CN)",
	"genre": "Adventure   Comedy   Drama   Romance   Supernatural   ",
	"tags": "Abusive Characters   Adultery   Alternate World   Ancient China   Apathetic Protagonist   Beautiful Female Lead   Betrayal   Businessmen   Calm Protagonist   Celebrities   Divorce   Doting Older Siblings   Doting Parents   Enemies Become Allies   Female Protagonist   Friendship   Manipulative Characters   Modern Day   Multiple Realms   Reincarnated in Another World   Revenge   Royalty   Showbiz   Sister Complex   System Administrator   Wealthy Characters   World Hopping   World Travel   Zombies   ",
	"rating": "(3.0 / 5.0, 7 votes)",
	"author": "茶色鸦   ",
	"year": "\nN/A",
	"ranking": "#2566   #2343   #12253   #5247   #11177   ",
	"reviewcount": "No Reviews",
	"description": "Shi Jiu was a max-level green tea that could pretend to be cute, play coy, act innocent, play a white lotus flower to tear her opponents apart.\r\n\r\n\r\nOne day, she was selected by a system and replaced the heroines of multiple dog blood abuse novels; she needed to fulfill the wishes of the original owner. \r\n\r\n\r\nKidneys dug out, abandoned after marriage, and used as a stand-in…. How can this work?\r\n\r\n\r\nShi Jiu rolled up her sleeves, tore the scumbag with her hands, stepped on them, and walked on the road of no return.\r\n\r\n\r\nLater:\r\n\r\nThe domineering president with handsome appearance, extraordinary family background, and countless wealth lit a cigarette: 'This woman doesn't love me at all, she only loves my money.'\r\n\r\n\r\nThe successful valedictorian:  'I thought she came to me because she loved me, who knows, she just wanted to screw me over.'\r\n\r\n\r\nThe multitalented, famous idol: 'She used to help me with all her heart. And I had thought she loved me very much, but who knew that she doesn't love me at all, instead she went to support other stars in a blink of an eye.'>"
}