{
	"url": "https://www.novelupdates.com/series/the-random-passerby-i-married-is-the-richest-man/",
	"title": "The Random Passerby I Married is The Richest Man! - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/12/randompasserby1.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Fantasy   Romance   ",
	"tags": "Beautiful Female Lead   Contracts   Devoted Love Interests   Female Protagonist   Handsome Male Lead   Hiding True Identity   Modern Day   Multiple Transported Individuals   Older Love Interests   Poor Protagonist   Pregnancy   Pretend Lovers   System Administrator   Transmigration   Wealthy Characters   ",
	"rating": "(4.1 / 5.0, 144 votes)",
	"author": "纳兰榴莲   ",
	"year": "\n2019",
	"ranking": "#2210   #1892   #1908   #4253   #1587   ",
	"reviewcount": "29 Reviews sorted by",
	"description": "When Bai Zhen Zhen woke up, she had actually become the main character of your typical Mary Sue novel.\n\nCar crash, miscarriage, amnesia… In order to fight with her for the male leads’ affection, those vicious women would stop at nothing.\n\nBai Zhen Zhen said: Who wants a bicycle! Only by walking the way of Buddha I can live a life free of worries till my old age!\n\nAs a result, she resolutely avoided the first, second and third male leads, and found a passerby to sign a contract marriage.\n\nThe day after obtaining the marriage certificate, shocking headlines stunned the world:\nThe only grandson of the world’s richest Huo family, Huo Xiang, who had been missing for 22 years, has finally been found!\nBai Zhen Zhen: Such coincidence? His name is exactly the same as yours!\nHuo Xiang: Darling, it’s me.\nBai Zhen Zhen: ?\n\nOn a certain day after the marriage, Bai Zhen Zhen took out several sheets of paper from the bottom of a box. It was the noninterference agreement they had signed before getting married.\n\nOn the cover, a string of gilded bold letters almost burnt her eyes  –– 《Bai Zhen Zhen x Huo Xiang’s True Love Filling 10,000 Years of Sweetness and Love Premarital Agreement》 ––\n\nMeow meow meow???\n\n//Male Lead’s version//\n\nOn a certain day, Huo Xiang was suddenly bound to a “Saving the female lead” system, and he transmigrated into a book with the mission of rescuing the female MC who was on the verge of experiencing a life full of suffering and torments.\n\nSide quest 1: Find the female lead. If the mission is completed successfully, your health will be restored.\n\nSide quest 2:  Marry the female lead within a week. After the mission succeeds, a new identity will be unlocked.\n\nSide quest 3:  …..\n\nBesides completing the side quests that pop up from time to time, he must do his best to love the female lead and let her reach 100 points of happiness.\n\nAs a result….\n\nHuo Xiang: Darling, I have cut the fruit for you, let me feed you, ok?\n\nBai Zhen Zhen’s happiness points: +0.1.\n\nHuo Xiang: Darling, the green tea b*tch2 that came to pick up a fight with you has already been driven out by me.\n\nBai Zhen Zhen’s happiness points: +1.\n\nHuo Xiang: Darling, I will be busy these days, you will have to play by yourself.\n\nBai Zhen Zhen’s happiness points: +10.\n\nHuo Xiang: ???>"
}