{
	"url": "https://www.novelupdates.com/series/tales-of-the-wickedly-vicious-underground-empire/",
	"title": "Tales of the Wickedly Vicious Underground Empire - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2015/10/tales-of-the-wickedly-vicious-underground-empire.jpg",
	"noveltype": "(JP)",
	"genre": "Adventure   Fantasy   Seinen   ",
	"tags": "Army Building   Dungeon Master   Kingdom Building   Kingdoms   Magic   Multiple Protagonists   R-15   Revenge   Royalty   Siblings   S*aves   Wars   ",
	"rating": "(4.0 / 5.0, 63 votes)",
	"author": "Hideki Uryu   ",
	"year": "\n2014",
	"ranking": "#2000   #2000   #8651   #2743   #4836   ",
	"reviewcount": "2 Reviews sorted by",
	"description": "It’s 5 years after the fall of the Magic Empire.\n\nThe Holy Kingdom is now the one who leads the Union of several countries, While restraining the other powers, it neglected to keep peace. The people of Holy Kingdom dream of perpetual peace. But with the wealth taken from Magic Kingdom, the buying of all slaves from minor powers, along with pillaging, they indulge themselves in the territories they snatch. However…\n\nUnknown to them, there are forces that moves behind the darkness.\n\nThese people, are mementos of a dead Empire.\n\nThe prince and princess of the long gone country, a pair of siblings.\n\nHarva, the princess, is a weak but lovely and energetic little girl\n\nAlarc, the prince, is a handsome young man with beautiful and kind smile.\n\n“That day, is the unforgettable day for us right, brother?!”\n\n“Yeah.”\n\nThe siblings escaped that day, the day when their beloved country turned into a land of nightmare. The day when the white sacred walls turned into crimson-stained walls of blood and fire. And the day when they lost everything. The siblings trained themselves, endured pain and sadness, losing soul and sanity, selling their soul to the darkness and evils, and now…  losing their former self, they create the foundation of what would be their last and dearest wish…\n\n”To grant our wish (revenge)…, —we create the Wickedly Vicious Underground Empire”\n\n….thus, starts the dark tale of revenge and retribution.>"
}