{
	"url": "https://www.novelupdates.com/series/peerless-martial-god/",
	"title": "Peerless Martial God - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2015/07/peerlessmartial.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Drama   Fantasy   Harem   Martial Arts   Mature   Shounen   Xuanhuan   ",
	"tags": "Adapted to Anime   Adapted to Manhua   Arrogant Characters   Battle Academy   Beast Companions   Beautiful Female Lead   Bloodlines   Caring Protagonist   Cultivation   Cunning Protagonist   Fast Cultivation   First-time Interc**rse   Friendship   Godly Powers   Gods   Handsome Male Lead   Hard-Working Protagonist   Inheritance   Lucky Protagonist   Magical Space   Male Protagonist   Marriage   Martial Spirits   Multiple Realms   Murders   Mysterious Family Background   Nobles   Pill Concocting   Politics   Polygamy   Pregnancy   Prophecies   Revenge   Romantic Subplot   Royalty   Ruthless Protagonist   S*xual Cultivation Technique   Skill Assimilation   Souls   Spirits   Strength-based Social Hierarchy   Strong Love Interests   Sword Wielder   Transmigration   Transplanted Memories   Transported to Another World   Underestimated Protagonist   ",
	"rating": "(3.0 / 5.0, 1407 votes)",
	"author": "Jing Wu Hen   净无痕   ",
	"year": "\n2012",
	"ranking": "#6970   #2000   #121   #14   #223   ",
	"reviewcount": "177 Reviews sorted by",
	"description": "Lin Feng was a diligent and hard-working person. He studied hard, did his best to make his family proud, and not get into trouble, but when he saw a girl being taken advantage of, he had to intervene. Being tricked, he was sentenced to 10 years in jail due to being framed for a crime he had never committed, losing everything. Before his life was over, he would first take those who ruined his life with him.\n\nSuddenly, he opened his eyes. Instead of dying, he woke up in the body of a different world's Lin Fen, alive. This other Lin Feng had been killed as he was tr*sh at cultivation. This world was one where the strong had no regard for human life, killing freely if they had the strength. Called “tr*sh” and thrown away, he will rise to new heights, going against heaven and earth's will.\n\n“Do not judge others ignorantly within my presence.\n\nThose who think of harming someone should be ready to be harmed.\n\nThose who are open and respectful shall receive my kindness and respect.\n\nThose who plot against me are seeking their own death.\n\nThis is true, for I am death… I am Lin Feng.”>"
}