{
	"url": "https://www.novelupdates.com/series/the-villainess-is-three-and-a-half-years-old/",
	"title": "The Villainess is Three and a Half Years Old - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/02/The-Villainess-is-Three-and-a-Half-Years-Old.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Drama   Fantasy   School Life   Sci-fi   Slice of Life   ",
	"tags": "Adapted to Visual Novel   Beautiful Female Lead   Charming Protagonist   Child Abuse   Child Protagonist   Childcare   Childhood Friends   Clones   Complex Family Relationships   Cute Children   Cute Protagonist   Cute Story   Doting Older Siblings   Doting Parents   Family   Family Conflict   Female Protagonist   Handsome Male Lead   Heartwarming   Lucky Protagonist   Modern Day   Secret Identity   Secrets   Siblings   Single Parent   Slow Growth at Start   System Administrator   Tragic Past   Transmigration   Villainess Noble Girls   Wealthy Characters   ",
	"rating": "(3.7 / 5.0, 32 votes)",
	"author": "锦橙   ",
	"year": "\n2020",
	"ranking": "#905   #1637   #6323   #2775   #7271   ",
	"reviewcount": "7 Reviews sorted by",
	"description": "Yeya is a little sprout of the Plant Clan, who has just turned 100 years old. To save her family, Yeya transmigrates into a novel.\r\n\r\nThe original owner of the body was a vicious villainess; the system asked Yeya to fulfill the task in place of the dead villainess.\r\n\r\nShe needs to be vicious and mercilessly suppress the protagonist at every turn. To do that, she needs to snatch away all his resources. And when the male lead is at his most vulnerable, she needs to hit him with a fatal blow.\r\n\r\nYeya nodded her head, indicating that she understood the task. However——\r\n\r\n“Uncle, what does it mean to be vicious and merciless?”\r\n\r\n“...” The system was extremely depressed and frustrated as he stared at the three and a half years old villainess.\r\n\r\n***\r\n\r\nYeya earnestly acted her villainess role according to the mission. However, the result was always contrary to the system’s expectations. As a result, the progress of the taskbar lengthened in reverse. The system eventually collapsed in despair, “Little one, what breed of plants are you? I’ve worked with your mother before. Your mother is a corpse flower*. She’s super malicious!”\r\n\r\nIsn’t genetics supposed to be strong?\r\n\r\nYeya, who is playing in the mud, has a soft and tender voice, “My father is a four-leaf clover, so I am a four-leaf clover as well~”\r\n\r\nThe system, “...” Wow, like father like daughter!\r\n\r\nT/N: * A carnivorous plant that mainly eats insects. It earned its name ‘the Corpse Flower’ because it smells like rotten flesh when it blooms. It’s also literally translated to ‘man-eating flower’.>"
}