{
	"url": "https://www.novelupdates.com/series/fatezero/",
	"title": "Fate/Zero - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2015/08/fatezero.png",
	"noveltype": "(JP)",
	"genre": "Action   Fantasy   Psychological   Seinen   Supernatural   Tragedy   ",
	"tags": "Adapted to Anime   Adapted to Drama CD   Adapted to Manga   Anti-Magic   Antihero Protagonist   Assassins   Based on a Visual Novel   Battle Competition   Betrayal   Corruption   Curses   Death of Loved Ones   Evil Gods   Firearms   Folklore   Gunfighters   Heroes   Homunculus   Knights   Legends   Magical Technology   Male Protagonist   Master-Servant Relationship   Modern Day   Multiple POV   Past Plays a Big Role   Past Trauma   Priests   Servants   Summoned Hero   Summoning Magic   Sword And Magic   Tragic Past   Unrequited Love   Wishes   ",
	"rating": "(4.5 / 5.0, 81 votes)",
	"author": "Nasu Kinoko   Nitro+   Type-Moon   Urobuchi Gen   ",
	"year": "\n2006\r\n",
	"ranking": "#2000   #2000   #7269   #13810   #6047   ",
	"reviewcount": "1 Review sorted by",
	"description": "War of the Holy Grail - Pursuing the power of the 'Holy Grail' which grants a miracle, this is a contest in which seven magi summon seven Heroic Spirits to compete for it. In that battle whose conclusion was postponed three times, now, the fourth war commenced again. \r\n\r\nEntrusting their dearest wish of victory, the magi joined the battleground called 'Fuyuki', but amongst them, there was a man who was always alone, and could not find out the meaning behind his fights. His name was Kotomine Kirei. Not comprehending the guidance of fate, Kirei was lost, and had kept questioning. Why someone like him was given the Command Seals. However, the fate of his fights crossed Kirei's path with a nemesis by chance. That person is - Emiya Kiritsugu. A man who was sterner than anyone else, more merciless than anyone else, and who sought the miracle of the Holy Grail.\r\n\r\nMerely recited in fragments in Fate/Stay Night, this is the Fourth War of the Holy Grail 10 years ago. The truth which unfolded behind the battle between ShirÅ's foster father, Rin's father, and the younger Kotomine Kirei, is finally revealed......>"
}