{
	"url": "https://www.novelupdates.com/series/chu-wang-fei/",
	"title": "Chu Wang Fei - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2015/10/chu-wang-fei.jpg",
	"noveltype": "(CN)",
	"genre": "Drama   Fantasy   Historical   Josei   Romance   ",
	"tags": "Alternate World   Ancient China   Arranged Marriage   Beautiful Female Lead   Broken Engagement   Calm Protagonist   Clever Protagonist   Cold Protagonist   Cruel Characters   Female Protagonist   Handsome Male Lead   Love Interest Falls in Love First   Politics   Power Couple   Revenge   R*pe   Schemes And Conspiracies   Second Chance   Sharp-tongued Characters   Slow Romance   Strong Love Interests   Transmigration   ",
	"rating": "(4.1 / 5.0, 611 votes)",
	"author": "Ning er   宁儿   ",
	"year": "\nN/A",
	"ranking": "#2182   #2280   #499   #4068   #489   ",
	"reviewcount": "93 Reviews sorted by",
	"description": "She, the prime minister’s daughter, was timid and cowardly. Because her engagement fell through, and her reputation was ruined, she was pressured to spill her own blood in the palace hall! Once again opening her eyes, the cowardice had vanished, replaced by coldness, causing others to be intimidated at first glance. Yet no one realized, she was not her.\n\nHe, the current dynasty’s Chu Wang, served the country and brought peace and stability. Peerless and magnificent, all the girls under the Heavens eagerly pursued him! He helped her break off her engagement in the palace hall, but she avoided him at a great distance. He set his mind to pursue her, but she didn’t intend to love him.\n\nAt home, the turbulent currents of government affairs surged violently, disputes from every country continued to spring up everywhere. The stunning her who had been reborn, and how she didn’t bat an eyelid to resolve that terrifying carnage; her name had shaken the whole world!\n\nWhen the dust had settled, and the song and dance had ceased, who could hold hands with her and look upon this thousand-year golden age, this flourishing ten thousand miles? Nowadays in this land under the Heavens, everyone spoke of how Chu Wang was cunning and two-faced, he desired the whole world, and was someone they seriously could not provoke. Yet the one they could not provoke even more was his Wang Fei – Yun Qian Meng! Anyone who provoked Chu Wang Fei, must surely be prepared to lose their necks!\n\nA breathtaking rebirth, a thrilling marriage, in the blink of an eye the once weak woman had become the honorable Chu Wang Fei!\n\nWang Fei: In the palace chambers, between the feasts, smiles are hiding daggers, with layers and layers of plots and machinations; those who hurt my flesh and blood will have to pay the price.\n\nChu Wang: In these troubled times, carrying the fire beacon, over thousands of miles of fortresses and mountains, I have traveled to the distance to these border stations; if you dare to hurt my wife I will take your life.\n\nWang Fei: In another country, in a foreign land, will his thoughts stay pure? The princess of another nation is graceful and beautiful, will “a pair of people for one life” change?\n\nChu Wang: Returning home, difficult problems arise. As green hills extend into the distance, beautiful flowers and tender feelings grow deeply; dealing with the ruler and his ministers is harder than rising into Heaven.\n\nThat night, all the monarchs struggled for power, smoke rising all around; that night, the husband and wife were separated, neither humble nor haughty; that night, the land was in great disorder, lying corpses filled the plains; that night, whose heart was confused, whose family was broken, whose country was lost?\n\nIn the chaos of war, during their separation, separated by thousands of miles of unmoving mountains and rivers, the gentleman’s heart and the wife’s heart never changed. In the lonely city without aid, hand in hand as before, they advanced together while chatting lightly about this West Chu country.>"
}