{
	"url": "https://www.novelupdates.com/series/the-vicious-female-character-at-the-end-of-days/",
	"title": "The Vicious Female Character at the End of Days - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/04/The-Vicious-Female-Character-at-the-End-of-Days.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Drama   Harem   Romance   Sci-fi   Tragedy   ",
	"tags": "Apocalypse   Beautiful Female Lead   Clever Protagonist   Cold Love Interests   Cunning Protagonist   Female Protagonist   Handsome Male Lead   Love Interest Falls in Love First   Manipulative Characters   Near-Death Experience   Possessive Characters   Second Chance   Seduction   Special Abilities   Strong Love Interests   System Administrator   Transmigration   Transplanted Memories   Underestimated Protagonist   Weak to Strong   Zombies   ",
	"rating": "(4.2 / 5.0, 70 votes)",
	"author": "Jīn Fēi   今绯   ",
	"year": "\n2021",
	"ranking": "#6970   #2000   #3894   #8106   #4442   ",
	"reviewcount": "18 Reviews sorted by",
	"description": "Bai Qingqing transmigrated into an Asura field novel at the end of the world and became a female cannon fodder. Because she was jealous of the heroine, she put everyone in danger and was finally thrown into a pile of zombies by one of her admirers.\nRight now, she transmigrated when she had just drugged the male lead and her life was immediately in danger.\nSystem: “Ding, open the heartthrob script, please seduce the male leads to complete the task.”\nBai Qinqing: “…”\nWhen she opened her eyes again, she pretended to have amnesia and shouted sweetly: “Brother.”\nThe man looked at the girl who crashed into his arms, rubbed her lips with his finger, and raised his eyebrows: “… sister?”\nBai Qingqing smiled, her eyes full of sincerity.\n\nNot only did she have to become a green tea, but she also needed to be a little white lotus. She had to give warmth to Big Brother A, had to give medicine to Big Brother B, and had to block the gun for Big Brother C. Later, they were suddenly separated.\n\n***\n\nWhen the zombies assieged the fortress and the humans were about to become extinct, a group of strange beasts appeared to devour the zombies, and Bai Qingqing, standing on a mutant plant, used her powers to wipe everyone at random.\nHumans: …\nIs this the weak and pitiful all the big guys are looking for like crazy?\n\n***\n\nThe high-ranking animals and plants that repelled the tide of zombies followed Bai Qinqing obediently. She sat in a chair made of vines and said: “I can save the city, but you have to pay.”\nThe lord of the fortress appeared on the wall and with deep black eyes, he smiled: “As long as you stay, both the base and your brother will be given to you.”\nBai Qinqing: “???” He had actually faked his death!\n\n***\n\nBai Qingqing: You lied to me!\nFu Chen: Didn’t you lie to me too?>"
}