{
	"url": "https://www.novelupdates.com/series/i-woke-up-piloting-the-strongest-starship-so-i-became-a-space-mercenary/",
	"title": "I Woke Up Piloting the Strongest Starship, so I Became a Space Mercenary - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/06/I-Woke-Up-Piloting-the-Strongest-Starship-so-I-Became-a-Space-Mercenary.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Ecchi   Fantasy   Harem   Mecha   Mystery   Romance   Sci-fi   Seinen   Slice of Life   ",
	"tags": "Adapted to Manga   Aliens   Androids   Appearance Different from Actual Age   Artificial Intelligence   Beautiful Female Lead   Boss-Subordinate Relationship   Confident Protagonist   Cooking   Cosmic Wars   Devoted Love Interests   Dwarfs   Early Romance   Elves   Empires   First-time Interc**rse   Fleet Battles   Futuristic Setting   Human-Nonhuman Relationship   Interdimensional Travel   Kind Love Interests   Kuudere   Leadership   Loli   Love Interest Falls in Love First   Maids   Male Protagonist   Master-Servant Relationship   Mercenaries   Monsters   Multiple POV   Multiple Transported Individuals   Nobles   Older Love Interests   Outer Space   Perverted Protagonist   Pilots   Pirates   Polygamy   Proactive Protagonist   Protagonist Strong from the Start   R-15   Royalty   Ruthless Protagonist   Schemes And Conspiracies   Shameless Protagonist   Strategic Battles   Strong Love Interests   Strong to Stronger   Sudden Wealth   Transported into a Game World   Twins   Wars   Wealthy Characters   World Tree   Younger Love Interests   ",
	"rating": "(3.8 / 5.0, 400 votes)",
	"author": "Ryuto   リュート   ",
	"year": "\n2019",
	"ranking": "#29   #364   #111   #33   #288   ",
	"reviewcount": "89 Reviews sorted by",
	"description": "When I woke up, I found myself inside a spaceship.\n\nI guess you guys think I’m talking nonsense here, but I also have absolutely no clue about what exactly happened to me.\n\nI was really close to completely losing it, but fortunately, I managed to notice that this place was really similar to the world featured in a game I was playing recently.\n\nAm I dreaming? Nope, it’s no dream. Maybe I actually got sent to a different world or something?\n\nBut didn’t those things usually involve getting sent to a magical world with elves, dwarves, dragons and whatnot?\n\nIn any case, I don’t know what caused this, but I guess I’ll just have to suck it up and live properly in this world from now on.\n\nIt’ll be okay. I got my trusty spaceship so I can probably make some money. It’ll work out! It has to!\n\nThis is the story of a man abruptly thrown into space along with his private spaceship. He runs around with it and saves damsels in distress along the way, flirts with said damsels, earns money as a merc-for-hire and uses his gaming knowledge to work his way into living freely and easily.>"
}