{
	"url": "https://www.novelupdates.com/series/demonesss-art-of-vengeance/",
	"title": "Demoness’s Art of Vengeance - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/02/魔女打脸攻略.jpeg",
	"noveltype": "(CN)",
	"genre": "Action   Harem   Josei   Romance   Xianxia   ",
	"tags": "Arranged Marriage   Arrogant Characters   Beast Companions   Betrayal   Caring Protagonist   Confident Protagonist   Cultivation   Death of Loved Ones   Demonic Cultivation Technique   Determined Protagonist   Doting Parents   Female Protagonist   Magic Formations   Pill Based Cultivation   Polyandry   Protagonist Falls in Love First   Revenge   Reverse Harem   Schemes And Conspiracies   Second Chance   Secretive Protagonist   S*xual Cultivation Technique   Slow Growth at Start   Sword Wielder   Weak to Strong   ",
	"rating": "(3.2 / 5.0, 92 votes)",
	"author": "Meditation Rock   冥想石   ",
	"year": "\nN/A",
	"ranking": "#6970   #1673   #1479   #1416   #3872   ",
	"reviewcount": "28 Reviews sorted by",
	"description": "Jun Xiaomo, notoriously known as “Lady Demoness”, finds herself chained and bound in a dungeon. Her hard-earned cultivation has been completely crippled, and she has no means of escape. Qin Shanshan, a lady she used to called her “close friend”, mocks Jun Xiaomo, revealing that Jun Xiaomo had been used by the people around her. Even her lover, Qin Lingyu was one of the masterminds scheming against her. Jun Xiaomo watches her life flash before her eyes and realizes that she had indeed blindly placed her trust in people. Her naivety had led to her current predicament.\r\n\r\nJun Xiaomo wanted to end it all. However, she is determined to deliver a swan song. Over the hundreds of days tormented in that very dungeon, Jun Xiaomo had painstakingly painted a complicated formation array with her own blood. With a determined look, Jun Xiaomo burns her life force to activate the array. Her sole intent? To bring with her as many schemers to the gates of hell as she could. The bright red light from thearray intensified, and the end was nigh.\r\n\r\n…or was it? Jun Xiaomo opens her eyes and finds herself alive again; time had rewound right back to when she was sixteen years of age, albeit only at the eighth level of Qi Cultivation. Armed with the knowledge and memories of her previous lifetime, Jun Xiaomo is determined to learn from her mistakes and bring retribution to those who so deserve…>"
}