{
	"url": "https://www.novelupdates.com/series/immortal/",
	"title": "Immortal - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2018/04/immortal02.png",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Drama   Harem   Mature   Romance   Tragedy   Xianxia   ",
	"tags": "Adopted Children   Appearance Changes   Army Building   Artifacts   Beast Companions   Betrayal   Clever Protagonist   Cultivation   Cunning Protagonist   Death of Loved Ones   Elderly Protagonist   Feng Shui   Hidden Abilities   Industrialization   Kingdom Building   Kingdoms   Lucky Protagonist   Male Protagonist   Mature Protagonist   Military   Modern Knowledge   Multiple Reincarnated Individuals   Politics   Polygamy   Protagonist with Multiple Bodies   Reincarnation   Revenge   Saving the World   S*xual Cultivation Technique   Strategist   Strong to Stronger   Tragic Past   Transported to Another World   Unique Cultivation Technique   Wars   ",
	"rating": "(4.2 / 5.0, 248 votes)",
	"author": "Guan Qi   Watching Chess   观棋   ",
	"year": "\n2010",
	"ranking": "#2000   #6209   #1398   #9500   #1722   ",
	"reviewcount": "37 Reviews sorted by",
	"description": "Once I’ve become Immortal, my attempt to conquer the world shall begin. \n\nI, Zhong Shan, in order establish a supreme heavenly dynasty, must marshal all the luck that I can gather to cleanse my own karma. Then I will have the strength to fight heaven itself, create a new world, and live forever.\n\nFirst: Fate\n\nSecond: Luck\n\nThird: Feng Shui\n\nFour: Cultivate Inner Virtue.\n\nFive: Fame\n\nTo gain eternal life. \n\nTo obtain fame, one must establish a heavenly dynasty and amass the luck of the world! \n\nTo cultivate inner virtue, one must establish holy sites and accumulate an immeasurable amount of merit! \n\nTo cultivate Feng Shui one must learn to communicate between yin and yang and control the powers of heaven and earth! \n\nTo cultivate luck! To cultivate fate!\n\nAsk the whole world, who can have eternal life!>"
}