{
	"url": "https://www.novelupdates.com/series/ostentatious-zhao-yao/",
	"title": "Ostentatious Zhao Yao - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2017/01/ozy.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Comedy   Drama   Romance   Xianxia   ",
	"tags": "Adapted to Drama   Beautiful Female Lead   Betrayal   Cultivation   Demonic Cultivation Technique   Demons   Devoted Love Interests   Dreams   Female Protagonist   Ghosts   Handsome Male Lead   Love Interest Falls in Love First   Magic Formations   Misunderstandings   Mythology   Possession   Protagonist Strong from the Start   Revenge   Secrets   Sect Development   Spirits   Time Skip   ",
	"rating": "(4.5 / 5.0, 130 votes)",
	"author": "Jiu Lu Fei Xiang   九鹭非香   ",
	"year": "\n2016",
	"ranking": "#2000   #4795   #3002   #4929   #2248   ",
	"reviewcount": "23 Reviews sorted by",
	"description": "In a hilarious and sweet xianxia romance set in Ancient China, Lu Zhao Yao went through life living ostentatiously in every way possible. She lived her entire demon life in a loud and brazen manner, reigning over legions of demons, and yet——just before she was about to retrieve the sword of the ancient demon king and rightfully claim her spot on the throne——she died.\n\nIn the most quiet and unobtrusive manner possible. How? By accident.\n\nMo Qing, one of her lowest ranking lackeys at that point in time, had killed her after he retrieved the demon sword and unintentionally unleashed the sword’s demonic aura onto the heavily injured Lu Zhao Yao.\n\nHer quiet and untimely death, coupled with her firm belief that Mo Qing had sneakily betrayed her by lying in the shadows and waiting to strike the final blow and reap all the rewards, nurtured a heavy grievance within her. Lu Zhao Yao refused to head to the underworld and reincarnate, hanging around in the human world in her spirit form.\n\nLady Luck, however, had not completely abandoned her.\n\nOne fine day, a female disciple of the Immortal Sect (Zhi Yan) fought with her childhood friend and banged her head onto Lu Zhao Yao’s grave. To Lu Zhao Yao’s utmost delight, she was able to possess Zhi Yan’s body for short periods of time after this.\n\nThus began her journey to avenge her very own death by destroying Mo Qing——and, in the process, resume her rightful place as the King over all demon sects!>"
}