{
	"url": "https://www.novelupdates.com/series/my-animal-legion/",
	"title": "My Animal Legion - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/09/My-Animal-Legion-Apocalypse.jpg",
	"noveltype": "(CN)",
	"genre": "Josei   Sci-fi   Shoujo   Slice of Life   ",
	"tags": "Apocalypse   Female Protagonist   Orphans   Pets   Romantic Subplot   Special Abilities   System Administrator   ",
	"rating": "(3.4 / 5.0, 18 votes)",
	"author": "小蜜蜂嗡嗡响   ",
	"year": "\n2021",
	"ranking": "#6970   #2000   #8659   #6413   #9295   ",
	"reviewcount": "4 Reviews sorted by",
	"description": "Su Yu, an orphan, loves small animals by nature. Even when she’s short of living expenses, she still chooses to study the veterinary profession for five years. It took her five years to collect money and graduate successfully from university at the age of 23.\n\nShe finally found an area of less than 100 square meters with three kittens, four puppies, and five hamsters, two parrots, two turtles, and three rabbits. But she didn’t expect that she had only been operating for two months, and when she was just preparing for her grand plans, the end of the world came.\n\nThe apocalypse was extremely cruel, and she’s just an ordinary person without any abilities, but she did own one golden finger, [Apocalypse Pet System] APP. Being alive is actually not difficult. (0o0)!\n\nCats: The claws were like sharp knives, and they run like lightning. It’s not difficult to discharge electricity, but it’s really difficult to raise a human.\n\nRabbits: It’s fluffy and white. And it’s not difficult to dig holes for planting vegetables. But it’s really tough to raise a human.\n\nDogs: Three meters long and extremely strong, and can also hunt. But it’s really challenging to raise a human being.\n\nHamsters: With bulging cheeks, it’s not difficult to hide things, but it really is hard to raise humans.\n\nTurtles: The shells are hard, the teeth are sharp, it’s not difficult to catch fish, it’s not difficult to dive, but it’s really hard to raise a human being.\n\nBirds: Wings like the wind, claws like a blade. It’s not hard to fly in the sky. It’s not hard to walk in the wind, but it’s really hard to raise a human being.\n\nSu Yu: Water, land, and air, all together! It’s not difficult to live!>"
}