{
	"url": "https://www.novelupdates.com/series/the-original-partner-robbed-of-luck-is-reborn/",
	"title": "The Original Partner Robbed of Luck is Reborn - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/06/The-Original-Partner-Robbed-of-Luck-is-Reborn.jpg",
	"noveltype": "(CN)",
	"genre": "Drama   Fantasy   Romance   Tragedy   ",
	"tags": "Arranged Marriage   Beautiful Female Lead   Female Protagonist   Handsome Male Lead   Military   Modern Day   Multiple Reincarnated Individuals   Second Chance   Soldiers   ",
	"rating": "(3.1 / 5.0, 9 votes)",
	"author": "秦皇   ",
	"year": "\n2022",
	"ranking": "#6970   #4238   #9729   #11313   #10336   ",
	"reviewcount": "2 Reviews sorted by",
	"description": "Su Ruan's cousin was someone who had transmigrated from outside the book. \r\n\r\nThe cousin wanted to become the wife of the powerful general, so she robbed the disabled soldier who proposed marriage to Su Ruan, and Su Ruan was forced to marry a young entrepreneur with little money in his pocket. \r\n\r\nAs a result, the cousin failed to marry the high-ranking general, but Su Ruan accompanied the young entrepreneur to create hundreds of millions of fortunes and became a beautiful wealthy lady.\r\n\r\nOnce reborn, Su Ruan found out that her cousin was actively seducing the young entrepreneur and wanted to push the disabled soldier back to her. \r\n\r\nSu Ruan, '...' \r\n\r\nIn her last life, Su Ruan was like a peacock, showing everyone her splendor with pride as for the behind… \r\n\r\nWho would want to continue that marriage for a second time? Who wanted to get married?! Isn't it beautiful to be alone??!\r\n\r\nAfter being pushed in front of the handsome man who was leaning on crutches, Su Ruan didn't panic and changed her plans. \r\n\r\nYears later, after the cousin dealt with her husband's illegitimate child, she came to Su Ruan to borrow some money for working capital. When she stood at the door of Su Ran's house, she watched the cold and violent man in her previous life hold Su Ruan in the palm of his hand.>"
}