{
	"url": "https://www.novelupdates.com/series/tyrannical-wangs-beloved-wife/",
	"title": "Tyrannical Wang’s Beloved Wife - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2018/12/845988.jpg",
	"noveltype": "(CN)",
	"genre": "Adult   Comedy   Drama   Fantasy   Mature   Romance   ",
	"tags": "Ancient China   Arranged Marriage   Beautiful Female Lead   Broken Engagement   Calm Protagonist   Caring Protagonist   Charming Protagonist   Clever Protagonist   Complex Family Relationships   Couple Growth   Cruel Characters   Death of Loved Ones   Depictions of Cruelty   Devoted Love Interests   Doting Love Interests   Doting Older Siblings   Familial Love   Fated Lovers   Female Protagonist   Flashbacks   Handsome Male Lead   Love Interest Falls in Love First   Male Yandere   Manipulative Characters   Mature Protagonist   Multiple Reincarnated Individuals   Mysterious Past   Obsessive Love   Older Love Interests   Past Plays a Big Role   Politics   Possessive Characters   Power Couple   Pragmatic Protagonist   Pregnancy   Previous Life Talent   Reincarnation   Royalty   Schemes And Conspiracies   Second Chance   Slow Romance   Smart Couple   Strong Love Interests   Tragic Past   Transmigration   Twisted Personality   Unconditional Love   ",
	"rating": "(4.2 / 5.0, 334 votes)",
	"author": "Zhao Zhao   昭昭   ",
	"year": "\n2016",
	"ranking": "#204   #453   #236   #325   #600   ",
	"reviewcount": "78 Reviews",
	"description": "Other people’s bad reputation, if not because of themselves, then it’s slandered by others. Jing Wan’s bad reputation wasn’t because of herself, but schemed by her future husband. Hong Yuan’s bad reputation wasn’t caused by others, but of his own design, only for the sake of marrying the woman he has had eyes on for two lifetimes! One unable to take a bride, one unable to marry. Because he was the number one handsomest man, but she wasn’t the number one beauty. So it was still her who has earned? What the hell?\n\nAfter marrying, the husband’s close beautiful servant girls didn’t try to crawl onto the bed, but instead served her like an ancestor. The previous stewards didn’t monopolize the power, but instead handed over in great detail all the properties and even the husband’s private funds. So strange no matter how one looks at it! After getting along day and night, she discovered that her husband suffers from a severe case of crazy, please cure! \n\n“Husband, just what do you like about me? I’ll change, just please stop being weird.”\n\nHis disease acting up in seconds, telling you with his actions, just how strong his possessive desires towards you are, that’s how much care you must give back.\n\nAlright, for the sake of his disease not becoming more severe, and seeing how there’s no little three or little four and other little demons, Jing Wan rolled up her up sleeves and went all out.>"
}