{
	"url": "https://www.novelupdates.com/series/after-the-disabled-god-of-war-became-my-concubine/",
	"title": "After the Disabled God of War Became My Concubine - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/08/After-the-Disabled-God-of-War-Became-My-Concubine.jpg",
	"noveltype": "(CN)",
	"genre": "Adult   Drama   Fantasy   Historical   Mature   Romance   Yaoi   ",
	"tags": "Ancient China   Bickering Couple   Black Belly   Bullying   Calm Protagonist   Clever Protagonist   Cohabitation   Cold Love Interests   Corruption   Couple Growth   Court Official   Cunning Protagonist   Devoted Love Interests   Disabilities   Doting Love Interests   Enemies Become Lovers   Forced Living Arrangements   Forced Marriage   Generals   Handsome Male Lead   Jealousy   Love Interest Falls in Love First   Manipulative Characters   Misunderstandings   Multiple POV   Nobles   Politics   Power Couple   Power Struggle   Pretend Lovers   Royalty   Schemes And Conspiracies   Sickly Characters   Slow Romance   Smart Couple   Stoic Characters   Strong Love Interests   Torture   Transmigration   ",
	"rating": "(4.6 / 5.0, 272 votes)",
	"author": "Liu Gou Hua   刘狗花   ",
	"year": "\n2021",
	"ranking": "#104   #90   #1153   #148   #687   ",
	"reviewcount": "55 Reviews sorted by",
	"description": "According to a popular legend, the famous God of War of Great Liang, Huo Wujiu, was once captured by an enemy country. He had his meridians severed and both his legs broken before he was thrown into the prison. In order to humiliate him, that incapable ruler of the country gifted him to his cutsleeve brother as a concubine.\n\nGeneral Huo suffered a great deal of humiliation. He laid in wait for three years before he shed his cicada skin and returned to the Great Jing. He treated his crippled legs, and three months later, he led his army to storm the enemy’s capital. He slaughtered the emperor, razed the capital, and finally beheaded that tr*sh of a cutsleeve, displaying his head on the city’s walls for the next three years.\n\nSince then, the world has been united.\n\n——\n\nA certain university’s history lecturer received a graduation thesis depicting the legend of Huo Wujiu, and he wrote a full page of criticism for the student.\n\nThen he blinked, and he was transmigrated into the body of that cutsleeve prince.  \n\nThere were lanterns and decorations everywhere. A man came, sending word that the disabled general of the enemy state had already entered the manor in his wedding sedan.\n\nAs he looked at the General Huo in front of him, taking in his malicious gaze, his tortured state, clad in a red wedding gown, Jiang Suizhou realised that even legends can come true. \n\nThis legend could even cause him to be beheaded in public in the future, with his head hung on the city walls for three years.\n\nJiang Suizhou’s only option was to take good care of General Huo.\n\nIn spite of the hidden arrows of the court’s political agendas and the incapable ruler’s endless attempts to humiliate him, he could only bite the bullet and bear the brunt of it; his only wish was that after three years, he could protect his own head. \n\nOf course, he didn’t dare to even dream of asking this 3 meters tall “concubine” to serve him. \n\nHowever, before the three years was up, General Huo’s legs recovered on their own. \n\nHe didn’t just slaughter the incapable ruler and unite the land under the heavens, but he also climbed into his own bed and pinned him down with a heated gaze, stubbornly wanting to establish his status as a concubine.>"
}