{
	"url": "https://www.novelupdates.com/series/the-villainess-wont-let-the-main-leads-break-up/",
	"title": "The Villainess Won’t Let the Main Leads Break Up! - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/10/The-Villainess-Wont-Let-the-Main-Leads-Break-Up.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Comedy   Fantasy   Romance   Xuanhuan   ",
	"tags": "Ancient China   Arrogant Characters   Beautiful Female Lead   Bickering Couple   Charming Protagonist   Cold Love Interests   Comedic Undertone   Confident Protagonist   Cruel Characters   Cultivation   Dao Companion   Demon Lord   Demonic Cultivation Technique   Devoted Love Interests   Doting Older Siblings   Female Protagonist   Handsome Male Lead   Immortals   Lazy Protagonist   Love Interest Falls in Love First   Male Yandere   Naive Protagonist   Past Trauma   Popular Love Interests   Possessive Characters   Power Couple   Proactive Protagonist   Schemes And Conspiracies   Sealed Power   Secret Identity   Shameless Protagonist   Slow Romance   Special Abilities   Stoic Characters   Strong Love Interests   Sword And Magic   Transmigration   Villainess Noble Girls   ",
	"rating": "(4.5 / 5.0, 119 votes)",
	"author": "Qitong   漆瞳   ",
	"year": "\n2020",
	"ranking": "#2642   #2086   #3349   #3101   #2728   ",
	"reviewcount": "19 Reviews sorted by",
	"description": "Shen Wanqing has transmigrated into a xuanhuan-angst novel! In the novel, the male and female lead’s love story is full of misunderstandings, leading to heartbreak and hurt. In the end, one is dead, and one is wounded.\n\nShen Wanqing looks at the evil villainess she has transmigrated into, “I understand, my mission must be to break apart the male and female lead, and then win the male lead’s heart, right?”\n\nThe system: “No, your mission is to turn this novel into a cute love story.”\n\nShen Wanqing, “…”\n\nThus, the evil villainess Shen Wanqing starts working hard for the love of the main leads. But….\n\n‘Alert! The male lead forgot that the female lead doesn’t eat spicy food, he put pepper into the fried pork dish again!’\n\n‘Alert! The villain who has an unrequited love for the female lead has appeared next to her again!’\n\n‘Alert! The cannon fodder side female character has drugged the male lead!’\n\nAnd just like this, in order to prevent the protagonists from breaking up, Shen Wanqing carefully worked hard on the frontlines. Until one day, the villain who had an unrequited love for the female lead came to find her.\n\nThis villain who was rumoured to be violent and bloodthirsty, faintly smiled at her, “Young lady, being a meddler will only lead to death.”\n\nShen Wanqing was about to open her mouth when the system rang again in her mind, ‘Warning! The main leads are about to break up again!’\n\nShe was silent for a while, and then said, “…what about this, can you let me go stop a fight first?”\n\nThe villain, “…”\n\nLater on, someone asked Shen Wanqing how she managed to tame the evil monster villain.\n\nShen Wanqing, “I don’t know, he came running to me first.”\n\nThe villain, “?”>"
}