{
	"url": "https://www.novelupdates.com/series/historys-number-1-founder/",
	"title": "History’s Number 1 Founder - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2015/08/historyhnumber1founder.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Fantasy   Martial Arts   Xuanhuan   ",
	"tags": "Adapted to Manhua   Alchemy   Artifacts   Beasts   Buddhism   Calm Protagonist   Cultivation   Cunning Protagonist   Dragons   Game Elements   Handsome Male Lead   Immortals   Kuudere   Lucky Protagonist   Magic Formations   Male Protagonist   Master-Disciple Relationship   Misunderstandings   Multiple POV   Multiple Realms   Mythology   Overpowered Protagonist   Parody   Politics   Proactive Protagonist   Protagonist with Multiple Bodies   Schemes And Conspiracies   Sect Development   Sentient Objects   Shameless Protagonist   Soul Power   Souls   Spirits   Strength-based Social Hierarchy   System Administrator   Teachers   Time Skip   Transmigration   Trickster   Underestimated Protagonist   Weak to Strong   ",
	"rating": "(4.1 / 5.0, 638 votes)",
	"author": "August Eagle   Ba Yue Fei Ying   八月飞鹰   ",
	"year": "\n2014",
	"ranking": "#3017   #6193   #194   #5342   #388   ",
	"reviewcount": "81 Reviews",
	"description": "He transmigrated and got a system but Lin Feng’s pressure is as big as a mountain.\n\nSystem main quest: Lin Feng creates a school, establishing history’s number 1 sect, Lin Feng himself becoming the number 1 founder.\n\nAnd so to become history’s number 1 founder Lin Feng started to work hard.\n\n“Your name is Shi Tianhao? Natural born supreme king but it was stolen by your cousin. Now being raised in a little village your father placed you in? Come come come, come with master, we’ll let those people know that justice that is owed must be returned!”\n\n“Your name is Xiao Yan? A genius in the past, now a loser. Your fiance even came over and humiliated you by breaking off the engagement? Come come come, come with master, we’ll let that brat know the meaning of don’t bully a youngster because he’s poor!”\n\n“Your name is Zhu Yi? The bastard son of a marquis, suppressed by your father. Your mother was the previous saint but she was killed? Come come come, come with master, we’ll let your dad know the meaning of the world is big, fists are… no, reason is the biggest!”>"
}