{
	"url": "https://www.novelupdates.com/series/welcome-to-the-man-eating-dungeon/",
	"title": "Welcome to the Man-Eating Dungeon - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2015/06/maneatingdungeon.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adult   Adventure   Fantasy   Harem   Seinen   Supernatural   ",
	"tags": "An*l   Adapted to Manga   Cunning Protagonist   Demons   Dungeon Master   Dungeons   First-time Interc**rse   F*llatio   Futanari   Golems   Hated Protagonist   Humanoid Protagonist   Incubus   Magic   Male Protagonist   Master-Servant Relationship   Mind Break   Netorase   Prostit**es   R-18   R*pe Victim Becomes Lover   Reverse R*pe   R*pe   S*ave Harem   Succubus   ",
	"rating": "(3.0 / 5.0, 245 votes)",
	"author": "Hitotose Arata   一年新   ",
	"year": "\n2013",
	"ranking": "#3923   #3067   #1055   #1948   #625   ",
	"reviewcount": "18 Reviews sorted by",
	"description": "The young man living in a frontier mining village, Elliott, lived in estrangement there. \n\nThe reason was because he carried the blood of the Demon Race, and had an unusual face, with two small horns growing from it.\n\nSeveral years after his mother – his only family – died, a young woman who called herself an acquaintance of her mother’s came to visit, and once she knew of Elliott’s existence, displayed the traits of a succubus, and whispered thus:\n\n“From now on you will ravish many women, steal many lives, and trample over the world, you shall dominate. But to start … you will dominate me, violate me, please”.\n\nUnable to wield a sword, nor kill his opponents with magic, the mixed-blood young man who could only grant a slight bit of magic into matter, used information, tools, and traps, repelling enemies, ravishing women, making them submit and fall into demonhood, and dominated them, surviving in a ruined world.\n\nThis is the story of the young man who was the Lord of the perilous place of fear, one that never allows a guest to leave, the “Man-Eating Dungeon”, and the women whose lives had been derailed by him.>"
}