{
	"url": "https://www.novelupdates.com/series/my-dream-is-to-get-my-own-house/",
	"title": "My Dream is to Get My Own House - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/07/My-Dream-is-to-Get-My-Own-House.jpg",
	"noveltype": "(KR)",
	"genre": "Comedy   Drama   Fantasy   Romance   ",
	"tags": "Comedic Undertone   Determined Protagonist   Devoted Love Interests   European Ambience   Female Protagonist   Hiding True Identity   Kind Love Interests   Love Interest Falls in Love First   Marriage of Convenience   Reincarnation   Second Chance   ",
	"rating": "(4.1 / 5.0, 12 votes)",
	"author": "여로은   ",
	"year": "\n2022",
	"ranking": "#2000   #6215   #10469   #6185   #9357   ",
	"reviewcount": "1 Review sorted by",
	"description": "I died and returned to my family and lover.\r\nThe way to legally and quickly disconnect from them is to buy a house and become independent-\r\n\r\n“If I get married in the country, will you give me a house?”\r\n\r\nMarriage, and moving into a newlywed town.\r\nHalf-jokingly, I proposed to the perfect knight, Sir Dylan.\r\n\r\n“Will you marry me?”\r\n\r\nHis expression was really bad.\r\nAll forces retreat.\r\n\r\n“Just kidding, if you don’t like it, I’ll marry Henry.”\r\n\r\n“Let’s get married as soon as possible.”\r\n\r\nI don’t know why, but he accepted the result?!\r\nBesides, this husband is suspiciously nice to me!\r\n\r\n“I’ve cleaned up in advance.”\r\n\r\n“I made a shake. Don’t skip lunch.”\r\n\r\n“I’ve made a light dinner.”\r\n\r\nA light meal for dinner?\r\nI don’t think you’re in your right mind\r\n\r\n~*~\r\n\r\nAnyway, thanks to the money I made to buy my own house, the time for divorce quickly came.\r\nBut my husband, who I thought was an ordinary knight, is the cursed Grand Duke?\r\n\r\n“This…! Isn’t this a fraudulent marriage?”\r\n\r\n“There was a situation. I’ll compensate you.”\r\n\r\nI was intrigued by the word “compensate”.\r\nHe grabbed my hand roughly and put it to his chest.\r\n\r\n“I swear to god, from now on I will do well at night.”\r\n\r\nI could feel the thick chest and a fast beating heart on my fingertips.\r\nAs he looked deeply into my bewildered eyes, he suddenly whispered.\r\n\r\n“I will pay the compensation with my body, so please accept it.”\r\n\r\n…No, how are you going to compensate with your body?!>"
}