{
	"url": "https://www.novelupdates.com/series/the-peach-blossoms-begin-to-dance/",
	"title": "The Peach Blossoms Begin to Dance - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/10/peachblossomdance1.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Romance   Shoujo   ",
	"tags": "Confident Protagonist   Devoted Love Interests   Female Protagonist   Hiding True Identity   MMORPG   Online Romance   Strong Love Interests   ",
	"rating": "(4.2 / 5.0, 18 votes)",
	"author": "Jun Zi Yi Ze   君子以泽   ",
	"year": "\n2019",
	"ranking": "#6970   #2000   #8707   #8106   #8444   ",
	"reviewcount": "4 Reviews sorted by",
	"description": "Pian Pian had once been the biggest bigshot in the whole game, but had disappeared from the Jianghu after being framed.\r\n\r\nSoon after, she bought over an account online from the xianyu app, and got ready to raise up this old player’s account. But then she realised that the former user’s online relationship had also been a real-life relationship – with the former user having aborted her scum husband’s baby. Her own female disciple had used her to climb up, and then repeatedly killed the former user to the point that she couldn’t take it anymore and sold her account – it had really been excessively cliche. Pian Pian felt that her plan to abuse the cheating scum husband back, was somewhat refreshing.\r\n\r\nFormer User’s Husband: “She’s not like you – she’s very innocent. If you have anything to say, say it to me instead!”\r\n\r\nPian Pian: “There’s no need, happy divorce!”\r\n\r\nFormer User’s Husband: “Ai, why’re you forcing yourself to act strong.”\r\n\r\nPian Pian: “I’m not forcing myself, this is completely real strength. After all, I’m the game’s strongest woman[4].”\r\n\r\nFormer Disciple: “Hubbie, did you hear her? She said that she’s Boss Han’s woman! Let’s help her spread this happy news around!”\r\n\r\nPian Pian: “Wait, I think you read that wrong!”\r\n\r\nLater on, she who had dealt with the gossip surrounding her and Boss Han, had actually met the real deal.\r\n\r\n“Pian Pian, I heard that you wanted to become my woman?”\r\n\r\n“…You think that’s possible?”\r\n\r\n“Of course.”\r\n\r\nUnder the gaze of thousands, she received a message from the game system.\r\n\r\n‘Yi Chuan Han Xing wants to do a pair action with you: forcibly kiss. Do you accept? [Yes] [No].”>"
}