{
	"url": "https://www.novelupdates.com/series/full-level-bigshot-only-takes-the-career-path/",
	"title": "Full Level Bigshot Only Takes the Career Path - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/07/Full-Level-Bigshot-Only-Takes-the-Career-Path.jpg",
	"noveltype": "(CN)",
	"genre": "Romance   Yaoi   ",
	"tags": "Absent Parents   Acting   Business Management   Celebrities   Childhood Love   Clever Protagonist   Clingy Lover   Cold Protagonist   College/University   Complex Family Relationships   Disabilities   Doting Love Interests   Family Business   Family Conflict   Handsome Male Lead   Heartwarming   Long Separations   Love Interest Falls in Love First   Modern Day   Parallel Worlds   Power Couple   Reincarnation   Schemes And Conspiracies   Second Chance   Showbiz   Slow Romance   Smart Couple   Wealthy Characters   ",
	"rating": "(4.1 / 5.0, 61 votes)",
	"author": "李温酒   ",
	"year": "\n2020",
	"ranking": "#3314   #2953   #4268   #4194   #3606   ",
	"reviewcount": "12 Reviews sorted by",
	"description": "The business bigshot who covered the sky with one hand, Zhao Yao, died of an illness. Once he opened his eyes, he returned to the age of 23 when he was discharged from the hospital after a car accident. He was pushed in a wheelchair into a meeting where the family was fighting for power. Facing the Zhao family’s fighting, Zhao Yao moved to a comfortable position and watched the farce. “You are free to do as you please.”\n\nIn his last life, he was so powerful but he died of illness. In this life, he had no intention of entering the Zhao family’s bottomless family business. Facing a new life, Zhao Yao thought of the advice from his psychologist in his previous life. “Mr Zhao, perhaps you need to fall in love?”\n\nMr Zhao had been single all his life so he placed an order to buy highly rated reference books, including ‘The Guide to Love.’ He went through them one by one with the attitude of reviewing a 10 billion yuan project. “Step one, become a rich man.”\n\nZhao Yao frowned slightly. “So simple?”\n\nAfter a while, the stars of a performing arts company shone, the performance of a live streaming company was rising and so on…\n\nZhao Yao, who was still single, asked his partner in a distressed manner, “Pei Mingzhan, have you ever been in a relationship?”\n\nPei Mingzhan’s gaze was deep. “It is simple. I’ll teach you.”\n\nLater in the hotel’s business room, Zhao Yao finished reading the yellow book and casually shouted, “Pei Mingzhan, how are you?”\n\nPei Mingzhan calmly closed the notebook, his voice slightly heavy. “I’m fine.”>"
}