{
	"url": "https://www.novelupdates.com/series/the-whole-world-thinks-im-a-woman-disguised-as-a-man/",
	"title": "The Whole World Thinks I’m a Woman Disguised as a Man - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/08/The-Whole-World-Thinks-Im-a-Woman-Disguised-as-a-Man.jpg",
	"noveltype": "(CN)",
	"genre": "Fantasy   Sports   Yaoi   ",
	"tags": "Androgynous Characters   Cross-dressing   Cute Protagonist   e-Sports   Gamers   Handsome Male Lead   Misunderstandings   Mob Protagonist   Shy Characters   Transmigration   ",
	"rating": "(3.8 / 5.0, 25 votes)",
	"author": "厌姝   ",
	"year": "\n2021",
	"ranking": "#1625   #1455   #10935   #3521   #8030   ",
	"reviewcount": "No Reviews",
	"description": "After transmigrating into a danmei novel, Xue Lan became a part of the protagonists’ game team: a cannon fodder who plotted against the lead gong1 and was eventually kicked out of the team.\r\n\r\nInitially, he only wanted to play and watch people be in a love-hate relationship as they teamed up. Unexpectedly, one day, he was mistaken for a woman who entered the club dressed as a man.\r\nA sudden change took place—\r\n\r\nTeammate A: Lan Lan, these snacks are all for you.\r\nTeammate B: Lan Lan, let me know if you need any materials.\r\nFans ABCD: Lan Lan, you’re our baby and our pride! We’re cheering for you!\r\n\r\nLead gong Wen Yan threw him the materials he’d farmed for n-long time: Stay close, don’t think you’ll be treated differently just because you’re a girl.\r\n\r\nXue Lan: …I’m really a man.\r\n\r\nXue Lan passed the garden carrying snacks and gifts with gloom, but then saw the lead shou2 Duan Wenzheng sitting by himself under a tree.\r\n\r\nDuan Wenzheng was a fierce teammate who rivaled Wen Yan in the rankings all year round. He just lost a solo3 practice match and seemed to be dejected.\r\n\r\nThinking he would soon become the shou, Xue Lan stuffed all the snacks in his hands.\r\n\r\nXue Lan with a sparkling gaze: Don’t be sad, we all lose and win in competitions. Next time you can tell me anything you’re upset about!\r\n\r\nDuan Wenzheng who was pondering over life problems, what to eat for lunch, and didn’t properly play the practice match: ?\r\n\r\nHe raised his head to see Xue Lan’s sparkling eyes and faintly smiled. “Okay.”\r\n\r\nLater—\r\nXue Lan was forced to come out of the closet after his identity was exposed. Everyone burst into an uproar. The media interviewed the teammates about their views on this.\r\n\r\n“Very surprised.” The interview spiraled out of control after Duan Wenzheng casually took the microphone: “This is the second revelation that has left me shocked.”\r\n\r\nThe media hastened to dig into the details: So, the first is?\r\nDuan Wenzheng: The partner of his coming out—is me.\r\n\r\nAll netizens: ?????>"
}