{
	"url": "https://www.novelupdates.com/series/lets-raise-the-abandoned-cat-heroes-an-awesome-demon-hunter-who-switched-to-being-a-teacher-and-is-very-much-missed-by-his-s-ranked-pupils/",
	"title": "Let’s Raise the Abandoned Cat Heroes – an Awesome Demon Hunter Who Switched to Being a Teacher, and Is Very Much Missed by His S-Ranked Pupils - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/07/lets-raise-the-abandoned-cat-heroes.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Comedy   Drama   Fantasy   Harem   School Life   ",
	"tags": "Abandoned Children   Academy   Childcare   Corruption   Cute Children   Demons   Dense Protagonist   Game Elements   Heroes   Level System   Loli   Male Protagonist   Protagonist Strong from the Start   R-15   Student-Teacher Relationship   Sword And Magic   Teachers   ",
	"rating": "(3.4 / 5.0, 49 votes)",
	"author": "Ikapon   いかぽん   ",
	"year": "\n2019",
	"ranking": "#2000   #6320   #3007   #5505   #4472   ",
	"reviewcount": "5 Reviews sorted by",
	"description": "Brett, a teacher at the Hero’s Academy, was once known as a brilliant and brave man in the past. One day, he is abruptly framed as an abusive teacher by Cyrus, an important figure in heroic society, and is exiled from the capital. When he arrives in a remote village by carriage, he finds a small, run down, nameless hut. Brett would soon come to learn that this unassuming hut is the Hero’s Academy for the village.\n\nAt this academy, Brett encounters three girls, who were dressed in rags and looked like abandoned cats, having experienced a series of misfortunes. He feeds them out of pity, saying he can’t leave such unfortunate children alone. When he feeds them, the three girls, who had been wary of him at first, start to take a liking to him. These girls are the heroes that Brett needs to raise, and they are all S-ranked children.\n\nBrett, now a teacher at this remote heroic academy, teaches his students skills and magic, whilst going on adventures with them to exterminate demon kings.>"
}