{
	"url": "https://www.novelupdates.com/series/rebirth-of-a-fashionista-this-life-is-soo-last-season/",
	"title": "Rebirth of a Fashionista: This Life Is Soo Last Season - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/02/重生之时尚女王.jpeg",
	"noveltype": "(CN)",
	"genre": "Romance   Shoujo   Slice of Life   ",
	"tags": "Appearance Changes   Beautiful Female Lead   Blackmail   Calm Protagonist   Celebrities   Charismatic Protagonist   Charming Protagonist   Determined Protagonist   Female Protagonist   Handsome Male Lead   Hard-Working Protagonist   Kidnappings   Love Interest Falls in Love First   Models   Modern Day   Poor to Rich   Pragmatic Protagonist   Previous Life Talent   Reincarnation   Revenge   R*pe   Second Chance   Showbiz   Sudden Wealth   Transmigration   ",
	"rating": "(3.3 / 5.0, 127 votes)",
	"author": "Busy Beans   豆子很忙   ",
	"year": "\n2016",
	"ranking": "#2000   #2000   #1589   #1450   #3042   ",
	"reviewcount": "29 Reviews sorted by",
	"description": "As a wealthy and beautiful woman with fair skin, she’d devoted herself to getting revenge on her Stepmother and Stepsister after they’d viciously tarnished her reputation. In addition, she’d been working towards gaining the attention of an unattainable man. Unfortunately, before she could achieve her goals, she was involved in an accident which resulted in her suddenly becoming a girl who was so poor that her house was nothing but four walls and a roof. Faced with such an abrupt change in circumstances, she had no choice but to participate in a top model competition to support herself by winning the prize money. Luckily, her new body was tall and beautiful and paired with her unique sense of style; she took her first steps on the path to fame and fortune. With her new life just beginning she decides to become a celebrity, turn all scumbags who bully her into cannon fodder, marry a tall and handsome rich man, and reach the peak of success!\r\n\r\nSheng Jiaoyang: It’s my life!\r\n\r\nTall and handsome rich man: You want to marry me and become my wife? Are you sure about that?\r\n\r\nSheng Jiaoyang (starts to lose confidence): …\r\n\r\nTall and handsome rich man: Also, who’s an unattainable man?\r\n\r\nSheng Jiaoyang bolted immediately.>"
}