{
	"url": "https://www.novelupdates.com/series/i-was-banished-from-the-s-rank-party-for-being-useless-so-i-decided-to-make-my-own-strongest-companions-using-appraisal-and-healing-magic-before-i-noticed-i-was-being-loved-by/",
	"title": "I Was Banished From the S-rank Party for Being “Useless”, so I Decided To Make My Own Strongest Companions Using [Appraisal] and [Healing Magic] -Before I Noticed, I Was Being Loved by the S*aves and Empresses Who Helped Me and Became the Strongest in the World! - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/02/I-Was-Banished_1645426679.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Fantasy   Harem   ",
	"tags": "Adapted to Manga   Adventurers   Alternate World   Beautiful Female Lead   Betrayal   Fantasy World   Friends Become Enemies   Game Elements   Kingdoms   Level System   Love Interest Falls in Love First   Male Protagonist   Monsters   Romantic Subplot   S*aves   Strong to Stronger   Sword And Magic   Underestimated Protagonist   ",
	"rating": "(3.1 / 5.0, 40 votes)",
	"author": "Daylight   Hiruandon   昼行燈   ",
	"year": "\n2021",
	"ranking": "#2000   #4850   #3122   #3335   #4388   ",
	"reviewcount": "9 Reviews sorted by",
	"description": "In this world, [skill] possession is very rare.\r\n\r\nIt was expected to be a capable skill, but the S rank party, Silver Wings, judged Nigris to be incompetent with his appraisal skill that could measure abilities.\r\n\r\nThe S-rank party, who could only see the appraisal skill, cursed Nigris as a parasite and banished him.\r\n\r\nHowever, his essence is the knowledge and experience he has cultivated through his appraisal skills. He thought of his friends more than anyone else and worked hard to keep them alive with his healing magic.\r\n\r\nThe stronger his feelings, the more effective the magic. Thanks to this characteristic, Nigris had become a healer who could heal injuries in an instant.\r\n\r\nHe decides to use his appraisal skills to create a party where he can think about and trust his friends, rather than a party that treats friends as s*aves and discards them like his previous party.\r\n\r\nNigris, who can see potential, gradually gathers talented people and creates the strongest party that has no equal.>"
}