{
	"url": "https://www.novelupdates.com/series/joyful-reunion/",
	"title": "Joyful Reunion - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/09/171651aggkydkpp5uiuyvh.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Drama   Martial Arts   Mature   Yaoi   ",
	"tags": "Adapted to Drama CD   Age Progression   Ancient China   Assassins   Betrayal   Character Growth   Charismatic Protagonist   Clever Protagonist   Coming of Age   Couple Growth   Death of Loved Ones   Devoted Love Interests   Doting Parents   Friends Become Enemies   Friendship   Hiding True Identity   Master-Servant Relationship   Near-Death Experience   Older Love Interests   Past Trauma   Poisons   Politics   Protagonist Falls in Love First   Royalty   Schemes And Conspiracies   Strong Love Interests   Unrequited Love   Wars   ",
	"rating": "(4.5 / 5.0, 81 votes)",
	"author": "Fei Tian Ye Xiang   非天夜翔   ",
	"year": "\n2016",
	"ranking": "#2071   #1645   #3584   #4217   #3026   ",
	"reviewcount": "17 Reviews sorted by",
	"description": "His name was Duan Ling. He used to be nothing more than an illegitimate child with humble beginnings. As a child he had his fill of neglect and torment until a mysterious man named Lang Junxia took him away from the Duans. Lang Junxia fed him, put him in school, and made him a new home. Lang Junxia told him that when the peach trees blossom his dad would come get him.\n\nThen his dad really did come. He was far more impressive than Duan Ling imagined, far more dashing, far more omnipotent. It turned out that Duan Ling wasn’t a bastard whose paternal lineage was in question after all. In his veins flowed the most noble Han imperial blood, and the empire was supposed to belong to him. \n\nBut in troubled times, with the beacons of war lit in all four corners of the world, his dad said everyone had a destiny that befit them, and their destiny was the way of benevolent rule, that was why they could never remain content with their little corner of the world. They were destined … to carry the enmity of an invaded empire, to bear the pain of losing their homeland; to live as the self required.>"
}