{
	"url": "https://www.novelupdates.com/series/what-to-do-when-i-become-a-koi-and-fall-into-the-male-gods-bathtub/",
	"title": "What to Do When I Become a Koi and Fall into the Male God’s Bathtub - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/03/20191020194200.jpg",
	"noveltype": "(CN)",
	"genre": "Drama   Mecha   Mystery   Psychological   Romance   Sci-fi   Tragedy   Yaoi   ",
	"tags": "Amnesia   Animal Characteristics   Animal Rearing   Brainwashing   Caring Protagonist   Celebrities   Child Abuse   Childcare   Cosmic Wars   Cute Children   Cute Protagonist   Death   Depictions of Cruelty   Doting Parents   Enemies Become Lovers   Fated Lovers   Futuristic Setting   Game Elements   Handsome Male Lead   Heartwarming   Human Experimentation   Human Weapon   Kidnappings   Kind Love Interests   Living Alone   Lucky Protagonist   Non-humanoid Protagonist   Orphans   Outer Space   Schemes And Conspiracies   Shapeshifters   Straight Uke   Tragic Past   Transmigration   Transported into a Game World   Transported to Another World   Virtual Reality   Wealthy Characters   Werebeasts   Writers   ",
	"rating": "(4.5 / 5.0, 151 votes)",
	"author": "甜画舫   ",
	"year": "\n2019",
	"ranking": "#2773   #2388   #1734   #6512   #1235   ",
	"reviewcount": "26 Reviews sorted by",
	"description": "He Ruge was addicted to “Your Exclusive Lover” this love nurturing game. Captivated by the attractive military uniformed person, whose original form was a White Tiger Male God.\n\nWhen the game came to the end, He Ruge suddenly became a mermaid and transmigrated, and he was even the legendary Koi Mermaid with flourishing beauty, charming singing and exceeding good luck?\n\nThe place where he fell was even more unusual – the bathtub of the Male God!\n\n___________\n\nThe federation’s Xi Guican, a man whose stamp of his foot could make the whole intersteller tremble. During his recuperation, there appeared a love game that could not be deleted from the optical computer.\n\nThe plot of the game was his secret past. In this love game, he returned to the experimental days of No. 20, allowing people to slaughter and bully him, there was only one variable.——\n\nIt’s his exclusive lover.\n\nThe love that came from the light, taking him out of the dark.>"
}