{
	"url": "https://www.novelupdates.com/series/peerless-immortal-surrounded-by-demonic-disciples/",
	"title": "Peerless Immortal Surrounded by Demonic Disciples - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/04/TIMDD-cover.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Drama   Harem   Romance   Xianxia   Yaoi   ",
	"tags": "Appearance Different from Actual Age   Arrogant Characters   Betrayal   Bloodlines   Calm Protagonist   Caring Protagonist   Charming Protagonist   Clever Protagonist   Cold Love Interests   Comedic Undertone   Demonic Cultivation Technique   Determined Protagonist   Devoted Love Interests   Discrimination   Doting Love Interests   Famous Protagonist   Handsome Male Lead   Jealousy   Love Interest Falls in Love First   Male Yandere   Master-Disciple Relationship   Mature Protagonist   Misunderstandings   Multiple Reincarnated Individuals   Overpowered Protagonist   Persistent Love Interests   Possessive Characters   Power Couple   Protagonist Strong from the Start   Reincarnation   Strength-based Social Hierarchy   Strong Love Interests   Sword Wielder   System Administrator   Transmigration   Transported to Another World   Twisted Personality   Unique Cultivation Technique   Yandere   Younger Love Interests   ",
	"rating": "(4.2 / 5.0, 221 votes)",
	"author": "Dao Xuan   道玄   ",
	"year": "\n2020",
	"ranking": "#1010   #1942   #1454   #1481   #707   ",
	"reviewcount": "43 Reviews sorted by",
	"description": "My disciples are always bullying me!\n\nXuan Wei Immortal Jiang Yinghe was the number one sword cultivator in the cultivation world. He has only three disciples, each more talented and tragic than the last. Jiang Yinghe gave his all to raise them into good and righteous cultivators until one day when he realized-\n\nThe warm and friendly first disciple was the Xuehe Demon Lord, not even blinking as he massacred others, not even stopping to season their remains before moving on.\n\nThe quick-witted and calculating second disciple was the Spirit Patriarch with tremendous power and tens of millions of ghouls under his command.\n\nThe obedient and cute third disciple was the Ancient Archdevil, able to go wherever he pleased under the heavens. Even the Devil Barons prostrate themselves at his feet.\n\nJiang Yinghe: “……”\n\nJiang Yinghe thought that the reason these people got close to him was to eliminate the only one who could stand in their way. He was able to think this until his disciple kissed him on the lips and whispered to him in a husky voice, “Won’t Shizun become my cultivation partner?”\n\n…..Is Shizun another word for cultivation partner to demonic cultivators?>"
}