{
	"url": "https://www.novelupdates.com/series/shes-the-older-sister-of-the-obsessive-male-lead/",
	"title": "She’s the Older Sister of the Obsessive Male Lead - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/07/Shes-The-Older-Sister-Of-The-Yandere-Male-Lead-In-A-BL-Novel.jpeg",
	"noveltype": "(KR)",
	"genre": "Fantasy   Romance   ",
	"tags": "Adapted to Manhwa   Aristocracy   Beautiful Female Lead   Caring Protagonist   Childhood Friends   Doting Older Siblings   European Ambience   Fantasy World   Female Protagonist   Handsome Male Lead   Love Interest Falls in Love First   Male Yandere   Manipulative Characters   Multiple Reincarnated Individuals   Nobles   Obsessive Love   Overprotective Siblings   Possessive Characters   Reincarnation   Saints   Siblings   Sickly Characters   Sister Complex   Sword And Magic   Transmigration   Twins   Younger Love Interests   ",
	"rating": "(4.2 / 5.0, 89 votes)",
	"author": "Antammi   안탐미   ",
	"year": "\n2021",
	"ranking": "#2642   #2056   #3389   #2795   #2110   ",
	"reviewcount": "8 Reviews sorted by",
	"description": "In this life, I was born with a gold spoon in my mouth. I thought my future would be bright.\r\n\r\nAs a matter of fact, I didn’t realize that the place I reincarnated into was a discontinued R-19 tragic BL novel that my friend wrote.\r\n\r\nAnd of all things, I became the older twin sister of Lisandro, the crazy obsessive yandere male lead who horribly, brutally murdered the sickly prisoner Frey at the end of the novel.\r\n\r\nIf I didn’t remember this, I would have just jumped into the sunset, blissfully unaware…\r\n\r\n***\r\n\r\n“Noona.”\r\n\r\nWith a suitcase in one hand, I flinched and looked behind me. The mysteriously beautiful Frey came towards me with a bright smile on his lips.\r\n\r\nIn no time, he towered over me with his tall, lean body.\r\n\r\n“Where are you going?”\r\n\r\n“Um.”\r\n\r\n“Where?”\r\n\r\nDon’t ask.\r\n\r\nI wanted to say this firmly, but I just wore a smile instead. Frey, who kept staring me, tried to grab my suitcase.\r\n\r\nTaken aback, I held onto it tightly. In return, I heard a refreshing, clear laugh.\r\n\r\n“Let me hold it for you.”\r\n\r\n“No, I’m fine.”\r\n\r\n“Why? Oh, I get it. You’re trying to escape. Am I getting in your way?”\r\n\r\nThe hand holding the suitcase flinched. As he looked at me with an eerie smile, he looked exceedingly dangerous the more he stared. There was ice glistening behind his golden irises.\r\n\r\n“You thought I wouldn’t know.”\r\n\r\nHis large hand wrapped around mine and held the suitcase handle tightly.\r\n\r\n“Just to avoid me and that bastard, you’re trying to run away.”\r\n\r\nHis harsh words didn’t match his aloof expression.\r\n\r\n“It’ll spell trouble, Yuni. If you disappear from my sight.”\r\n\r\nThe gentle and feeble, sickly prisoner suddenly became an obsessive yandere himself.>"
}