{
	"url": "https://www.novelupdates.com/series/tales-of-demons-and-gods/",
	"title": "Tales of Demons and Gods - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2015/07/tales-of-demons-and-gods.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Fantasy   Harem   Martial Arts   Shounen   Xuanhuan   ",
	"tags": "Adapted to Anime   Adapted to Manhua   Alchemy   Army Building   Arranged Marriage   Artifacts   Beautiful Female Lead   Bloodlines   Books   Business Management   Calm Protagonist   Clan Building   Cultivation   Cunning Protagonist   Demons   Destiny   Determined Protagonist   Divination   Enlightenment   Fast Cultivation   Friendship   Gods   Inheritance   Inscriptions   Jack of All Trades   Legends   Magic Formations   Magical Space   Male Protagonist   Martial Spirits   Monsters   Multiple Realms   Multiple Reincarnated Individuals   Past Plays a Big Role   Pill Concocting   Politics   Polygamy   Possession   Previous Life Talent   Prophecies   Revenge   Romantic Subplot   Second Chance   Sect Development   Shameless Protagonist   Soul Power   Strength-based Social Hierarchy   Strong Love Interests   Sword Wielder   Time Manipulation   Time Paradox   Tragic Past   Transformation Ability   Underestimated Protagonist   Unique Cultivation Technique   Wars   Weak to Strong   World Travel   ",
	"rating": "(3.8 / 5.0, 2472 votes)",
	"author": "Mad Snail   发飙的蜗牛   ",
	"year": "\n2015",
	"ranking": "#1183   #919   #93   #263   #19   ",
	"reviewcount": "232 Reviews sorted by",
	"description": "Killed by a Sage Emperor and reborn as his 13 year old self, Nie Li was given a second chance at life. A second chance to change everything and save his loved ones and his beloved city. He shall once again battle with the Sage Emperor to avenge his death and those of his beloved. With the vast knowledge of hundred years of life he accumulated in his previous life, wielding the strongest demon spirits, he shall reach the pinnacle of Martial Arts.\n\nEnmities of the past will be settled in this new lifetime. “Since I’m back, then in this lifetime, I shall become the King of the Gods that dominate everything. Let everything else tremble beneath my feet!”>"
}