{
	"url": "https://www.novelupdates.com/series/i-dont-want-to-be-an-ojakgyo/",
	"title": "I Don’t Want To Be An Ojakgyo - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/06/I-Dont-Want-To-Be-An-Ojakgyo.jpg",
	"noveltype": "(KR)",
	"genre": "Comedy   Fantasy   Romance   School Life   Shoujo   Slice of Life   ",
	"tags": "Academy   Age Progression   Aristocracy   Bloodlines   Caring Protagonist   Charismatic Protagonist   Charming Protagonist   Child Abuse   Childhood Friends   Childhood Love   Clever Protagonist   Clumsy Love Interests   Dark   Dense Protagonist   Depictions of Cruelty   Devoted Love Interests   Dragons   European Ambience   Female Protagonist   Friendship   Handsome Male Lead   Hard-Working Protagonist   Healers   Knights   Love Interest Falls in Love First   Magic   Mob Protagonist   Modern Knowledge   Monsters   Multiple POV   Obsessive Love   Past Plays a Big Role   Persistent Love Interests   Popular Love Interests   Pragmatic Protagonist   Reincarnated in Another World   Reincarnation   Reverse Harem   Sharp-tongued Characters   Slow Romance   Strong Love Interests   Sword And Magic   Time Loop   Tragic Past   Unconditional Love   Villainess Noble Girls   ",
	"rating": "(4.3 / 5.0, 286 votes)",
	"author": "An Old Man   살오른곱등이   ",
	"year": "\n2018",
	"ranking": "#2425   #2366   #1041   #1913   #604   ",
	"reviewcount": "53 Reviews",
	"description": "I was reincarnated as the supporting character of a novel.\n\nAs a wingwoman in a depressing romance novel titled  at that. Romance is out of the question, and the future of my family is ominous because of debt.\n\nI was going to become a civil servant to gain some of the splendor I never got in my last life…but the male love interests are acting kind of strange?!\n\n“Just think about it, does Shushu look like someone who would blush and act shy?”\n\n“Wow…….that would be great.” Cory said as he stared at Hylli in a daze, and Yves frowned and whispered to himself. \n\n“Should I just kidnap her…….”\n\nSwan wrapped his face with both of his hands and stayed quiet. His face turned bright red. The blush turned his ears red.\n\nWhy are you guys fooling around, you’re supposed to be obsessing over the heroine.\n\nThe story of Shuraina West, Shushu’s reverse harem academy survival.\n\nNote: Ojakgyo means wingman/woman!>"
}