{
	"url": "https://www.novelupdates.com/series/thriller-night-talk/",
	"title": "Thriller Night Talk - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/07/Thriller-Night-Talk.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Comedy   Horror   Mystery   Romance   Shounen Ai   Supernatural   ",
	"tags": "Boss-Subordinate Relationship   Calm Protagonist   Caring Protagonist   Daoism   Ghosts   Handsome Male Lead   Hard-Working Protagonist   Human-Nonhuman Relationship   Investigations   Modern Day   Mysterious Past   Mystery Solving   Seeing Things Other Humans Can't   Seme Protagonist   Sharp-tongued Characters   Slow Romance   Special Abilities   ",
	"rating": "(4.4 / 5.0, 38 votes)",
	"author": "Lu Jiji   吕吉吉   ",
	"year": "\n2020",
	"ranking": "#6970   #2000   #6102   #4637   #5772   ",
	"reviewcount": "4 Reviews sorted by",
	"description": "Every Thursday at midnight, tune the FM button. Behind a blank hiss, maybe you will hear a broadcast like this: “Welcome to Midnight Radio Station “Thriller Night Talk”. This is the anchor Bei Quan. Please tell us about your story; no matter how bizarre it is.”\n\nThe rich second-generation Wei Fuyuan broke up with his family and was cut off from his financial source. He accidentally broke into a broadcasting studio to apply for a part-time job.\n\nWei Fuyuan: This place is small and shabby. The front desk lady is so fierce and her assistant is a three-year-old child laborer?? Are you really a regular company!\n\nBei Quan: During the internship period, the monthly salary is 7800 Yuan, including three meals and accommodation. Do you want it or not?\n\nWei Fuyuan : I’ll do it if I can live next door to you!\n\nOn the first night at work, Master Wei found out that this company called Sāntúchuān was more irregular than he thought.\n\nColleagues felt that there were ghosts in the world, and the audience said that they were dead, and they had to follow the poisonous anchor. The crime scene…\n\nWei Fuyuan : Wait, isn’t this the job of the police?!\n\nBei Quan: Look over there, the ghost is here.\n\nWei Fuyuan: Ah, ah, don’t come near me! The young master doesn’t like women’s ghosts. Don’t get me… Eat my righteous face-breaking fist!\n\nWhat you see may not be true, and what you hear may not be true.\n\nThe truth and falsity interweaved between the story, the stand-in for a crime they didn’t, betrayal after betrayal, money and love… \n\nPursue the mystery, punish evil and promote good\n\nThis is the Thrilling Night talk for you—\n\nDon’t be afraid.\n\n[Wei Fuyuan the rich second generation born with aura to attack x mysterious poisonous tongue Bei Quan]>"
}