{
	"url": "https://www.novelupdates.com/series/the-lady-chef-anecdote/",
	"title": "The Lady Chef Anecdote - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2018/03/The-Cooks-Embarrassment.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Drama   Slice of Life   ",
	"tags": "Ancient China   Chefs   Cooking   ",
	"rating": "(4.4 / 5.0, 5 votes)",
	"author": "苏素   ",
	"year": "\n2009",
	"ranking": "#2000   #2000   #12839   #11313   #11290   ",
	"reviewcount": "No Reviews",
	"description": "\n'Anecdotes of a Lady Chef' frankly narrates the encounter between a crazy lady chef and mensao imperial chef, a crafty prince and idiotic girl. \n\nThe Lin family has a daughter, Wu Niao, who time traveled into the internal strife to become the champion of chefs just as she was cooking some noodles, and she then cooked instant noodles together with the brilliant prince and imperial chef.\n\nLin Wu Niao was blind in the kitchen and had no ambition. Despite being born in a noble family of chefs, neither her legs nor her arms were diligent. Rather, she was too lazy to practice cooking, and she was only skilled in cooking cup noodles.\n\nBy chance, because she was cooking instant noodles, the pressure cooker exploded and she was blasted into a country that did not exist in history - the Jin Dynasty. There, Lin Wu Niao transformed with a single shake, becoming the recommended chef of the imperial kitchen's first chief manager, the imperial Lin kitchen.\n\nWithout even the slightest bit of culinary talent, Lin Wu Niao had no choice but to toughen up and participate in the selection for the imperial kitchen. Relying on five packs of instant noodles and a stick of Maybelline lipstick, she was easily chosen.\n\nAfter entering the emperor's palace, handsome men and beautiful cuisine became the modern-day Lin Wu Niao's romantic undertaking, a double harvest. Not only did she harvest the love of the mensao kitchen chief, she also obtained the title of first of the palace hall's imperial chefs.\n\nYet, because of the ambiguity of the chief manager of the imperial kitchen, Miao Man Xi, she was drawn into an inner court rebellion. On one side, a beautiful man. On the other, a beautiful career. At the end of the day, which one should she seize?\n\nHilarious to the point of making one's hair stand up, the crazy lady chef decisively battles the imperial palace with the powerful beauty of the kitchen-blind. She challenges the imperial kitchen with pots, bowls, ladles, basins, battling to the summit.>"
}