{
	"url": "https://www.novelupdates.com/series/the-founder-of-diabolism/",
	"title": "The Founder of Diabolism - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2018/08/2980391bfdb389f26a2f4aca82081514.jpg",
	"noveltype": "(CN)",
	"genre": "Adventure   Drama   Mystery   Romance   Supernatural   Xianxia   Yaoi   ",
	"tags": "Absent Parents   Abusive Characters   Adapted to Anime   Adapted to Drama   Adapted to Drama CD   Adapted to Game   Adapted to Manhua   Adopted Children   Adopted Protagonist   Ancient Times   Arrogant Characters   Betrayal   Calm Protagonist   Carefree Protagonist   Character Growth   Charismatic Protagonist   Charming Protagonist   Clever Protagonist   Cold Love Interests   Complex Family Relationships   Confident Protagonist   Conflicting Loyalties   Cruel Characters   Cultivation   Death   Death of Loved Ones   Demonic Cultivation Technique   Dense Protagonist   Devoted Love Interests   Disfigurement   Enemies Become Allies   Exorcism   Familial Love   Family   Family Conflict   Famous Protagonist   First Love   First-time Interc**rse   Flashbacks   F*llatio   Ghosts   Gore   Handsome Male Lead   Hated Protagonist   Helpful Protagonist   Hiding True Identity   Inferiority Complex   Kuudere   Long Separations   Love Interest Falls in Love First   Misunderstandings   Murders   Music   Mystery Solving   Necromancer   Non-linear Storytelling   Outdoor Interc**rse   Past Plays a Big Role   Past Trauma   Playful Protagonist   Politics   Possession   Power Couple   Previous Life Talent   Revenge   Schemes And Conspiracies   Secret Identity   Secrets   Shameless Protagonist   Shy Characters   Siblings Not Related by Blood   Slow Romance   Smart Couple   Souls   Stoic Characters   Strong Love Interests   Unconditional Love   Unique Cultivation Technique   Wealthy Characters   ",
	"rating": "(4.7 / 5.0, 3189 votes)",
	"author": "Mò Xiāng Tóngxiù   墨香铜臭   ",
	"year": "\n2015",
	"ranking": "#1698   #1256   #232   #668   #17   ",
	"reviewcount": "492 Reviews sorted by",
	"description": "As the grandmaster of demonic cultivation, Wei Wuxian roamed the world, hated by millions for committing acts of necromancy. Overthrown by the powerful clans he had attempted to subjugate, Wei Wuxian is supposedly killed by his shidi in order to save the cultivation world. \n\nRestored to life in the body of Mo Xuanyu, the local cut-sleeve lunatic, in order to exact revenge on his abusive relatives, Wei Wuxian quickly finds himself spiralling back into his old life when he's taken away by the cold-hearted, stern, and ultimately quite boring Lan Wangji - who might be harbouring warmer feelings than contempt. Perhaps of the...romantic kind?\n\nBut despite his new beginning, Wei Wuxian begins to unravel a decade and a half long mystery that is set to undo the very fabric of the cultivation world as they know it. \n\nA mysterious, action-packed thriller of a ride, this is a journey you won't want to miss!  \n>"
}