{
	"url": "https://www.novelupdates.com/series/npc-survival-guide/",
	"title": "NPC Survival Guide - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/05/13478_ecdaa_4013_l.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Comedy   Fantasy   Martial Arts   Psychological   Shounen   ",
	"tags": "Alternate World   Antihero Protagonist   Beautiful Female Lead   Books   Brotherhood   Determined Protagonist   Evil Organizations   Fantasy Creatures   Fantasy World   Friendship   Game Elements   Hiding True Identity   Identity Crisis   Kingdom Building   Level System   Loyal Subordinates   Male Protagonist   Medieval   Mob Protagonist   Multiple Transported Individuals   Parallel Worlds   Parody   Power Struggle   Quirky Characters   Romantic Subplot   Secret Organizations   Strategist   Survival   System Administrator   Transported to Another World   Ugly Protagonist   Weak to Strong   ",
	"rating": "(4.0 / 5.0, 37 votes)",
	"author": "Mu Yue   幕月   ",
	"year": "\n2017",
	"ranking": "#2000   #2000   #8039   #9693   #8069   ",
	"reviewcount": "1 Review sorted by",
	"description": "Resident no. 233, a  frustrated novel villain of the City of Sin had a hard life due to his fondness in acting like a protagonist in each parallel world he enters. The measly sin points he earned wasn’t even enough to fill his belly.\n\nHaving enough of begging in the streets of the city where villains like him lived, he stood up with a determined face and promised to stick to his villainous roles to earn more sin points and live a decent life!\n\nBut just as he was rebuilding himself, he met Lily, a one-of-a kind heroine who seeks revenge for the death of a protagonist killed in cold blood by Wei Batian, another villain.\n\nLily mistakenly thought that 233 was also a righteous martial artist like her, so she came to him and offered a proposal.\n\n“Please Mister! You have to help me! As righteous martial artists, we have to find and kill Wei Batian!”\n\nThis is f*cking embarrassing…>"
}