{
	"url": "https://www.novelupdates.com/series/the-supporting-male-character-just-wants-to-be-a-tool-man/",
	"title": "The Supporting Male Character Just Wants to Be a Tool Man - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/10/The-Supporting-Male-Character-Just-Wants-to-Be-a-Tool-Man.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Drama   Romance   Shounen Ai   Yaoi   ",
	"tags": "Acting   Bickering Couple   Cohabitation   Confident Protagonist   Couple Growth   Doting Love Interests   Doting Older Siblings   Early Romance   Familial Love   Family Conflict   First Love   Handsome Male Lead   Hard-Working Protagonist   Heartwarming   Love Interest Falls in Love First   Modern Day   Narcissistic Protagonist   Older Love Interests   S*x Friends   Shameless Protagonist   Showbiz   Strong Love Interests   Transmigration   ",
	"rating": "(4.4 / 5.0, 247 votes)",
	"author": "Lin Ang Si   林盎司   ",
	"year": "\n2021",
	"ranking": "#98   #171   #1140   #221   #1146   ",
	"reviewcount": "73 Reviews",
	"description": "Shen QingShu, 22, died in an accident. His biggest regret before his death was that he’d been single all his life. He obviously wasn’t a monk, but he’d never eaten meat.\n\nThen, when he opened his eyes, he saw a handsome, self-assured man standing before him. The handsome man parted his thin lips slightly and asked, “Wanna have a one-night stand?”\n\nShen QingShu didn’t hesitate at all. “Let’s do it! Twice!”\n\nThe next morning, Shen QingShu woke up aching all over. Only then did he discover he’d transmigrated into a book. The handsome guy beside him who’d gone two rounds with him was the protagonist gong, Han Cheng, the second son of the Han Group.\n\nAnd the original owner of this body was just a disliked, death-seeking cannon fodder.\n\nShen QingShu: …Well, this is f*cking awkward.\n\nBut Shen QingShu didn’t panic. Anyway, he was just a cannon fodder. He figured they’d part in a few days\n\nHe knew he was a tool man, a character who only existed to develop the plot.\n\n-Half a year later-\n\nShen QingShu looked at the man next to him and wondered: It’s been more than six months. Why hasn’t he left already?\n\nUntil the day he saw the protagonist shou and Han Cheng meet by accident.\n\nTool man Shen QingShu immediately felt the call of duty. Eyes shining, he prepared to push the plot forward.\n\n“Don’t come looking for me in the future.” Shen QingShu was extremely self-aware.\n\nHan Cheng was shocked. “Why? Do you have feelings for someone else? Who is it?”\n\nShen QingShu: … Darling, this reaction isn’t quite right.\n\n“I don’t accept this,” Han Cheng said, furious. “One day as husband and wife means a hundred days of grace. Can you even calculate how much grace we have?”\n\nShen QingShu: … No, wait, what are you talking about? It’s not like I’m your wife. I’m just a tool man, and it’s time for me to go offline!\n\nHowever, Shen QingShu found that not only did the protagonist gong refuse to let him go offline, he was going to make him his bride!\n\nShen QingShu: I’m crying.>"
}