{
	"url": "https://www.novelupdates.com/series/ancient-godly-monarch/",
	"title": "Ancient Godly Monarch - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2016/04/Ancient-Godly-Monarch.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Drama   Fantasy   Harem   Martial Arts   Xuanhuan   ",
	"tags": "Absent Parents   Academy   Adapted to Drama   Alchemy   Archery   Artifacts   Beast Companions   Beautiful Female Lead   Betrayal   Blacksmith   Bloodlines   Body Tempering   Broken Engagement   Cultivation   Death of Loved Ones   Demonic Cultivation Technique   Demons   Determined Protagonist   Friendship   Handsome Male Lead   Immortals   Late Romance   Male Protagonist   Marriage   Multiple Realms   Mysterious Family Background   Mythical Beasts   Politics   Polygamy   Protagonist with Multiple Bodies   Revenge   Romantic Subplot   Ruthless Protagonist   Spear Wielder   Strength-based Social Hierarchy   Strong Love Interests   Sword Wielder   Underestimated Protagonist   Unique Cultivation Technique   Weak to Strong   World Travel   ",
	"rating": "(3.5 / 5.0, 807 votes)",
	"author": "Jing Wu Hen   净无痕   ",
	"year": "\n2015",
	"ranking": "#4265   #6152   #41   #7850   #363   ",
	"reviewcount": "114 Reviews sorted by",
	"description": "In the Province of the Nine Skies, far above the heavens, there exists Nine Galaxies of Astral Rivers made up of countless constellations interwoven together. \n\nFor Martial Cultivators, they could form an innate link with one of the constellations, awaken their Astral Soul, and transform into a Stellar Martial Cultivator. \n\nLegend has it that, the strongest cultivators in the Province of the Nine Skies, were beings that could open an astral gate every time they advanced into a new realm. Their talent in cultivation was such that they could even establish innate links with constellations that existed in a layer higher than the Nine Layers of Heavens, eventually transforming into the heaven-defying and earth-shattering power known as the War God of the Nine Heavens. \n\nQin Wentian is the MC of this story. How could a guy, with a broken set of meridians, successfully cultivate? There were countless Stellar Martial Cultivators, as there were countless constellations in the vast starry skies. What he wanted to be, was the brightest constellation of all, shining dazzlingly in the vast starry skies.>"
}