{
	"url": "https://www.novelupdates.com/series/transcending-the-nine-heavens/",
	"title": "Transcending the Nine Heavens - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2017/04/Transcending-the-Nine-Heavens.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Comedy   Drama   Harem   Martial Arts   Seinen   Xuanhuan   ",
	"tags": "Abandoned Children   Adapted to Manhua   Artifacts   Beautiful Female Lead   Betrayal   Bloodlines   Brotherhood   Cultivation   Cunning Protagonist   Elves   Fast Cultivation   Friendship   Genius Protagonist   Handsome Male Lead   Herbalist   Loli   Male Protagonist   Manipulative Characters   Master-Disciple Relationship   Misunderstandings   Multiple Realms   Politics   Polygamy   Pregnancy   Previous Life Talent   Protagonist Falls in Love First   Reverse R*pe   Romantic Subplot   Ruthless Protagonist   Schemes And Conspiracies   Second Chance   Shameless Protagonist   Strategist   Strong Love Interests   Sword Wielder   Teamwork   Unique Cultivation Technique   Wars   Weak to Strong   ",
	"rating": "(4.2 / 5.0, 1430 votes)",
	"author": "Fengling Tianxia   风凌天下   ",
	"year": "\n2011",
	"ranking": "#4617   #6194   #78   #19   #84   ",
	"reviewcount": "146 Reviews sorted by",
	"description": "Chu Yang, the Ninth Master of the Nine Tribulations Sword, sacrificed almost everything he had for the sake of improving his martial arts, including the love of his life. After spending three years locating the fifth fragment of the Nine Tribulations Sword, he was ambushed by all sides at that very place. Mortally injured with no means of escape, Chu Yang executed a sacrificial technique by plunging the Nine Tribulations Sword into his very own heart. “With the blood of my heart, ten thousand tribulations will collapse!”\r\n\r\nAfter witnessing the death of all his ambushers, Chu Yang’s vision began to darken. At a distance, moments before his death, he saw the mastermind who had plotted his downfall — Mo Tian Ji. With that, his eyes finally closed.\r\n\r\nHowever, with a start, Chu Yang once again awoke to find that he had returned to when he was sixteen years of age! Furthermore, the Sword Spirit of the Nine Tribulations Sword now resided within his Dantian, the energy center of his body! From that very moment, Chu Yang would then begin to right all of his past regrets, and carve his very own legend by fulfilling his destiny as the final Master of the Nine Tribulations Sword, and defeating the Heavenly Devils beyond the realm of the Nine Heavens Continent.>"
}