{
	"url": "https://www.novelupdates.com/series/a-lifelong-love-affair-at-work/",
	"title": "A Lifelong Love Affair At Work - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/10/A-Lifelong-Love-Affair-At-Work.jpg",
	"noveltype": "(KR)",
	"genre": "Action   Adventure   Romance   Shounen Ai   ",
	"tags": "Magic   Office Romance   ",
	"rating": "(5.0 / 5.0, 2 votes)",
	"author": "새벽한강   ",
	"year": "\n2022",
	"ranking": "#2000   #2062   #13679   #5886   #13318   ",
	"reviewcount": "No Reviews",
	"description": "Esper is a job known to everyone as a hero, it topped the list of popular elementary school jobs.\r\n\r\nKwon Ho-Eun also wants to be an Esper, the hero of justice.\r\n\r\n“Please like and subscribe!”\r\n\r\nHowever, the reality is that he is unemployed who runs an eating show on YouTube because he does not have a decent job.\r\n\r\nThen one day, Ho-Eun receives a labour contract from the Guide Corporation.\r\n\r\n“I’m coming in as an active guide… Success.”\r\n\r\n“One, ten, hundred, thousand, ten thousand… 100 million?”\r\n\r\n“It may feel like a small amount right now, but if you get older and take on field duties, you will be able to receive more than that.”\r\n\r\n“Are you really giving me 100 million?”\r\n\r\nAfter living for 25 years, he found out that he was a guide and got a job for life.\r\n\r\nHe was excited to work with Esper, the hero of justice.\r\n\r\nDue to a lack of guidance, he meets Esper Do In-ho, who is on the verge of running away.\r\n\r\n“If it’s a guide duty to guide an Esper, I’ll help you.”\r\n\r\n“I can’t wait to die. It’s only worth it if I die and won’t need to work anymore.”\r\n\r\n\r\nWhen he got the job, he thought he would be wearing a nice semi-suit, an employee ID, and a coffee in one hand.\r\n\r\nHowever, the reality is that he is wearing a rough combat uniform and a helmet that cab ve broken at any time.\r\n\r\nA scene where the boundary between life and death is a fine line.\r\n\r\nHe couldn’t even look at Do In-Ho, who was treated as a tool.\r\n\r\n“Do In-Ho, so that you can live as a person, not a tool. I’ll save you.”\r\n\r\nCan Guide Kwon Ho-Eun survive the Guide Corporation, when they are prohibited from leaving the company?>"
}