{
	"url": "https://www.novelupdates.com/series/the-entertainment-circle-is-mine/",
	"title": "The Entertainment Circle is Mine - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/06/The-Entertainment-Circle-is-Mine-Rebirth.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Drama   Psychological   Romance   School Life   ",
	"tags": "Celebrities   Character Growth   Child Abuse   Cold Love Interests   Cute Protagonist   Depression   Devoted Love Interests   Doting Love Interests   Female Protagonist   Genius Protagonist   Kind Love Interests   Modern Day   Multiple Reincarnated Individuals   Protagonist Falls in Love First   Showbiz   Slow Romance   Suicides   Time Travel   Weak to Strong   Wealthy Characters   ",
	"rating": "(4.5 / 5.0, 136 votes)",
	"author": "Chun Dao Han   春刀寒   ",
	"year": "\nN/A",
	"ranking": "#518   #210   #2688   #2764   #2517   ",
	"reviewcount": "31 Reviews",
	"description": "Xu Zhaixing’s idol, Cen Feng, was a new star, slowly rising in the entertainment circle. She firmly believed that everyone would see the brilliance of her idol one day. But she could no longer wait for the day to arrive…\n\nCen Feng had committed suicide at home because of depression. It was only after his death that the injustices he had suffered had been revealed to the public.\n\nIt turned out that he was an adopted orphan, and his biological father was actually a murderer.\n\nIt turned out that the reason he never touched the piano again was that his little finger was intentionally trampled by his teammates.\n\nIt turned out that the team was harassing him, and he offended a higher-up company, resulting in resources being divided.\n\nIt turned out that the treasure, which she had been so afraid to hold on to her palm in fear of breaking it, had been trampled on, had been beaten black and blue…\n\nSix months later, Xu Zhaixing died in a car accident, only to be reborn as a high school student. She was just a freshman that year.\n\nIt was ten years before Cen Feng committed suicide.\n\nI’m going to use these ten years to build the best road just for you. All those who hurt you will never appear in front of you. Brother, let’s walk the flowery road together this time.>"
}