{
	"url": "https://www.novelupdates.com/series/faking-straight/",
	"title": "Faking Straight - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/12/Faking-Straight.jpg",
	"noveltype": "(CN)",
	"genre": "Adult   Comedy   Drama   Romance   Sci-fi   Yaoi   ",
	"tags": "Brotherhood   Calm Protagonist   Charismatic Protagonist   Devoted Love Interests   Friendship   Futuristic Setting   Manly Gay Couple   Misunderstandings   Older Love Interests   Playful Protagonist   Possessive Characters   Protagonist Falls in Love First   Seme Protagonist   Strong Love Interests   Strong to Stronger   Transmigration   ",
	"rating": "(4.5 / 5.0, 130 votes)",
	"author": "常念君   ",
	"year": "\n2020",
	"ranking": "#1183   #1135   #3131   #1646   #2020   ",
	"reviewcount": "20 Reviews sorted by",
	"description": "Li Zouxing is a gay man. A solid top, a gong, the real deal. Unfortunately for him, he transmigrated into a bg harem novel. \n\nThe Journey is a popular web novel based on an intergalactic setting. The whole book is filled with the straight romance between one male lead and his harem of beauties. The male lead of the novel is actually over 30 years old, but after consuming a secret medicine his body regressed back to that of a teenager. This male lead is the perfect mix of shy and mature, passionate and innocent – all at the same time. No other person can unify all those conflicting traits as well as the male lead can. \n\nNeedless to say the male lead is exactly Li Zouxing’s type. \n\nIf only Li Zouxing could, then he would. \n\nBut the author told Li Zouxing: there’s no way for you to un-transmigrate yourself, this is a harem novel, the world setting doesn’t even have gay in its vocabulary, and on top of that you have to remain in character at all times.\n\nAnd what kind of character is this Li Zouxing from the book? Nicknamed Sunny (Little Sun), known for being sweet but kind of dumb, the male lead’s best buddie, a loyal little underling for the mighty male lead. And worst of all – straight as they come. \n\nAnd so, every time he witnessed the male lead’s domineering aura while wiping out all the bad guys, Li Zouxing would pay his due respects and act along with the rest of the crowd: “You’re so awesome!”\n\nBut in his head Li Zouxing is definitely thinking: damn this slutty little thing, everytime he cooks he’s gotta wear that apron and tie it so tight around that tiny waist. \n\nA waist that’s small enough for Li Zouxing to wrap his hands around. \n\nFor a gay guy, Li Zouxing’s always had pretty good luck with the ladies. \n\nIn a bar: Gu Wencheng watched as the woman with heavy makeup flirted with his best buddy. Gu Wencheng’s face darkened as the violent storm of emotions in his heart threatened to burst forth. For a moment, Gu Wencheng wondered if his controlling and possessive instincts are getting a little out of control. \n\nIt took a while for Gu Wencheng to realize that he was actually jealous of that woman. \n\nBut Li Zouxing, the one who turned him so weird in the first place, is actually an idiot that doesn’t understand anything – how could the idiot Li Zouxing know the effect that he has on Gu Wencheng?>"
}