{
	"url": "https://www.novelupdates.com/series/the-return-of-the-lord-god/",
	"title": "The Return of The Lord God - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/04/The-Return-of-The-Lord-God.jpg",
	"noveltype": "(CN)",
	"genre": "Drama   Fantasy   Martial Arts   Romance   Sci-fi   Yaoi   ",
	"tags": "Amnesia   Ancient Times   Betrayal   Calm Protagonist   Celebrities   Charismatic Protagonist   Charming Protagonist   Clever Protagonist   Cold Love Interests   Confident Protagonist   Cunning Protagonist   Dancers   Daoism   Devoted Love Interests   Doting Love Interests   Dragons   Early Romance   Episodic   Famous Protagonist   Fantasy Creatures   Fantasy World   Gamers   God-human Relationship   Godly Powers   Gods   Handsome Male Lead   Hard-Working Protagonist   Magic   Manipulative Characters   Mature Protagonist   Mob Protagonist   Modern Day   Mpreg   Multiple Personalities   Multiple Realms   Outer Space   Overpowered Protagonist   Persistent Love Interests   Possessive Characters   Power Couple   Priests   Protagonist Strong from the Start   Royalty   R*pe   Seduction   Showbiz   Strong Love Interests   System Administrator   Terminal Illness   Transmigration   Transplanted Memories   Unconditional Love   Vampires   Wealthy Characters   World Hopping   Zombies   ",
	"rating": "(4.1 / 5.0, 128 votes)",
	"author": "牧白   ",
	"year": "\n2016",
	"ranking": "#139   #312   #2711   #517   #3462   ",
	"reviewcount": "28 Reviews sorted by",
	"description": "In his quest to reverse time and space to save his fallen kingdom, the fallen prince, Bai Lixin, was bound to a dimensional system and became the host to an artificial intelligence called S419M. \n\nFrom then on, he lived the life of the wind; world-hopping, constantly changing faces and blackening in seconds. \n\nAncient, modern, future and post-apocalyptic worlds, mecha, blood battles, gods and demons, immortals….his mental power was becoming more and more powerful, and he was on the verge of achieving the condition for reversing time and space. \n\nBut unexpectedly, he triggered a hidden God-level mission: The Return of the Lord God! \n\nHe had to complete this mandatory mission before he could return to his original world! If he knew how it was triggered, he would have avoided it!>"
}