{
	"url": "https://www.novelupdates.com/series/why-not-soar-your-majesty/",
	"title": "Why Not Soar Your Majesty - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2017/08/wnsym.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Gender Bender   Josei   Mature   Romance   Slice of Life   ",
	"tags": "Acting   Beautiful Female Lead   Bickering Couple   Black Belly   Celebrities   Chat Rooms   Female Protagonist   Gamers   Guilds   Handsome Male Lead   MMORPG   Modern Day   Movies   Online Romance   Pets   Popular Love Interests   Shameless Protagonist   Showbiz   Slow Romance   ",
	"rating": "(4.4 / 5.0, 392 votes)",
	"author": "Er Hua   贰花   ",
	"year": "\n2016",
	"ranking": "#4080   #4077   #812   #882   #762   ",
	"reviewcount": "88 Reviews sorted by",
	"description": "If you are good enough,  why don’t you fly to the heavens, and rise side by side with the sun?\n\nThis is about a girl who played using a male character, carefully building up her strength, guarding her wallet to one day be able to sponsor her male idol. \n\nThis is the story of a group of mentally insane people.\n\nTang Xiao had two wishes so far, the first wish is to sponsor Mu Cheng. The second wish was to help every enemy of Su Muzhe!\n\nFemale: Wife, I have died! When I die, hold me tight! That way, the ones who have come for revenge will know that we are a pair!\n\nMale: … …\n\nEveryone:  Why aren’t you going to the heavens?!\n\nEveryday, when Tang Xiao sat at home, she would first, number 1: kiss kiss pat pat and stare contentedly at the collection of naked posters of her male idol Mu Cheng that she had pasted all over her home.\n\nSecondly, she would play online games.\n\nWith her male ID, Tang Xiao would cause havoc and uproar all over the game by confessing to girls constantly everyday, murdering all the men and generally, harassing people in public.\n\nEvery single time, she raised havoc, a female ID named Su Muzhe would punch her and try to knock her to her senses.\n\nThus a marriage began between a male ID who had a girl behind it, and a female ID who had a man behind it. \n\nWhile at the same time, Tang Xiao tried her very best to roll into the sheets of her male idol, not knowing that she was already associated with him in the 2D world.\n\nThis is the story of how Tang Xiao was shamelessly bribed by her male idol to marry his character with naked posters of himself, and how every time she announced she wanted to sleep with him, she was punched.>"
}