{
	"url": "https://www.novelupdates.com/series/the-daily-task-of-preventing-my-disciple-from-turning-to-the-dark-side/",
	"title": "The Daily Task of Preventing My Disciple from Turning to the Dark Side - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2017/07/daily-task-raising.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Comedy   Martial Arts   Romance   Xianxia   Yaoi   ",
	"tags": "Abusive Characters   Age Progression   Anti-social Protagonist   Appearance Different from Actual Age   Awkward Protagonist   Blackmail   Cheats   Childcare   Cold Protagonist   Cultivation   Cute Children   Devoted Love Interests   Doting Love Interests   Handsome Male Lead   Hiding True Identity   Immortals   Jealousy   Love Interest Falls in Love First   Magic Beasts   Magic Formations   Male Yandere   Marriage   Master-Disciple Relationship   Multiple Reincarnated Individuals   Naive Protagonist   Possessive Characters   Protagonist Strong from the Start   R*pe Victim Becomes Lover   Reincarnation   R*pe   Schemes And Conspiracies   Second Chance   Secret Identity   Secrets   Time Skip   Time Travel   Tsundere   Twins   Yandere   Younger Love Interests   ",
	"rating": "(3.9 / 5.0, 429 votes)",
	"author": "Hēi Māo Nì Nì   黑猫睨睨   ",
	"year": "\n2016",
	"ranking": "#6970   #6157   #954   #2105   #376   ",
	"reviewcount": "65 Reviews sorted by",
	"description": "As the number one pill alchemist of the immortal world, Mu Chen had always believed that it was because he had single-mindedly focused on concocting pills that led to him to neglect disciplining his disciple. Which in turn, caused his disciple to be led astray by the seduction of devil cultivation, leading to the three realms to fall to disaster. \n\nAfter his rebirth, Mu Chen resolved to properly teach his disciple, give him the very best resources, earnestly love him, carry him close to his heart, teach him by way of example, and didn’t let him grow corrupt.\n\nSure enough, his disciple became more and more “intimate”. Every day his disciple even crawled into his bed, rubbing against his chest and clinging to his thigh. It was just that his expression isn’t exactly quite right……>"
}