{
	"url": "https://www.novelupdates.com/series/the-transmigration-survival-guide/",
	"title": "The Transmigration Survival Guide - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2018/04/MYSD-cover.jpg",
	"noveltype": "(CN)",
	"genre": "Adventure   Ecchi   Harem   Mature   Romance   ",
	"tags": "Arrogant Characters   Beautiful Female Lead   Cautious Protagonist   Clever Protagonist   Cunning Protagonist   Demons   Depictions of Cruelty   Doting Love Interests   Elves   Fantasy World   Knights   Kuudere   Loli   Male Protagonist   Masochistic Characters   Master-Servant Relationship   Nobles   Obsessive Love   Orphans   Parent Complex   Possessive Characters   Schemes And Conspiracies   S*aves   Succubus   Transmigration   Yandere   ",
	"rating": "(3.5 / 5.0, 277 votes)",
	"author": "Chuan xiang mala jirou guo   川香麻辣鸡肉锅   ",
	"year": "\n2018",
	"ranking": "#2000   #6324   #512   #4680   #1303   ",
	"reviewcount": "33 Reviews sorted by",
	"description": "The end of that era means the start of a new era, and those who belong to this new era quietly appear.\n\nHe doesn’t have a sword, but he has a more dangerous and terrifying weapon……\n\nHe can’t use magic, but he can get the entire empire to focus their eyes on him……\n\nHe was toyed with when he came here, treated as a s*ave, but in the end, the entire world trembled in fear at his words…….\n\nHe’s not the demon king, but they call him the demon king……\n\nHowever, he is an invincible demon king.\n\nThis is a story of love and contention. The jealousy and destructive powers of the women are no less than that of a man. Females’ hearts are set aflutter everywhere he goes. Countless flirtatious eyes are always on him. However, as the man who adopted the succubus daughter of the demon king, he has something more important to do right now.\n\nRaising a daughter isn’t easy for a guy after all.\n\nAnd if your daughter loves him in some weird way, then not even mom will get to go near her dad.\n\n“Lord Dongqing…… Father……. Darling……”>"
}