{
	"url": "https://www.novelupdates.com/series/miss-cousin-is-always-busy/",
	"title": "Miss Cousin is Always Busy - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/04/Miss-Biao-is-Always-Busy-Quick-Transmigration.png",
	"noveltype": "(CN)",
	"genre": "Comedy   Fantasy   Romance   Slice of Life   Yuri   ",
	"tags": "Acting   Ancient China   Apocalypse   Beautiful Female Lead   Calm Protagonist   Cannibalism   Character Growth   Charming Protagonist   Clever Protagonist   College/University   Comedic Undertone   Couple Growth   Cousins   Crime   Criminals   Cruel Characters   Cunning Protagonist   Detectives   Doting Love Interests   Female Protagonist   Friendship   Generals   Gore   Kind Love Interests   Kuudere   Love Interest Falls in Love First   Love Rivals   Modern Day   Murders   Police   Possessive Characters   Power Couple   Proactive Protagonist   Psychopaths   Royalty   Shounen-Ai Subplot   Siblings Not Related by Blood   Sister Complex   Strong Love Interests   Survival   Transmigration   Unconditional Love   World Hopping   Yandere   Zombies   ",
	"rating": "(4.6 / 5.0, 116 votes)",
	"author": "Xiao Wu Jun   小吾君   ",
	"year": "\n2018",
	"ranking": "#2731   #2075   #1403   #1446   #4271   ",
	"reviewcount": "19 Reviews sorted by",
	"description": "Jun Zishu was interning as a fate changer. Her character setting was designated as her mission target’s cousin, and her goal was to save her mission targets from their tragic fates.\n\nThus…\n\nMaid: Miss Cousin, Miss Cousin, the Young Miss fell into the pond!\n\nJun Zishu: Okay, I’m coming!\n\nServant: Miss Cousin, Miss Cousin, the Young Miss’s fiance ran away with another person!\n\nJun Zishu: Okay, I’m coming!\n\n…\n\nSubordinate: Miss Cousin, Miss Cousin, not good!\n\nJun Zishu: Okay, shut up. I know what you’re trying to say!\n\nSubordinate: Erm...\n\nWhat should have been an innocent relationship between cousins had evolved into the mission target wanting to bed Jun Zishu/love rivals becoming lovers/the female protagonist falling in love with the female side character(Jun Zishu)/Jun Zishu becoming the female protagonist’s lover’s sweetheart.\n\nEvery scenario you could possibly think of.\n\nMiss Cousin was very busy today as well.>"
}