{
	"url": "https://www.novelupdates.com/series/entrust-the-rest-of-my-life-to-you/",
	"title": "Entrust the Rest of My Life to You - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/08/rsz_5d5277b8b59fb.jpg",
	"noveltype": "(CN)",
	"genre": "Romance   Slice of Life   ",
	"tags": "Adapted to Drama   Doctors   Doting Love Interests   Fated Lovers   Female Protagonist   Love at First Sight   Modern Day   ",
	"rating": "(4.1 / 5.0, 86 votes)",
	"author": "Bolin Shijiang   柏林石匠   ",
	"year": "\n2016",
	"ranking": "#3133   #2000   #5204   #10271   #4720   ",
	"reviewcount": "6 Reviews sorted by",
	"description": "I used to think that I couldn’t find it for my entire life – the world is very big, and I walked it slowly, what if I couldn’t meet my loved one?\n\nSince I heard “more than 3 billion men in the world, 700 million men in China, there were plenty of fish in the sea”. It became more and more clear that in normal life, the opposite s*x that we could get familiar with and to developed deep feelings with, was too limited. Too limited until I was prepared to accept people’s matchmaking to find a suitable man, simmer slowly and then ordinarily entered marriage life. But in the unexpected corner of life, perhaps we still could find our better half.\n\nIn March 2009, I watched my father being pushed out of the operating room, and I had no idea that the doctor followed behind the bed would be my lifelong’s partner.\n\nI think, in this relationship, I could never surpass Gu Wei. I just followed my heart and followed him all the way, but Gu Wei always had to consider the future for both of us. He always jokingly said, “Lin Zhixiao, I don’t dare make mistakes now.”\n\nThis man, who was occasionally deep and childish most of the time, occupied almost my entire point of view about love.\n\nHe said: “I will always stay by your side, no matter in good or bad.”\n\nI told him: “Even if life rewinds many times, in spring 2009, I will still fall in love with you at first sight.”>"
}