{
	"url": "https://www.novelupdates.com/series/laws-of-the-other-world/",
	"title": "Laws of the Other World - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2018/07/8d7bb53cgw1f4dtpfl3zdj20bx0gojrz.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Fantasy   Romance   Sci-fi   Yaoi   ",
	"tags": "Aliens   Arrogant Characters   Brotherhood   Calm Protagonist   Charismatic Protagonist   Clever Protagonist   Dark   Death   Determined Protagonist   Devoted Love Interests   Dragons   Fearless Protagonist   Firearms   Friendship   Gunfighters   Handsome Male Lead   Human Experimentation   Human-Nonhuman Relationship   Interdimensional Travel   Love Interest Falls in Love First   Manly Gay Couple   Military   Modern Day   Mutations   Mystery Solving   Near-Death Experience   Obsessive Love   Overpowered Protagonist   Persistent Love Interests   Possessive Characters   Power Couple   Protagonist Strong from the Start   Psychic Powers   Scientists   Seduction   Selfless Protagonist   Siblings   Straight Uke   Strong Love Interests   Survival   Teamwork   World Travel   ",
	"rating": "(4.6 / 5.0, 196 votes)",
	"author": "Jiao Tang Dong Gua   焦糖冬瓜   ",
	"year": "\n2016",
	"ranking": "#2283   #2046   #1834   #3336   #886   ",
	"reviewcount": "38 Reviews sorted by",
	"description": "A botched rescue mission with an unknown objective cost Zhou Yu his team members, while leading him progressively closer to the multinational biotech corporation Juli’s research core.\n\nIn order to protect his botanist younger brother Zhou Qing, Zhou Yu accepted employment under the Juli Corporation, and is dispatched to a parallel world—Nibelungen.\n\nNibelungen’s biological systems are completely different from the world Zhou Yu is from. To live in this place, Zhou Yu must follow three great laws:\n\nThe first law, fear is the sign of the hunted, so you must never show fear.\n\nThe second law, the more beautiful an organism is, the more dangerous they are. Do not approach them, and do not trust them.\n\nThe third law, do not be misled by the mimicry of S rank organisms. They understand your mind, and they know how to entice you. Always remember that they have no human emotions or love. All humans are no exception to them.\n\nFinally: We wish everyone can live happily in Nibelungen.>"
}