{
	"url": "https://www.novelupdates.com/series/i-got-bitten-after-transmigrating-into-a-pseudo-beta/",
	"title": "I Got Bitten After Transmigrating into a Pseudo-Beta - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/03/I-Got-Bitten-After-Transmigrating-into-a-PseudoBeta.jpg",
	"noveltype": "(CN)",
	"genre": "Drama   Romance   School Life   Yaoi   ",
	"tags": "Amnesia   Black Belly   Blind Dates   Contracts   Cute Children   Cute Protagonist   Doting Love Interests   Dreams   Futuristic Setting   Handsome Male Lead   Heartwarming   Love Interest Falls in Love First   Marriage   Marriage of Convenience   Misunderstandings   Modern Day   Mpreg   Older Love Interests   Omegaverse   Possessive Characters   Strong Love Interests   Transmigration   Wealthy Characters   ",
	"rating": "(4.1 / 5.0, 425 votes)",
	"author": "Lu Wei Mu   芦苇木   ",
	"year": "\n2020",
	"ranking": "#3133   #192   #1173   #262   #817   ",
	"reviewcount": "112 Reviews sorted by",
	"description": "Yue Fei transmigrates into a novel and becomes the cannon fodder beta male partner of the male lead in the book. His alpha boyfriend marks an omega because he is being led on by the pheromone…\n\nAccording to the original plot, Yue Fei should do everything possible to make things difficult for the omega. After all, he is the true boyfriend of the alpha, and they are true love if they fall in love without being controlled by the pheromone.\n\nHowever, Yue Fei, who transmigrated into the novel, yawned: I don’t bother to give these two people a glance.\n\nThe family wanted Yue Fei to marry into the rich, because the other party’s first choice was beta. In the original work, Yue Fei, who should do everything possible to escape the marriage and vilify the other party, nodded after listening to the introduction of the middleman: Yes, I’ll get married.\n\nBig Shot Gu Wei: I like smart and tactful people.\n\nYu Fei’s true thoughts: Marrying into a wealthy family, I don’t have to worry about money and just live my life lavishly forever, why not agree?\n\nAfter the marriage, one day he was being pressed against the wall and got bit on the back of his neck, Yue Fei was not calm. Why did no one tell him that he was actually an Omega in the original work???!!!>"
}