{
	"url": "https://www.novelupdates.com/series/the-saintess-is-busy-raising-a-warrior/",
	"title": "The Saintess is Busy Raising a Warrior - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/08/The-Saintess-is-Busy-Raising-a-Warrior.jpg",
	"noveltype": "(KR)",
	"genre": "Action   Adventure   Fantasy   Romance   ",
	"tags": "Adventurers   Beautiful Female Lead   Clingy Lover   Cold Love Interests   Determined Protagonist   Devoted Love Interests   European Ambience   Fantasy World   Fearless Protagonist   Female Protagonist   Game Elements   Handsome Male Lead   Healers   Love Interest Falls in Love First   Loyal Subordinates   Magic   Medieval   Otome Game   Possessive Characters   Power Couple   Religions   Saints   Strong Love Interests   Sword And Magic   Transmigration   Transported into a Game World   Unconditional Love   ",
	"rating": "(3.9 / 5.0, 7 votes)",
	"author": "넬라크   ",
	"year": "\n2022",
	"ranking": "#5262   #2000   #13142   #12438   #11813   ",
	"reviewcount": "No Reviews",
	"description": "Lee Eun-hye was a gold medalist in the Summer Olympics Women’s Boxing. \r\nAhead of a match, she came to possess Saintess ‘Maria Estelle’ from her favorite otome game [Hero Maker].\r\n\r\nIn order to return back to reality, she had to gather all of the powerful male protagonists one by one and defeat the Demon King. \r\nThe problem was that this stupid game only had bad endings. \r\n\r\n'Maybe this is my chance. An opportunity to change a game with only bad endings to a happy ending.' \r\n\r\nHowever, things got a little complicated.\r\n\r\n* * *\r\n\r\n“Move aside.”\r\n“…….”\r\n“I said move aside, Allen Iroas.”\r\n\r\nThe Demon King’s Castle was just a few steps away. \r\nI had no doubt in my mind that I would finally be able to achieve a happy ending and return home this time if I defeated the Demon King, but…\r\n\r\n“You’ve always been like this. Always forcing me to make difficult decisions.”\r\n“What are you doing right now.”\r\n“Maria Estelle, there’s only one thing I want.”\r\n“Let go of me.”\r\n“I just need you to stay by my side forever.”\r\n“…….”\r\n\r\nForever. \r\nAs he said so, his eyes were full of determination to never let me go. >"
}