{
	"url": "https://www.novelupdates.com/series/the-dreamer-in-the-spring-boudoir/",
	"title": "The Dreamer in the Spring Boudoir - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2018/06/DSB-Cover-00.png",
	"noveltype": "(CN)",
	"genre": "Drama   Historical   Josei   Romance   ",
	"tags": "Adapted to Drama   Ancient China   Aristocracy   Arranged Marriage   Betrayal   Black Belly   Business Management   Calm Protagonist   Carefree Protagonist   Character Growth   Childcare   Clever Protagonist   Cold Protagonist   Couple Growth   Cross-dressing   Cunning Protagonist   Death of Loved Ones   Doting Older Siblings   Dreams   Empires   Female Protagonist   Ghosts   Handsome Male Lead   Imperial Harem   Late Romance   Love Interest Falls in Love First   Misunderstandings   Modern Knowledge   Multiple POV   Nobles   Persistent Love Interests   Politics   Polygamy   Pregnancy   Proactive Protagonist   Royalty   Schemes And Conspiracies   Secret Identity   Servants   Sister Complex   Slow Romance   Smart Couple   Time Skip   Transmigration   Villainess Noble Girls   ",
	"rating": "(3.8 / 5.0, 621 votes)",
	"author": "Bái Lù Chéng Shuāng   白鹭成双   ",
	"year": "\n2014",
	"ranking": "#5262   #4237   #291   #325   #711   ",
	"reviewcount": "243 Reviews",
	"description": "“I can’t accept this! I can’t! Even as a ghost, I’m going to spend eternity cursing that your relationship will shatter like glass! Break apart like a pair of mandarin ducks that fly away from each other!” With such a persisting obsession, it would be difficult for the vengeful departed spirit to move on.\n \nJi Man had only read a light novel to pass the time, but she was unexpectedly pulled into a very strange dream. She had become the novel’s most vicious villainess.\n \nThe novel rewinds to the beginning. The villainess who had been ordered to commit suicide reappears on stage and begins to follow the plot as she walks toward the novel’s ending once again, to a courtyard deep inside the marquis' residence. A female lead that’s like the Holy Mother. Countless cannon fodders. The imperial family’s favor…>"
}