{
	"url": "https://www.novelupdates.com/series/re-survival/",
	"title": "Re: Survival - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/11/RE-S-Cover.jpg",
	"noveltype": "(KR)",
	"genre": "Action   Adventure   Fantasy   Horror   Shounen   Tragedy   ",
	"tags": "Adapted to Manhwa   Antihero Protagonist   Apocalypse   Calm Protagonist   Cautious Protagonist   Cunning Protagonist   Evil Organizations   Gangs   Male Protagonist   Organized Crime   Post-apocalyptic   Second Chance   Survival   Time Travel   Zombies   ",
	"rating": "(3.8 / 5.0, 78 votes)",
	"author": "Woo Sol Yeon   연우솔   ",
	"year": "\n2018",
	"ranking": "#1453   #6308   #4173   #1484   #4406   ",
	"reviewcount": "10 Reviews sorted by",
	"description": "Zombies suddenly appeared all over the world, quickly spreading through densely populated cities. It only took two years for every government around the world to collapse, leaving behind chaos and anarchy on a global scale. Without the law and order that once kept them safe, people turned fearful of both the zombie threat and of each other. Even in the face of the countless waves of undead, groups formed and fought over the limited resources that remained.\n\nThis culminated in a battle between two of the strongest remaining groups—the last beacons of humanity. What resulted was a devastating loss of life on both sides. Yohan’s group was completely annihilated and their surviving enemies were swarmed by zombies. Though he managed to suffer through this apocalyptic world for three years, his time was up. Unexpectedly, death had come not from an enemy, but from a friend. He had been bitten by his oldest and most trusted companion, who had been infected during the battle and turned into a zombie.\n\nAccepting his fate, Yohan closes his eyes, only to discover that he has returned to the past, six months prior to the zombie outbreak. With his memories of the last three years, only he knows of the approaching apocalypse.\n\nGiven a second chance, he plans to do everything to survive!>"
}