{
	"url": "https://www.novelupdates.com/series/after-rebirth-i-became-the-scum-gongs-uncles-destined-omega/",
	"title": "After Rebirth, I Became the Scum Gong’s Uncle’s Destined Omega - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/07/After-Rebirth-I-Became-the-Scum-Gongs-Uncles-Destined-Omega.jpg",
	"noveltype": "(CN)",
	"genre": "Drama   Fantasy   Mecha   Romance   Yaoi   ",
	"tags": "Artificial Intelligence   Family   Futuristic Setting   Handsome Male Lead   Hiding True Identity   Human Experimentation   Love Interest Falls in Love First   Male Yandere   Military   Multiple Reincarnated Individuals   Mysterious Illness   Obsessive Love   Older Love Interests   Omegaverse   Past Plays a Big Role   Past Trauma   Persistent Love Interests   Personality Changes   Possessive Characters   Reincarnation   Second Chance   Terminal Illness   Tragic Past   Wealthy Characters   ",
	"rating": "(4.0 / 5.0, 78 votes)",
	"author": "黑猫白袜子   ",
	"year": "\n2021",
	"ranking": "#2094   #628   #5081   #2631   #4406   ",
	"reviewcount": "17 Reviews sorted by",
	"description": "In his past life, the beta Su Liang dared to seduce Lu Zhizhao, the future of the Lu family, and eloped.\r\n\r\nIn the end, after burning down all his boats with no hesitation, Su Liang realized that he was nothing but a big joke.\r\n\r\nSu Liang gave up everything, and died silently on the day after Lu Zhizhao’s marriage to someone else.\r\n\r\nReliving a life, the courageous fool of that year finally learned to accept his fate.\r\n\r\nThis time, Su Liang honestly accepted that he was an unfavoured and mediocre beta, feeling that this bland and undemanding life was quite good.\r\n\r\nAfter all, the way of the salted fish is the best way.\r\n\r\nBut after just a few peaceful days, he was sent into the forbidden area, in the depths of the noble’s compound.\r\n\r\n \r\n\r\nLu Taipan – who used to be a big boss, is now a big boss, who will always be the kind of sinister and ruthless big boss who would make everyone tremble with fear when he comes out.\r\n\r\nHowever, it was this top-level alpha who single-handedly supported the Lu Family, but suffered from pheromone disorder.\r\n\r\nAnd, the place where he rested, was a forbidden place in the eyes of everyone.\r\n\r\nNo matter how many things Su Liang thought about, he didn’t expect Lu Taipan to embrace him in the frenzy of his pheromone disorder.\r\n\r\nThen, he bit the back of his neck with a single bite.\r\n\r\n“Your pheromones…. smells good.”\r\n\r\nThe devil-like man, like a beast, scented the pheromones on his body, and muttered greedily.\r\n\r\nSu Liang was horrified to discover that Lu Taipan and him became more and more intimate. He, who was supposed to be a beta, somehow began to develop unusual pheromone glands.\r\n\r\nFrom a beta, he was now an omega.\r\n\r\nMoreover, he was an omega who matched perfectly with Lu Taipan.>"
}