{
	"url": "https://www.novelupdates.com/series/ive-been-devoting-myself-to-helping-my-sister-but-im-quitting-today/",
	"title": "I’ve Been Devoting Myself To Helping My Sister, but I’m Quitting Today - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/05/Ive-Been-Devoting-Myself-To-Helping-My-Sister-but-Im-Quitting-Today.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Fantasy   Romance   School Life   Shoujo   ",
	"tags": "Academy   Aristocracy   Betrayal   Determined Protagonist   European Ambience   Fantasy World   Female Protagonist   Handsome Male Lead   Magic   Misunderstandings   Multiple POV   Naive Protagonist   Nobles   Overpowered Protagonist   Past Plays a Big Role   Royalty   Sibling Rivalry   Siblings   Sword And Magic   Underestimated Protagonist   ",
	"rating": "(3.1 / 5.0, 26 votes)",
	"author": "Almond   あーもんど   ",
	"year": "\n2021",
	"ranking": "#3633   #3285   #4210   #6797   #6923   ",
	"reviewcount": "3 Reviews sorted by",
	"description": "According to her childhood promise, Charlotte has been devoting herself to helping her sister. She had endured no matter how foolish it seemed, but when she entered school, she broke. Her sister made a fool of Charlotte at the school. It was so bad that even the most excellent sister couldn’t take it, and Charlotte becomes isolated as soon as she enters school.\n\nIf the next three years are wasted as it is, the Viscount daughter Charlotte has no future. Because if she can’t find a fiancé by the time she graduates from school, Charlotte, the daughter of a weak aristocrat, has no happy future. If she goes on like this she would marry an old man who is as old as her father. Weighing her relationship with her sister and her future, Charlotte makes a decision.\n\n“I want to marry a nice person and live a peaceful life! So ──── I’ll quit being my sister’s foil today!”\n\nCharlotte, who quit being her sister’s foil, shows her true ability and overwhelms even the teachers! Charlotte, who knows neither restraint nor hesitation, pushes forward to grasp a happy future!>"
}