{
	"url": "https://www.novelupdates.com/series/transmigrated-into-the-film-emperors-death-seeking-fiance/",
	"title": "Transmigrated into the Film Emperor’s Death-Seeking Fiance - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/06/Transmigrated-into-the-Film-Emperors-Death-Seeking-Fiance-new.jpg",
	"noveltype": "(CN)",
	"genre": "Adult   Mature   Romance   Slice of Life   Yaoi   ",
	"tags": "Acting   Adopted Children   Arranged Marriage   Bickering Couple   Calm Protagonist   Childcare   Clever Protagonist   Couple Growth   Cute Children   Engagement   Familial Love   Fast Learner   First Love   First-time Interc**rse   Handsome Male Lead   Manly Gay Couple   Modern Day   Mpreg   Past Plays a Big Role   Popular Love Interests   Power Couple   Pragmatic Protagonist   Pregnancy   Shameless Protagonist   Showbiz   Slow Romance   Transmigration   ",
	"rating": "(4.2 / 5.0, 216 votes)",
	"author": "Lin Ang Si   林盎司   ",
	"year": "\n2018",
	"ranking": "#1768   #3271   #1317   #2634   #673   ",
	"reviewcount": "57 Reviews sorted by",
	"description": "His filming opportunities were taken by others; his boyfriend cheated on him; he gave up a rich, tall handsome fiance and devoted himself to a scumbag. In the end, he was beaten to death by the scumbag. Yan Qing Chi felt that although this danmei cannon fodder supporting male that he transmigrated into was troublesome, it was kind of tragic that he died like this through his own actions.\n\nSo, the first thing that Yan Qing Chi did after taking over this body was to catch them in the act and beat up the scumbag! The second thing that he did, was to agree to the marriage proposal from the aristocratic fiance.\n\nHowever, Yan Qing Chi stared down at his big belly. Who can tell him what the heck this was?! Don’t tell him that he transmigrated into a mpreg novel???\n\nStanding on the side, the tall, rich, and handsome Film Emperor Jiang asked carefully, “Babe, do you want a boy or a girl?”\n\nYan Qing Chi: Do I want a WHAT?!>"
}