{
	"url": "https://www.novelupdates.com/series/please-dont-eat-me-saha/",
	"title": "Please Don’t Eat Me (Saha) - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/08/1-1.png",
	"noveltype": "(KR)",
	"genre": "Fantasy   Romance   Smut   Tragedy   ",
	"tags": "Absent Parents   Adapted to Manhwa   Aristocracy   Beautiful Female Lead   Couple Growth   Dark   Debts   Elemental Magic   European Ambience   Fallen Nobility   Family   Family Business   Female Protagonist   Handsome Male Lead   Magic   Manipulative Characters   Marriage   Marriage of Convenience   Persistent Love Interests   Poor Protagonist   Poor to Rich   Possessive Characters   Pragmatic Protagonist   Prostit**es   Reincarnated in Another World   Reincarnation   Rich to Poor   Sibling's Care   Strong Love Interests   Unlucky Protagonist   Wizards   ",
	"rating": "(4.4 / 5.0, 96 votes)",
	"author": "Saha   사하   ",
	"year": "\n2019",
	"ranking": "#4617   #4171   #4009   #2349   #1829   ",
	"reviewcount": "12 Reviews sorted by",
	"description": "She reincarnated in a 19th-century male-oriented fantasy novel. But there was no heroine in this nasty and brutal B-rated dramatic story.\n\nIt’s because he had killed everyone.\n\nIn this hopeless story devoid of any dreams, she was destined to be eaten alive by the protagonist. But before she could even meet them, her house was ruined.\n\nBe devoured by the protagonist, or starve to death?\n\nAfter much agonizing, she decided to sell herself.\n\nThe main character sealed the deal with a price of 5 billion Marcas.\n\nIt’s not such a bad deal for both the hero and her.\n\n***\n\n“How could a woman who sold herself in the slums be more important than the Emperor’s name?!”\n\nThe voice belonged to a young knight. The other knights hurried to restrain him, but the beans were already spilled. The captain of the knights apologized with a cold sweat.\n\n“I apologize, Your Grace. I have nothing to say. This is all due to my incompetence.”\n\n“No, it’s finished.”\n\nZahid drew his sword as he spoke gracefully.\n\nWhile the knights were at their wits’ end, I approached Zahid. He glanced back at me, before turning back to the sword’s blade that shone in the moonlight. I reached out to him.\n\n“Give me the sword.”\n\n“I don’t want to. He insulted you.”\n\n“No, that’s not it.”\n\nI looked directly up at the knights that spoke such insulting words.\n\n“I’ll stab you myself.”>"
}