{
	"url": "https://www.novelupdates.com/series/our-binding-love-my-gentle-tyrant/",
	"title": "Our Binding Love: My Gentle Tyrant - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/11/Our-Binding-Love-My-Gentle-Tyrant.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Psychological   Romance   Tragedy   ",
	"tags": "Adapted to Manhua   Age Progression   Alternate World   Beautiful Female Lead   Betrayal   Caring Protagonist   Complex Family Relationships   Cruel Characters   Depictions of Cruelty   Devoted Love Interests   Doting Love Interests   Female Protagonist   First Love   Gore   Handsome Male Lead   Lack of Common Sense   Loli   Love Interest Falls in Love First   Persistent Love Interests   Politics   Possessive Characters   Royalty   Ruthless Protagonist   Strong Love Interests   Torture   Tragic Past   Transmigration   Transported to Another World   Villainess Noble Girls   Yandere   ",
	"rating": "(4.1 / 5.0, 165 votes)",
	"author": "Fēng Yǔ Zìrán   Wind & Nature   风与自然   ",
	"year": "\n2018",
	"ranking": "#1420   #1298   #1194   #2429   #1037   ",
	"reviewcount": "33 Reviews sorted by",
	"description": "She was transmigrated into a novel where she became the cannon fodder who abused the male lead and ultimately suffered her demise under said male lead. And to return back home, she had to obtain the city boundary map first.\r\n\r\nYe Mu doesn’t want to play a game! Now that she’s inside the book with such a plot, the only way around her death is to kill the male lead first and let this world collapse!\r\n\r\nHowever, upon seeing a scraggly, skinny little boy whose brows were full of perseverance, her hand won’t move…\r\n\r\nWell then, she would subdue the male lead’s tyrannical tendencies! How to do it? Raise the male lead and have him help her find the city boundary map? That’s a good idea!\r\n\r\nDespite raising him properly, the male lead seems to have grown into a devious man who won’t listen to her. Moreover, he lures her over with the city boundary map.\r\n\r\n“Do you want this or not? Then come to my bed.”\r\n\r\nHer face was full of tears. Where was the promised honest and upstanding monarch? Does she have to raise him all over again?\r\n\r\nThe man smiles and pats her on the head, “Come on, stop crying. Wash and go to bed.”>"
}