{
	"url": "https://www.novelupdates.com/series/the-emperor-and-the-female-knight/",
	"title": "The Emperor and the Female Knight - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/12/TheEmperorFemaleKnight1b.jpg",
	"noveltype": "(KR)",
	"genre": "Action   Adventure   Gender Bender   Josei   Mature   Romance   Slice of Life   ",
	"tags": "Adapted to Manhwa   Age Progression   Aristocracy   Average-looking Protagonist   Bullying   Clever Protagonist   Determined Protagonist   Different Social Status   European Ambience   Female Protagonist   Handsome Male Lead   Hard-Working Protagonist   Kingdoms   Knights   Late Romance   Love Interest Falls in Love First   Military   Nobles   Pregnancy   Royalty   Slow Romance   Sword Wielder   Tomboyish Female Lead   Wars   ",
	"rating": "(4.0 / 5.0, 70 votes)",
	"author": "Glasses Monkey   안경원숭이   ",
	"year": "\n2016",
	"ranking": "#2000   #2000   #5955   #8230   #4274   ",
	"reviewcount": "7 Reviews sorted by",
	"description": "“You are looking lovelier by the day.”\n\n“Is there anywhere that you feel is uncomfortable?”\n\nThe emperor of the continent, possessing both ability and looks, has fallen in love with a female knight tougher than any man! But before their comradeship turned into love…a story of a particularly new style of a ‘female knight romance’, divided into both solemnness and comedic relief by the golden ratio!\n\nThe female knight Pauliana stood on a disadvantaged battlefield, defeated by the Acrean army. She had desperately worked to survive in a patriarchal society, but she was now going to die.\n\nHowever, the young Acrean king, Lucius the First, looked at her desperate struggle and threw out a suggestion.\n\n“I have a dream. It is to continue to invade to the south and become the first emperor of this content. How is it. To follow me to set foot on the edge of this continent?”\n\nPauliana swore a lifetime of allegiance to the king who had recognized her. As a knight. But at the final stage of his campaign, Lucius the First realizes that he’s in love.\n\nThe him who wants her to be his ‘woman’ and the her who does her utmost to serve her ’emperor.’\n\nOn the battlefield of love, the emperor is the weaker party! The ideal chivalric romance vs. The peculiar palace romance, what will happen when the two collide?>"
}