{
	"url": "https://www.novelupdates.com/series/black-moonlight-holds-the-be-script/",
	"title": "Black Moonlight Holds the BE Script - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/08/Black-Moonlight-Holds-the-BE-Script.jpg",
	"noveltype": "(CN)",
	"genre": "Adult   Drama   Historical   Mature   Romance   Tragedy   Xianxia   ",
	"tags": "Abusive Characters   Adapted to Drama   Cultivation   Demon Lord   Demons   Enemies Become Lovers   Evil Gods   Exorcism   Female Protagonist   Goddesses   Gods   Immortals   Magic Formations   Marriage   Past Plays a Big Role   Psychopaths   R*pe Victim Becomes Lover   R*pe   S*xual Abuse   Time Travel   Transmigration   Weak to Strong   ",
	"rating": "(3.7 / 5.0, 71 votes)",
	"author": "藤萝为枝   ",
	"year": "\n2020",
	"ranking": "#1969   #926   #3964   #3153   #5330   ",
	"reviewcount": "21 Reviews sorted by",
	"description": "The rebel army leader swung his sword to my neck on the city tower, as I faced a dead end. Then, with a huge grin, he said to Tantai Jin, “Between your wife and Miss Ye, only one can live. Who are you going to pick?”\n\nThe system cautiously looked at Ye Bingshang, who was crying, and said, “Master, he’ll pick you.”\n\n“Let Bingshang go,” Tantai Jin ordered without hesitation.\n\n“Uh oh,” said the system.\n\n“Uh oh,” I said.\n\n“Tantai Jin must know that your family is large and owns a lot of property,” the system remarked, reassuringly. “As a result, he must think that the secret guards will save you.”\n\nTantai Jin thought similarly. So, on that day, in front of 300 thousand men, I smiled at him and jumped off the city tower, beneath his shattered gaze. \n\nI didn’t even leave a complete body behind for him.\n\nSo, this is the ‘BE’ ending that I have chosen for Tantai Jin.\n\nAs the new emperor, Tantai Jin’s hair turned white overnight in the first year of Jinghe. Then he turned into an insane devil that slaughtered the city, even beheading Ye Bingshang.\n\nAnd after Nirvana, I, who had already seen through these few years of hopeless love, returned to the immortal cultivation realm. Being a little fairy makes me happy too.\n\nMany years later, I’m claimed to be the white moonlight of a fallen divinity throughout the immortal cultivation realm.\n\nTantai Jin had never sobbed in his entire life. No one had ever witnessed his frail state, even if his eye was gouged out and his meridian veins were cut.\n\nThat was the day that everyone will remember for the rest of their lives. With blood and tears streaming down his cheeks like beads, he pleaded for mercy.>"
}