{
	"url": "https://www.novelupdates.com/series/im-worried-that-my-brother-is-too-gentle/",
	"title": "I’m Worried that My Brother is Too Gentle - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/03/Im-Worried-that-My-Brother-is-Too-Gentle.jpg",
	"noveltype": "(KR)",
	"genre": "Fantasy   Romance   Shoujo   ",
	"tags": "Adapted to Manhwa   Age Progression   Aristocracy   Beautiful Female Lead   Brother Complex   Child Protagonist   Comedic Undertone   Cute Protagonist   Dense Protagonist   Doting Older Siblings   Doting Parents   European Ambience   Fantasy World   Female Protagonist   Handsome Male Lead   Love Interest Falls in Love First   Misunderstandings   Quirky Characters   Reincarnation   Royalty   Sister Complex   ",
	"rating": "(4.0 / 5.0, 88 votes)",
	"author": "류희온   ",
	"year": "\n2019",
	"ranking": "#2000   #6268   #3552   #1408   #1546   ",
	"reviewcount": "3 Reviews sorted by",
	"description": "“Your Highness! The papers have piled up like this……!”\n\nI reincarnated as Irene Weber, the younger sister of an aide who is suffering from overtime because of the prince who is in love and neglects his work. Irene, who was buried in work before the reincarnation and died of overwork, intends to protect her beloved brother from such a terrible thing.\n\nNo overtime! No call after work! Evil boss, go away! Work less and earn more, brother!\n\nTo the end, Irene tries to separate the prince from her brother.\n\nA method to win by knowing your enemy and knowing yourself. Irene scraps a little record without leaving any details, of the Prince whose face she doesn’t even know about, for the future. Somehow, her brother’s face, looking at such Irene, is dark……\n\n“Brother, if you’re meeting the Crown Prince today, I’ll go with…..”\n\n“Absolutely not.”\n\n‘Do you want to meet him alone soo much?’\n\n***\n\n“Before that, Benjamin Webber, when can I meet your sister?”\n\n“Not for the rest of your life.”\n\nThe most affectionate brother and sister of the continent. Will the day come when these two siblings can resolve their growing misunderstanding?>"
}