{
	"url": "https://www.novelupdates.com/series/guide-to-save-the-yandere-villains/",
	"title": "Guide To Save The Yandere Villains - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/04/Guide-To-Save-The-Yandere-Villains.jpg",
	"noveltype": "(CN)",
	"genre": "Fantasy   Romance   ",
	"tags": "Female Protagonist   Love Interest Falls in Love First   Male Yandere   Master-Servant Relationship   Matriarchy   Possessive Characters   S*aves   Stockholm Syndrome   World Hopping   ",
	"rating": "(3.6 / 5.0, 16 votes)",
	"author": "它的猫扑卡   ",
	"year": "\nN/A",
	"ranking": "#4617   #4701   #9239   #11527   #9731   ",
	"reviewcount": "2 Reviews sorted by",
	"description": "Situ was the only Goddess of War in the Realm of the Gods. In the final moments of the Battle of Gods and Demons, her Divine Consciousness shattered and scattered across 3000 worlds. She could only regain her Divine Power piece by piece by completing her missions to save the yandere villains of different worlds.\r\n\r\nIt was already hard to be a villain, but it was much harder to save a villain. Every day, Situ would either sacrifice herself or try to resist the urge to assassinate the villain.\r\n\r\n[Host! Look how pitiful this villain is! He's like a delicate flower.]\r\n\r\n[Can we be a little gentler and have a bit more empathy? How about putting down the knife in your hand first?]\r\n\r\n[What if my host always wants to kill the villain? Please reply urgently, it's somewhat nerve-wracking to wait for an answer!]\r\n\r\nOnly when Situ had completed most of her missions and was planning to leave soon did she realize something— at some point, she had fallen into the pit that the villains dug, and there was no way to climb out.\r\n\r\nTsk, a little white bunny turning into a big gray wolf; why was the story not following the script?\r\n\r\n***\r\n\r\n[The Princess & The Slave]\r\n'Your Highness promised not to leave Xiaobai again, so where do you think you're escaping to?'\r\n\r\n[Master & Disciple]\r\n'It was a mistake for me to be born, but you remain my only belief. Becoming a devil or an immortal all depends on your imagination.'\r\n\r\n[Green Plum & The Bamboo Horse]\r\n'Those who live in the dark mud have also longed for the light. Elder sister, you are the light that I will follow in my life, and I will not regret this decision even when death comes to claim me!'>"
}