{
	"url": "https://www.novelupdates.com/series/im-a-friend-of-the-male-lead-who-went-crazy-because-the-female-lead-died/",
	"title": "I’m a Friend of The Male Lead Who Went Crazy Because The Female Lead Died - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/01/Im-a-Friend-of-The-Male-Lead-Who-Went-Crazy-Because-The-Female-Lead-Died_1641851504.jpg",
	"noveltype": "(KR)",
	"genre": "Fantasy   Romance   ",
	"tags": "Beautiful Female Lead   Death of Loved Ones   Fairies   Fantasy World   Female Protagonist   Handsome Male Lead   Love Interest Falls in Love First   Male Yandere   Obsessive Love   Spirits   Transmigration   Yandere   ",
	"rating": "(3.9 / 5.0, 19 votes)",
	"author": "데미칼린   ",
	"year": "\n2021",
	"ranking": "#6970   #6165   #9794   #6338   #6727   ",
	"reviewcount": "No Reviews",
	"description": "The male lead went crazy because the female lead died…… I possessed his friend.\n\nMy role is one thing. \n\nAfter reviving the female protagonist, \n\n“Hey, female lead. The male lead went crazy because you died.”  \n\nI will guide her to the male lead then disappear. \n\nBut there was a problem. \n\nThe female lead can’t wake up.\n\n*** \n\nTo protect the crazy male lead beautifully\n\nTo make sure the female lead was revived\n\nI collected all the money from the empire. \n\n-Gourmet of the Nation, overturn the food industry of the Empire! \n\n-White mask, business success! Who the hell is she! \n\nFyuh. I’ve saved money, and now I’m almost achieving my goal and closing my time-limited life.\n\n“Elschnein. What do you mean, you’re going to leave me? Do you want to see this continent fall?” \n\nSomehow, the beautifully crazy male lead is strange. \n\nWhy are those crazy eyes facing me? \n\n“Ky, Kylian. Just give me one day.” \n\n“… What? A day?” \n\n“Yea, yeah. I’m going to disappear tomorrow, so I’ll revive Arwen somehow…” \n\nClank, the sword he was holding fell to the floor. \n\n… Was he that happy that the female lead was going to revive?>"
}