{
	"url": "https://www.novelupdates.com/series/the-empress-returns/",
	"title": "The Empress Returns - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/02/The-Empress-Returns.jpeg",
	"noveltype": "(KR)",
	"genre": "Adult   Drama   Fantasy   Psychological   Romance   Smut   ",
	"tags": "Abandoned Children   Absent Parents   Abusive Characters   Affair   Aggressive Characters   Ancient Times   Appearance Changes   Arrogant Characters   Beautiful Female Lead   Character Growth   Clingy Lover   C*nnilingus   Cold Love Interests   Contracts   Cruel Characters   Death of Loved Ones   Depictions of Cruelty   Determined Protagonist   Devoted Love Interests   Distrustful Protagonist   Enemies Become Lovers   Fantasy World   Fated Lovers   Female Protagonist   First Love   First-time Interc**rse   F*llatio   Generals   Love Interest Falls in Love First   Love Rivals   Male Yandere   Marriage   Marriage of Convenience   Misunderstandings   Nobles   Obsessive Love   Possessive Characters   Power Couple   Pragmatic Protagonist   Pretend Lovers   Protagonist Strong from the Start   R-18   Royalty   Secret Identity   Secret Relationship   Special Abilities   Strong Love Interests   Sword Wielder   Tomboyish Female Lead   Tragic Past   ",
	"rating": "(3.2 / 5.0, 66 votes)",
	"author": "riki   리키   ",
	"year": "\n2020",
	"ranking": "#5262   #2000   #5471   #9888   #3412   ",
	"reviewcount": "7 Reviews sorted by",
	"description": "When the Arpen Empire decided to no longer wage war, small countries nearby could finally breathe. But this peace was meant to be shattered, for soon after, envoys were sent to each country issuing a golden decree to each of the royal families.\n\n“To establish an alliance with the Arpen Empire, each kingdom must send a princess to become a Crown Princess Candidate. The princesses will undergo six months of training to divide them into those who have the potential to become empress and those who will be concubines. Any kingdom disobeying the imperial edict shall be seen as enemies and their access to the River Judith’s stream will be blocked.”\n\n“The God of Judith” was an age-old love song that had been sung from generation to generation. The ballad passed from the grandma’s lips to the little girl’s, from her to another, and another… etching a place in time. But this was no tale of admiration and envy, for all whose ears it reached agreed that the God of Judith was foolish.\n\nStanding by the banks, a woman gazed at the River Judith before her…  where the god may have stood thousands of years ago, her hand resting on her heart, a suffocating feeling clutching at her.\n\n“The god isn’t the only one who’s foolish… Humans are the same as well… You and I.”\n\nViola’s long-cherished dream was not to marry and be someone’s wife but be hailed as the queen of the Kingdom of Koronis. She longed for the crown, even more after losing her only flesh and blood in the war. Once a half-royal, she struck a deal with the king to restore her status. It was a political marriage to the Crown Prince of the Arpen Empire.\n\n“I’m going to be a queen, and I will take my identity back.”>"
}