{
	"url": "https://www.novelupdates.com/series/im-sure-its-my-baby/",
	"title": "I’m Sure It’s My Baby - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/07/Im-Sure-Its-My-Baby_1657523688.jpg",
	"noveltype": "(KR)",
	"genre": "Fantasy   Romance   ",
	"tags": "Aristocracy   Childcare   European Ambience   Female Protagonist   Nobles   R-15   Reincarnation   ",
	"rating": "(4.2 / 5.0, 13 votes)",
	"author": "한민트   ",
	"year": "\n2022",
	"ranking": "#6970   #6316   #11208   #6342   #9636   ",
	"reviewcount": "No Reviews",
	"description": "She was born again as the eldest daughter of a baron after being hit by a reincarnation truck.\n\nA harmonious family, a lovely sister and a simple estate. I was going to live my whole life, sucking honey and being unemployed.\n\n“How the hell did this happen?”\n\n“Don’t you remember?”\n\n“I do. I meant to say I don’t know how it went that way.”\n\n“……who’s to say.”\n\nShe made a mistake with the duke, who is from one of the three most prestigious families of the Empire. Well, that’s a possibility. Mistakes are inevitable. But that day, my sister got caught up in something dangerous.\n\n“Everyone will die if it’s known I’ve seen it. You have to run, sister.”\n\nIt’s not because of you that I ran away, is it?\n\n***\n\n\n'That must be my child, do you think you can fool me by lying like that?”\n'Are you claiming that I raised your child by turning her into my  younger sister's child to pretend that I wasn't pregnant?”\n'I didn't say that! I'm telling you to admit that it's my child!'\n\nIt's been five years, so isn't it time for the mistake to be forgotten?\nThis is driving me crazy\n\n“Still, it’s not my son’s fault, so I’ll pay for child support in moderation. Go back to the countryside.”\nMy mother-in-law held out an envelope\n\n'I was so curious. Who took my light blue dress from the Duke's room?'\nThe flower of  the society is talking nonsense.\n\n“It’s the union of Klausener and Aren… … It's too dangerous.'\nThe Empress is hostile.\n\nI wanted to live quietly and just make some  money, but I think I'll have to kill everyone to protect my baby.    >"
}