{
	"url": "https://www.novelupdates.com/series/i-married-female-leads-crush/",
	"title": "I Married Female Lead’s Crush - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/01/27-da5e83a.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Drama   Horror   Josei   Romance   ",
	"tags": "Absent Parents   Abusive Characters   Aggressive Characters   Alternate World   Ancient Times   Appearance Different from Actual Age   Arranged Marriage   Arrogant Characters   Beautiful Female Lead   Bickering Couple   Black Belly   Carefree Protagonist   Childish Protagonist   Cowardly Protagonist   Female Protagonist   Handsome Male Lead   Lazy Protagonist   Male Yandere   Mysterious Past   Timid Protagonist   Transmigration   Tsundere   Wealthy Characters   ",
	"rating": "(3.3 / 5.0, 177 votes)",
	"author": "栖迟Q   ",
	"year": "\nN/A",
	"ranking": "#2773   #2044   #2076   #1679   #2517   ",
	"reviewcount": "47 Reviews sorted by",
	"description": "This is a story of a sicko and vicious tongued male lead pampering and obsessing over his little wife.\n\nOnce she crossed over in a novel, she became the hateful cannon fodder who married the Seven Lord of Gu family. It’s rumored that the Seven Lord of Gu family has a Buddha’s mouth but a viper’s heart, unpredictable temperament, and very superb at making a human skin painted fan. \n\nThe most terrible thing is that this man is the white lotus female lead’s head over heels crush. The biggest demon in the book, the kind that the male lead must admit when he sees him. \n\nThis… this this this, isn’t it like forcibly pushing her to the Yellow Spring road?\n\n———\n\nAt night, she straddled the wall and watched the Seven Lord, who was smiling faintly under the wall, she could not help but swallow in fear. \n\n“Seven, Seven Lord….” \n\n“Huh?” Gu Zifu lightly nodded and sat next to her. He raised his hand to touch her face: “Qing Qing, where are you going this late in the night?”\n\nSu Qing was flustered. The water mist covering eyes and her voice was like a thin silk: “I come out to look, look at the moon….”\n\n“Moon?” Seven Lord chuckled, “Does it look better than me?”\n\nSu Qing counseled, and quickly shook her head as she looks at him.\n\nGu Zifu laughed lightly. He hooked her chin looking at those delicate lips and said: “Be good.” \n\n——Be good, I’ll give you whatever you want.>"
}