{
	"url": "https://www.novelupdates.com/series/celebrity-lady/",
	"title": "Celebrity Lady - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/08/Celebrity-Lady.jpg",
	"noveltype": "(KR)",
	"genre": "Comedy   Drama   Fantasy   Romance   Slice of Life   ",
	"tags": "Abandoned Children   Abusive Characters   Acting   Aristocracy   Arrogant Characters   Beautiful Female Lead   Body Swap   Bullying   Business Management   Calm Protagonist   Celebrities   Character Growth   Child Abuse   Clever Protagonist   Complex Family Relationships   Confident Protagonist   Contracts   Cruel Characters   Cunning Protagonist   Death   Discrimination   European Ambience   Familial Love   Family Conflict   Famous Parents   Famous Protagonist   Fast Learner   Fat to Fit   Female Protagonist   Handsome Male Lead   Misunderstandings   Modern Day   Nobles   Past Plays a Big Role   Past Trauma   Pretend Lovers   Previous Life Talent   Proactive Protagonist   Protagonist Strong from the Start   Revenge   Royalty   Sadistic Characters   Shameless Protagonist   Sharp-tongued Characters   Showbiz   Spirit Users   Spirits   Store Owner   Strategist   Strong to Stronger   Sword Wielder   Tragic Past   Transmigration   Transplanted Memories   Ugly to Beautiful   Wealthy Characters   World Travel   ",
	"rating": "(4.2 / 5.0, 34 votes)",
	"author": "고은채   ",
	"year": "\n2021",
	"ranking": "#1653   #1343   #6080   #2469   #6066   ",
	"reviewcount": "8 Reviews sorted by",
	"description": "*Celeb: short for celebrity.\n\nA dull body, a timid and kind personality.\n\nThe fat princess who was ostracized, Rubetria Diollus.\n\n“Oh my, the princess is at the dessert shop every time I see her. She eats so many sweets, enough to make one’s cheeks burst, no wonder she gets fat.”\n\nPrincess Lillia, the ‘swan princess’ of the family, was always surrounded by friends, and Rubetria, the ‘ugly duckling’ who was bullied by them, was a loner.\n\n“Hey, you idiot. Our princess is angry. Eat it, quickly.”\n\n“Puhaha…!”\n\n“Oh my god! She really ate that!”\n\nRubetria was tired of the bullying.\n\nThen one day, she said,\n\n‘I want to live a wonderful life like that woman for just one day.’\n\n180 degrees change.>"
}