{
	"url": "https://www.novelupdates.com/series/mushoku-tensei-ln/",
	"title": "Mushoku Tensei (LN) - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/03/Mushoku-Tensei-LN.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Comedy   Drama   Ecchi   Fantasy   Harem   Mature   Romance   Seinen   Tragedy   ",
	"tags": "Academy   Adapted to Anime   Adapted to Drama CD   Adapted to Manga   Adventurers   Age Progression   Appearance Different from Actual Age   Aristocracy   Artifact Crafting   Beastkin   Betrayal   Caring Protagonist   Character Growth   Childhood Friends   Coming of Age   Cousins   Cute Children   Death of Loved Ones   Demon Lord   Demons   Destiny   Devoted Love Interests   Disabilities   Doting Love Interests   Dragons   Dungeons   Elemental Magic   Elves   Enemies Become Allies   Eye Powers   Familial Love   First-time Interc**rse   Friends Become Enemies   Friendship   Human-Nonhuman Relationship   Immortals   Knights   Long Separations   Magic Formations   Male Protagonist   Marriage   Monsters   Near-Death Experience   Nobles   Older Love Interests   Perverted Protagonist   Polygamy   Pregnancy   Reincarnated in Another World   Schemes And Conspiracies   Siblings   S*aves   Summoning Magic   Sword And Magic   Time Skip   Wars   Weak to Strong   Younger Sisters   ",
	"rating": "(4.1 / 5.0, 332 votes)",
	"author": "Rifujin na Magonote   理不尽な孫の手   ",
	"year": "\n2014",
	"ranking": "#4265   #4784   #3617   #6259   #1633   ",
	"reviewcount": "28 Reviews sorted by",
	"description": "A 34-year-old NEET otaku, chased out from his house by his family, found that his life is reaching a dead end. He then recalled that his life could actually have been much better if he had made better choices in the past.\n\nJust when he was at the point of regret, he saw a truck moving at fast speed, and three high schoolers in its path. Mustering all the strength he had, he tried to save them and ended getting run over by the truck, quickly ending his life.\n\nThe next time he opened his eyes, he is reincarnated to a world of sword and magic as Rudeus Greyrat. Born to a new world, a new life, Rudeus decided that, “This time, I’ll really live my life to the fullest with no regret!” Thus starts the journey of a man yearning to restart his life.>"
}