{
	"url": "https://www.novelupdates.com/series/isekai-kaeri-no-ossan-wa-fusei-sukiru-de-fathercon-musume-tachi-o-tororori-ni/",
	"title": "Isekai Kaeri no Ossan wa, Fusei Sukiru de Fathercon Musume-tachi o Tororori ni - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/09/FatherconVolume2Cover.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Comedy   Drama   Ecchi   Fantasy   Harem   Mystery   Romance   Seinen   Slice of Life   ",
	"tags": "Adapted to Manga   Cohabitation   Cooking   Death of Loved Ones   Dense Protagonist   Former Hero   Game Elements   Lack of Common Sense   Male Protagonist   Modern Day   Naive Protagonist   Organized Crime   Overpowered Protagonist   Parent Complex   Past Plays a Big Role   Polygamy   Protagonist Strong from the Start   R-15   Returning from Another World   Showbiz   Transported to Another World   Yandere   Younger Love Interests   ",
	"rating": "(3.7 / 5.0, 102 votes)",
	"author": "Takahasi Hiromu   高橋弘   ",
	"year": "\n2018",
	"ranking": "#5262   #2000   #1875   #5744   #1358   ",
	"reviewcount": "13 Reviews sorted by",
	"description": "The strongest Hero in history, Nakamoto Keisuke.\n\nHe was summoned to another world in the spring at the age of fifteen years old, and when he successfully defeated The Demon King, he was already thirty-two years old. He had finished his role in another world and returned to Japan, but the reality that had been waiting for him was, “Middle school graduate with seventeen years of blank period” label. He couldn’t find a decent job and had no choice but to spend his days working part-time.\n\nBefore such a Nakamoto, a beautiful girl who self-proclaimed had come to return the favor, appeared. “I’m the reward for Hero who had defeated Demon King”, said Angelica, a girl who came from another world that persistently tempted Nakamoto to make her his wife. Together with a high school girl who looks like Elsa, his beloved girl that he lost in another world, Nakamoto with his cheat skills got caught in a harem life.>"
}