{
	"url": "https://www.novelupdates.com/series/lend-me-a-lifetime/",
	"title": "Lend Me A Lifetime - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/11/92521s.jpg",
	"noveltype": "(CN)",
	"genre": "Drama   Mature   Romance   Yaoi   ",
	"tags": "Bodyguards   Gangs   Handsome Male Lead   Misunderstandings   Modern Day   Near-Death Experience   Older Love Interests   Organized Crime   Possessive Characters   Protagonist Falls in Love First   Short Story   Unrequited Love   ",
	"rating": "(2.9 / 5.0, 13 votes)",
	"author": "梁思危   ",
	"year": "\n2011",
	"ranking": "#2000   #3141   #10489   #12116   #10138   ",
	"reviewcount": "2 Reviews sorted by",
	"description": "Thinking that he was the man’s true love, he naively handed over his sincerity, only to realize that that he himself was the protagonist of the most disgusting story about a body double.\n\nHe was unable to control himself, he wanted to kill off that person who looked exactly like him. Only that the lover he had been with for the past year or so, had raised his gun and shot him dead. In that split moment of pain and cold, the heat of being pierced by the bullet had scorched into his heart, carved onto his bones, so deep that he would never ever be able to start over new. \n\nYet he still lived; could even empty his heart and step back, could even openly laugh. Just as if nothing had even changed.\n\nBut under the rambler roses, the former lover stepped out from the past year, his eyes slowly fixed on him, as he assumed a cold posture to question him. The weakness at the bottom of his eyes hidden behind the thousands of mountains and rivers of the difficult journey.\n\nGu Han Liang then said: “It doesn’t matter to me if you don’t forgive, don’t believe, or don’t accept. Just let it be as if you lent yourself to me. If you hate it, if you feel sad, then go back at once. I will not force you a second time.”\n\nHe didn’t reply, but his heart trembled.\n\nThe man’s kiss pressed onto his forehead, and the deep voice sounded again.\n\n“If you don’t hate it and don’t feel sad, then lend me a lifetime.”>"
}