{
	"url": "https://www.novelupdates.com/series/director-of-a-suspense-film/",
	"title": "Director of a Suspense Film - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/11/Director-of-a-Suspense-Film.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Horror   Mystery   Shounen Ai   Supernatural   ",
	"tags": "Friendship   Game Elements   Ghosts   Glasses-wearing Love Interests   Handsome Male Lead   Hiding True Identity   Lazy Protagonist   Loner Protagonist   Mystery Solving   Older Love Interests   Poor Protagonist   Poor to Rich   Power Couple   Righteous Protagonist   Secret Organizations   Showbiz   System Administrator   Thriller   Unlimited Flow   Unlucky Protagonist   ",
	"rating": "(3.9 / 5.0, 40 votes)",
	"author": "Raven   Wang Ya   妄鸦   ",
	"year": "\n2021",
	"ranking": "#3314   #4702   #8059   #10478   #6409   ",
	"reviewcount": "3 Reviews sorted by",
	"description": "The dead broke small streamer Zong Qi received a random message one day.\n\n[Congratulations! You have received Alpha access to the system, Horror Film Director. Signing actors with potential, come and shoot the film that fits you the best!]\n\nZong Qi: ? tr*sh commercial, deleted\n\nThat night, he got pulled onto the set of a horror film and was informed that if he didn’t shoot it… He’ll die. \n\nHe was lucky that the actors were all working as hard as they could, and the director only needed to stand around and watch the show.\n\nBut because he had been given way too much, Zong Qi didn’t hesitate at all before making his own changes.\n\nUnder his false identity was an ‘evil mastermind’ that fought with the actors on everything.\n\nThe immoral things he’s done on set include but aren’t limited to–\n\nPersonally putting makeup on the ghost, teaching actors how to mess and change the script, switching ‘sides’ at crucial times… \n\nPeople as arrogant as him usually don’t have good endings when their identities were revealed.\n\nWhat Zong Qi didn’t expect was that instead of the actors joining up for revenge, an unlucky bastard’s whose plans had been spoilt by him countless times appeared instead. \n\nThe man took off his glasses, revealing a pair of closed eyes, his face beautiful and cold.\n\nThe brush dipped in paint hooked past the young man’s neck, full of danger.  \n\n“You dirtied my brush.”\n\nHe smirked, drawling, “As punishment, I’ll dirty you.”>"
}