{
	"url": "https://www.novelupdates.com/series/mr-dior/",
	"title": "Mr. Dior - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2018/09/mr-dior.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Drama   Romance   Sci-fi   Shounen Ai   ",
	"tags": "Absent Parents   Adapted to Drama CD   Adapted to Manhua   Alternate World   Bickering Couple   Biochip   Business Management   Calm Protagonist   Cold Protagonist   Complex Family Relationships   Couple Growth   Cute Story   Devoted Love Interests   Doting Love Interests   Episodic   Famous Parents   Flashbacks   Futuristic Setting   Handsome Male Lead   Heartwarming   Love Interest Falls in Love First   Marriage   Multiple Personalities   Multiple POV   Past Plays a Big Role   Poor to Rich   Popular Love Interests   Possessive Characters   Smart Couple   Wealthy Characters   ",
	"rating": "(4.6 / 5.0, 200 votes)",
	"author": "Lu Ye Qian He   Lục Dã Thiên Hạc   绿野千鹤   ",
	"year": "\n2018",
	"ranking": "#2731   #6137   #2180   #1945   #1261   ",
	"reviewcount": "19 Reviews sorted by",
	"description": "One day, Zhang Chenfei met a car accident. Fortunately, he didn’t suffer any serious physical injuries. However, due to the impact of the car crash, his brain’s perception of the real world had turned into that of the novel that he was reading prior to the accident. The thing that horrified his wife, Jiao Qi, was… the Smart Brain, Louis XIII downloaded a series of books which meant that his husband would turn into a different character each time!\n\nHow will our adorable little wife deal with this kind of husband who seemed to suddenly suffer from multiple personalities?\n\nThis novel’s plot focuses on Zhang Chenfei’s changing personality based from the characters in the books, and how his wife, Jiao Qi, deal with every character as he will have to act in sync with whoever his husband’s character is. This is per the advise of the private doctor since treatment of this special condition was still under research.\n\nAs they act out their roles, they will gradually discover and learn more about the other, which they’ve never known in their seven years of living together.>"
}