{
	"url": "https://www.novelupdates.com/series/phantasmal-genesis/",
	"title": "Phantasmal Genesis - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/08/Phantasmal-Genesis.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Fantasy   Sci-fi   Supernatural   ",
	"tags": "Beasts   Cautious Protagonist   Cheats   Cunning Protagonist   Dark   Delusions   Evil Protagonist   Fantasy Creatures   Game Elements   Game Ranking System   Level System   Low-key Protagonist   Magic   Magic Beasts   Male Protagonist   Manipulative Characters   Modern Day   Monster Tamer   Multiple POV   Psychic Powers   Ruthless Protagonist   Schemes And Conspiracies   Special Abilities   System Administrator   Weak to Strong   ",
	"rating": "(4.2 / 5.0, 21 votes)",
	"author": "Elegant Leisurely Fox   Xian Hu Ya Yi   闲狐雅意   ",
	"year": "\n2018",
	"ranking": "#2000   #2014   #8907   #10269   #9730   ",
	"reviewcount": "2 Reviews sorted by",
	"description": "While standing beneath the Heavens, have you ever harboured doubts about the world you’re in?\n\nSome people had obtained the Scholar System and in just a few short years, they became the repository of humanity’s knowledge and became known as the master of all knowledge of the human civilisation.\n\nThen there are some that received divine blessings and embarked on a path to pursue the Dao of Martial Arts. They ended up being worshipped by millions, henceforth becoming the God of War.\n\nThen there was a person walking down the street when he suddenly stopped and looked up to the sky and roared, “God! I have returned!”\n\nEveryone is staking their life, fighting tooth and nail on their struggle on their way to the top.\n\nAs for Meng Ke, who has stood at the pinnacle from the very beginning, will inevitably look down on the myriad worlds.\n\n…\n\nIllusion is reality. Reality is also an illusion. \n\nOne day, Meng Ke discovered that he could create illusions and turn them into reality. \n\nBut when the illusions are shifted into reality, bizarre things began to occur on Earth.>"
}