{
	"url": "https://www.novelupdates.com/series/a-tale-of-one-lady-and-two-men/",
	"title": "A Tale of One Lady and Two Men - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/06/A-Tale-of-One-Lady-and-Two-Men.jpg",
	"noveltype": "(KR)",
	"genre": "Adult   Drama   Harem   Josei   Romance   Smut   ",
	"tags": "Affair   Aristocracy   Arranged Marriage   Beautiful Female Lead   Different Social Status   Family Conflict   Female Protagonist   First-time Interc**rse   Handsome Male Lead   Jealousy   Knights   Love Triangles   Misunderstandings   Nobles   Past Trauma   Possessive Characters   R-18   Reverse Harem   R*pe   ",
	"rating": "(3.4 / 5.0, 25 votes)",
	"author": "코르카   ",
	"year": "\n2019",
	"ranking": "#6970   #2000   #7485   #6710   #6543   ",
	"reviewcount": "2 Reviews sorted by",
	"description": "Nadia Ingram was a Duke’s daughter who just wanted to be loved. At the behest of her family, she entered an arranged marriage with the arrogant and self-indulgent Marquis Edwin R. Elantz.\r\n\r\nHowever, as she was trying to come to terms with her new life as a married woman, she somehow reunited with her ex-lover, Asheel Khurshid, who was Edwin’s knight.\r\n\r\nThis marriage, which she had wanted to be peaceful and uneventful, grew turbulent in the presence of the two men in her life.\r\n\r\n* * *\r\n\r\n“Don’t tell me you just got back from rolling around in bed with some other bastard? You smell like c*m.”\r\n\r\n“…Th-that isn’t the case at all!”\r\n\r\nInside her dress, Asheel’s fluids trickled down to her knees, but Nadia still firmly denied it. She almost broke out in cold sweat as she pretended that nothing was amiss.\r\n\r\nIt was a relief that she was good at controlling her expressions, but she continued to avoid the persistent gaze directed at her, hoping that he would just drop the subject and let it go.\r\n\r\n“Then, is it mine?”\r\n\r\nHe drew close to whisper into her ear, dirty words leaving his languid tongue as he teased her with a hint of sadistic glee.\r\n\r\n“You must have had fun until early morning, hm? It’d be nice if you could make sure to handle it properly so we won’t need to worry about any illegitimate children. How are you doing now, is it leaking out?”\r\n\r\nNadia felt the blood drain from her face.\r\n\r\n—\r\n\r\n▸ Edwin R. Elantz – the most powerful man in the Empire; surrounded by many bad rumors after gaining the trust of the Emperor; would do however as he pleased; an apathetic-looking eye candy who actually has a twisted personality; uses his eloquence well\r\n\r\n▸ Asheel Khurshid – a commoner knight; with his skills alone, he managed to rise to the position of deputy commander of the best knight order in the Empire; quiet and calm; rarely loses his temper, but he definitely would if someone pushed his buttons\r\n\r\n▸ Nadia Ingram – hails from a ducal family on the verge of bankruptcy; suffered from a childhood devoid of warmth and affection; unlike how she appears while pretending to be arrogant, truthfully she’s naive and vulnerable\r\n\r\n▸ “I’m a greedy man. I have no plans of sharing you at all. That’s why… you’d better consider your actions very carefully.”\r\n>"
}