{
	"url": "https://www.novelupdates.com/series/the-flirtatious-scheme-of-the-vicious-generals-daughter/",
	"title": "The Flirtatious Scheme of the Vicious General’s Daughter - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/10/vicgendaughter1b.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Fantasy   Historical   Romance   Supernatural   ",
	"tags": "Ancient China   Beautiful Female Lead   Bickering Couple   Broken Engagement   Brotherhood   Charming Protagonist   Cross-dressing   Dense Protagonist   Familial Love   Female Protagonist   Handsome Male Lead   Love Interest Falls in Love First   Military   Slow Romance   Strong Love Interests   Transmigration   Villainess Noble Girls   ",
	"rating": "(3.8 / 5.0, 83 votes)",
	"author": "鹿焰   ",
	"year": "\n2019",
	"ranking": "#2686   #2285   #3285   #6415   #3039   ",
	"reviewcount": "10 Reviews sorted by",
	"description": "Jiang Liangchan was transmigrated into a book and to the body of a sweet naive young woman whose family was destined to be a supporting role and a cannon fodder with catastrophic end.\r\n\r\nHer father and brother would cut off the male lead official road. While she on the other hand would be as ruthless as a demon and tried to kill the female lead.\r\n\r\nWith knowledge of this plot, she frantically followed and helped Cheng Fang and the female lead among to act as a go between in an attempt to make up for their mistakes.\r\n\r\nFinally, the story line goes to the magpie bridge, where the female heroine set foot on the bridge, henceforth will entangled with the male protagonist in one’s life and will doted on all her life.\r\n\r\nStanding at the foot of the magpie bridge, Jiang Liangchan breathed a sigh of relief and was ready to retire\r\n\r\nChen Fang stared at her and lifted her chin: “This bridge is yours.”\r\n\r\nJiang Liangchan: ?????\r\n\r\nI treat you like a brother, but you treat me like your girl instead?\r\n\r\nThis friendship between the ruthless male protagonist and the vicious female isn’t that simple, right?>"
}