{
	"url": "https://www.novelupdates.com/series/beloved-empress/",
	"title": "Beloved Empress - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2016/11/empress.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Drama   Romance   Shoujo   ",
	"tags": "Ancient China   Beautiful Female Lead   Bickering Couple   Dense Protagonist   Female Protagonist   Handsome Male Lead   Imperial Harem   Jealousy   Love Interest Falls in Love First   Misunderstandings   Modern Knowledge   Politics   Pregnancy   Royalty   R*pe   Transmigration   ",
	"rating": "(3.7 / 5.0, 292 votes)",
	"author": "Shui Yun Xing   水云行   ",
	"year": "\n2016",
	"ranking": "#5262   #6209   #706   #2308   #1145   ",
	"reviewcount": "49 Reviews sorted by",
	"description": "She was stupidly in love with him. Because of him, she became rude and unreasonable, overbearing, jealous, insane. But he did not spare a glance to her. Married for two years, he didn’t favor her once, letting her become the laughing stock of the whole world. Eventually, she ended up in an affair, leading to her tragic death.\n\nWhen her eyes  opened again, it was a different person.\n\nSince it’s an empress, then we absolutely must be virtuous, generous, correct the previous jealousy defect.\n\nThus begins the replacement empress’ harem life.\n\nTaking the initiative to help the emperor look for beauties, sending them to serve in the bedroom, teaching the imperial concubines how to primp themselves to win the emperor’s favor, and even using the phoenix seal as a reward. Whoever can satisfy the emperor on the dragon bed, will have the opportunity to take the phoenix seal and sit on the phoenix seat, to experience the feeling of being the empress. Being this virtuous can really be called impeccable.\n\nShe was this virtuous, the emperor ought to be pleased in every aspect!\n\nHadn’t expected the emperor wouldn’t know good from bad. Not only reprimanded her, but also contradicted her everywhere. The beauties she’d sent were actually all driven away.\n\nSince he didn’t like the beauties, apparently there’s a special interest. In that case, send over a group of beautiful men. Can top, can bottom, every option is there.\n\nIn the end, they were also driven away.\n\nThus the empress personally arrived to battle at the emperor’s bedroom-\n\n“Your Majesty, do you have an unmentionable illness down there? If so, rest assured and tell me. I’ll let some people treat it in secret.” Take a look at her virtue, she could move herself to tears.\n\n“Unmentionable illness?” The emperor’s sword-like eyebrows raised, the eyes suddenly looked dangerous. Approaching her slowly, unexpectedly ordered: “Tonight, the empress will serve me.”\n\n“What?” Then, Mo Qiqi with lightning speed jabbed the hornet’s nest.\n\n“Ah!” A miserable scream.\n\nMo Qiqi worriedly looked at the emperor to inquire: “Your Majesty. Are you alright!”\n\nThe emperor spoke with a pained expression: “Call the court physician!”\n\n“You did have an unmentionable illness!”>"
}