{
	"url": "https://www.novelupdates.com/series/shuumatsu-nani-shitemasu-ka-isogashii-desu-ka-sukutte-moratte-ii-desu-ka/",
	"title": "Shuumatsu Nani Shitemasu ka? Isogashii desu ka? Sukutte Moratte Ii desu ka? - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/11/sukasuka_v1a.jpg",
	"noveltype": "(JP)",
	"genre": "Drama   Fantasy   Mystery   Psychological   Romance   Sci-fi   Seinen   Tragedy   ",
	"tags": "Adapted to Anime   Adapted to Manga   Beastkin   Beasts   Beautiful Female Lead   Caring Protagonist   Cryostasis   Death of Loved Ones   Determined Protagonist   Fairies   Fantasy World   Gods   Hard-Working Protagonist   Human-Nonhuman Relationship   Late Romance   Male Protagonist   Orphans   Past Plays a Big Role   Post-apocalyptic   Sword And Magic   ",
	"rating": "(4.7 / 5.0, 319 votes)",
	"author": "Kareno Akira   枯野瑛   ",
	"year": "\n2014",
	"ranking": "#5262   #6293   #1526   #11743   #702   ",
	"reviewcount": "23 Reviews sorted by",
	"description": "Five hundred years have passed since the humans went extinct at the hands of the fearsome and mysterious 'Beasts'. The surviving races now make their homes up on floating islands in the sky, out of reach of all but the most mobile of Beasts.\r\n\r\nOnly a small group of young girls, the Leprechauns, can wield the ancient weapons needed to fend off invasions from these creatures. Into the girls’ unstable and fleeting lives, where a call to certain death could come at any moment, enters an unlikely character: a young man who lost everything in his final battle five hundred years ago, the last living human awakened from a long, icy slumber.\r\n\r\nUnable to fight any longer, Willem becomes the father that the girls never had, caring for and nurturing them even as he struggles to come to terms with his new life, in which he feels the pain of helplessly waiting for his loved ones to return home from battle that his 'Daughter' once felt for him so long ago. Together, Willem and the girls gradually come to understand what family means and what is truly worth protecting.>"
}