{
	"url": "https://www.novelupdates.com/series/the-top-couple-is-a-bit-sweet/",
	"title": "The Top Couple Is a Bit Sweet - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/07/The-Top-Couple-Is-a-Bit-Sweet.jpg",
	"noveltype": "(CN)",
	"genre": "Josei   Romance   ",
	"tags": "Beautiful Female Lead   Broken Engagement   Celebrities   Female Protagonist   First Love   Handsome Male Lead   Love Interest Falls in Love First   Marriage of Convenience   Modern Day   Power Couple   Proactive Protagonist   Secret Crush   Showbiz   ",
	"rating": "(3.8 / 5.0, 12 votes)",
	"author": "图样先森   ",
	"year": "\n2021",
	"ranking": "#2000   #2000   #11194   #7364   #11324   ",
	"reviewcount": "2 Reviews sorted by",
	"description": "A certain hot topic: 「Why do Wen Li and Song Yan have so many CP fans?」\n\nThe original poster wrote: It’s obvious that they’ve been married for two years, but they do not have any movie or TV collaborations, or variety show shots in the same frame, and I have never seen them interact on social media. The entertainment industry accepts them as a couple with a contract marriage where they are even too lazy to act like they are in love. I am extremely puzzled by why they have so many CP fans. I swear I am not black. \n\nThe popular reply: 「CP fan here letting myself in. To clarify for the original poster: They really don’t interact much, and their sugar is observed under a microscope. But—\n\n1. In terms of appearance, they are a pair with god-like faces. When our Three Powers was a young newcomer, someone had a YY of what they would look like in the same frame. Afterwards, the picture exploded in the industry. Black Swan x White Moonlight. A huge number of similar personas in the entertainment industry emerged rapidly as food substitutes.\n\n2. In terms of fame ranking, they are both first-tier. They are strong in every sense, okay?\n\n3. There are so many fairy madams in the inner circle. They write fanfiction, draw fanart, and edit videos and photos; they eat grain and eat until they burst. They are reluctant to leave the pit when they think about getting out. \n\nTo summarize: No matter how much of a plastic couple people say they are, we will still ship this CP as long as they never announce a divorce!」>"
}