{
	"url": "https://www.novelupdates.com/series/sons-too-mensao/",
	"title": "Sons, Too Mensao - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2018/05/Image.png",
	"noveltype": "(CN)",
	"genre": "Comedy   Drama   Fantasy   Harem   Josei   Martial Arts   Romance   Slice of Life   ",
	"tags": "Adopted Children   Appearance Different from Actual Age   Beautiful Female Lead   Bloodlines   Calm Protagonist   Childish Protagonist   Crime   Criminals   Cute Protagonist   Demons   Dense Protagonist   Doting Love Interests   Female Protagonist   Gangs   Handsome Male Lead   Hiding True Identity   Immortals   Jealousy   Love Interest Falls in Love First   Male Yandere   Modern Day   Mysterious Past   Non-humanoid Protagonist   Organized Crime   Police   Politics   Polyandry   Possessive Characters   Protagonist Strong from the Start   Reverse Harem   Secret Organizations   Strong Love Interests   Vampires   Wealthy Characters   Younger Love Interests   ",
	"rating": "(4.5 / 5.0, 89 votes)",
	"author": "冷優然   ",
	"year": "\n2012-07-04",
	"ranking": "#2000   #2000   #4872   #7040   #3896   ",
	"reviewcount": "4 Reviews sorted by",
	"description": "There is a family, under the Qi surname, living in the city. It is a strange but cosy family. \n\nA family of four composed of a mother and three sons. The most bewildering of all, the mother has a very beautiful appearance. She is thirty year old, yet still as delicate as a twenty-one. \n\nAs for her three sons, respectively twenty-five, twenty-three, and eighteen year old, they are all handsome and elegant, yet the three of them are still single……\n\n“She’s a princess of the demon realm who unexpectedly reborn. As a mommy with three babies, they are 25, 23, and 18 years old, all of which are not small! Are you really our mommy? \n\n'The head of the household is me, of course I am your mommy!'\n\nIt turns out that mommy is actually a vampire! Another vampire is her big brother! Snow wolf tribe? Demon realm? It doesn’t matter anyway! As long as we can live a happy life!”>"
}