{
	"url": "https://www.novelupdates.com/series/the-treacherous-concubines-guide-to-whitewashing/",
	"title": "The Treacherous Concubine’s Guide To Whitewashing - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/09/TTCGTW.jpg",
	"noveltype": "(CN)",
	"genre": "Drama   Fantasy   Historical   Josei   Romance   ",
	"tags": "Ancient China   Black Belly   Clever Protagonist   Cunning Protagonist   Devoted Love Interests   Enemies Become Lovers   Female Protagonist   Handsome Male Lead   Hated Protagonist   Hiding True Identity   Imperial Harem   Kidnappings   Long Separations   Love Interest Falls in Love First   Manipulative Characters   Marriage   Mature Protagonist   Modern Knowledge   Power Couple   Reverse Harem   Schemes And Conspiracies   Transmigration   ",
	"rating": "(3.7 / 5.0, 42 votes)",
	"author": "邹涅   ",
	"year": "\n2020",
	"ranking": "#2000   #2000   #6475   #4640   #6615   ",
	"reviewcount": "8 Reviews sorted by",
	"description": "There was once a treacherous concubine. She controlled the government, persecuted the honest and faithful, and created chaos in the harem. Inciting anger from the people.\n\nOf course, in the end, the protagonist was cleanly dealt with and the people rejoiced.\n\nYuan Luo, who was supposed to be dead, wasn’t. Instead, she became the treacherous concubine who was comparable to Su Daji.\n\nThe first thought when she woke up was to whitewash her name. But…\n\nLackey 1: Niang niang, the family of imperial censor Zhu who impeached you has been slaughtered by us. Even his cats, dogs, chickens, and ducks have not been spared…\n\nLackey 2: Niang niang, the little bit*h assigned by Dong Hai Wang to seduce the emperor has been disfigured. But Dong Hai Wang is not easy to deal with. We are ready to poison him at your command.\n\nLackey 3: Niang niang, the enemy received the military plans we leaked out. As expected, General Gu was defeated on the front line. That old man can no longer go against you. His whole family is dead.\n\nYuan Luo: …\n\nShe walked out of her chamber and looked at the young general who was kneeling in the snow and begging for his family to be spared. She felt the eyes that fell on her grow colder and darker than the wind and snow.\n\nYuan Luo just wants to throw away the imperial jade seal! Son of a b*tch, how do you whitewash this? This road is completely blackened!>"
}