{
	"url": "https://www.novelupdates.com/series/the-villain-big-boss-just-wants-to-spoil-me/",
	"title": "The Villain Big Boss Just Wants to Spoil Me - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/01/The-Villain-Big-Boss-Just-Wants-to-Spoil-Me.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Romance   School Life   Slice of Life   ",
	"tags": "Age Progression   Beautiful Female Lead   Bullying   Child Abuse   Child Protagonist   Childhood Friends   Childhood Love   College/University   Cute Children   Cute Protagonist   Cute Story   Dense Protagonist   Devoted Love Interests   Doting Love Interests   Doting Parents   Familial Love   Female Protagonist   First Love   Friendship   Handsome Male Lead   Hard-Working Protagonist   Heartwarming   Love Interest Falls in Love First   Misunderstandings   Mob Protagonist   Modern Day   Multiple POV   Naive Protagonist   Popular Love Interests   Power Couple   Short Story   Stoic Characters   System Administrator   Time Skip   Transmigration   Transported to Another World   Tsundere   Wealthy Characters   ",
	"rating": "(4.0 / 5.0, 51 votes)",
	"author": "Ling Younian   凌又年   ",
	"year": "\n2020",
	"ranking": "#5262   #6142   #4864   #6965   #3707   ",
	"reviewcount": "13 Reviews sorted by",
	"description": "Yan Xiao, who transmigrated into a baby, only knew that she was the cannon fodder in a book when she was three years old.\n\nThe system told her that as long as she worked hard to brush up the villain big brother’s unfavorability, she could return to her original world once the value reached its peak.\n\nNaturally, Yan Xiao was longing of going back to her world… So she snatched the milk of the villainous big brother who was six years old, snatched his toy car, snatched his Transformers … she stomped her short and chubby legs and snatched and snatched again, using all her strength to brush up the unfavorability value.\n\nShe worked very hard for many years, yet, unbeknowst to her, the bad feeling value didn’t rise, but the good feeling value skyrocketed straight to the clouds. Facing the good feeling value that was about to explode, Yan Xiao looked at the villainous big brother with two lines of tears streaming down her cheeks and aggrievedly cryed out: “You, you, don’t spoil me anymore!”\n\n**\n\nQiu Li knew that he was an illegitimate child since he was a child. He was unwelcome whenever he went. No child liked him, and no one was willing to play with him. At first, he had some hopes and expectations, and even took the initiative many times. But in the end, all he got was cold looks and painful fists. Later, he didn’t look forward to other people’s affection anymore, and simply started eating alone, going to kindergarten, doing homework, and playing by himself.\n\nOne day, a cute little doll with a pigtail ran over to help him throw away the milk he didn’t like, and helped him throw away all the toys he didn’t like, and even invited him to play on the slide. He was very happy and secretly vowed that, in the future, he would always be nice to her and hold her in the palm of his hand!\n\nUntil one day, the little loli whom had grown into a beautiful young girl cried pitifully in front of him and miserably told him to stop being kind to her. At that moment, he could hardly control the irritability and frustration in his chest, but still carefully and gently wiped away her tears while softly coaxing her: “Don’t cry, I’ll buy you strawberry-flavored cotton candy.”\n\nThe girl cried so much she choked and blankly nodded in a daze. He took her soft hand in his own and his lowered eyelids covered the craziness in his eyes -you are my life, and I can promise you anything, except for wronging to you.>"
}