{
	"url": "https://www.novelupdates.com/series/so-what-if-youve-been-reborn/",
	"title": "So What If You’ve Been Reborn? - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2018/04/d8a245b4gw1eivs296v4cj205k07sgm1.jpg",
	"noveltype": "(CN)",
	"genre": "Adventure   Mystery   Romance   Xianxia   Yaoi   ",
	"tags": "Age Progression   Amnesia   Ancient Times   Betrayal   Calm Protagonist   Caring Protagonist   Childcare   Clever Protagonist   Cold Love Interests   Comedic Undertone   Confident Protagonist   Cruel Characters   Cultivation   Devoted Love Interests   Disabilities   Doting Love Interests   Genius Protagonist   Guardian Relationship   Handsome Male Lead   Hated Protagonist   Heartwarming   Heavenly Tribulation   Honest Protagonist   Magic   Multiple Reincarnated Individuals   Older Love Interests   Past Plays a Big Role   Power Couple   Senpai-Kouhai Relationship   Slow Romance   Smart Couple   Strong Love Interests   Time Skip   Tragic Past   Weak to Strong   Wealthy Characters   ",
	"rating": "(4.3 / 5.0, 141 votes)",
	"author": "Tian Tang Fang Zhu Zhe   天堂放逐者   ",
	"year": "\n2014",
	"ranking": "#5262   #6264   #2885   #3564   #1059   ",
	"reviewcount": "11 Reviews sorted by",
	"description": "The main protagonist Chen He often meets crazy people in his life, and all these people have very deep prejudices against him. They often do weird things.\r\n\r\n(1)\r\n\r\nOnce, Chen He polished off a bunch of hired killers (who seemed to be after him?), and eventually found the mastermind.\r\n\r\nChen He: You and I are complete strangers, so why are you doing this to me?\r\n\r\nMastermind: You’re gonna kill me after ten years! Of course I’ve got to make a preemptive strike.\r\n\r\nChen He: …\r\n\r\n(2)\r\n\r\nChen He: Sir, we have had no bad blood between us, and I have not done anything to offend you. Why are you being so threatening?\r\n\r\nTaoist priest: Hmph! In the future, you’ll be offending me to no end. Haven’t you been looking down on me all your life?\r\n\r\nChen He: …but I still have my entire life ahead of me!\r\n\r\n(3)\r\n\r\nAntagonist A: Chen He! Because of your master, I was rejected by XX Sect, and so I was forced to become a demonic cultivator!\r\n\r\nChen He: Who…who are you?\r\n\r\nAntagonist B: My future lover’s meridians and good looks were ruined by you, and I’m definitely not gonna let you do it this time!\r\n\r\nChen He could not help but think: There is definitely something wrong with my life!>"
}