{
	"url": "https://www.novelupdates.com/series/cuckold-wizards-adventure/",
	"title": "Cuckold Wizard’s Adventure - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/06/Cuckold-Wizards-Adventure.jpeg",
	"noveltype": "(JP)",
	"genre": "Adult   Adventure   Ecchi   Fantasy   Harem   Martial Arts   Mature   Romance   Seinen   ",
	"tags": "Adultery   Adventurers   Affair   Aristocracy   Beastkin   Blacksmith   Brainwashing   C*nnilingus   Cohabitation   Confident Protagonist   Demi-Humans   Dreams   Dwarfs   Elemental Magic   Elves   First-time Interc**rse   F*llatio   God-human Relationship   Goddesses   Hidden Abilities   Hiding True Identity   H*ndjob   Human-Nonhuman Relationship   Hypnotism   Loli   Love Rivals   Magic   Maids   Male Protagonist   M*sturbation   Mind Break   Mind Control   Multiple POV   Multiple Reincarnated Individuals   Mysterious Past   Netori   Nobles   Or*y   Outdoor Interc**rse   Paizuri   Perverted Protagonist   Polygamy   Possession   Pregnancy   Priestesses   Prostit**es   Protagonist Strong from the Start   R-18   Royalty   R*pe   Ruthless Protagonist   Secret Identity   Secret Relationship   Secretive Protagonist   Secrets   S*x Friends   Spirit Users   Spirits   Strong to Stronger   Succubus   Sword And Magic   Tentacles   Threesome   Wizards   ",
	"rating": "(3.9 / 5.0, 276 votes)",
	"author": "Majikari   まじかり   ",
	"year": "\n2020",
	"ranking": "#221   #248   #557   #329   #1324   ",
	"reviewcount": "23 Reviews",
	"description": "A new member joins the adventuring team of a boy swordsman, a female priest, and a female ranger. The new member is a male wizard.\n\nAs they go on adventures, their bond deepens and they become the best team ever.\n\nBut Alvin, the boy swordsman, doesn’t know.\n\nWhat Alvin doesn’t know is that behind the scenes, the wizard Shinji, his beloved priestess Milis, and his best friend Renka, a female ranger, are having a physical relationship.\n\nThe two of them have fallen into pleasure.\n\nOnly Alvin doesn`t know.\n\nThis is a netori story.\n\nThere are scenes other than cuckolding.>"
}