{
	"url": "https://www.novelupdates.com/series/this-damned-thirst-for-survival/",
	"title": "This Damned Thirst for Survival - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/04/This-Damned-Thirst-for-Survival.jpg",
	"noveltype": "(CN)",
	"genre": "Drama   Horror   Mystery   Romance   Supernatural   Yaoi   ",
	"tags": "Black Belly   Calm Protagonist   Clever Protagonist   Confident Protagonist   Cruel Characters   Cunning Protagonist   Daoism   Death   Death of Loved Ones   Drugs   Enemies Become Lovers   Exorcism   Feng Shui   First-time Interc**rse   Friendship   Ghosts   Gods   Gore   Handsome Male Lead   Human-Nonhuman Relationship   Lack of Common Sense   Love Interest Falls in Love First   Male Yandere   Manly Gay Couple   Modern Day   Multiple POV   Mysterious Past   Near-Death Experience   Obsessive Love   Possessive Characters   Psychopaths   Puppeteers   Ruthless Protagonist   Schemes And Conspiracies   Shameless Protagonist   Stalkers   Strong Love Interests   Strong to Stronger   Thriller   Transmigration   Trickster   Unique Weapon User   Unlucky Protagonist   Yandere   ",
	"rating": "(4.5 / 5.0, 223 votes)",
	"author": "Wàng Sānshān   望三山   ",
	"year": "\n2021",
	"ranking": "#931   #2740   #1932   #1336   #1523   ",
	"reviewcount": "61 Reviews sorted by",
	"description": "《Devil》 tells the story of Chi You, the protagonist shou, who was killed by someone and cultivated for revenge with the help of Feng Li, the protagonist gong. When Jiang Luo woke up, he transmigrated into the body of the cannon fodder that killed the protagonist shou.\n\nWhat’s even worse, he transmigrated at the time when the protagonist shou was already killed by the original body.\n\nAt the funeral, Jiang Luo was pushed in front of the coffin.\n\nThe deceased body of the protagonist shou in front of him was serene, with a smile at the corner of his lips. However, Jiang Luo knew that he had turned into a malicious spirit and was eyeing covetously at him.\n\nThe more dangerous it was, the calmer Jiang Luo became. When his desire for survival reached the critical point, he knelt on the ground with a puff, and forced himself to cry.\n\nWith his sincere emotion, he said: “Chi You, I love you so much. Please don’t leave me…”\n\nThe chilliness around him smothered slightly.>"
}