{
	"url": "https://www.novelupdates.com/series/cant-come-back/",
	"title": "Can’t Come Back - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/12/Cant-Come-Back.jpg",
	"noveltype": "(KR)",
	"genre": "Adult   Mature   Romance   Smut   ",
	"tags": "Adultery   Affair   Aristocracy   Beautiful Female Lead   Complex Family Relationships   Empires   European Ambience   Female Protagonist   Forgetful Protagonist   Handsome Male Lead   Love at First Sight   Love Interest Falls in Love First   Love Rivals   Lovers Reunited   Nobles   R-18   Unrequited Love   ",
	"rating": "(3.4 / 5.0, 29 votes)",
	"author": "윤린해   ",
	"year": "\n2018",
	"ranking": "#4617   #6290   #8610   #12437   #6890   ",
	"reviewcount": "2 Reviews",
	"description": "Duke Dean Hildayden’s wife, Berlia, had a crush on her brother-in-law—Cain Hildayden—since before she got married.\n\nUnder one roof, Berlia lives under the same surname as Cain, but as his sister-in-law.\n\nShe has lived her life trying to erase Cain from her mind.\n\nBut one day, Berlia witnessed her husband, Dean, having an affair with another woman.\n\nAfter witnessing her husband’s affair, Berlia felt a sense of disappointment in her marriage.\n\nAt the same time, while her husband is away from the mansion, Cain comes to visit her room……\n\n“……maybe you heard it wrong. It’s late, so……go back, Cain.”\n\nShe told him to go back as if nothing had happened.\n\nIt would be uncomfortable the next time she met him, but she needed to resolve the situation like this.\n\nIf she told him to go back like this, he would have no choice but to do so.\n\nRather than that, no matter how much he heard a moan, was it normal for him to come into his sister-in-law’s room and secretly watch her masturbate?\n\nShe was confused. And then, unbelievable words came out of Cain’s mouth.\n\n“I don’t think I heard it wrong. Weren’t you excited, sister-in-law, no, Berlia?”\n\n“What……”\n\nShe couldn’t deny it. Because everything he said was true. Cain approached Berlia who was unable to answer, and whispered,\n\n“Did you expect someone to stroke you like this?”\n\nCain stroked Berlia’s cheek and spoke with a seductive smile,\n\n“How about this. During the three months without my brother, I will spend the night with you?”>"
}