{
	"url": "https://www.novelupdates.com/series/the-villains-need-to-save-the-world/",
	"title": "The Villains Need to Save the World? - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/05/The-Villains-Need-to-Save-the-World.jpg",
	"noveltype": "(CN)",
	"genre": "Adventure   Ecchi   Fantasy   Gender Bender   Harem   Romance   School Life   Sci-fi   Supernatural   Yuri   ",
	"tags": "Antihero Protagonist   BDSM   Beautiful Female Lead   Blackmail   Cheats   Demon Lord   Dragons   Female Protagonist   God Protagonist   Goddesses   Godly Powers   Gods   Harem-seeking Protagonist   Hiding True Identity   Loli   Loyal Subordinates   Male to Female   Master-Servant Relationship   Mind Break   Multiple Realms   Multiple Reincarnated Individuals   Necromancer   Overpowered Protagonist   Perverted Protagonist   Polygamy   Protagonist Strong from the Start   Reincarnated in Another World   Religions   R*pe   Sadistic Characters   S*x S*aves   S*ave Harem   S*aves   Sword And Magic   Wars   ",
	"rating": "(3.8 / 5.0, 269 votes)",
	"author": "A Gentleman Does Not Speak Whilst He Reads   观书不语真君子   ",
	"year": "\n2016",
	"ranking": "#6970   #3491   #702   #6796   #1317   ",
	"reviewcount": "30 Reviews sorted by",
	"description": "In the legends that were told, ten thousand years ago the twelve demon kings wreaked havoc upon the world, almost completely destroying it. Ten thousand years later, the late arriving Bella discovered that she had been screwed over by her reincarnation, the ranks of the Saviors are already filled and she has to change teams in order to pass the days. Having her gender changed into a beautiful girl… she endured that, not being able to join the righteous side and obtain cheat abilities… she endured, but what she could not endure, was that the world that she had transmigrated to was toxic beyond belief. No one here does their rightful jobs properly, be they heroes, demon kings, or creator gods... in fact, Bella felt as if they all had also started with the wrong faction!>"
}