{
	"url": "https://www.novelupdates.com/series/deep-in-the-act/",
	"title": "Deep in the Act - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/09/Deep-in-the-Act.jpg",
	"noveltype": "(CN)",
	"genre": "Adult   Drama   Mature   Psychological   Romance   Smut   Yaoi   ",
	"tags": "Acting   Adultery   Dark   Doctors   Identity Crisis   Manipulative Characters   Modern Day   Movies   Multiple Protagonists   Obsessive Love   Older Love Interests   Past Trauma   Personality Changes   Power Struggle   R*pe   Showbiz   Straight Seme   ",
	"rating": "(4.4 / 5.0, 158 votes)",
	"author": "Tong Zi   Tongzi   童子   童童童子   ",
	"year": "\nN/A",
	"ranking": "#3567   #2000   #2880   #4538   #2382   ",
	"reviewcount": "34 Reviews sorted by",
	"description": "To save Gao Zhun from the shackles of his invisible illness, Fang Chi overcomes obstacle after obstacle, inching closer and closer to his heart. But…\n\nEverything you have done so far amounts to nothing more than a technique? What about…\n\nYour feelings?\n\n—–\n\nCan the course of human feelings ever be truly understood?\n\nIn an attempt to diversify his career, Zhang Zhun agrees to co-star with award-winning actor, Chen Hsin.\n\nTheir first task, by the director’s orders:\n15 days of cohabitation in a couple’s room.15 days of watching raunchy movies in the same bed, in preparation for the filming of their first scene together.\n\nYet, things begin to go wrong as they get into bed for the camera.\nNo one on the set is safe from the passion of their performance.\nNo one is exempt from the heat of their desire.\n\nEven the director cannot help but fume: Have I ever asked them to take things this far?\n\nBut… isn’t it our job to go deeper into the act?\n\n—–\n\nYou are my secret sunshine.\n\nChen Hsin risks everything in his possession as Zhang Zhun walks down the path of no return.\n\nHow should they define the bond between them?\n\nPerhaps it should not be known as love, for love is too heavy and terrifying a word for them.\n\nAnd yet…\n\nThere will never be another film like this! Your performance and the feelings you conveyed will never be surpassed! This is a masterpiece that belongs only to the two of you!\n\nWhen their eyes meet – before the camera, according to the script – Zhang Zhun feels the tips of his fingers go numb.\n\nWho is he?\nHas he become Gao Zhun? Or is he still Zhang Zhun?\n\nWho is this before him?\nIs it Fang Chi? Or is it Chen Hsin?\n\n—–\n\nWhen the filming comes to an end, the characters will recover, the actors’ passion will fade, and they will forget each other eventually as they return to their individual paths.\n\nIn the end, how should they make sense of it all?\n\nHave they truly been hopelessly and deliriously in love?\nOr have they simply lost themselves too deeply in the act?>"
}