{
	"url": "https://www.novelupdates.com/series/my-whole-family-are-villain/",
	"title": "My Whole Family Are Villain - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/04/20200307155356.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Drama   School Life   Shoujo   ",
	"tags": "Age Progression   Beautiful Female Lead   Charming Protagonist   Childcare   Clever Protagonist   Cute Story   Devoted Love Interests   Doting Love Interests   Doting Older Siblings   Doting Parents   Familial Love   Family   Female Protagonist   Hackers   Handsome Male Lead   Heartwarming   Late Romance   Love Interest Falls in Love First   Mature Protagonist   Modern Day   Older Love Interests   Overpowered Protagonist   Poor to Rich   Precognition   Romantic Subplot   Second Chance   Siblings   Single Parent   Smart Couple   Time Skip   Transmigration   Twins   Wealthy Characters   ",
	"rating": "(4.3 / 5.0, 665 votes)",
	"author": "咸鱼老人   ",
	"year": "\n2020",
	"ranking": "#1508   #2384   #423   #78   #427   ",
	"reviewcount": "206 Reviews sorted by",
	"description": "Fourteen-year-old Su Bei almost died when she caught a high fever, got transmigrated into another world, and finally figured out a shocking truth—it turned out that her original world she was just a novel and her whole family were villains.\n\nThe woman who gave birth to them was the cannon fodder in the novel. She and Su Xiaobao were written like this in the extra chapter: One was a little bastard who tried to bully the male lead’s daughter and eventually got thrown into prison and the other one became an escort who, after having failed to seduce the male lead, was killed by an evil director. They also have a dad whom they never met and was the biggest villain in the book.\n\nBack to her original world, the first thing Su Bei did was to take Su Xiaobao and find their father.\n\nSu Bei: Su Xiaobao, quick, call him.\n\nSu Xiaobao: Call him what?\n\nSu Bei: Call him dad.\n\nSu Xiaobao: I don’t want to, do it yourself.\n\nSu Bei: Dad!\n\nLooking at these two dirty children in front of him, Mr. Qin’s eyes showed disgust.>"
}