{
	"url": "https://www.novelupdates.com/series/hold-on-youre-something-else/",
	"title": "Hold On, You’re Something Else - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/05/Hold-On-Youre-Something-Else.jpg",
	"noveltype": "(CN)",
	"genre": "Drama   Mature   Mystery   Psychological   Romance   Yaoi   ",
	"tags": "Abusive Characters   Acting   Adapted to Manhua   Alternate World   Amnesia   Black Belly   Businessmen   Calm Protagonist   Caring Protagonist   Clingy Lover   Corruption   Cute Protagonist   Doting Older Siblings   Familial Love   Family   Family Business   First Love   Flashbacks   Handsome Male Lead   Inferiority Complex   Kidnappings   Love Interest Falls in Love First   Male Yandere   Mind Break   Mind Control   Modern Day   Multiple Personalities   Multiple POV   Obsessive Love   Omegaverse   Overprotective Siblings   Phobias   Poisons   Popular Love Interests   Possessive Characters   Power Couple   Previous Life Talent   Second Chance   Secret Crush   Secret Relationship   Seme Protagonist   Showbiz   Siblings Not Related by Blood   Stalkers   Straight Seme   Tragic Past   Transmigration   Transplanted Memories   Wealthy Characters   ",
	"rating": "(4.4 / 5.0, 155 votes)",
	"author": "童柯   ",
	"year": "\n2020",
	"ranking": "#413   #1328   #2479   #1739   #2102   ",
	"reviewcount": "33 Reviews sorted by",
	"description": "Rong Jing is an easy-going person. After transmigrating into a book, he tries his best to avoid the inevitable ending of a cannon fodder. Instead of provoking the book’s protagonist, he quietly stays as an Alpha though he is actually a heavenly dish within the circle.\n\nThe protagonist in the book is a heartthrob omega. He is born into a poor family but is constantly striving to improve himself. He’s talented and all, like he basically has a cheat in life. His career is very important to him.\n\nLots of big shots are attracted to him and want to bow down to him because of his bewitching pheromones. The more they like him… the crazier and more perverted they become.\n\nRong Jing didn’t finish reading the book so he wasn’t aware that this book is a wicked revenge story and that the protagonist suffered because of his beauty.\n\nThen one day, he got drunk on those very same fascinating pheromones all night.\n\nThe next day, as he watched the crying, red-eyed protagonist, he proposed to work hard to learn how to be a good financial backer for him for one year.\n\nA year later, when he decided to break up with him for good, the protagonist slapped him with their agreement. Even his fans scolded him fiercely saying that he should take responsibility.\n\nHold on!\n\nSo was he only acting innocent?!>"
}