{
	"url": "https://www.novelupdates.com/series/the-enchantress-of-medicine-with-the-heaven-defying-child-and-the-black-belly-father/",
	"title": "The Enchantress of Medicine, with the Heaven Defying Child, and the Black Belly Father - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2018/04/5a4f839fc7e7d.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Comedy   Mature   Romance   Xuanhuan   ",
	"tags": "Absent Parents   Alchemy   Ancient Times   Arrogant Characters   Beast Companions   Beautiful Female Lead   Betrayal   Black Belly   Broken Engagement   Calm Protagonist   Childcare   Cold Love Interests   Cold Protagonist   Cultivation   Cunning Protagonist   Cute Children   Devoted Love Interests   Doting Love Interests   Family   Famous Protagonist   Fast Learner   Fated Lovers   Female Protagonist   Genius Protagonist   Handsome Male Lead   Hard-Working Protagonist   Love Interest Falls in Love First   Lucky Protagonist   Magical Space   Misunderstandings   Multiple Realms   Music   Mysterious Family Background   Persistent Love Interests   Pets   Pill Concocting   Possessive Characters   Power Couple   Pregnancy   Prophecies   Reincarnation   Revenge   Ruthless Protagonist   Second Chance   Shameless Protagonist   Smart Couple   Strength-based Social Hierarchy   Strong Love Interests   Unique Cultivation Technique   Weak to Strong   Wealthy Characters   ",
	"rating": "(4.1 / 5.0, 156 votes)",
	"author": "Remembrance Zi   Xiang Si Zi   相思梓   ",
	"year": "\n2017",
	"ranking": "#2000   #2000   #359   #5687   #1015   ",
	"reviewcount": "22 Reviews sorted by",
	"description": "In her past life, Jun MuYan had a hard life and died miserably. Her unborn child was ripped from her to be refined as an elixir, and even her own flesh was used as someone else’s stepping stone.\r\n\r\nIn this arduous life, she has an outwardly cold, adorable Bao (treasure/baby) beside her. \r\n\r\n“Xiao Bao, that woman who wants to form a contract with the sacred beast is Mommy’s enemy.”\r\n\r\nThus, the top sacred beast becomes Xiao Bao’s pet. \r\n\r\n“Xiao Bao, this God Musician’s inheritance is too powerful!”\r\n\r\nTiny hands move, and the place of inheritance opens. Jun MuYan becomes the only successor of the God Musician.\r\n\r\n“Xiao Bao, this man is always pestering Mommy and doesn’t let go!”\r\n\r\nXiao Bao immediately strikes to drive said man away… hey, you can’t be driven away!?\r\n\r\nYou’re my father? What father? Can you even eat that?>"
}