{
	"url": "https://www.novelupdates.com/series/transmigrated-into-the-violent-boss-little-mermaid/",
	"title": "Transmigrated Into the Violent Boss’ Little Mermaid - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/06/Transmigrated-Into-the-Violent-Boss-Little-Mermaid.jpg",
	"noveltype": "(CN)",
	"genre": "Fantasy   Romance   Sci-fi   Slice of Life   Yaoi   ",
	"tags": "Amnesia   Animal Characteristics   Animal Rearing   Caring Protagonist   Clingy Lover   Cooking   Cosmic Wars   Cute Protagonist   Devoted Love Interests   Doting Love Interests   Empires   Futuristic Setting   Handsome Male Lead   Heartwarming   Hidden Abilities   Hiding True Abilities   Hiding True Identity   Human Experimentation   Human-Nonhuman Relationship   Humanoid Protagonist   Lazy Protagonist   Magical Space   Marriage   Military   Politics   Power Couple   Protagonist Strong from the Start   Schemes And Conspiracies   Sickly Characters   Smart Couple   Thieves   Transformation Ability   Transmigration   Transported to Another World   Unconditional Love   Wars   Wealthy Characters   ",
	"rating": "(4.4 / 5.0, 186 votes)",
	"author": "弦三千   ",
	"year": "\n2021",
	"ranking": "#1575   #840   #1354   #1094   #1205   ",
	"reviewcount": "24 Reviews sorted by",
	"description": "Jun Qingyu pursues a novel with a protagonist that strives on his own, from an ordinary person to a high position as a marshal. He suffered from an accident on the battlefield that only a mermaid can heal, but because the injury caused the protagonist to have a violent temperament, the mermaids refused to treat him.\r\n\r\nThe protagonist’s family seized the opportunity to steal his token to start an interstellar war. The close friend of the protagonist kicked him when he was down. For a period of time, the protagonist became a target of public criticism. He was simply a model example of an unfortunate person with good looks and strong capability.\r\n\r\nInitially, the protagonist should have risen at this time and started a series of face-slapping in line but the author ran off in the end, leaving the novel incomplete and directly sentenced the protagonist to death.\r\n\r\nJun Qingyu got so hung up over it that he dreamt of the protagonist of this book and after he woke up, he became a mermaid in that novel.\r\n\r\nFu Yuanchuan didn’t know how many times he had stood by the mermaid pond. The little newborn mermaids in the pond were no more than the size of his palm.\r\n\r\nThe mermaids rejected coming into contact with him very much. He looked at the pod of mermaids, who were originally close to the shore, quickly fleeing without any accident when he approached.\r\n\r\nThe sound of taunts and jeers fell incessantly in his ear.\r\n\r\n‘How can someone like him still dare to buy a mermaid?’\r\n‘If I were him, I would stay at home and wait for death instead of running around and scaring people.’\r\n\r\nFu Yuanchuan looked indifferent but when he was going to leave, he heard an exclamation.\r\n\r\n‘What’s going on with that mermaid?’\r\n\r\nFu Yuanchuan looked down and saw a golden-tailed little mermaid struggling against the pod of mermaids to swim towards him. The little mermaid stopped when he was close to the shore. He raised his head and his golden eyes were full of his shadow.\r\n\r\nAfter a moment of silence, he crouched by the side of the mermaid pond and tried to dip his hand into the water……\r\n\r\nThe little mermaid did not flee.\r\nThe little mermaid hugged his hand.\r\nThe little mermaid kissed his finger.\r\n\r\nIt was as if a beam of light had shone into the gloomy world, leading him back to the world.>"
}