{
	"url": "https://www.novelupdates.com/series/reborn-as-the-villain-presidents-lover/",
	"title": "Reborn As The Villain President’s Lover - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/03/e06915a7ly1g1pgrwj0lpj20jg0r8n6f.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Drama   Romance   Yaoi   ",
	"tags": "Acting   Adapted to Drama CD   Bickering Couple   Couple Growth   Cute Story   Doting Love Interests   First Love   First-time Interc**rse   Handsome Male Lead   Heartwarming   Love Interest Falls in Love First   Modern Day   Pragmatic Protagonist   Protagonist Falls in Love First   Showbiz   Slow Romance   Strong Love Interests   Transmigration   Wealthy Characters   ",
	"rating": "(4.1 / 5.0, 271 votes)",
	"author": "Lin Ang Si   林盎司   ",
	"year": "\n2019",
	"ranking": "#272   #1579   #870   #3706   #518   ",
	"reviewcount": "75 Reviews sorted by",
	"description": "Ji Qingzhou crossed into a book of dogblood scum and abuse. There were two choices in front of him.\n\nA: Choose the genuine slag Gong in the original book, and start a sadistic and abusive romance with Fang Yaoxuan filled with domestic abuse, a dead mom, and leaving the entertainment circle.\n\nB: Choose the cannon fodder Villain, Chu Cheng, and be free of the slag Gong forever.\n\nJi Qingzhou wordlessly chose B without a second thought.\n\nChu Cheng was of distinguished birth and became the head of a popular company at a comparatively young age. He had seen many beauties in the entertainment circle but just happened to be fond of Ji Qingzhou.\n\nA friend asked him, “Do you like this little star?”\n\nChu Cheng shook his head. “No, just playing with him.”\n\nOutside the door, Ji Qingzhou nodded. Yes, that was what the book said.\n\nA few months later, Ji Qingzhou was walking away while answering the phone, when he overheard someone saying, “Ji Qingzhou? Oh, Chu Cheng is just playing with him. Once he’s played enough, they’ll split.”\n\nJi Qingzhou was just about to nod, but then he heard Chu Cheng’s furious reply: “Nonsense! Which bastard told you that! Doesn’t he know that those who disturb a marriage will be kicked by a horse!”\n\nJi Qingzhou: ??? Wait, no, this is not what the book said!>"
}