{
	"url": "https://www.novelupdates.com/series/white-lotus-overturned-daily/",
	"title": "White Lotus Overturned Daily - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/11/White-Lotus-Overturned-Daily-.jpg",
	"noveltype": "(CN)",
	"genre": "Drama   Fantasy   Historical   Josei   Romance   Slice of Life   ",
	"tags": "Ancient China   Beautiful Female Lead   Comedic Undertone   Female Protagonist   Handsome Male Lead   Late Romance   Love Interest Falls in Love First   Multiple Reincarnated Individuals   Older Love Interests   Politics   Power Couple   Power Struggle   Protagonist Strong from the Start   Reincarnation   Revenge   Romantic Subplot   Royalty   Second Chance   Secret Identity   Siblings   Sibling's Care   Smart Couple   Strong Love Interests   Tragic Past   Unconditional Love   Underestimated Protagonist   Villainess Noble Girls   Wealthy Characters   Younger Sisters   ",
	"rating": "(3.7 / 5.0, 82 votes)",
	"author": "SoulFire   魂火   ",
	"year": "\n2020",
	"ranking": "#2686   #3311   #3014   #1738   #3603   ",
	"reviewcount": "24 Reviews sorted by",
	"description": "Su Mo Li is reborn and seven years later is taken back to the Prime Minister’s residence and betrothed to the second prince as a side consort.\r\n\r\nHowever, the second prince didn’t like the delicate little white lotus and only loved the flashy red peony.\r\n\r\nAs a result, Su Mo Li is divorced from the marriage.\r\nOutsiders mocked and relatives insulted.\r\n\r\nOne day at the banquet, the delicate white lotus, with red eyes dripping with tears, threw herself into the arms of the Crown Prince.\r\n\r\nThe crowd sucked in a breath, who did not know that the Crown Prince hates crying women!\r\n\r\nAnd it was the abandoned woman of his rival, the Second Prince!\r\n\r\nThe Crown Prince, who was not close to women, felt the softness in his arms, and his face suddenly became as cold as ice.\r\n\r\nThe crowd trembled: the Crown Prince was going to be angry!\r\n\r\nAll of the ladies are gloating: Su Mo Li is finished!\r\n\r\nBut then the Prince asked in a low voice, “Who bullied you? Do you want to tear him apart or kill his whole family? It’s all up to you ……”>"
}