{
	"url": "https://www.novelupdates.com/series/theory-of-paradise/",
	"title": "Theory of Paradise - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/08/Theory-of-Paradise.jpg",
	"noveltype": "(KR)",
	"genre": "Action   Adventure   Fantasy   Romance   School Life   Sci-fi   Tragedy   ",
	"tags": "Adapted to Manhwa   Anti-social Protagonist   Apocalypse   Artifacts   Beautiful Female Lead   Charismatic Protagonist   Cold Protagonist   Determined Protagonist   Dragons   Dystopia   Famous Protagonist   Fantasy Creatures   Fantasy World   Female Protagonist   Genius Protagonist   Handsome Male Lead   Hard-Working Protagonist   Level System   Loner Protagonist   Love Rivals   Love Triangles   Military   Monsters   Special Abilities   Weak to Strong   ",
	"rating": "(3.7 / 5.0, 7 votes)",
	"author": "Jeong Seon-woo   ",
	"year": "\n2019",
	"ranking": "#2000   #2000   #12933   #12115   #11645   ",
	"reviewcount": "No Reviews",
	"description": "A land covered with snow-white sand, an air with a foul smell of sulfur, and a land where it was difficult to breathe without a purifier. A gloomy future where even tomorrow’s life could not be guaranteed.\n\nFaced with a desperate crisis, humanity sculpts the dragon’s corpse to create eight cities. The chosen move to a new city, and the unchosen are left in the desolate Dead sea.\n\nThe ‘Theory of Paradise’ will be supported by three pillars. The three of them will be attending the school at the same time, dreaming and sharing the same senses, so they will surely acknowledge each other’s presence.\n\n1000 years after the city was built, three youths who were abandoned and destroyed by the world faced an old prophecy.\n\n“Tell me, you will never love me.”\n\n“You said there was a light outside the tunnel, but to me, the light was you.”\n\nEven in the gloomy dystopian era, the three main characters, Eun Woo, Jae Hee, and Yoon Hwan, were constantly in dynamism. They faced their fate head-on and continued to carry out their own beliefs that they firmly believed on. Through this, it showed how important “love” was in choosing the direction of life, how courageous choices were gathered to change the world, and how overwhelming the ‘love-induced revolution’ was.\n\n‘Theory of Paradise’ was the story of three people who had fallen into hell and had lived desperately, trying to change the world for the one they love, and eventually finding light in the dark.>"
}