{
	"url": "https://www.novelupdates.com/series/the-girl-who-was-forced-by-her-stepsister-to-marry-the-cursed-duke/",
	"title": "The Girl Who Was Forced by Her Stepsister to Marry the Cursed Duke - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/02/The-Girl-Who-Was-Forced-by-Her-Stepsister-to-Marry-the-Cursed-Duke.jpg",
	"noveltype": "(JP)",
	"genre": "Comedy   Fantasy   Romance   Shoujo   ",
	"tags": "Abusive Characters   Adapted to Manga   Aristocracy   Complex Family Relationships   Cooking   Curses   Fantasy World   Female Protagonist   Handsome Male Lead   Magic   Multiple POV   Nobles   ",
	"rating": "(4.3 / 5.0, 34 votes)",
	"author": "伊坂　枕   ",
	"year": "\n2021",
	"ranking": "#888   #1350   #4054   #1069   #5093   ",
	"reviewcount": "3 Reviews sorted by",
	"description": "Miltia was treated as a servant and oppressed by her stepmother and her stepsister because there was no blood relation between her and them. She was having trouble getting enough food to survive everyday. Somehow she was able to get by through cooking whatever thing she could find herself. \n\nIn the midst of all this, her stepsister, who was doted on by both her stepfather and her stepmother, along with her fiancé, who was only interested in a woman’s youth and physical appearance, cruelly broke off her engagement in public and forced her to marry the notorious 『Cursed Duke』, the Duke of Lönnrot. \n\nBecause of the curse, the duke had a repulsive, monstrous appearance. He was ostracized by a lot of people and grew distrustful of people… At first, he was hard on Miltia but to Miltia, the duke’s monstrous appearance actually resembled an octopus, an ingredient she had grown used to seeing so she didn’t find the duke’s appearance to be repulsive. Furthermore, she was actually happier living in the ducal house compared to in her previous county house since her daily necessities were provided by the ducal household. \n\nAs the result of her, faithfully serving the 『Cursed Duke』, along with Miltia’s unexpected behaviour, she gradually melted Duke Lönnrot’s cold and hard heart. She was also able to grab a hold of the duke’s stomach through her cooking. \n\nThe duke, whose curse was lifted by the cooking of the woman he loved, was actually a very beautiful young man. \n\nAs soon as her stepsister found out about it, she completely changed her demeanor and insisted.\n\n“I want to swap our fiancé!!”\n\nBut of course, the duke wouldn’t tolerate such selfishness. Eventually, the people who had abused Miltia, reaped what they sowed and fell into their demise. \n\nThis is the story of Miltia, a young girl who was abused, scorned and survived through eating whatever things she could get but she eventually received her happiness and doted on by the cursed duke.>"
}