{
	"url": "https://www.novelupdates.com/series/miss-cannon-fodder-wants-to-escape-death-flags/",
	"title": "Miss Cannon Fodder Wants To Escape Death Flags - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/03/Miss-Cannon-Fodder-Wants-To-Escape-Death-Flags.jpg",
	"noveltype": "(CN)",
	"genre": "Adventure   Comedy   Romance   Shoujo   Xianxia   ",
	"tags": "Beautiful Female Lead   Caring Protagonist   Female Protagonist   Handsome Male Lead   Hard-Working Protagonist   Misunderstandings   Multiple Transported Individuals   Transmigration   Tsundere   ",
	"rating": "(4.4 / 5.0, 38 votes)",
	"author": "纪婴   ",
	"year": "\n2020",
	"ranking": "#2000   #2000   #5860   #8662   #6335   ",
	"reviewcount": "15 Reviews sorted by",
	"description": "After entering a male orientated cultivation novel, Ning Ning originally planned to carefully follow the planned storyline, but only to discover that there was something not quite right about this world.\r\n\r\nWithin the sect, her senior brother relies on everyone around him for his cultivation progress, her senior sister sells information of their sect elders and her peers for money, while her master was so dirt poor that it makes one’s hairs stand on their end, and drinks water gathered from 82 years ago every single day.\r\n\r\nOutside of her sect, those buddist practitioners cultivated arduously, chanting scriptures akin to singing rap, their lips moving so quickly that sparks would fly; those sword practitioners treated their swords like their beloved wives, yet struggling to become courtesans to support their families, with their love stories deeply touching the hearts of many; those music practitioners treat temple bells as weapons, and excels in flinging their bells to strike people down.\r\n\r\nNing Ning : '...'\r\n\r\nThere’s no use saving this world. Just let it get destroyed. Sooner or later, this cultivation world will come to an end.\r\n\r\n*\r\n\r\nNing Ning had crossed over into a cultivation novel world with the identity of an evil junior sister.\r\n\r\nIf she wanted to live, she needed to follow the story line and continue to court death with her actions.\r\n\r\nTarget number 1: The noble and benevolent eldest senior brother\r\n\r\nSenior brother possessed Innate Sword Bones, and unsurpassed cultivation. Ning Ning requested for a late night private meeting, only for the former to smile faintly and nod his head: “Do you want to learn...something that doesn’t suit your age?”\r\n\r\nTherefore, as the night progressed, the eldest senior brother brought out an entire set of extremely difficult secret sword arts, with Ning Ning being forced to train arduously throughout the entire night, leaving her completely exhausted, with her heart being as dead as ashes.\r\n\r\nTarget number 2: The quiet, sick and handsome elder\r\n\r\nThe elder’s cultivation was destroyed during the great war, and retreated into the mountains to recuperate alone.\r\n\r\nTaking advantage of his playing the zither, Ning Ning originally wished to head up and cause trouble. However, after bumping into and inhaling a poisonous fragrance from a flower, she was paralyzed, having to endure excruciating pain, causing waves of tears to stream down her face.  \r\n\r\nSeeing her tearful gaze, the elder merely assumed that he had finally met someone with good music taste and she had started to cry because she had become too happy hearing his zither. He got happy to the point where he almost wanted to pull everyone together to sing the song “Good Luck’s coming”.\r\n\r\nTarget number 3: Arrogant and antisocial junior brother\r\n\r\nAccording to the original storyline, the junior brother, main male character, was born in poverty, had an impure bloodline, was discriminated against within the sect, and got bullied to the point of being completely riddled with wounds.  \r\n\r\nNing Ning knocked away the immortal spring water that he was using to treat his injuries. In the end, the immortal spring water had long been swapped by other people with an extremely corrosive poison, which splashed all over her legs. \r\n\r\nThe youth squatted down, and gently rubbed away the bloodstains on the girl’s calf: “Why did you help me?”\r\n\r\nAs if the story wasn't any weirder enough, it took a weirder turn. \r\n\r\nThe ever so malicious youth buried his head in her neck, his voice racked with sobs, in which it hid an intense servitude and thirst.\r\n\r\n“Don’t leave me behind.”>"
}