{
	"url": "https://www.novelupdates.com/series/did-the-affectionate-love-interest-collapse-today/",
	"title": "Did The Affectionate Love Interest Collapse Today? - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/06/3932D5BC-6B6C-45F9-896E-60324786729E.jpeg",
	"noveltype": "(CN)",
	"genre": "Comedy   Drama   Fantasy   Romance   Sci-fi   Tragedy   Yaoi   ",
	"tags": "Acting   Brother Complex   Charming Protagonist   Cold Love Interests   Cute Protagonist   Death of Loved Ones   Love Interest Falls in Love First   Love Triangles   Male Yandere   Manipulative Characters   Naive Protagonist   Obsessive Love   Popular Love Interests   Possessive Characters   R*pe   Strong Love Interests   Suicides   System Administrator   Virtual Reality   World Hopping   ",
	"rating": "(4.2 / 5.0, 142 votes)",
	"author": "Jimo Yao   即墨遥   ",
	"year": "\n2020",
	"ranking": "#3633   #3146   #1654   #3190   #1402   ",
	"reviewcount": "44 Reviews sorted by",
	"description": "Within almost every melodramatic novel, there’s an affectionate male supporting role who is infatuated with the shou protagonist. To be there when the shou is being attacked by the gong, to offer love when the gong abandons the shou protagonist, fighting for justice when the gong betrays the shou…..\n\nAs a catalyst between the romantic love of the shou and gong, he dedicates his light and heat to his identity as a spare tire without any complaint or regret. \n\nLin Ziran’s task is to play the part of the affectionate male partner in different worlds. However, after he went there, he discovered that the way that each world’s plot opens doesn’t seem to be right at all……\n\nLin Ziran: I love you so much. I’m willing to do whatever it takes, so why won’t you spare another glance at me just one more time? \n\nProtagonist Shou: I realized that I actually love you, let’s be together. \n\nLu Zhen: …… no. \n\nProtagonist Shou: So all your talk about loving me was a lie? \n\nThe blackened protagonist stood in the corner. \n\nLin Ziran: ??? \n\nLin Ziran: He loves you so much and is kind-hearted. How could you be willing to harm him? I’ll fight you! \n\nThe protagonist’s gong: Is that so, you love him that much? \n\nLu Zhen: Yes! \n\nThe protagonist’s gong: What part of him deserves your love? He’s not even a millionth as good as you. \n\nThe protagonist was in the arms of the villain. \n\nLin Ziran: You’re the one who took him? You shameless man, release him now! \n\nVillain: You really care about him? \n\nLin Ziran: Of course, he’s the most important person to me. \n\nVillain: There’s no problem in letting him go, you can just stay and take his place.\n\nLin Ziran who was forcibly taken by the villain: ??? \n\nWhere’s the 10,000-year-old who said that regardless of whether how infatuated he is, he would never be loved and would not regret becoming a spare tire?\n\nLin Ziran: Stop it…… why are you guys fighting over me!>"
}