{
	"url": "https://www.novelupdates.com/series/one-day-my-dad-showed-up/",
	"title": "One Day, My Dad Showed Up - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/07/One-Day-My-Dad-Showed-Up_1626558983.jpg",
	"noveltype": "(KR)",
	"genre": "Comedy   Drama   Fantasy   Romance   Shoujo   ",
	"tags": "Age Progression   Aristocracy   Beautiful Female Lead   Child Protagonist   Doting Parents   Elemental Magic   European Ambience   Familial Love   Female Protagonist   Magic   Mature Protagonist   Nobles   Royalty   Twins   ",
	"rating": "(3.5 / 5.0, 12 votes)",
	"author": "해여늘   ",
	"year": "\n2021",
	"ranking": "#6970   #2000   #11547   #8532   #8215   ",
	"reviewcount": "1 Review sorted by",
	"description": "During the springtime of the year I turned nine years old, a father I didn’t even know existed suddenly showed up.\r\n\r\n“Why are you here, Duke? It was comfortable when we didn’t see each other.”\r\n“You’ve been comfortable all this time, so isn’t it time for you to be uncomfortable, Your Highness?”\r\n\r\nTurns out, my mother was actually the daughter of a tyrant. And my father was the Duke who overthrew that tyrant.\r\n\r\n“O, great and busy Duke of Chelsiers. Did you look for me just to make me feel uncomfortable?”\r\n“Is it so strange for a husband to look for his wife?”\r\n“Do we still have that relationship? Ah, I forgot. Well then, let’s get divorced.”\r\n\r\n…Can anyone tell me what’s going on with these two??\r\n\r\n***\r\n\r\n“I wish I was there to hug you when you were younger.”\r\n\r\nIt was a low whisper filled with a mixture of soft, warm and sad feelings.\r\nI hesitated a little before I confessed.\r\n\r\n“I often made Mom upset before. If I met you earlier, you might’ve hated me.”\r\n\r\nDad burst into laughter at my words. Even though… I meant what I said.\r\nAfter a long laugh, he looked at me with a hint of a sorrowful smile on his lips.\r\n\r\n“If we had met earlier, you would’ve called me Dad more. That’s enough for me.”\r\n>"
}