{
	"url": "https://www.novelupdates.com/series/but-shixiong-doesnt-want-to-be-a-villain/",
	"title": "But Shixiong Doesn’t Want To Be A Villain! - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/08/But-Shixiong-Doesnt-Want-To-Be-A-Villain.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Romance   Xianxia   Yaoi   ",
	"tags": "Amnesia   Ancient Times   Appearance Changes   Artifacts   Beast Companions   Cultivation   Cute Protagonist   Dao Companion   Demonic Cultivation Technique   Demons   Devoted Love Interests   Distrustful Protagonist   Fantasy World   Fated Lovers   Godly Powers   Love Interest Falls in Love First   Misunderstandings   Mysterious Past   Possessive Characters   Secret Identity   Time Paradox   Transmigration   Unreliable Narrator   ",
	"rating": "(4.0 / 5.0, 82 votes)",
	"author": "Bai Lu Ai Chi Yu   White Heron Loves To Eat Fish   白鹭爱吃鱼   ",
	"year": "\n2021",
	"ranking": "#3314   #2552   #4744   #3392   #3532   ",
	"reviewcount": "5 Reviews sorted by",
	"description": "Bai Fanlu transmigrated into an immortal cultivation novel as a villainous demon lord.\n\nIn the original novel, the demon lord was originally in the ranks of the immortal class and had a promising future. Unfortunately, he fell in love with the male lead, became a villain for his sake, and ended up with his soul disintegrated.\n\nBai Fanlu objected to this idiotic plot. The reason for the demon lord to become a villain was not the least justified. He was obviously a decent gentleman! The most important reason, of course, is that the demon lord and him share the same name.\n\nSystem: [Giving you a chance to prove yourself.]\nBai Fanlu: [?]\nSystem: [Persevere and do not become a villain to the end, and you can return home when the male lead is done with saving the world.]\nBai Fanlu: […What if I become a villain?]\nSystem: [Then of course you will end up as cannon fodder.]\n\nBai Fanlu has a plan. In order to not become a villain, he has to adhere to three principles:\n\nDo not have any physical contact with the main lead.\n\nDo not have any grudge entanglement with the main lead.\n\nDo not have any emotional interaction with the main lead.\n\nHowever, nothing went as planned…\n\n1. The first day Bai Fanlu escaped from the mountain, he was carried back to the Sect by the main lead in full view of everyone.\n\nAll the female disciples: “Sect Leader is so considerate to Shixiong.”\n\nBai Fanlu: “…”\n\n2. When Bai Fanlu was about to go out of control with his cultivation, the male lead risked his life to unblock his meridians to keep him from harm.\n\nAll the male disciples: “Sect Leader was willing to sacrifice his life to save another, such a righteous man and deserving of our admiration.”\n\nBai Fanlu: “…”\n\n3. The cliff below was an endless abyss, and according to the original plot, he will be pushed down into the 10,000-feet deep demon pit.\n\nBai Fanlu thought to himself, ‘Am I doomed to become a villain?’\n\nAs he was getting desperate, a figure descended from the sky, throwing out a long, colourful damask to him, snatching him out of the red lotus fire and carrying him up into the sky.\n\nUnder the divine tree, above the sea of clouds and mountains, the young man forcibly trapped him, with a darkness swirling in his eyes he said, “Shixiong…are you trying to leave me? I will not allow it.”\n\nBai Fanlu: “…”\n\nBai Fanlu: “So, who exactly is becoming the villain in the end?”>"
}