{
	"url": "https://www.novelupdates.com/series/married-to-a-disabled-man-in-the-70s/",
	"title": "Married to a Disabled Man in the ’70s - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/06/Hi8J2qzRv5AsTXc.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Fantasy   Romance   Slice of Life   ",
	"tags": "Beautiful Female Lead   Carefree Protagonist   Character Growth   Cooking   Couple Growth   Cute Story   Disabilities   Doting Older Siblings   Doting Parents   Familial Love   Family   Farming   Female Protagonist   Handsome Male Lead   Heartwarming   Marriage   Poor to Rich   Pregnancy   Slow Romance   Smart Couple   System Administrator   Time Travel   Transmigration   ",
	"rating": "(3.9 / 5.0, 182 votes)",
	"author": "Du Bu Tianxia   毒步天下   ",
	"year": "\n2020",
	"ranking": "#479   #786   #1265   #1256   #1484   ",
	"reviewcount": "49 Reviews sorted by",
	"description": "In the book of a certain era, there was a female lead who first took a fancy to the face of the male lead and married him forcefully. But because the male lead’s legs got injured, she wanted to escape from marriage.\r\n\r\nDuring their engagement, she eloped with a young man, which resulted to the blackening value of the male lead.\r\n\r\nWhen Su Jiaojiao transmigrated to this role and faced her husband’s black face, she forcefully changed her words: “Marry, how can I not want to marry!”\r\n\r\nThe next second, a mechanical sound rings in her mind: [The matchmaker system is activated, host Su Jiaojiao is bounded successfully. I wish host and husband a long life together!!]\r\n\r\nSu Jiaojiao: “Huh?!”\r\n\r\nMatchmaker System: [Please make a delicious meal for your husband and get his praise. You can get a bag of wheat flour after finishing.]\r\n\r\nSu Jiaojiao dropped down a bowl of noodles and delivered them to the man in front of her.\r\n\r\nThe man slightly reluctantly said: “It’s delicious.”\r\n\r\nMatchmaker System: [Praise is not sincere enough, please continue!]\r\n\r\nSu Jiaojiao took half of the noodles from the man and says: “Sincerely! Otherwise, you won’t eat the remaining noodles! “\r\n\r\nThe weak, helpless and pitiful man: “It’s really delicious!”\r\n\r\nMatchmaker System: [Task success, reward distribution in progress]\r\n\r\n*****\r\n\r\nSong Qinghan, whose family didn’t love him, had suffered all kinds of hardships in order to survive. One day when he broke his leg, he thought he would fall into the abyss again, but he was pulled up by a ferocious voice: “Say I love you three times, or you won’t eat it!”\r\n\r\nSong Qinghan, with a red face and earnestly said, “I love you, my wife!”\r\n\r\nAfter shouting, he buried his face in his wife’s neck and murmured, “JiaoJiao loves me so much!!” I’m too shy!>"
}