{
	"url": "https://www.novelupdates.com/series/transmigrated-as-a-rich-and-vicious-widow/",
	"title": "Transmigrated as a Rich and Vicious Widow - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/08/Transmigrated-as-a-Rich-and-Vicious-Widow.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Drama   Fantasy   Shounen Ai   Yaoi   ",
	"tags": "Caring Protagonist   Familial Love   Handsome Male Lead   Kidnappings   Love Interest Falls in Love First   Mpreg   Siblings   Transmigration   Transported to Another World   ",
	"rating": "(3.4 / 5.0, 30 votes)",
	"author": "多金少女猫   ",
	"year": "\n2019",
	"ranking": "#720   #580   #5900   #680   #7008   ",
	"reviewcount": "6 Reviews sorted by",
	"description": "Chang Qing transmigrated into a novel of having children with a rich family, and became a vicious widowed man who has been hindering the gong’s HE.\r\n\r\nThis widowed husband attracted bees and butterflies excessively. From brother-in-law to eldest cousin, he hooked up all over the place. He was finally driven out of the house with a broken leg by his brother-in-law, and was reduced to homelessness and death in the street.\r\n\r\nThe point at which Chang Qing transmigrated into happened to be the first time that the original owner, who had not yet become a widow, climbed into the bed of the gong.\r\n\r\nFacing Lu Zheng, whose face had sank and was about to come and beat him up any minute, Chang Qing gathered up his scattered shirt and solemnly said, '… I just went to the wrong room and slept in the wrong bed. Can you believe it?'\r\n\r\nLu Zheng: ... hehe.\r\n\r\nIn order to avoid being kicked out of the house as a beggar by Lu Zheng, Chang Qing decided to be a virtuous husband.\r\n\r\nHowever, this chaste husband is not easy to do. In the book, the original owner took the initiative to hook up with all kinds of bosses and all of them in turn hooked up with him to seduce him to remarry.\r\n\r\nRegarding these big boss's courtship, Chang Qing refused. And the memorial archway above his head sparkled: I love my husband very much.\r\n\r\nIn the end, even the real gong, that is, his brother-in-law Lu Zheng, couldn't help but forcibly demolish his fierce husband memorial arch, and hold him down. He gritted his teeth and threatened, “You're not allowed to remarry. If you dare to remarry, I'll break your legs.”.\r\n\r\nLu Zheng always felt that his eldest sister-in-law was coquettish, always looking at people with a hook in his eyes, and was always provocative, even daring to climb into his bed one day.\r\n\r\nLu Zheng was thinking about how to teach him a lesson. As a result, this man stopped being coquettish. His buttons were always fastened to the top of his shirt, and he was fully clothed. You couldn’t see any skin at all. He looked so stoic and serious. This made Lu Zheng unhappy.\r\n\r\nHe wanted to rip off his clothes and watch him continue to be coquettish.>"
}