{
	"url": "https://www.novelupdates.com/series/i-raised-a-sick-and-weak-prince/",
	"title": "I Raised A Sick And Weak Prince - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/03/20191222114623.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Fantasy   Historical   Romance   School Life   ",
	"tags": "Adapted to Manhua   Ancient China   Beautiful Female Lead   Female Protagonist   Game Elements   Handsome Male Lead   Heartwarming   Kingdom Building   Love Interest Falls in Love First   Military   Modern Day   Modern Knowledge   Politics   Possessive Characters   Power Struggle   Royalty   Slow Growth at Start   Slow Romance   Strong Love Interests   System Administrator   Time Loop   Time Paradox   Time Travel   Unlucky Protagonist   ",
	"rating": "(4.7 / 5.0, 231 votes)",
	"author": "Ming Gui Zai Jiu   明桂载酒   ",
	"year": "\nN/A",
	"ranking": "#754   #2394   #1912   #2812   #1392   ",
	"reviewcount": "50 Reviews sorted by",
	"description": "Suxi, who had been well cared for since childhood and had achieved excellent results, was a good girl everyone liked.\n\nLu Xun was exiled from his childhood and suffered humiliation before he became an emperor.\n\nOne day, Suxi downloaded a love cultivation Game App, and found that the game protagonist’s eyes were dark and beautiful. He was drawn completely according to her taste, and she  immediately opened the mode of baby raising mode.\n\n“Why is there no fire in the cub’s house? Do you want gold to buy it for him?”\n\n“The pup looks better in snow white. Ouch, buy, buy, bought it!”\n\n“Why was there a trace of footprints on the cub when he came out of the door? Is it a side mission to deal with the bully ?!”\n\nSuxi enjoyed playing the cultivation game.\n\nLu Huan had lived in mud and blood since he was a child. He thought that living was just a matter of getting through one day then another.\n\nUntil he made a complicated discovery-\n\nA warm charcoal fire was smuggled into his room.\n\nHis torn old clothes were quietly replaced with new ones.\n\nThose who bullied him and ridiculed him, who knows who taught them a lesson, but their faces were swollen and they dared not go out.\n\nOn his long lonely journey, he had a female bodhisattva walking his path with him.>"
}