{
	"url": "https://www.novelupdates.com/series/monster/",
	"title": "Monster - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/02/Monster.jpg",
	"noveltype": "(CN)",
	"genre": "Drama   Horror   Mature   Psychological   Sci-fi   Tragedy   Yaoi   ",
	"tags": "Amnesia   Appearance Different from Actual Age   Betrayal   Confinement   Dark   Death   Death of Loved Ones   Family Conflict   Futuristic Setting   Guardian Relationship   Hospital   Human Experimentation   Human-Nonhuman Relationship   Male Yandere   Multiple Personalities   Murders   Obsessive Love   Possessive Characters   Psychic Powers   Sickly Characters   Straight Uke   Terminal Illness   Unconditional Love   Unreliable Narrator   Unrequited Love   Younger Love Interests   ",
	"rating": "(4.4 / 5.0, 111 votes)",
	"author": "Little Devil   小妖子   ",
	"year": "\n2017-2018",
	"ranking": "#4617   #2706   #4080   #5634   #4695   ",
	"reviewcount": "30 Reviews sorted by",
	"description": "He was born without eyes, nose or mouth, just a piece of rotting flesh, a cruel and terrible monster.\r\n\r\nHe had eyes for only one person, his creator, Feng Yeran: a terminally ill, ambitious scientist.\r\n\r\nHe had only one wish, to get him. That included getting his love, his everything, to be with him forever―\r\n\r\nFor that he would give everything; anyone who dared to lay their hands on Feng Yeran would be doomed.\r\n\r\nYounger Yandere Monster Top X Weak Researcher Bottom\r\n\r\nPreface:\r\n\r\nThere were four pieces of playdough on the table, of different sizes. Little Feng Hua was puzzled.\r\n\r\n—Feng Hua: Ye'er, how do we make a small house out of these four pieces of playdough?\r\n\r\n—Feng Yeran: Squeeze them into the shape you want. This one is the roof, the biggest one is the walls, this one is the doors and windows, and the last small one is the chimney.\r\n\r\n—Feng Hua: There are so many coloured pencils and pastels here!\r\n\r\n—Feng Yeran: When we finish the house, let's paint the background of the house, the earth, the green grass, the blue sky and the white clouds.\r\n\r\n—Feng Hua: And paint the two of us!\r\n\r\n—Feng Yeran: Yes, one adult and one child!\r\n\r\n—Feng Hua: We'll be together forever!>"
}