{
	"url": "https://www.novelupdates.com/series/surrender/",
	"title": "Surrender - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/12/Surrender.jpg",
	"noveltype": "(CN)",
	"genre": "Adult   Comedy   Romance   Smut   Yaoi   ",
	"tags": "Acting   Adapted to Drama CD   BDSM   Black Belly   Blackmail   Businessmen   Character Growth   Cold Love Interests   Contracts   Handsome Male Lead   Heartwarming   Incest   Master-Servant Relationship   Misunderstandings   Past Trauma   Phobias   Possessive Characters   Power Couple   R*pe   Secrets   S*x Friends   S*x S*aves   S*xual Abuse   Wealthy Characters   ",
	"rating": "(4.4 / 5.0, 81 votes)",
	"author": "墨奈何   墨青城   ",
	"year": "\n2015",
	"ranking": "#2000   #2000   #3997   #3564   #3798   ",
	"reviewcount": "16 Reviews sorted by",
	"description": "Each Book is a stand-alone novel. \n\nBook 1\n\nWhen Xu Ye stepped into a BDSM club looking for someone who could satisfy his darkest desires, he met a mysterious and powerful man. That man could bring him to the peak of pleasure, but what the man wanted was a s*ave that completely trusted and surrendered to him. \n\nXu Ye did not want to be a s*ave with no free will, but he soon became deeply entangled with the mysterious man; sinking deeper and deeper into his embrace. However, when he finally discovered the man’s true identity and wanted to extract himself, he found that he could no longer leave.\n\nBook 2\n\nThe events following Surrender Book 1 by the same author. This is a spinoff story detailing about Marvin’s character from Surrender 1 \n\nZhuo Yue is a dying actor who had to shoulder a family debt. Forced at wit’s end, he braved himself to meet Fang MingYan, the big boss of a rival entertainment agency, also a professional dom and the only man who could get him out of the situation and possibly restore his career. \n\n“Since you can find me all the way here and beg me, naturally you should have known my preferences. If you can satisfy me tonight, I will sign you up.” \n\nZhuo Yue gritted his teeth told himself that as long as he obeyed and satisfied the man, if he could bear this humiliation, he would restore the glory of his past.  That night he took the first step into his world of BDSM- sinking him deeper and deeper to a path of no return.\n\nBook 3\n\nThe story of the two young masters of the Chu family.\n\nI don’t understand your silent guardianship, you don’t understand my stubborn persistence.\nIn these incomprehensions, how much time we wasted and how much we failed in the past.\nBefore this life runs out, I want to stand by your side,\nWithstand disasters for you, dispel loneliness for you.\nBefore this life runs out, I want to be with you,\nStep across the river in the setting sun, and watch the stars and the moon together.>"
}