{
	"url": "https://www.novelupdates.com/series/i-will-make-an-effort-to-change-the-genre/",
	"title": "I Will Make an Effort to Change the Genre - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/08/I-Will-Make-an-Effort-to-Change-the-Genre.jpg",
	"noveltype": "(KR)",
	"genre": "Comedy   Fantasy   Romance   Shoujo   Slice of Life   ",
	"tags": "Adapted to Manhwa   Aristocracy   Assassins   Beautiful Female Lead   Caring Protagonist   Childcare   Complex Family Relationships   Cute Children   Cute Protagonist   Devoted Love Interests   Different Social Status   Doting Love Interests   European Ambience   Familial Love   Family   Female Protagonist   Handsome Male Lead   Loner Protagonist   Love Interest Falls in Love First   Misunderstandings   Mob Protagonist   Mysterious Past   Nobles   Persistent Love Interests   Popular Love Interests   Proactive Protagonist   Quirky Characters   Royalty   Secret Crush   Slow Romance   Strong Love Interests   Transmigration   Transported to Another World   Tsundere   Wealthy Characters   ",
	"rating": "(4.2 / 5.0, 86 votes)",
	"author": "Ken   ",
	"year": "\n2018",
	"ranking": "#4080   #6290   #3421   #387   #1428   ",
	"reviewcount": "10 Reviews sorted by",
	"description": "I entered the world of my favorite novel and genre through someone else’s body.\n\nOf course, out of all the characters, I just had to enter the body of the protagonist’s aunt, the woman who abused her nephew, the selfish villainess.\n\nAccording to the original storyline, in any case, my nephew was expected to leave my side soon.\n\nCompassion for him grew, so I put my most sincere effort into tending for him until the day we parted-\n\n“I realize it is rude in asking since you have been taking care of Luca until now, but may I take Luca to Winterwald with me?”\n\nThere’s no way that won’t happen! I mean, I suppose I could’ve rushed to send him off and then live comfortably, but unexpectedly, my nephew wrapped his arms around my waist and shouted.\n\n“M-mom!”\n\nHow did I become his mom all of a sudden?>"
}