{
	"url": "https://www.novelupdates.com/series/heroic-wife-reborn/",
	"title": "Heroic Wife Reborn - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/10/HWR.png",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Comedy   Martial Arts   Romance   ",
	"tags": "Ancient China   Awkward Protagonist   Beautiful Female Lead   Cold Protagonist   Complex Family Relationships   Dense Protagonist   Evil Religions   Female Protagonist   Kind Love Interests   Loyal Subordinates   Medical Knowledge   Military   Misunderstandings   Modern Knowledge   Multiple POV   Older Love Interests   Overpowered Protagonist   Politics   Protagonist Strong from the Start   Royalty   Schemes And Conspiracies   Shameless Protagonist   Special Abilities   Tomboyish Female Lead   Transmigration   ",
	"rating": "(4.3 / 5.0, 171 votes)",
	"author": "Mei Guo   梅果   ",
	"year": "\n2015",
	"ranking": "#4617   #6290   #1564   #6513   #1510   ",
	"reviewcount": "34 Reviews sorted by",
	"description": "The army drillmaster Yu Xiaoxiao (玉小小) [aka “Little Jade”] transmigrated from a zombie apocalypse world into the body of the eldest imperial princess. On her first day, she got hitched to young General Gu Xinglang (顾星朗) at the lowest point of his life: unjustly accused, imprisoned, and tortured. Ever since then, the valiant girl who only knew how to eat, sleep, and fight zombies tied her destiny with the brave general who was loyal, patriotic, stern, and taciturn.\n\nWith the country weak and enemies on all sides, the imperial palace is full of spying concubines, sycophant officials, and a fatuous, self-indulgent ruler. Beyond the court lies the populace suffering in dire poverty. Faced with these circumstances, General Gu only hopes that he can help the imperial court restore its discipline and give peace to the people.\n\nBut his wife and princess says, “Your wish is too grand. Let’s go take over the kingdom ourselves instead!”\n\n“…….” General Gu could only remain speechless.\n\nHow does one become a royal favored by the annals of history? Yu Xiaoxiao is convinced that a truly good princess is one who dotes on her husband!>"
}