{
	"url": "https://www.novelupdates.com/series/alusha-contractual-marriage-that-saves-the-country/",
	"title": "Alusha: Contractual Marriage That Saves The Country - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/01/Alusha-Contractual-Marriage-That-Saves-The-Country_1611694740.jpg",
	"noveltype": "(KR)",
	"genre": "Fantasy   Josei   Mature   Romance   ",
	"tags": "Abusive Characters   Arranged Marriage   Beasts   Beautiful Female Lead   Calm Protagonist   Character Growth   Charismatic Protagonist   Cunning Protagonist   Death of Loved Ones   Depression   Doting Love Interests   Enemies Become Lovers   European Ambience   Fantasy World   Female Protagonist   Gods   Handsome Male Lead   Kidnappings   Kind Love Interests   Kingdoms   Knights   Manipulative Characters   Monsters   Nobles   Obsessive Love   Past Plays a Big Role   Politics   Pregnancy   Reincarnation   Revenge   Royalty   R*pe   Sadistic Characters   Schemes And Conspiracies   Second Chance   Smart Couple   Special Abilities   Strong Love Interests   Sword And Magic   Teamwork   Tragic Past   Unlucky Protagonist   ",
	"rating": "(3.9 / 5.0, 26 votes)",
	"author": "바믜   ",
	"year": "\n2021",
	"ranking": "#2000   #2000   #9682   #6711   #6152   ",
	"reviewcount": "1 Review sorted by",
	"description": "Alusha, the princess of a fallen kingdom, had an unwanted marriage with the emperor, the conqueror.\n\nLife was like hell every day.\n\nAnd then one day she found out that the Emperor was the one who killed her parents and her child.\n\nHer only wish was to avenge them.\n\nWhile she repeats her life five times for revenge, she finds out that she cannot achieve her will alone, and goes to the Duke of Kalad, who shares the same goal as her.\n\n“Let’s hear about what the Princess thinks.”\n\n“As I said before, I intend to marry the Duke.”\n\nAlusha, who became a contracted couple with Kalad, used the information from her past life to become a celebrity leading the empire’s fashion.\n\n“The dress Alusha wore, where did you say she bought it?”\n\n“Give me all the fabric Alusha bought!”\n\nIn addition, she took possession of all the commercial rights of the empire.\n\nAlusha, who received wealth, honor, jealousy, and praise from the nobility of the Empire.\n\nWill she ever regain her country?>"
}