{
	"url": "https://www.novelupdates.com/series/he-didnt-want-to-be-the-center-of-attention-hence-after-defeating-the-demon-lord-he-became-guild-master-ln/",
	"title": "He Didn’t Want to Be the Center of Attention, Hence, after Defeating the Demon Lord, He Became Guild Master (LN) - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/09/005.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Comedy   Ecchi   Fantasy   Harem   Martial Arts   Romance   Shounen   Supernatural   ",
	"tags": "Adapted to Manga   Calm Protagonist   Clever Protagonist   Demon Lord   Dense Protagonist   Dragon Slayers   Dragons   Elves   Genius Protagonist   Godly Powers   Handsome Male Lead   Heroes   Hiding True Abilities   Hiding True Identity   Male Protagonist   Monster Tamer   Monsters   Older Love Interests   Overpowered Protagonist   Polygamy   Protagonist Strong from the Start   Strong to Stronger   Sword And Magic   Younger Love Interests   ",
	"rating": "(3.4 / 5.0, 27 votes)",
	"author": "Akatsuki Touwa   Toowa   とーわ   朱月十話   ",
	"year": "\n2017",
	"ranking": "#2000   #2000   #7431   #4387   #6074   ",
	"reviewcount": "1 Review sorted by",
	"description": "The Kingdom of Albein was blessed with the appearance of the Miracle children, individuals with the greatest talents ever seen. Despite being around ten years old, with abilities dozens of times stronger than the average adventurer, they managed to reach an Adventurer’s Strength score that exceeded 100.000 points, granting them the SSS adventurer rank. With a mere party of five people, they defeated the Demon Lord and regained the kingdom’s peace.\n\nAfter that journey, Dick Silver, the most balanced between them, racked his brain to not draw the public attention.\n\nIn the end, he decided to become the Guild Master of a rundown guild as a reward, becoming the successor of the 12th guild.\n\nAfter five years he reached his aim and then became a regular of his own guild’s bar.\n\nBut one day, as he was drinking at the bar as always, the daughter of a certain noble came to pay him a visit…>"
}