{
	"url": "https://www.novelupdates.com/series/after-i-died-i-became-popular-again/",
	"title": "After I Died, I Became Popular Again - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/12/After-I-died-I-became-popular-again.jpeg",
	"noveltype": "(CN)",
	"genre": "Comedy   Romance   School Life   Yaoi   ",
	"tags": "Acting   Artists   Business Management   Celebrities   Cohabitation   College/University   Handsome Male Lead   Master-Disciple Relationship   Modern Day   Multiple Reincarnated Individuals   Past Plays a Big Role   Seme Protagonist   Sibling Rivalry   Siblings   Siblings Not Related by Blood   Slow Romance   Transmigration   Wealthy Characters   ",
	"rating": "(4.0 / 5.0, 71 votes)",
	"author": "Zuo Chuanchuan   佐川川   ",
	"year": "\n2021",
	"ranking": "#4617   #3770   #5146   #4385   #4628   ",
	"reviewcount": "16 Reviews sorted by",
	"description": "Tang Dynasty painter Fu Yi died and found himself reincarnated in the modern world in the body of a young master named Qi Linqing whose economic resources had been cut-off.\n\nIn order to make ends meet, he started to diligently paint and write calligraphy.\n\nEveryone was waiting for this young master to make a joke of himself as he tried to fake his painting skills, but what really happened was ——\n\nThe director of the costume drama cried bitterly: Come to my play! \n\nPeople’s Daily: # Qi Linqing, the youngest genius youth in traditional Chinese painting #\n\nFacing the media interview, Qi Linqing said very honestly: “I am actually very average at painting.”\n\nAfter all, he was poor in his previous life.\n\nThe crowd: “?”\n\nWhy do you have misconceptions about your own strength?\n\nLater, the well-known master of Chinese painting exclaimed, “Your brushwork looks like the Saint of Painting ……”\n\nUpon hearing the phrase Saint of Painting, Qi Linqing hastened to be modest: “I don’t dare to be.”\n\nMaster: “……Saint of Painting Fu Yi.”\n\nAs Qi Linqing finally realised this: “?”\n\nFu Yi, was this not himself??>"
}