{
	"url": "https://www.novelupdates.com/series/transmigrating-into-a-violent-generals-sweetheart-breeder/",
	"title": "Transmigrating Into a Violent General’s Sweetheart Breeder - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/03/Transmigrating-Into-a-Violent-Generals-Sweetheart-Breeder.jpg",
	"noveltype": "(CN)",
	"genre": "Drama   Fantasy   Romance   Yaoi   ",
	"tags": "Amnesia   Beasts   Childcare   Forced Marriage   Futuristic Setting   Love Interest Falls in Love First   Omegaverse   System Administrator   Transmigration   ",
	"rating": "(3.1 / 5.0, 36 votes)",
	"author": "Feast Day Of Fire   白日宴火   ",
	"year": "\n2020",
	"ranking": "#6970   #2000   #5836   #9890   #4907   ",
	"reviewcount": "6 Reviews sorted by",
	"description": "Ling Huan transmigrated into a traitor to the Empire, and at the last moment during the trial, he survived because the Main Brain detected a 99% match between him and the imperial general Lu Jinbei and forcibly bonded them into marriage.\n\nGeneral Lu said: “After the two years of compulsory marriage is over, you will be branded as a prisoner and exiled to the abandoned planet to fend for yourself.” Ling Huan, who was ruthlessly kicked away when he got married, found a stray yellow kitten. He was  beautiful and soft to touch, but not talkative and looked very noble.\n\nLing Huan was also bound to a system. He needed to do a lot of tasks to maintain the stability of the world line: pretend to be a Beta and open the largest pet shop, become the most powerful store manager, rubbing a lot of fluffy fur, and become the most cannon fodder’s fiancé. After the task is completed, he can be free from the book. Because of the superb smoothing technique, the shop planted catnip that made the all-interstellar cat alpha crazy and in the live broadcast he made the long-lost Blue Star gourmet, and he became the most sought-after shit(lit) shoveling officer in the interstellar.\n\nBut Ling Huan never expected that at first when he picked it up, climbed onto the bed, the cat who had been freeload of his food turned into Lu Jinbei. General Lu grabbed the hand he just used to touch the other cub and blocked him in the corner.\n\n “I just watered the flowers for you, why didn’t you**?”\n\n“No. 011 breeder, kiss me too.”>"
}