{
	"url": "https://www.novelupdates.com/series/cloudside-cafe/",
	"title": "Cloudside Café - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/07/Cloudside-Caf.jpg",
	"noveltype": "(CN)",
	"genre": "Romance   Slice of Life   ",
	"tags": "Adapted to Drama CD   Artists   Beautiful Female Lead   Businessmen   Calm Protagonist   Carefree Protagonist   Character Growth   Complex Family Relationships   Cute Story   Depression   Determined Protagonist   Doting Love Interests   Family Conflict   Female Protagonist   Handsome Male Lead   Modern Day   Protagonist Falls in Love First   ",
	"rating": "(4.5 / 5.0, 36 votes)",
	"author": "Zoody   ",
	"year": "\n2021",
	"ranking": "#377   #1469   #6239   #1135   #6884   ",
	"reviewcount": "8 Reviews sorted by",
	"description": "A new café had opened downstairs from the company. The shop’s signature item was neither coffee nor cake, but the boss’s good looks. \nJiang Ying, who was biased about appearances, was not careful and had left her heart over there.\nSince then, a trip to Cloudside has become a daily ritual. \n\nAt some point, Jiang Ying checked her bank account and realized that her financial situation from the past few months was something to worry about.\nThus, she said to Yun Xian, “Boss Yun, I must be your store’s biggest customer. Why don't you consider letting me invest in it? Let's make money together.”\n\nYun Xian glanced at her as he wiped the glass and said in a flat tone, “Forget about investing.”\nJiang Ying felt like she was wronged. “I help with the taste test every time there’s a new product! When you said you couldn’t fall asleep, I thought of ways to coax you to sleep! I even painted the mural on the wall for you! *sigh* If I can't even invest, then I'm at too much of a loss!”\n“Oh, it is a bit of a loss,” Yun Xian said when he learned about her reasoning. “Then I can only let you make up for it by being the boss’s wife.”\n\nYun Xian x Jiang Ying\nA beautiful but pessimistic café boss x a game designer working in a cubicle with her heart floating in the Jianghu\n\nA short story where love comes first. >"
}