{
	"url": "https://www.novelupdates.com/series/like-love-but-not/",
	"title": "Like Love But Not - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/12/Like-Love-But-Not2.jpg",
	"noveltype": "(CN)",
	"genre": "Drama   Romance   Supernatural   Tragedy   Yaoi   ",
	"tags": "Abusive Characters   Blackmail   Caring Protagonist   Childhood Friends   Ghosts   Hated Protagonist   Love Triangles   Protagonist Falls in Love First   Second Chance   Sickly Characters   Suicides   Unrequited Love   ",
	"rating": "(3.6 / 5.0, 113 votes)",
	"author": "Orange Rain   橙子雨   ",
	"year": "\n2008",
	"ranking": "#2000   #6169   #4665   #6184   #4945   ",
	"reviewcount": "27 Reviews sorted by",
	"description": "When it came to their feelings, he was always the cruel one.\r\n\r\nTen years, that person stood in front of him and told him that he loved him. However, he would not spare him a glance.\r\n\r\nHe originally believed that there was enough time between them. They had already wasted ten years. If they continued to waste it, then it would be almost a whole lifetime.\r\n\r\nHe knew that the other’s obsession with him was too deep. It would have been simply ridiculous for him to let go.\r\n\r\nWhen that person finally let go of him, he had obtained the freedom that he had long since yearned for. However, it was not as sweet as he had imagined.\r\n\r\nIt was already too late for regrets when he finally understood the implications of that person letting him go.\r\n\r\nA light slash, and the once fervent warmth turned into coldness that couldn’t be touched.\r\n\r\nHe wanted to let out a soft apology, but that wasn’t possible anymore.\r\n\r\nHe did not know that everything could be so cruel before.\r\n\r\nOnce upon a time, the longest distance of this world was when I stood right in front of you, but did not realize that I loved you.\r\n\r\nRight now, the longest distance in the world is life and death.\r\n\r\nBy the time I realized that I love you, the damage was already irreversible.\r\n\r\nIf I had the chance to hug you again, would I repeat the same mistake of the past?>"
}