{
	"url": "https://www.novelupdates.com/series/the-fake-young-master-just-want-to-win-glory-for-the-country/",
	"title": "The Fake Young Master Just Want to Win Glory for the Country - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/03/The-Fake-Young-Master-Just-Want-to-Win-Glory-for-the-Country.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Drama   Romance   Sports   Yaoi   ",
	"tags": "Adopted Protagonist   Cold Love Interests   Dense Protagonist   Familial Love   Forced Living Arrangements   Handsome Male Lead   Heartwarming   Love Interest Falls in Love First   Poor Protagonist   Pretend Lovers   Reincarnation   Second Chance   Sharp-tongued Characters   Straight Uke   Thriller   Tsundere   Wealthy Characters   ",
	"rating": "(3.6 / 5.0, 27 votes)",
	"author": "Yimei   壹枚   ",
	"year": "\n2021",
	"ranking": "#1732   #3362   #8221   #4680   #7512   ",
	"reviewcount": "3 Reviews sorted by",
	"description": "Xu Xizhou was a high-spirited and extremely arrogant young master. That was until the real young master–Lu Rong–was welcomed home, the affection of his adoptive parents for the arrogant and willful Xu Xizhou was instantly withdrawn.\n\nUnwilling, he tried to compete for favor with Lu Rong but was ridiculed, and finally was driven out of the Lu family.\n\nWhen he was desperate, the mixed-race young master of the Zhuang family coldly threw a marriage contract to him. He thought that the other party was humiliating him, so he tore up the contract and went to his friends for help but he was framed instead. His racing career plummeted and he ended up dying tragically in a car accident.\n\nReturning to that desperate rainy night, when the tall and handsome man handed over the marriage contract, Xu Xizhou only raised a single eyebrow and signed it!\n\nSomeone in the beginning (usually cold and aloof): We only have a contractual relationship, you’d better not think of something more.\n\nSomeone later (getting more and more irritable): These fans, don’t inconsiderately shout husband! He is obviously my wife!!\n\n——–\n\nWatching Xu Xizhou win awards on the track and become an internationally renowned racer, the way the real young master looked at him was getting hotter; his adoptive parents regretted it and wanted to take him home to continue training him.\n\nUnexpectedly, Xu Xizhou’s grandfather came to their door instead. \n\nTop millionaire Grandpa: I’ll give you 500 million, stay away from my good grandson, do you hear me? \n\nPresident Uncle: Dad, it’s not good to spoil the younger generation like this. Secretary Wang, how much does it cost to buy an F1 team? \n\nDesigner Mother: Baby, your boyfriend doesn’t seem to have a very good temper, why don’t I find you a younger and more handsome one? \n\nA certain someone：……>"
}