{
	"url": "https://www.novelupdates.com/series/villain-husband-please-let-go/",
	"title": "Villain Husband, Please Let Go - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/10/villainhusbanletgo3.jpg",
	"noveltype": "(CN)",
	"genre": "Drama   Fantasy   Mature   Romance   ",
	"tags": "Amnesia   Ancient China   Ancient Times   Apocalypse   Beautiful Female Lead   Businessmen   Caring Protagonist   Clingy Lover   Cohabitation   College/University   Cultivation   Cute Story   Demons   Devoted Love Interests   Doting Love Interests   Fat Protagonist   Fated Lovers   Female Master   Female Protagonist   First Love   First-time Interc**rse   Gamers   Handsome Male Lead   Heartwarming   Jealousy   Love at First Sight   Love Interest Falls in Love First   Lovers Reunited   Male Yandere   Master-Disciple Relationship   Post-apocalyptic   Power Couple   Pregnancy   Second Chance   Showbiz   Siblings Not Related by Blood   Time Skip   Transmigration   World Hopping   Zombies   ",
	"rating": "(4.3 / 5.0, 46 votes)",
	"author": "深蓝水浅   ",
	"year": "\n2020",
	"ranking": "#2094   #6173   #5631   #8803   #5250   ",
	"reviewcount": "13 Reviews sorted by",
	"description": "A Fortune-teller once said that Tang Wan was destined to live her entire life alone, but she didn’t believe him, she had money and beauty, how could she not get married?   \n\nShe ended up having 99 boyfriends, each of whom found their true love and dumped her within a month! \n\nThe last one even ran off with another woman on their wedding day!\n\nThen she was bound to a daddy system.   \n\nDad System: Want a perfect husband? No.998, no No.888, just bind to my Daddy System and the perfect husband will be delivered to your home!  \n\nTang Wan: Daddy?\n\nDaddy System (shy): Hello daughter~ Call Daddy, you can have any kind of son-in-law you want! \n\nAfter binding to the system, Tang Wan only wanted to strangle it. The promised perfect husband?! These men with crooked natures, who dares to want them?! Would I not be personally digging a pit to bury my head in?!\n\nDaddy System: Daughter, why would father let you personally dig a pit to bury your head in? Con? You take a look, which one of them is not premium quality goods? Which one of them is not handsome with long slender legs?\n\nTang Wan:…>"
}