{
	"url": "https://www.novelupdates.com/series/im-only-a-stepmother-but-my-daughter-is-just-so-cute/",
	"title": "I’m Only a Stepmother, but My Daughter is Just so Cute! - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/05/Im-Only-a-Stepmother-but-My-Daughter-is-Just-so-Cute.jpg",
	"noveltype": "(KR)",
	"genre": "Fantasy   Josei   Romance   ",
	"tags": "Adapted to Manhwa   Aristocracy   Beautiful Female Lead   Bickering Couple   Caring Protagonist   Character Growth   Charismatic Protagonist   Charming Protagonist   Child Abuse   Childcare   Clever Protagonist   Clumsy Love Interests   Cold Love Interests   Comedic Undertone   Complex Family Relationships   Couple Growth   Cute Children   Cute Protagonist   Determined Protagonist   Devoted Love Interests   Doting Love Interests   Doting Parents   Enemies Become Allies   Enemies Become Lovers   European Ambience   Family   Family Conflict   Female Protagonist   Handsome Male Lead   Heartwarming   Kind Love Interests   Kingdoms   Kuudere   Love Interest Falls in Love First   Manipulative Characters   Nobles   Obsessive Love   Past Plays a Big Role   Past Trauma   Phobias   Popular Love Interests   Power Couple   Pragmatic Protagonist   Previous Life Talent   Proactive Protagonist   Protagonist Strong from the Start   Quirky Characters   Reverse R*pe   Royalty   Selfless Protagonist   Smart Couple   Tragic Past   Transmigration   Villainess Noble Girls   Wealthy Characters   ",
	"rating": "(4.6 / 5.0, 411 votes)",
	"author": "Yir   ",
	"year": "\n2019",
	"ranking": "#3923   #4816   #1061   #179   #125   ",
	"reviewcount": "46 Reviews sorted by",
	"description": "I managed to get myself thrown into a story as a stepmother so jealous of her daughter that she tried to kill the girl with a poisoned apple.\r\n\r\nI’d love it if I could shower my cute and lovely Blanche with all sorts of affection, but–\r\n\r\n“Hilarious. Since when did you like Blanche so much?”\r\n\r\nThis god-damned husband keeps getting in my way!\r\n\r\n“I am Blanche’s parent as well. I demand an apology for being so suspicious of me.”\r\n\r\n“And if I don’t?”\r\n\r\n“I’ll visit your bedroom tonight, your majesty.”\r\n\r\n“…..”\r\n\r\n“I even managed to get some really sexy panties just for you.”\r\n\r\nWith a big smile on my face, I struck him with a critical hit.\r\n\r\n“I could show it to you right now if you’d like?”\r\n\r\nThe look on his face was truly something to behold.\r\n\r\nI lifted my chin, and looked down on him victoriously.>"
}