{
	"url": "https://www.novelupdates.com/series/if-the-world-sees-gentleness/",
	"title": "If The World Sees Gentleness - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/02/If-The-World-Sees-Gentleness.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Fantasy   Martial Arts   Romance   ",
	"tags": "Ancient China   Arranged Marriage   Female Master   Female Protagonist   Handsome Male Lead   Matriarchy   Military   Mpreg   Multiple Transported Individuals   Politics   Protagonist Strong from the Start   Royalty   Transmigration   ",
	"rating": "(4.1 / 5.0, 45 votes)",
	"author": "Shēn Lín   深临   ",
	"year": "\n2019",
	"ranking": "#3710   #2000   #5324   #10066   #5920   ",
	"reviewcount": "10 Reviews sorted by",
	"description": "When Xu Ting came back from the army, she found out that her boyfriend and her best friend had an affair behind her back.  She had no face left!\n\nShe immediately went racing and fell from the steep mountain and died. But she did not expect that she would actually be reincarnated to Dayan Dynasty, where women were superior to men. Women were the breadwinners, and men were meant to take care of the house.\n\nWasn’t this just right?\n\nMen were virtuous and beautiful, gentle and small, more likable. If she chose a man, she would love him wholeheartedly, he would rely on her unconditionally and they would never betray each other.\n\nDu Siyin’s life is like a joke. He is obviously the legitimate son, but he is not as good as the bastard son. His father died early, his mother did not like him, and even his servants were sarcastic and negligent towards him. He is obviously virtuous and beautiful. He is good at piano, chess, calligraphy, needlework and poetry. He was graceful and refined. But even after all this, his fiancee broke off their engagement and instead pursued the son of an ugly and unrefined merchant. He had become a joke among the noble sons of the capital. He was unmarried at the age of nineteen and was maliciously speculated against by countless people.\n\nAt the end of the summer of the fifteenth year of Wenqi, the Queen of Zhenbian returned to Beijing, and Xu Ting, the Princess of Zhenbian, who was the dream candidate of countless sons, appeared before anyone. But Du Siyin had a dead heart and did not have any hopes of having a better life.\n\nWho knew how, but this big pie fell on his head!\n\nOnce the marriage was bestowed, and a good relationship was formed, Xu Ting treated Du Siyin with gentleness that the world would be jealous of.>"
}