{
	"url": "https://www.novelupdates.com/series/ancestor-watch-over-me/",
	"title": "Ancestor, Watch Over Me - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/10/Ancestor-Watch-Over-Me.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Comedy   Fantasy   ",
	"tags": "Cultivation   Dead Protagonist   Male Protagonist   Overpowered Protagonist   Romantic Subplot   System Administrator   Unique Cultivation Technique   ",
	"rating": "(3.4 / 5.0, 7 votes)",
	"author": "Desktop Computer   ",
	"year": "\nN/A",
	"ranking": "#6970   #2000   #11233   #13810   #13287   ",
	"reviewcount": "1 Review sorted by",
	"description": "I am a physical practitioner, they call me the “bulldozer”! I had once ruled over my times, establishing a family clan that was respected by all. The saying “breaking all rules with physical force” describes me perfectly! After I passed away, my body has remained intact for 1000 years. However, my unfilial descendants have decided to dig me out of the coffin and make use of my body to defend against natural disasters and attacks from our family’s enemies… \r\n\r\n“Dear ancestor, the Red Whale Gang is here to kill us, the Elders can no longer fight them off, please lend us your power with your body!” \r\n\r\n“Dear ancestor, please forgive us, the Heavenly Sword Clan is here to attack us again, the head of the clan is already severely injured, we need your body to scare them away!” \r\n\r\n… \r\n\r\nUntil one day... \r\n\r\n“It’s too much hassle digging out the ancestor’s body and burying it over and over again! Why don’t we cultivate him into a battle puppet? He’ll protect us equally well that way!” \r\n\r\n“I believe our ancestor is watching over us. He will never forgive us for such disrespectful acts…” “That’s absolutely deplorable!” \r\n\r\nThis bunch of unfilial brats deserve a good beating! One day, I regain my consciousness and lift up my coffin lid in anger… \r\n\r\nThis is a story about the first physical cultivator, who had made significant contributions to human civilization and the cultivation realms a thousand years ago. However, infuriated by his insolent descendants, he wakes up from death and continues to do his part in elevating his family clan from the brink of extermination and saving his city from attacks by monsters. It is also an educational tale which instills moral righteousness and emphasizes the importance of filial piety, as the ancestor teaches his descendants to care for the young and respect the old, and to strive to create a peaceful world together as one family.>"
}