{
	"url": "https://www.novelupdates.com/series/my-wife-spoils-me-too-much/",
	"title": "My Wife Spoils Me Too Much - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/10/MWSM.jpg",
	"noveltype": "(CN)",
	"genre": "Drama   Josei   Romance   Slice of Life   Supernatural   ",
	"tags": "Caring Protagonist   Childcare   Cold Love Interests   Complex Family Relationships   Cooking   Couple Growth   Crafting   Cute Children   Cute Protagonist   Dense Protagonist   Devoted Love Interests   Doting Parents   Familial Love   Female Protagonist   Handsome Male Lead   Heartwarming   Inferiority Complex   Military   Modern Day   Naive Protagonist   Popular Love Interests   Protagonist Falls in Love First   Slow Romance   Time Travel   Tragic Past   Transmigration   Tsundere   Ugly Protagonist   Ugly to Beautiful   ",
	"rating": "(4.3 / 5.0, 403 votes)",
	"author": "Yue ban yao fen jia   月半要分家   ",
	"year": "\nN/A",
	"ranking": "#3314   #4688   #739   #325   #771   ",
	"reviewcount": "101 Reviews sorted by",
	"description": "Ji Yan discovered his wife, who hated him so much that she wished he was dead, had lost her memory after a car crash. She had changed so much it was like she was a totally different person…\n\nWhen he goes to work: “Dear, don’t move, I’ll put on your shoes for you.”\n\nWhen he is having a meal: “Dear, I have made all of your favourite dishes. You have worked hard, so eat up.”\n\nWhen he finished work: “Dear, you have worked all day. I’ll massage your shoulders and feet.”\n\nJi Yan: “…”\n\n—————\n\nTang Tang got pushed into the pond by her step sister who frequently bullied her. She thought she would meet her dead mother but, who knew, when she opened her eyes again, she was in a strange place. But what made her happy was that she had a super handsome husband and a very cute son. The most important thing was that her husband was good. He was a hero who protects the country, and earns money to support her and their son. Also, he only has her as his wife, he didn’t have any concubines whatsoever. Tang Tang decided she should be submissive to her husband, to be a good wife and a loving mother. Her nanny no longer needed to worry about her not being able to get married anymore!>"
}