{
	"url": "https://www.novelupdates.com/series/after-transmigrating-into-an-omega-i-was-marked-by-the-enemy/",
	"title": "After Transmigrating Into an Omega, I Was Marked by the Enemy - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/04/20191224122306.jpg",
	"noveltype": "(CN)",
	"genre": "School Life   Yaoi   ",
	"tags": "Black Belly   Dense Protagonist   Enemies Become Lovers   Handsome Male Lead   Hot-blooded Protagonist   Love Interest Falls in Love First   Male Yandere   Manipulative Characters   Marriage   Military   Misunderstandings   Mpreg   Naive Protagonist   Obsessive Love   Omegaverse   Past Plays a Big Role   Popular Love Interests   Possessive Characters   Strong Love Interests   Transmigration   Tsundere   ",
	"rating": "(3.5 / 5.0, 127 votes)",
	"author": "十权   ",
	"year": "\n2020",
	"ranking": "#2094   #2181   #1862   #3799   #1280   ",
	"reviewcount": "24 Reviews",
	"description": "Alpha Yan Qiu bumped his head and unexpectedly transmigrated into his nemesis Ji Xinglan’s Omega fiance’s body.\n \n【Before Marriage】\n \nJi Xinglan leaned lazily on the couch. “Renouncing the wedding? 'Impossible.'\n \nThe man smiled wickedly, overturned Yan Qiu on the sofa, and suddenly lifted his shirt.\n \nYan Qiu looked at his belly and suddenly felt the heavens fall and the earth rend! (idiom; rocked by a major disaster)\n \nAh, I’m pregnant!\n \n... Ah, I’m pregnant! This pair of male dogs!\n \n【After Marriage】\n \nInhibitors couldn’t be used during pregnancy, so feverish Yan Qiu, with no choice, could only let Ji Xinglan repeatedly torture him.\n \nHaving to meet with my arch-nemesis is indescribable. I’m going to die!\n \nOnly Ji Xinglan knew that he had never touched his Omega fiance at all.\n \nHe was going for Yan Qiu from the beginning.\n \nA few months later, Yan Qiu looked at his still flat belly, gritted his teeth, and slapped Ji Xinglan’s face.\n \n“Go away! You f*cking cheater! ”\n \n“This Laozi demands a divorce!”\n \nJi Xinglan smiled calmly and took out a piece of paper from the drawer.\n \n'Sorry, honey, it’s too late. Now you really are pregnant with my seed.”>"
}