{
	"url": "https://www.novelupdates.com/series/hush-now-saintess/",
	"title": "Hush Now, Saintess! - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/06/Hush-Now-Saintess.jpg",
	"noveltype": "(KR)",
	"genre": "Comedy   Fantasy   Romance   ",
	"tags": "Aristocracy   Beautiful Female Lead   European Ambience   Female Protagonist   Game Elements   Handsome Male Lead   Magic Beasts   Misunderstandings   Nobles   Royalty   Saints   System Administrator   Transmigration   Villainess Noble Girls   ",
	"rating": "(3.8 / 5.0, 22 votes)",
	"author": "Hi My Dear   하이마이디어   ",
	"year": "\n2022",
	"ranking": "#4617   #1927   #10363   #4970   #8364   ",
	"reviewcount": "No Reviews",
	"description": "I transmigrated into a crazily disastrous novel and came to possess the body of ‘Roella’, a fake saintess who’s destined to die young.\n\n‘No, but is there some sort of trend of dying young?’\n\nA moment of despair. A determined plan to survive.\n\nWhen the real saintess comes out, I’ll just say, ‘I knew it, I guess I’m a fake!’ then stand down!\n\nThe perfect plan provided a moment’s repose. \n\nDing—!\n\n〈 Mission : A villainess, but forcibly turning over a new leaf! \n\n1. Raise your reputation\n2. Apply the automatic curse word filtering\n\n※ Penalty upon mission failure : Death within six months of the recognition of the real saintess.\n※ Reward upon mission success : Survival\n\nWould you like to accept this mission?\n( I want to ♥ / YES! )  〉\n\nA ruthless system window with no conscience appeared before my eyes.\n\n* * *\n\nTo ensure my survival, I followed what the system window said.\nConsequently, \n\n“The best Saintess of the empire!”\n“Cursing at the Saintess is the same as cursing at me, so I won’t let this go.”\n“She’s here. This era’s number one Saintess!”\n\nWhat the. Seems like my reputation went up too much?\n\nAnd to make matters worse.\n\n—Ah, this crazy…!\n“Ah, how cute…!”\n\n—What did you say, you f*****!\n“What did you say, you cutie!”\n\nBecause of the mayhem that the filtering brought on, I guess the cursed imperial crown prince even got swept into this kind of misunderstanding?!\n\n“I’m… cute?”\n\nNo. That’s not what I meant.>"
}