{
	"url": "https://www.novelupdates.com/series/extra-works-hard/",
	"title": "Extra Works Hard - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/06/Extra-Works-Hard.jpg",
	"noveltype": "(KR)",
	"genre": "Adventure   Fantasy   Romance   School Life   Shounen Ai   Supernatural   ",
	"tags": "Academy   Cute Protagonist   European Ambience   Fantasy World   Glasses-wearing Protagonist   Handsome Male Lead   Hard-Working Protagonist   Kingdoms   Magic   Stubborn Protagonist   Sword And Magic   Transmigration   Weak Protagonist   ",
	"rating": "(4.4 / 5.0, 40 votes)",
	"author": "삼각   ",
	"year": "\n2021",
	"ranking": "#4265   #6301   #5882   #3265   #4472   ",
	"reviewcount": "7 Reviews sorted by",
	"description": "A train journey to escape from reality.\n\n“Is it a dream...?”\n\nWhen I came to my senses at some point, I felt like I was in a fantasy novel I had been reading a while ago.\n\nIt was also possessed by the body of an extra whose name was not mentioned in the original work!\n\n‘Does this make sense?!’\n\nThe original work had already begun without the man even getting to his senses.\n\nThe man, now ‘Nathan Norbert’, tried to make a connection with the original protagonist in order to survive from the original incident that would take place three years later...\n\n* * *\n\n“What are you doing there?”\n\nIt was a good thing there was no backlighting. If there were, he wouldn’t have noticed immediately who the boy standing in front of him was. \n\nThe gold colour, like melted gold, shimmered even in the gloomy weather. His cool eyes were slightly frowning as if puzzled and, blue like the summer sky, were looking straight at Nathan. \n\nAt that moment, a huge shock struck his head. Nathan sighed involuntarily. Ah, instinct whispers. \n\nThis person is Hazard. \n\nHis name is Hazard Erasmus.\n\nIndeed, the boy in front of him was exactly what Nathan had envisioned while reading . So he had no choice but to recognize it at a glance. He couldn’t have dared to imagine a protagonist other than this figure.\n>"
}