{
	"url": "https://www.novelupdates.com/series/mr-xiaos-unconditional-love/",
	"title": "Mr. Xiao’s Unconditional Love - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/02/Mr-Xiaos-Unconditional-Love.jpg",
	"noveltype": "(CN)",
	"genre": "Drama   Romance   School Life   ",
	"tags": "Beautiful Female Lead   Devoted Love Interests   Early Romance   Fast Learner   Female Protagonist   Handsome Male Lead   Long-distance Relationship   Modern Day   Power Couple   Secret Relationship   Strong Love Interests   Time Travel   ",
	"rating": "(3.0 / 5.0, 3 votes)",
	"author": "Yi Xiyan   忆昔颜   ",
	"year": "\nN/A",
	"ranking": "#2000   #2000   #12465   #13810   #12711   ",
	"reviewcount": "No Reviews",
	"description": "Wrongly imprisoned for a crime she did not commit, Ye Qiao was freed from the iron gates that locked her away for seven years with nowhere to go, no one to see, and nothing to move on to following the passing of her husband, who she had never appreciated. The man was part of the Special Forces and had been killed during a mission.\r\n\r\nShe thought she would never cry again after being hardened by the hard knocks of prison life, but there she was, weeping for the man named Lu Beixiao. He had spent his entire life loving her, truly and deeply, but she had been misled by her own stupidity and lack of trust.\r\n\r\nOn her first day out of prison, she found herself in an accident and learned that it was actually a homicide, presumably by the same people that had killed her husband. 'Boss, there's nothing to worry about. She is going to die for sure,' the stranger's voice rang in her ears.\r\n\r\nEven though she was going to die, all she could think of was that she wanted to see her husband again in her next life and find her way back in love.\r\n\r\nShe must.\r\n\r\nAll of sudden, Ye Qiao awakened to her life twenty years ago! It seemed that she had been given another chance to right the wrongs of the past, but would she be able to overcome the obstacles that had held her back in her past life? Who was the man responsible for her death, and would he prevent her from doing so?>"
}