{
	"url": "https://www.novelupdates.com/series/how-can-you-pay-back-the-kindness-i-raised-with-obsession/",
	"title": "How Can You Pay Back The Kindness I Raised With Obsession? - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/01/How-Can-You-Pay-Back-The-Kindness-I-Raised-With-Obsession_1643180436.jpg",
	"noveltype": "(KR)",
	"genre": "Comedy   Fantasy   Romance   Slice of Life   ",
	"tags": "Beast Companions   Caring Protagonist   Childcare   Contracts   Cooking   Cute Children   Different Social Status   European Ambience   Female Protagonist   Handsome Male Lead   Knights   Love Interest Falls in Love First   Magic   Misunderstandings   Nobles   Schemes And Conspiracies   Strong Love Interests   Transmigration   Tsundere   Witches   ",
	"rating": "(4.4 / 5.0, 28 votes)",
	"author": "Cha Bori   차보리   ",
	"year": "\n2022",
	"ranking": "#5262   #6320   #5388   #4463   #5703   ",
	"reviewcount": "6 Reviews sorted by",
	"description": "She possessed the evil witch in a fairy tale.\n\nShe was living a lonely life hated by everyone, but one day she found a brother and sister who ate her candy house and raised them.\n\n“Witch Hazel should be executed for kidnapping!”\n“You’re going to be executed for kidnapping the younger siblings of the Archduke!”\n“If you execute Hazel, I will starve for the rest of my life!”\n‌“Ahhh- Hazel cannot go.”\n\nThanks to the children, it was good that I became the nanny of them, but my employer…\n“The Duke doesn’t marry a witch. Of course, not even a nanny.”\n\nIt’s okay because I don’t want to marry either. Even more so with the Grand Duke! I’m just going to raise the kids and leave.\n\n‌On the long-awaited retirement day.\n“What kind of potion did you use for me? No, I’d rather you use it because it’s a potion”\n\nWhat I brought out is a letter of resignation, but why is the duke giving me a ring?\n\nGuys, calm down.\n“Hazel and brother, when is the baby coming?”\n“A nephew who resembles Hazel? Yes!”\n\nAre you repaying the kindness from when I raised you with obsession?>"
}