{
	"url": "https://www.novelupdates.com/series/bite-your-fingertips/",
	"title": "Bite Your Fingertips - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/02/Bite-Your-Fingertips.png",
	"noveltype": "(CN)",
	"genre": "Mature   Psychological   Romance   School Life   Shounen Ai   Supernatural   ",
	"tags": "Absent Parents   Adapted to Drama CD   Aggressive Characters   Cold Love Interests   Complex Family Relationships   Cute Protagonist   Death   Depression   Doting Love Interests   Family   Family Business   Family Conflict   Handsome Male Lead   Lazy Protagonist   Love Interest Falls in Love First   Male Yandere   Modern Day   Murders   Narcissistic Protagonist   Obsessive Love   Past Trauma   Possessive Characters   Shameless Protagonist   Strong Love Interests   Vampires   Wealthy Characters   ",
	"rating": "(4.6 / 5.0, 205 votes)",
	"author": "Su Jingxian   苏景闲   ",
	"year": "\n2019",
	"ranking": "#135   #350   #1773   #1593   #1440   ",
	"reviewcount": "47 Reviews",
	"description": "Chu Yu was good-looking and had a good family background. Despite being male and an irredeemable slacker, he was still elected as Jianing Private School’s school flower by an overwhelming number of votes.\n\nThe whole school knew that Chu Yu was on bad terms with the second year’s top student who’d won so many awards from various competitions that his hand had gone limp with exhaustion just from holding them. He was the cold, restrained, taciturn, and indifferent to anyone school grass, Lu Shi. \n\nThat was until one certain day after school, when someone saw Chu Yu amongst the trees behind the school building, pulling on the sleeves of the study god’s white shirt while speaking pitifully, “Lu Shi, give me a bite, I’ll be gentle.”\n\nLu Shi put his finger in Chu Yu’s mouth. “It doesn’t matter if it hurts a little.”\n\n——\n\nChu Yu was frightened to discover that, overnight, he had awakened a strange bloodline that required him to suck a drop or two of blood everyday in order to survive. However, the blood of everyone was bitter and smelly, except…Lu Shi’s.\n\n#The Heavens must be pitting me#\n\n——\n\n*坑 (lit. Pit.) means a teammate that intentionally or unintentionally screws their teammate over.>"
}