{
	"url": "https://www.novelupdates.com/series/how-to-protect-the-master-of-the-monster-mansion/",
	"title": "How To Protect The Master Of The Monster Mansion - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/09/How-To-Protect-The-Master-Of-The-Monster-Mansion.jpg",
	"noveltype": "(KR)",
	"genre": "Action   Drama   Fantasy   Josei   Mystery   Romance   ",
	"tags": "Beautiful Female Lead   Childcare   Female Protagonist   Handsome Male Lead   Possessive Characters   Reincarnated in a Game World   Transmigration   Transported to Another World   ",
	"rating": "(3.8 / 5.0, 15 votes)",
	"author": "Kin   킨   ",
	"year": "\n2021",
	"ranking": "#6970   #6343   #10930   #8806   #9397   ",
	"reviewcount": "No Reviews",
	"description": "20XX, the era of virtual reality games. \nAmong them, , which I played, was a game that mixed romance simulation, horror action, and upbringing genres. \n\n“Oh. Don't worry, baby. I'll definitely save you next time.' \n'really? Then I'll leave it to you.' \n\nHowever, on the 43rd day of the death of the master who had been nurtured and nurtured, a strange voice was heard and the strange 44th episode began. \n\n“Master Diane, a new caregiver has arrived.” \n\nThe job of a nurturer, which was not originally in the game, was automatically selected, and then the unpredictable things continued to happen in the Redford Mansion, the setting of the game. \n\n“I like Rin the best in the world. So don't die until I'm an adult and stay by my side.' \n“It’s said that Rin likes a man with a pretty crying face. that's just me Would you like to check it out now?” \n\nEven so, the cute sunfish cat worked hard to protect it, and I made a data lover like a flower deer... . \n\n[Loading system… . Partial recovery of the system for quick deployment.] \n[ \n\nFavorite 2] Hey, didn't you like me? What the hell is this petty crush? \nHowever, whenever the handsome man saw another person, the number above his head that penetrated to the inner core was even more disconcerting. \n\n[Favorite –889/?]\n\nIt turned out that this man, the subject of the game data, must have been afflicted with anthropophobia. >"
}