{
	"url": "https://www.novelupdates.com/series/isekai-souzou-no-susume-smartphone-app-de-wakusei-wo-tsukkushiteshimatta-ore-wa-kami-tonari-sekai-wo-meguru/",
	"title": "Isekai Souzou no Susume ~Smartphone App de Wakusei wo Tsukkushiteshimatta Ore wa Kami Tonari Sekai wo Meguru~ - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/09/i-cover.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Fantasy   Harem   Romance   Supernatural   ",
	"tags": "Accelerated Growth   Adapted to Manga   Adventurers   Demon Lord   Dragons   Dwarfs   Elves   Evolution   Game Elements   God-human Relationship   God Protagonist   Godly Powers   Interdimensional Travel   Lack of Common Sense   Male Protagonist   Misunderstandings   Modern Day   Multiple POV   Nobles   Onmyouji   Polygamy   Special Abilities   Stalkers   Strong Love Interests   Time Travel   Tomboyish Female Lead   Transported into a Game World   Transported to Another World   Weak to Strong   World Hopping   World Travel   Yandere   Youkai   ",
	"rating": "(3.3 / 5.0, 101 votes)",
	"author": "Tamagokake Candy   たまごかけキャンディー   ",
	"year": "\n2019",
	"ranking": "#822   #6318   #1229   #2129   #2703   ",
	"reviewcount": "19 Reviews sorted by",
	"description": "A certain middle-aged man, Saito Kenji installed a mysterious smartphone app “Guide to Creating Another World”.\r\n\r\nIt was a game in which you could freely manipulate planets, lives, tribes, eras, and all sorts of other things.\r\n\r\nHowever, as a result of being transferred to the world on the screen through a new function, he found himself able to travel back and forth to Japan!\r\n\r\nYou can explore and time travel in other world, and the different abilities you get can be used either way, and use dimensional storage. And you can take things and people with you as much as you want…!\r\n\r\n“Hmm, this is an adventure you have to have, isn’t it?\r\n\r\nI’m busy resolving problems in two worlds, and leveling up in between.\r\n\r\nOccasionally, he gives an oracle to cause the other world to shake violently, or tames a nine-tailed girl with tuna mayo–?\r\n\r\nThe life of an Ex-salaryman with an “anything goes” God life START!>"
}