{
	"url": "https://www.novelupdates.com/series/kantai-collection-kankore-kankore-rpg-replay-negai-wa-umi-wo-koete/",
	"title": "Kantai Collection – Kankore – Kankore RPG Replay – Negai wa Umi wo Koete - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2015/08/kantaicollection1.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Sci-fi   ",
	"tags": "Game Elements   Wars   ",
	"rating": "(2.1 / 5.0, 11 votes)",
	"author": "Mana Komatsu   Sakurai Hikaru   Sarah Emi Bridcutt   Shirou Akatoki   Touichirou Kawashima   ",
	"year": "\n2014\r\n",
	"ranking": "#2000   #2000   #12144   #13810   #12930   ",
	"reviewcount": "No Reviews",
	"description": "Welcome to the world of Kancolle RPG! This book tells a story about a novice admiral and his interesting kanmusu (ship girls). But, this book is a little different from a normal story. This book, tells a, “Roleplaying,” story.\n\n“Roleplaying, ”is a type of game that you play with other people where you read lines from the book as if you’re the one in the story. There are a lot of “Roleplaying,” types and this book is specifically a, “Table talk,” RPG. Read it as if you’re playing kantai collection- Kancole- Kancolle RPG.\n\nThis Kancolle RPG is based on a browser game called Kantai Collection. The game itself puts the player in control of girls that have the memories and powers of warships in the past. The player then must battle a mysterious threat called the “Abyssal Fleet,” sighted all around the world. The difference between Kancolle RPG and the browser game, is that you’ll need to use dice, pieces, and follow the rules and scenarios stated by the Kancolle RPG rulebook. Obtaining ship girls are different too; each player will only get one shipgirl. In table talk RPG, you can ease your mind, the rage, the salt that naturally comes while playing, by gathering friends who have the same hobby, and discuss while playing.\n\nSometimes you’ll need to face the enemy seriously. Sometimes, you can put yourself in the ship girls’ shoes, and act out their lines. Sometimes you’ll have to go back to yourself, and joke at another character’s line. You playing it happily with your friends are what “Roleplaying,” is all about.\n\nA Battleship girl who has just come back from another country, she is generous and having a big heart, Kongou.\n\nA Heavy Cruiser princess with a lack of common sense, Kumano.\n\nAn eccentric Light Aircraft Carrier, Zuihou.\n\nThe serious and analytical Light Cruiser, Kiso.\n\nThese are the main girls who play a big part in this book. But, due to the haphazard nature of this game, you won’t be able to play their characters perfectly. Even if you try to, but deep inside, the girls you know are different. Nevertheless, we hope you would be able to enjoy that character gap.\n\nAnd lastly, we’ll introduce another one of the main characters, Teitoku (the Admiral). He is a young and by-the-book admiral. This novice Admiral is often being played around by the 4 wild girls. He still thinks that, “It shouldn’t be like that, it’s not like that.” This hard working Admiral is one of the view points we will be using in this book.\n\nFrom now, for everyone whose thinking, “I’d like to be an admiral in kancolle RPG!” please try it. It will be a good reference!>"
}