{
	"url": "https://www.novelupdates.com/series/my-lovers-personality-is-a-little-strange/",
	"title": "My Lover’s Personality Is A Little Strange - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/01/My-Lovers-Personality-Is-A-Little-Strange.jpg",
	"noveltype": "(KR)",
	"genre": "Drama   Fantasy   Mystery   Romance   ",
	"tags": "Abusive Characters   Amnesia   Aristocracy   Beautiful Female Lead   Childhood Friends   Childhood Love   Cross-dressing   Curses   Death of Loved Ones   Different Social Status   European Ambience   Female Protagonist   Handsome Male Lead   Knights   Love at First Sight   Love Interest Falls in Love First   Lovers Reunited   Magic   Male Yandere   Misunderstandings   Nobles   Obsessive Love   Personality Changes   Politics   Royalty   Secret Identity   Tragic Past   ",
	"rating": "(3.7 / 5.0, 63 votes)",
	"author": "Honey   꿀끼   ",
	"year": "\n2022",
	"ranking": "#770   #307   #5283   #1541   #5105   ",
	"reviewcount": "5 Reviews sorted by",
	"description": "My lover lost his memory.  It was a common horse accident.  However, the man seemed to have lost his personality along with his memories.\r\n\r\n \r\n\r\n‘A wreck that had never been seen in Albrecht’s history. ‘Pretty garbage that can’t even be collected’ ‘A human failed.’\r\n\r\n \r\n\r\n Were all the rumors about my lover true? \r\n\r\n \r\n\r\n In the meantime, he got engaged. Whether he held his fiancée’s hand or rubbed her lips in front of me, I endured, thinking that when he regained his memory, then I would go there and beat him up, but….\r\n\r\n \r\n\r\n ‘I’m pregnant.’\r\n\r\n \r\n\r\n His child was growing in my womb.\r\n\r\n \r\n\r\n If the truth is known, my lover’s fiancée will kill me.\r\n\r\n \r\n\r\n Therefore, I decided to run away from my lover and his fiancée, who had a slightly strange personality.  Last but not least, I left behind the feelings I wanted to convey.\r\n\r\n\r\n\r\n \r\n\r\n***\r\n\r\n \r\n\r\n “I love you, Yves.  Are you going to leave me?”\r\n\r\n \r\n\r\n The lover who regained his memory eventually reappeared. He shed tears with the prettiest face in the world.\r\n\r\n \r\n\r\n“Your Theo can be a good dog who turns his belly up and acts cute if he can be loved by you. So don’t abandon me.” \r\n\r\n \r\n\r\n“I’m sorry. Bad dogs bite their owners.”\r\n\r\n \r\n\r\n At the indifferent reply, the air around him suddenly shattered sharply as if it was going to pierce his skin.\r\n\r\n \r\n\r\n “……I’ll be nice.”\r\n\r\n \r\n\r\n Ah.\r\n\r\n \r\n\r\n He grabbed my hand and curled up the corners of his red lips.\r\n\r\n \r\n\r\n “I’ll be a good dog that does not bite, huh? Master.”\r\n\r\n \r\n\r\n Rubbing my cheek with the back of his rough hand, he smirked. The golden eyes flashed with madness curved thinly, capturing me.>"
}