{
	"url": "https://www.novelupdates.com/series/male-lead-2-and-male-lead-3-happy-ending/",
	"title": "Male Lead 2 and Male Lead 3 Happy Ending! - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/05/ml2ml3he_.jpg",
	"noveltype": "(CN)",
	"genre": "Drama   Romance   Shounen Ai   Slice of Life   ",
	"tags": "Calm Protagonist   Clever Protagonist   Cohabitation   Dense Protagonist   Devoted Love Interests   Doting Love Interests   Doting Older Siblings   Doting Parents   Handsome Male Lead   Hard-Working Protagonist   Love Interest Falls in Love First   Low-key Protagonist   Medical Knowledge   Misunderstandings   Older Love Interests   Persistent Love Interests   Power Couple   Proactive Protagonist   Scientists   Slow Romance   Transmigration   Underestimated Protagonist   ",
	"rating": "(4.1 / 5.0, 108 votes)",
	"author": "Feng Jiu   封玖   ",
	"year": "\n2020",
	"ranking": "#369   #613   #2164   #881   #1213   ",
	"reviewcount": "32 Reviews sorted by",
	"description": "Duan Shu Tong transmigrated into an abusive romance story as the second male lead with the same name.\n\nThe second male lead was a playboy, but after meeting the female lead, he turned over a new leaf and dedicated his life to only loving one person.\n\nThe female lead gets injured, so the second male lead takes her to the hospital, but the one who takes her out of the hospital is the male lead.\n\nThe female lead is bullied, the second male lead appears in time to save the female lead, but the female lead throws herself into the male lead’s arms to cry;\n\nThe female lead gets pregnant and runs away with the baby, the second male lead accompanies her, but when the baby is born it comes with a pre-installed radar that only gets close to the male lead;\n\n... \n\nDuan Shu Tong was affected by the original book's plot and decided to give these opportunities to the 'deeply in love' third male lead who never got married in his lifetime.\n\nAs a result, the “deeply in love” third male lead pushes the female lead away and hands him a ring.\n\nDuan Shu Tong: …>"
}