{
	"url": "https://www.novelupdates.com/series/why-did-you-summon-me/",
	"title": "Why Did You Summon Me? - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2018/04/WhyDidYouSummonMe.jpg",
	"noveltype": "(CN)",
	"genre": "Adventure   Comedy   Fantasy   Harem   Xuanhuan   ",
	"tags": "Academy   Adopted Children   Alchemy   Angels   Aristocracy   Assassins   Astrologers   Automatons   Beautiful Female Lead   Blacksmith   Calm Protagonist   Caring Protagonist   Clever Protagonist   Clingy Lover   Confident Protagonist   Contracts   Curses   Cute Children   Demon Lord   Demons   Dense Protagonist   Destiny   Dragon Riders   Dragon Slayers   Dragons   Druids   Dwarfs   Elemental Magic   Empires   Evil Gods   Evil Religions   Fairies   Familial Love   Famous Protagonist   Fantasy World   Fox Spirits   Gate to Another World   God-human Relationship   God Protagonist   Godly Powers   Gods   Hiding True Abilities   Humanoid Protagonist   Inheritance   Kingdom Building   Late Romance   Loli   Love Interest Falls in Love First   Loyal Subordinates   Lucky Protagonist   Magic   Magic Formations   Magical Space   Magical Technology   Male Protagonist   Mature Protagonist   Mind Control   Misunderstandings   Modern Knowledge   Monsters   Multiple Identities   Multiple POV   Multiple Realms   Necromancer   Nobles   Overpowered Protagonist   Parent Complex   Parody   Persistent Love Interests   Polygamy   Priestesses   Prophecies   Protagonist Strong from the Start   Quirky Characters   Religions   Romantic Subplot   Royalty   Ruthless Protagonist   Schemes And Conspiracies   Souls   Spatial Manipulation   Spirit Advisor   Spirits   Strong Love Interests   Strong to Stronger   Student-Teacher Relationship   Sword And Magic   Time Manipulation   Time Skip   Time Travel   Transmigration   Transplanted Memories   Wars   Younger Love Interests   ",
	"rating": "(3.2 / 5.0, 108 votes)",
	"author": "Sixteenth Basket Of Mantaos   第十六笼馒头   ",
	"year": "\n2017",
	"ranking": "#2000   #2000   #1387   #6338   #4634   ",
	"reviewcount": "11 Reviews sorted by",
	"description": "Imagine being forced to live, after death, as incorporeal bodies trapped in a vast space of nothingness for thousands of years, with nothing to do but exchanging past memories with other cohabitants (read: weirdos). Everybody wanted out, but there was no way to leave the Void… \n\nUntil one day, a young man was finally summoned, as a powerful but reluctant mentor, by a bubbly and motivated but completely naive young girl. Baiyi, finally out of the Void, was the only one who could save all of the other 32 souls from their prison and his summoner might just be The Key to their freedom. \n\nHowever, Baiyi had to use the techniques and abilities the other souls had taught him throughout the years, and together with his own extensive knowledge of anime and game tropes from his shady and dangerous past as an otaku, to face the biggest challenge of them all: training the clumsy young girl he was forced to partner up with… into a competent sorcerer!\n\nThis is a story of heroic adventures, cunning strategies and romantic tales. How will our MC thrive in a world completely strange to him? Where will his ambitions and abilities take him in the palace?>"
}