{
	"url": "https://www.novelupdates.com/series/transmigrated-to-become-the-tyrants-male-concubine/",
	"title": "Transmigrated to become the Tyrant’s Male Concubine - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/10/Transmigrated-to-become-the-Tyrants-Male-Concubine.png",
	"noveltype": "(CN)",
	"genre": "Comedy   Drama   Fantasy   Romance   Yaoi   ",
	"tags": "Abusive Characters   Adultery   Ancient China   Ancient Times   Arranged Marriage   Assassins   Bickering Couple   Child Abuse   Complex Family Relationships   Cowardly Protagonist   Depictions of Cruelty   Disabilities   Eunuch   Family Conflict   First-time Interc**rse   Forced into a Relationship   Forced Marriage   Handsome Male Lead   Hidden Abilities   Incest   Lazy Protagonist   Love Interest Falls in Love First   Misunderstandings   Mpreg   Murders   Politics   Royalty   R*pe   Servants   Shameless Protagonist   Sibling Rivalry   Slow Romance   Special Abilities   Straight Uke   Strong Love Interests   Time Paradox   Timid Protagonist   Transmigration   Transported to Another World   Wishes   ",
	"rating": "(3.9 / 5.0, 70 votes)",
	"author": "Sweet And Greasy Millet Porridge   Tian Ni XiaoMiZhou   甜腻小米粥   ",
	"year": "\n2020",
	"ranking": "#400   #192   #4077   #608   #3417   ",
	"reviewcount": "12 Reviews sorted by",
	"description": "When he woke up, Wen Chi transmigrated into a book.\n\nIn the book, the protagonist accidentally obtained a system, and with the help of the system, he pretended to be sick and escaped his engagement with the disabled Crown Prince. Then, at the peach blossom banquet, he demonstrated his extraordinary talent and attracted the attention of the fourth prince…\n\nFinally, everything went well between the protagonist shou and the fourth prince and they fell in love very deeply. The fourth prince overthrew the rule of the previous emperors and became a model royal husband.\n\nHowever…….\n\nWen Chi transmigrated and became the cannon fodder brother of the protagonist shou, and he was the one who was forced to replace the protagonist to marry the disabled Crown Prince.\n\nIt was rumored that the disabled Crown Prince was burned by fire five years ago. Not only was his face disfigured, but his legs also ended up being disabled. He lived deep in the Eastern Palace and stayed behind closed doors all year round. He had a very strange temper.\n\nOnly Wen Chi knew that the disabled Crown Prince would still become the emperor and became a famous tyrant in history. Unfortunately, he was later killed by the fourth prince for being too cruel. Even the cannon fodder, he was not spared, and he ended up tragically.\n\nOn the wedding night, the disabled Crown Prince grabbed Wen Chi’s chin. He sneered: “Here comes another one who wants to step on me to climb up.”\n\nWen Chi in silent tears: “No, no, no. I’m only sitting around waiting to die.”\n\nThe disabled Crown Prince: “???”>"
}