{
	"url": "https://www.novelupdates.com/series/youve-got-the-wrong-house-villain/",
	"title": "You’ve Got The Wrong House, Villain - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/08/3620E76C-C0A5-4298-B3E8-7CFBE865540C.jpg",
	"noveltype": "(KR)",
	"genre": "Fantasy   Josei   Psychological   Romance   Sci-fi   Slice of Life   Supernatural   ",
	"tags": "Abandoned Children   Animal Characteristics   Apathetic Protagonist   Aristocracy   Assassins   Beautiful Female Lead   Calm Protagonist   Child Abuse   Cold Protagonist   European Ambience   Female Protagonist   Handsome Male Lead   Hiding True Identity   Human Experimentation   Kidnappings   Magical Technology   Male Yandere   Murders   Mutations   Obsessive Love   Organized Crime   Orphans   Power Couple   Protagonist Strong from the Start   Ruthless Protagonist   Secret Identity   Secret Organizations   Slow Romance   Special Abilities   Strong Love Interests   Transformation Ability   Transmigration   Werebeasts   ",
	"rating": "(4.4 / 5.0, 849 votes)",
	"author": "Margot   마르고트   ",
	"year": "\n2019",
	"ranking": "#675   #1399   #225   #154   #35   ",
	"reviewcount": "155 Reviews sorted by",
	"description": "As if it wasn’t enough for me to be reincarnated as a child in the slums, I was taken to a city of crime and became a test subject. \n\nBut then, when I saw the man that came to destroy the research institute, I realized that this was the world of an angst-filled reverse harem novel.\n\nWhile living a relatively normal life after escaping from the institute, the heroine of the novel moved in next door. \n\nFrom the looks of it, I might be the heroine’s neighbor extra. \n\nOriginally, the heroine was to save the unconscious and fatally wounded villain and in return, be subject to a fanatical obsession.\n\nBut, why. Why is the sub-villain collapsed in front of my house?\n\nThe sub-villain, Lakis Avalon, was the king of the underworld and the very same frightening man that I had met at the institute before.\n\n“…”\n\nI took a moment’s glance around then I kicked the man’s body away.\n\nYou’ve got the wrong house, Villain.>"
}