{
	"url": "https://www.novelupdates.com/series/isaac/",
	"title": "Isaac - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/03/Chue-Mong-Gak.jpg",
	"noveltype": "(KR)",
	"genre": "Action   Comedy   Drama   Fantasy   Mystery   Psychological   School Life   Tragedy   ",
	"tags": "Academy   Age Progression   Alternate World   Angels   Antihero Protagonist   Apathetic Protagonist   Appearance Different from Actual Age   Aristocracy   Army   Arrogant Characters   Beastkin   Betrayal   Bullying   Business Management   Businessmen   Calm Protagonist   Clever Protagonist   Comedic Undertone   Confident Protagonist   Conflicting Loyalties   Criminals   Cruel Characters   Cunning Protagonist   Dark   Demons   Depictions of Cruelty   Dragons   Dwarfs   Elves   Enemies Become Allies   European Ambience   Family Conflict   Fantasy World   Firearms   Friendship   Hard-Working Protagonist   Industrialization   Interdimensional Travel   Lazy Protagonist   Lucky Protagonist   Magic   Magical Technology   Male Protagonist   Management   Manipulative Characters   Mature Protagonist   Mercenaries   Merchants   Modern Knowledge   Multiple Realms   Multiple Reincarnated Individuals   Multiple Transported Individuals   Murders   Mysterious Past   Nobles   Organized Crime   Orphans   Past Plays a Big Role   Politics   Pragmatic Protagonist   Previous Life Talent   Psychopaths   Revenge   Royalty   Ruthless Protagonist   Salaryman   Schemes And Conspiracies   Secret Organizations   Secrets   Shameless Protagonist   Suicides   Survival   Sword And Magic   Terrorists   Time Skip   Torture   Transmigration   Transported to Another World   Twisted Personality   Unlucky Protagonist   Wars   Weak Protagonist   Werebeasts   ",
	"rating": "(4.1 / 5.0, 584 votes)",
	"author": "Chue Mong Gak   취몽객   ",
	"year": "\n2016",
	"ranking": "#874   #817   #460   #1028   #487   ",
	"reviewcount": "110 Reviews sorted by",
	"description": "Insane. Traitor. Terrorist. \n\nThe title given to Joon-young, a soldier who fought a lost war. Performing the most devious last stand befitting his titles, his memories were sent to another world. \n\nNow named Isaac, he seeks to live out his days in relative peace. But with his family wanting him dead he is sent to the Campus, the Empire’s greatest centre of Education, in hopes that he would be expelled and tarnish his position as the heir of his family. \n\nHe is told that the school will treat him as if he doesn’t exist, that he isn’t protected by its rules. But Isaac, or Joon-young, sees it differently. \n\nThere are no rules to hold him back from getting what he wants.>"
}