{
	"url": "https://www.novelupdates.com/series/the-npc-was-once-again-frightened-by-me/",
	"title": "The NPC Was Once Again Frightened By Me - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/12/The-NPC-Was-Once-Again-Frightened-By-Me.jpeg",
	"noveltype": "(CN)",
	"genre": "Action   Comedy   Horror   Mystery   Shounen Ai   Supernatural   ",
	"tags": "Alternate World   Amnesia   Bickering Couple   Carefree Protagonist   Clever Protagonist   Ghosts   Humanoid Protagonist   Multiple Realms   Power Couple   Protagonist Strong from the Start   Survival Game   Thriller   Unlimited Flow   World Hopping   ",
	"rating": "(4.2 / 5.0, 62 votes)",
	"author": "Su Xing Chuan   宿星川   ",
	"year": "\n2019",
	"ranking": "#2000   #3032   #6891   #8802   #4844   ",
	"reviewcount": "4 Reviews sorted by",
	"description": "Lin Huai considered himself to be a perfectly ordinary university student; he loved studying science and living life, and just like any other perfectly ordinary person he loved living people and he used novels and tv dramas to cope with his lack of common sense.\n\nYes, apart from having been a well dwelling revenant who devoured an entire city full of ghosts and then possessed a student’s corpse, Lin Huai was absolutely perfectly ordinary.\n\nAt the moment his only concern is living a peaceful life. And occasionally mending his skull.\n\nThat was until he discovered the apartment he’d been planning on renting was declared uninhabitable. The note on the foyer table read: “There is a ghost amongst you people. If you catch this ghost all of you may survive.”\n\nLin Huai: ? I really only wanted to rent a room…\n\n“Don’t worry, newbie.” A hand rested on Lin Huai’s weak, pitiful and helpless shoulder, “I’ll protect you.”\n\nLin Huai nodded his head, touched.\n\nAnd then that man, whose name was Chu Tianshu, gave Lin Huai a refreshing smile.\n\n“I’ll come quickly and hammer that ghost!”\n\nLin Huai: (slight smile) …I’ll have to hammer you first though, okay?\n\nSome time later, Lin Huai was dutifully dragging a wraith that was screaming and struggling to escape which made it hard work for him to knock on the door with his shoulder.\n\n“Help! Help! It’s trying to get away! Wait… I can’t get away!”>"
}