{
	"url": "https://www.novelupdates.com/series/prodigiously-amazing-weaponsmith/",
	"title": "Prodigiously Amazing Weaponsmith - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2017/03/PAW.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Drama   Gender Bender   Romance   Xianxia   ",
	"tags": "Academy   Alchemy   Ancient China   Arrogant Characters   Artifacts   Beast Companions   Beautiful Female Lead   Betrayal   Black Belly   Calm Protagonist   Clever Protagonist   Crafting   Cultivation   Cunning Protagonist   Devoted Love Interests   Doting Love Interests   Female Protagonist   Genius Protagonist   Handsome Male Lead   Love Interest Falls in Love First   Lovers Reunited   Magical Space   Money Grubber   Past Plays a Big Role   Persistent Love Interests   Pets   Phoenixes   Power Couple   Ruthless Protagonist   Shameless Protagonist   Slow Growth at Start   Slow Romance   Smart Couple   Strong Love Interests   Tragic Past   Transmigration   Unique Cultivation Technique   Weak to Strong   ",
	"rating": "(3.5 / 5.0, 264 votes)",
	"author": "Shui Qingqing   水卿卿   ",
	"year": "\n2016",
	"ranking": "#2000   #3089   #249   #7852   #1109   ",
	"reviewcount": "33 Reviews",
	"description": "When trash becomes a genius—one word: Fierce! Two words: Two-faced! Three words: Too heaven defying!\n\nShe is the foremost and outstanding armament refining master. Passing through a dynasty, and became a publicly humiliated and bullied Third Young Miss. Ancient beasts, too outrageous? Obediently become a docile pet, or I’ll make you into soup!\n\nNinth rank talent, rare talent in a thousand years? She was born with a godly constitution, crushing all geniuses!\n\nPeak level Profound Grade Armament, beyond priceless? Sorry to embarrass, but the bowl she uses to feed the cat is already at the God Grade….. she possessed a pair of eyes that could see through everything, yet she couldn’t see through—him!\n\nMerely exposing his demonic smile, Prince Mou lightly loosened his belt: “Can’t see through? Do not fret, you can slowly view when you return to the room. I’ll allow you to scrupulously inspect from head to toe.”>"
}