{
	"url": "https://www.novelupdates.com/series/qingge-rebirth/",
	"title": "Qingge - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2017/10/006ry7vfgy1ff4ry7n52tj315o1jkgsk.jpg",
	"noveltype": "(CN)",
	"genre": "Fantasy   Romance   Shounen Ai   ",
	"tags": "College/University   Confident Protagonist   Cute Protagonist   Devoted Love Interests   Handsome Male Lead   Love at First Sight   Modern Day   Past Plays a Big Role   Reincarnation   Second Chance   Sickly Characters   Weak Protagonist   Wealthy Characters   ",
	"rating": "(4.0 / 5.0, 113 votes)",
	"author": "戏楼蒹葭   ",
	"year": "\n2017",
	"ranking": "#5262   #2000   #3395   #8979   #2417   ",
	"reviewcount": "16 Reviews sorted by",
	"description": "Lin Qingge’s body was pathetically weak, so weak that just taking a few steps would make him gasp for breath. His own family treated him like he didn’t exist. His birth mother died when he was young and his father promptly remarried and knocked his stepmom up. His father didn’t like him, his stepmom looked askance at him and his step siblings coveted his position. Who told him to be the lawful eldest with inheritance rights?\r\n\r\nWhen Lin Qingge was eighteen he came out of the closet, creating a huge rift between him and his family. It was all for that guy, Liu Yang. He’d whispered sweet nothings in his ear, saying things like he’d protect him and bs like that. Lin Qingge’s old man blew his top when he found out and promptly disowned him. That didn’t matter to Lin Qingge, he had Liu Yang afterall. He fully believed in that guys words and goodwill.\r\n\r\nIf only he wasn’t so stupid…\r\n\r\nUltimately Liu Yang was like a vampire sucking his wealth dry, leaving a husk behind. After pushing Liu Yang to a high position, Lin Qingge finally collapsed in his apartment. It was a sad sorry sight. Closing his eyes, he knew this was the end of him. Who knew he would wake up instead in a different time and a different place?\r\n\r\nEh? What’s this? Well fine! This time I’m gonna hug that brother’s thigh real tight and never let go!>"
}