{
	"url": "https://www.novelupdates.com/series/marchen-for-a-villain/",
	"title": "Märchen For A Villain - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/01/Mrchen-For-A-Villain.jpeg",
	"noveltype": "(KR)",
	"genre": "Drama   Fantasy   Mystery   Romance   ",
	"tags": "Beautiful Female Lead   European Ambience   Female Protagonist   Folklore   Handsome Male Lead   Love Interest Falls in Love First   Marriage   Marriage of Convenience   Reincarnation   Time Travel   Transmigration   Villainess Noble Girls   ",
	"rating": "(3.8 / 5.0, 18 votes)",
	"author": "제퓨어   ",
	"year": "\n2022",
	"ranking": "#2000   #2000   #8301   #11905   #7538   ",
	"reviewcount": "2 Reviews sorted by",
	"description": "\r\n\r\nShe possessed Isabelle, the princess of a neighboring country who married the Prince in the fairy tale 'The Little Mermaid.” However, the Princess, who she thought was simply playing a supporting role, was a well known villain on the continent. Moreover, even though with the time limit of the day of her death, she continued to live.\r\n\r\n\r\n \r\n‘Are you playing with people? No matter how God exists, this is not right.'\r\n\r\n\r\nWhen she came back to life the fourth time due to His will, she ran away, dreaming of a safe farewell to the Little Mermaid.\r\n\r\nHowever, Snow White and the Grand Duke that turned into a beast appeared, and the clock that appeared in every regression was Hook's.\r\n\r\n\r\n\r\n\r\n‘Wasn't this the original version of 'The Little Mermaid” ? I have never seen a fairy tale like this!’\r\n\r\n\r\nWhatever the original story was about, it was a default fact that death repeated itself, and after this happened, she made a contract marriage with a Grand Duke who turned into a beast at night to guarantee her safety until the day she died.\r\n\r\n\r\nBut..... This man was a bit strange.\r\n\r\n\r\n\r\n'Isn’t the Princess already a Grand Duchess?' \r\n\r\n\r\n\r\n'Grand….Duchess?”\r\n\r\n\r\n“In the meantime, did you forget our wedding night?”\r\n\r\n\r\n***\r\n\r\nThis novel has various elements of fairy tales Beauty and The Beast, Snow White, The Little Mermaid, The Wizard of Oz.\r\n>"
}