{
	"url": "https://www.novelupdates.com/series/mayday-mayday-mayday/",
	"title": "Mayday Mayday Mayday - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/11/Mayday-Mayday-Mayday.jpg",
	"noveltype": "(KR)",
	"genre": "Action   Adult   Comedy   Drama   Mature   Romance   Smut   Yaoi   ",
	"tags": "Adapted to Drama CD   Adapted to Manhwa   Amnesia   Arms Dealers   Cautious Protagonist   Character Growth   Cohabitation   Couple Growth   Devoted Love Interests   Early Romance   Family Conflict   Flashbacks   Love Interest Falls in Love First   Modern Day   Organized Crime   Past Plays a Big Role   Past Trauma   Possessive Characters   R-18   Strong Love Interests   Time Skip   Timid Protagonist   Wealthy Characters   ",
	"rating": "(3.8 / 5.0, 14 votes)",
	"author": "그웬돌린   ",
	"year": "\n2010",
	"ranking": "#2000   #2000   #10225   #12558   #8764   ",
	"reviewcount": "No Reviews",
	"description": "The protagonist Vasily Ivanovich Kaminsky (Vasya) is the president of a private security company, but is the boss of the Red Mafia. He interests Eun-han with his handsome face and appearance that was enough to walk on the runway as a model.\n\nThe Lead Yoon Eunhan.\n\nA money launderer who settled in Miami after many twists and turns and lives a good life. In front of the vicious Red Mafia boss Kaminsky, he trembles like a rabbit, but in fact, he is famous in the gay society as a demonic bottom.\n\nStory\n\nYoon Eun-han, who left Korea when he was kicked out due to an unfortunate incident 10 years ago, is enjoying a stable life as a money launderer in Miami, USA.\n\nThe only unsettling factor in his life is his main customer, Red Mafia boss Vasily Kaminsky. In fact, in terms of appearance and body shape, he was a exactly Eun-han’s type, but unlike his monk-like appearance, he was the boss of a brutal mafia. He was someone who thought that getting rid of problems was easier than lifting a finger. He was afraid that he was interested in Eun-han, and after hearing information from his subordinate that Kaminsky is ‘Bi’, he raises his level of vigilance… but the goddess of fate was not so merciful to Eun-han.\n\nEun-han’s life, who prided himself on not committing any major crimes and living a modest life until now, suddenly turned upside down after 10 years and started to get more twisted after the appearance of his cousin Sung-han, and Kaminsky spurs his fate even more…\n\n“Live wisely. okay?”>"
}