{
	"url": "https://www.novelupdates.com/series/the-witch/",
	"title": "The Witch - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/04/The-Witch.jpeg",
	"noveltype": "(CN)",
	"genre": "Romance   Supernatural   Xuanhuan   ",
	"tags": "Arranged Marriage   Cold Love Interests   Cute Protagonist   Doting Love Interests   Exorcism   Female Protagonist   Ghosts   Handsome Male Lead   Magic   Modern Day   Nightmares   Overpowered Protagonist   Protagonist Falls in Love First   Protagonist Strong from the Start   Quirky Characters   Witches   ",
	"rating": "(4.6 / 5.0, 102 votes)",
	"author": "Grumpy Crab   暴躁的螃蟹   ",
	"year": "\n2020",
	"ranking": "#292   #298   #2402   #518   #3383   ",
	"reviewcount": "24 Reviews sorted by",
	"description": "Wu Miaomiao was the last in line of the Witch Clan. When she was 2 years old, her master found her a fiancé. When she was 18 years old, she felt that it was time to meet with this fiancé. And so, she carried her school bag and took the train into the city.\n\n“My dearest husband, come follow me back to the mountains.”\n\nJi Lang was amused. Amongst the ghosts he had met, this was the first time he met one who came to groomnap.\n\n“In that case, shouldn’t we first have our nuptial night?” said Ji Lang. Wu Miaomiao tilted her head. She felt it was logical and headed home with her husband.\n\nJi Lang was the reincarnation of Ephialtes. It was said that if he was to be fully awakened, he would possess the powers to drown the entire human population in their nightmares. He could enter into anybody’s dreams, probe into their dreamscapes and pry into their deepest secrets.\n\nBecause of this ability, for these 20 years, Ji Lang could not have a good night's sleep. He was forced to sink into all sorts of nightmares till the day he met the girl from the Witch Clan. On the first day he met her, he slept on her bed.\n\nJi Lang: “You said that you are my wife? (I finally can have a proper sleep (#^.^#))”\n\nThe people from the metaphysical world feared the power of Ephialtes. They were constantly wary of him fully awakening his powers and destroying the world afterwards. They planted spies near him to put an end to him upon signs of his awakening.\n\nWu Miaomiao: “I heard that you people want to bully my dearest husband, I will curse you all oh~~~”\n\nJi Lang: (#^.^#)\n\nBig shots from the metaphysical world: “When are the two of you going to divorce?”\n\nJi Lang: “Do you want to die?”\n\nNote: Ephialtes – A nightmare/demon who causes nightmares>"
}