{
	"url": "https://www.novelupdates.com/series/never-die-extra/",
	"title": "Never Die Extra - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/08/8DDB5642-D451-491E-8016-EB3D88ECF809.jpeg",
	"noveltype": "(KR)",
	"genre": "Adventure   Comedy   Fantasy   Harem   Mystery   Shounen   Slice of Life   Supernatural   ",
	"tags": "Adapted to Manhwa   Adventurers   Age Progression   Alchemy   Aristocracy   Army Building   Artifacts   Beast Companions   Beautiful Female Lead   Brother Complex   Business Management   Butlers   Caring Protagonist   Cautious Protagonist   Character Growth   Charismatic Protagonist   Charming Protagonist   Cheats   Clever Protagonist   Curses   Cute Protagonist   Demi-Humans   Demons   Doting Older Siblings   Doting Parents   Dragons   Dungeons   Dwarfs   Elves   Familial Love   Family   Fantasy Creatures   Fantasy World   First-time Interc**rse   Game Elements   God Protagonist   Gods   Grinding   Handsome Male Lead   Hard-Working Protagonist   Incest   Inferiority Complex   Lack of Common Sense   Level System   Loyal Subordinates   Magic Beasts   Maids   Male Protagonist   Master-Servant Relationship   Misunderstandings   Monster Tamer   Monsters   Multiple POV   Nobles   Obsessive Love   Older Love Interests   Overpowered Protagonist   Pharmacist   Polygamy   Pregnancy   Reincarnated in a Game World   Reluctant Protagonist   Royalty   Schemes And Conspiracies   Servants   S*aves   Strong to Stronger   Sword And Magic   Time Paradox   Time Skip   Time Travel   Transmigration   Transplanted Memories   Transported into a Game World   Transported to Another World   Weak to Strong   Yandere   Younger Love Interests   ",
	"rating": "(3.8 / 5.0, 598 votes)",
	"author": "Toika   Toy Car   토이카   ",
	"year": "\n2019",
	"ranking": "#2566   #1820   #355   #55   #524   ",
	"reviewcount": "122 Reviews",
	"description": "Extras die every day in various ways in the game [Yo-Ma Great War 3].\n\nHe was an extra when he reincarnated into the game.\n\nI’ll never die. Never.\n\n“Let’s get started.”\n\nEvan had come to a conclusion. He tapped his cheeks as a way of signaling to himself that he had made up his mind.\n\nHe would become a character who never dies.>"
}