{
	"url": "https://www.novelupdates.com/series/ill-become-the-female-lead-in-this-trashy-webnovel/",
	"title": "I’ll Become the Female Lead in this Trashy Webnovel - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/07/Ill-Become-the-Female-Lead-in-this-Trashy-Webnovel.png",
	"noveltype": "(KR)",
	"genre": "Comedy   Drama   Fantasy   Romance   ",
	"tags": "Aristocracy   Beautiful Female Lead   Character Growth   Charming Protagonist   Comedic Undertone   Determined Protagonist   Devoted Love Interests   European Ambience   Female Protagonist   First Love   First-time Interc**rse   Handsome Male Lead   Jealousy   Love Interest Falls in Love First   Love Triangles   Male Yandere   Marriage   Misunderstandings   Nobles   Obsessive Love   Possession   Possessive Characters   Power Couple   R-15   Reverse Harem   Royalty   Special Abilities   Strong Love Interests   Transmigration   Transported to Another World   Villainess Noble Girls   Weak to Strong   Yandere   ",
	"rating": "(3.3 / 5.0, 15 votes)",
	"author": "어서왕   ",
	"year": "\n2022",
	"ranking": "#2261   #1468   #10153   #3276   #9242   ",
	"reviewcount": "1 Review sorted by",
	"description": "The novel I wrote became a mess.\r\n\r\nI had possessed Ariad, the beautiful hoe that had already mixed her body fluids with countless men.\r\n\r\nSince this had already happened, I had no choice but to make Ariad the female lead of my web novel.\r\n\r\nAll my characters had already gone wild while running full steam ahead as I struggled to save the novel's tearful survival.\r\n\r\n“You are mine. No one is allowed to touch you.”\r\n\r\nI have to connect with the male lead fast, but why did the second male lead have to keep checking the third leg inside his pants?\r\n\r\n“I love it when I see your face contort from the pain, Ariad. I want to be right beside you while you suffer and die.”\r\n\r\nYou have to be loved to become a female lead but who said that love isn’t a bitch?\r\n\r\nThe male lead was nothing but possessive.\r\n\r\n“I feel sorry for Joshua. Please divorce me.”\r\n\r\nThe existing female lead, who was supposed to have a kind and refreshing character, got blinded by unrequited love that she couldn’t see anything else.\r\n\r\nCan I properly complete this messed-up novel?\r\n\r\nReaders, I'm working hard here, so please don't leave me!>"
}