{
	"url": "https://www.novelupdates.com/series/kingdoms-bloodline/",
	"title": "Kingdom’s Bloodline - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2018/02/Kingdom’s-Bloodline.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Drama   Fantasy   Mature   Psychological   Seinen   Tragedy   ",
	"tags": "Adapted to Manhua   Age Progression   Archery   Army   Betrayal   Calm Protagonist   Caring Protagonist   Child Protagonist   Clever Protagonist   Complex Family Relationships   Dark   Depictions of Cruelty   Determined Protagonist   Discrimination   Domestic Affairs   Elves   Enemies Become Allies   Famous Parents   Gods   Gore   Guilds   Handsome Male Lead   Kingdoms   Knights   Leadership   Loli   Loyal Subordinates   Magic   Male Protagonist   Manipulative Characters   Medieval   Modern Knowledge   Monsters   Multiple POV   Orcs   Orphans   Politics   Reincarnated in Another World   Religions   Royalty   Schemes And Conspiracies   Special Abilities   Strategic Battles   Strategist   Survival   Vampires   Wars   Weak to Strong   Witches   Wizards   World Travel   ",
	"rating": "(3.9 / 5.0, 242 votes)",
	"author": "Masterless Sword   无主之剑   ",
	"year": "\n2016",
	"ranking": "#1380   #1046   #2377   #3298   #3304   ",
	"reviewcount": "53 Reviews sorted by",
	"description": "A lowly child beggar, a noble prince, a monster viewed as the enemy of the entire world. If you possess all three identities at the same time, which identity would you choose to help you earn a better ending?\n\nThales did not have the answer.\n\nHe only knew that he came to a different and magnificent world, and he had to face a future that was as difficult to handle as a nightmare.\n\nThe glorious Empire had already been destroyed for one thousand years, the dying royal family suffered many problems, the legendary sacred battle had plenty of conspiracies, the divided world was in chaos.\n\nBut Thales had nothing.\n\nThe only thing he had left was an unswerving determination to preserve his own identity, bravery which would allow him to survive in a perilous situation, and a belief that he would never submit to principles he did not believe.\n\n“A King does not gain respect by virtue of his bloodline. The bloodline's glory rests on the deeds of the King.”\n\nDarkness will baptize light. Fire will create true steel. The forbidden prince’s story starts here.>"
}