{
	"url": "https://www.novelupdates.com/series/i-am-overlord/",
	"title": "I Am Overlord - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/04/iamobarodo1b.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Comedy   Ecchi   Fantasy   Harem   Martial Arts   Mature   Xuanhuan   ",
	"tags": "Absent Parents   Adapted to Manhua   Army Building   Arrogant Characters   Battle Academy   Beast Companions   Beautiful Female Lead   Betrayal   Bloodlines   Brother Complex   Brotherhood   Character Growth   Charismatic Protagonist   Charming Protagonist   Confident Protagonist   Cultivation   Death of Loved Ones   Doting Parents   Dragons   Dwarfs   Eidetic Memory   Enemies Become Allies   Enemies Become Lovers   Famous Parents   Fantasy World   Friends Become Enemies   Friendship   Genius Protagonist   God Protagonist   Godly Powers   Handsome Male Lead   Hard-Working Protagonist   Harsh Training   Inheritance   Invisibility   Love at First Sight   Love Interest Falls in Love First   Love Rivals   Lovers Reunited   Loyal Subordinates   Lucky Protagonist   Magical Space   Male Protagonist   Marriage   Master-Disciple Relationship   Mysterious Family Background   Mythical Beasts   Narcissistic Protagonist   Outer Space   Perverted Protagonist   Phoenixes   Polygamy   Pregnancy   Reincarnation   Revenge   Shameless Protagonist   Siblings Not Related by Blood   S*aves   Strength-based Social Hierarchy   Strong Love Interests   Strong to Stronger   Time Manipulation   Time Skip   Weak to Strong   Younger Sisters   ",
	"rating": "(3.0 / 5.0, 102 votes)",
	"author": "I Am Pure   Wo BenChunJie   我本纯洁   ",
	"year": "\nN/A",
	"ranking": "#2836   #4680   #1075   #2292   #4990   ",
	"reviewcount": "7 Reviews sorted by",
	"description": "Xiang Shaoyun is the young master of an influential and powerful sect and is blessed with an extreme latent talent in martial cultivation. From talent comes confidence, and from confidence comes a declaration to give all the so-called geniuses a head start of ten years before catching up to them.\r\n\r\nTen years later, Xiang Shaoyun appears at a tiny sect of a tiny town. Betrayed and disgraced by his own sect, he is penniless and powerless, his cultivation level lower than his peers’ due to the ten-year vow. Now to reclaim the glory he once had, he must climb to the top from the very bottom.\r\n\r\nWitness and join Xiang Shaoyun’s adventure in his rise to glory.>"
}