{
	"url": "https://www.novelupdates.com/series/he-likes-me-a-lot-more-than-i-thought/",
	"title": "He Likes Me a Lot More Than I Thought! - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/07/He-Likes-Me-a-Lot-More-Than-I-Thought.jpg",
	"noveltype": "(KR)",
	"genre": "Fantasy   Romance   ",
	"tags": "Age Progression   Aristocracy   Childcare   Childhood Friends   Childhood Love   Cute Protagonist   Depression   European Ambience   Female Protagonist   Love Interest Falls in Love First   Nobles   Reincarnated in Another World   Reincarnation   Slow Romance   ",
	"rating": "(4.0 / 5.0, 48 votes)",
	"author": "Yemaro   예마로   ",
	"year": "\n2021",
	"ranking": "#1632   #162   #4305   #2403   #3563   ",
	"reviewcount": "8 Reviews sorted by",
	"description": "I was reincarnated in a child-rearing novel and met the male lead in his miserable childhood. \r\n\r\nAlthough he might’ve eventually found his way to happiness without my help, I couldn’t shake off the image of that trembling young boy with cracked lips. I saved him and returned him to his parents, a young couple that ruled over a duchy, who had desperately been searching for him and were about to meet their early deaths. \r\n\r\n“Rwen, I really like you.”\r\n“Yeah, I like you too.”\r\n“Yeah!”\r\n\r\nBut he liked me too much. \r\n\r\nAlthough it was uncomfortable to have a young child stick to me like glue, I’d rather have him smile prettily than cry. No matter how much he liked me now, it wasn't like he would even act like he knew me when he grew up. \r\n\r\nThen, five years later…\r\n\r\n“You’re so pretty today, Rwen. I like you a lot. I really like you.”\r\n“Yeah.”\r\n\r\n10 years later…..\r\n\r\n“Arwen, congratulations on graduating. I like you.”\r\n“Y-Yeah.”\r\n\r\nWait, hold up. Why do you still like me?\r\n\r\nThe young kid, who had already grown up into a fine man, proposed to me. I was shocked, of course. I was the daughter of a lowly viscount, and he was the heir to a dukedom. As much as his parents adored me, they wouldn’t accept me to that extent…\r\n\r\n“Arwen, welcome. The treasury is over there, and here’s the key.”\r\n“Goodness, I can’t believe you’re becoming my daughter-in-law, Arwen! Now this mister -- ah, no, father-in-law -- can die without any regrets!”\r\n\r\n...Would they?>"
}