{
	"url": "https://www.novelupdates.com/series/transmigrated-as-a-second-male-lead-while-grabbing-the-protagonists-white-moonlight/",
	"title": "Transmigrated As A Second Male Lead While Grabbing the Protagonist’s White Moonlight - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/09/Transmigrated-As-A-Second-Male-Lead-While-Grabbing-the-Protagonists-White-Moonlight.jpg",
	"noveltype": "(CN)",
	"genre": "Romance   Sports   Yaoi   ",
	"tags": "Doting Love Interests   Doting Older Siblings   e-Sports   Gamers   Love Interest Falls in Love First   Modern Day   Online Romance   Seme Protagonist   System Administrator   Transmigration   ",
	"rating": "(3.7 / 5.0, 25 votes)",
	"author": "Mi Jiu Xun   觅九寻   ",
	"year": "\n2021",
	"ranking": "#2000   #2000   #8606   #9890   #6728   ",
	"reviewcount": "2 Reviews sorted by",
	"description": "Qi Yi was a game technology anchor before his death, and entered the world of novels after his death.\n\nIn this world, he is a gentle, handsome, golden and affectionate second male lead. A stepping stone for the protagonist.\n\nHe had to go through the plot, and at the same time he was busy with his career, just to not be too miserable in the finale.\n\nSo he started to be an anchor. On the first day of the broadcast, a big guy came to his live broadcast room and directly made him number one in the new anchor list!\n\nThis so-called fate is indescribable. He added contact information of this big guy, and took him to play games every day.\n\nAfter he became popular, his elder brother found out about his live broadcast. Not only did his elder brother not disagree, but he even grabbed the top spots on the supporter list along with the big boss.\n\nAs a last resort, he confessed his gender to the boss, and then the boss disappeared.\n\nLater, he met someone who was the protagonist’s white moonlight, and they got along well.\n\nTo his surprise, he was contacted by the boss again and was asked how to chase people.\n\nHe taught him the method, but he didn’t expect that it would be used on him.\n\nSo he was with the protagonist’s white moonlight.>"
}