{
	"url": "https://www.novelupdates.com/series/phoenix-destiny/",
	"title": "Phoenix Destiny - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2017/11/phoenix-destiny.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Fantasy   Martial Arts   Romance   Shoujo   Xianxia   ",
	"tags": "Abandoned Children   Absent Parents   Alternate World   Ancient China   Anti-social Protagonist   Beautiful Female Lead   Clever Protagonist   Cold Protagonist   Cultivation   Cunning Protagonist   Fast Cultivation   Fast Learner   Female Protagonist   Game Elements   Genius Protagonist   Handsome Male Lead   Hard-Working Protagonist   Inheritance   Love Interest Falls in Love First   Magical Space   Male Yandere   Modern Knowledge   Multiple Personalities   Multiple Realms   Obsessive Love   Personality Changes   Revenge   Ruthless Protagonist   Schemes And Conspiracies   Slow Romance   Strength-based Social Hierarchy   Weak to Strong   ",
	"rating": "(4.2 / 5.0, 198 votes)",
	"author": "Yun Ji   云芨   ",
	"year": "\n2016",
	"ranking": "#2000   #2000   #1206   #6712   #2153   ",
	"reviewcount": "27 Reviews sorted by",
	"description": "Lu Mingshu had never believed in fate.\n\nShe hadn’t believed in it when her father had remarried and caused her family to break into pieces, nor had she believed in it when she’d been thrown into a valley to perish.\n\nShe hadn’t believed in it when she didn’t have any resources to cultivate with, nor had she believed in it when she’d been condemned by everyone.\n\nShe climbed up little by little from dust, while her reign soared into the sky, which caused the world to look on in fear!\n\nIf justice doesn’t come, I’ll personally obtain it.\n\nIf fate disregards me, I‘ll open up a way to survive.\n\nNo matter what fate throws at me, I will surely become a phoenix!\n\n“What a ruthless woman. I’m willing to risk my life and limbs for you, willing to be calculative for you – I’m even willing to be an enemy of the entire world for you. Aren’t you moved even a little?”\n\n“That's right, since I‘m such a ruthless woman, what exactly is it that you like about me?”>"
}