{
	"url": "https://www.novelupdates.com/series/i-once-broke-an-oath/",
	"title": "I Once Broke An Oath - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/08/I-Once-Broke-An-Oath.jpeg",
	"noveltype": "(KR)",
	"genre": "Drama   Fantasy   Romance   Shoujo   ",
	"tags": "Adapted to Manhwa   Age Regression   Aristocracy   Beautiful Female Lead   Broken Engagement   European Ambience   Female Protagonist   Handsome Male Lead   Magic   Nobles   Reincarnation   ",
	"rating": "(3.5 / 5.0, 15 votes)",
	"author": "Flowing Honey   Honey Dripping   Honey Flows   꿀이흐르는   ",
	"year": "\n2020",
	"ranking": "#2000   #2000   #9308   #7989   #7398   ",
	"reviewcount": "3 Reviews sorted by",
	"description": "Ezette, the eighth prince of the Empire who was thought to have died, returned alive. His return which intertwined with the Crown Prince's suicide left the Empire in turmoil.\r\n\r\nMeanwhile, Diarin, a doll-like and immature woman with unwitting love who is known as a beautiful marionette, moves as the Duke instructed. She heads to Ezette at the Duke’s order, which is to carry on their engagement.\r\n\r\nThe following words she said were different from what she thought she’d say.\r\n\r\n“I’ll break our engagement.”\r\n\r\n~*~\r\n\r\nDiarin leaned towards Ezette to make it look as natural as possible.\r\n\r\n“I’ll break our engagement.”\r\n\r\nThe knight immediately replied, ‘what?' and was about to ask more.\r\n\r\nBut Ezette, on the other hand, had an odd expression. Thanks to her keen awareness, Diarin was able to catch his expression. Ezette never took his eyes off her.\r\n\r\nEzette asked,\r\n\r\n“Is that what Duke Conkel wants?'\r\n\r\nThe sentence was spoken in a quiet voice, much like Diarin’s. No one, except the knight, could hear the conversation.\r\n\r\n“No way. Do you really think the Duke would let you go? If he could, the Duke would've tied your legs together with a rope.'\r\n\r\n“Then, why?”\r\n\r\nDiarin said in a small voice as if ice would break if she spoke any louder.\r\n\r\n“It’s what I want.”>"
}