{
	"url": "https://www.novelupdates.com/series/kekkon-shoya-no-deathloopnosuji-reijou-wa-nando-shindemo-megemasen/",
	"title": "Kekkon Shoya no Deathloop~Nosuji Reijou wa Nando Shindemo Megemasen~ - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/07/Kekkon-Shoya-no-Deathloop-Cover.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Fantasy   Mystery   Psychological   Romance   Shoujo   ",
	"tags": "Aristocracy   Arranged Marriage   Assassins   Clumsy Love Interests   Comedic Undertone   Determined Protagonist   Fearless Protagonist   Female Protagonist   Hard-Working Protagonist   Hot-blooded Protagonist   Lack of Common Sense   Misunderstandings   Murders   Nobles   Precognition   R-15   Secrets   Time Loop   Tomboyish Female Lead   Unlucky Protagonist   ",
	"rating": "(3.4 / 5.0, 13 votes)",
	"author": "Kogeta Shuumai   焦田 シューマイ   ",
	"year": "\n2019",
	"ranking": "#2000   #2000   #9577   #8228   #7571   ",
	"reviewcount": "2 Reviews sorted by",
	"description": "One day, Katrea, the youngest and only daughter of a countryside noble received a suspicious marriage offer from one of the most prestigious aristocratic family in the country, the Vrag family. \n\nBlinded by his good looks, wealth and closeness in age, all these great conditions, Katrea agreed without a second thought. However, the Duke appeared particularly cold towards her on their first meeting, like he was completely uninterested in his bride. And on the day of their wedding, she overheard the Duke mocking her family with his friends. \n\nEnrage by that, Katrea exploded and refused to engage in the various activities of a wedding night. But she was eventually forced into his bedroom and died before she could process what had happened. \n\n「Eh? I came back to life?」\n\nShe should be dead, but when she opened her eyes, she had somehow gone back in time, right before she left for the Duke’s bedroom. Katrea actually looped back on the worst wedding night ever!\n\nEvery time she died, she would loop back to the start of this terrible night.\n\nCan this simple-minded Ojou-sama overcome the deathloop?>"
}