{
	"url": "https://www.novelupdates.com/series/evade-the-hero-and-flee/",
	"title": "Evade The Hero and Flee! - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2017/10/Running-Away-From-The-Hero.jpg",
	"noveltype": "(KR)",
	"genre": "Action   Adventure   Comedy   Fantasy   Harem   Slice of Life   ",
	"tags": "Academy   Adapted to Manhwa   Adopted Children   Antihero Protagonist   Artifacts   Beautiful Female Lead   Betrayal   Cautious Protagonist   Clever Protagonist   Cunning Protagonist   Demons   Dragons   Dwarfs   Elves   Evil Organizations   Family   Fantasy World   Gods   Hard-Working Protagonist   Heroes   Hiding True Identity   Kingdoms   Knights   Lack of Common Sense   Love Interest Falls in Love First   Male Protagonist   Mature Protagonist   Misunderstandings   Multiple Identities   Multiple POV   Mysterious Past   Nobles   Obsessive Love   Older Love Interests   Parent Complex   Reincarnated in Another World   Reincarnation   Romantic Subplot   Royalty   Ruthless Protagonist   Sadistic Characters   Shameless Protagonist   Strong Love Interests   Student Council   Summoning Magic   Sword And Magic   Teachers   Teamwork   Unique Weapon User   Yandere   Younger Love Interests   ",
	"rating": "(4.3 / 5.0, 432 votes)",
	"author": "Phantom Of The Moonlit Night   월야-팬텀   ",
	"year": "\n2017",
	"ranking": "#1957   #949   #346   #776   #303   ",
	"reviewcount": "60 Reviews sorted by",
	"description": "When I woke up after a pretty crappy death, what greeted me was one of those famous fantasy worlds! I didn’t expect anything like becoming the strongest with a common job, or rising to the top with the weakest class…\r\n\r\nAll I wanted was to live a slow farming life, but the world just wouldn’t leave me alone! And so I equally backstabbed good people and bad people alike, becoming a villain with a true sense of equality and just when I was about to retire and enjoy a proper life on a farm…\r\n\r\n“Master!”\r\n\r\nMy former disciple at the evil organisation, currently the hero of justice came looking for me. Can’t you all just leave me alone?>"
}