{
	"url": "https://www.novelupdates.com/series/muchuan-and-xiang-wan/",
	"title": "Muchuan and Xiang Wan - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/01/murderdreamguy1.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Josei   Mystery   Psychological   Romance   Shoujo   ",
	"tags": "Beautiful Female Lead   Clever Protagonist   Crime   Detectives   Female Protagonist   Handsome Male Lead   Modern Day   Police   Sharp-tongued Characters   Thriller   Tsundere   Writers   ",
	"rating": "(4.1 / 5.0, 47 votes)",
	"author": "Si Jin   姒锦   ",
	"year": "\n2018",
	"ranking": "#6970   #2000   #6186   #12113   #7297   ",
	"reviewcount": "9 Reviews sorted by",
	"description": "Deemed hopeless by her family and that she was better off married when her fourth novel continued to be a flop, aspiring author Xiang Wan begins to doubt herself. While feeling conflicted about continuing her dream as an author, things take an unexpected turn when a dazzling guy appears before her and takes her to the police station.\r\n\r\n'What? I'm the primary suspect in a murder case?'\r\n\r\nA murder has taken place and the details are eerily similar to the details of her latest novel. The dazzling guy turns out to be a talented detective with a hidden identity who is assigned to investigate the case. From then on, her life turns topsy-turvy.\r\n\r\nIn the beginning, she seeks the detective's protection by requesting to stay overnight at his place.\r\n\r\n'Detective Bai, is it not the duty of the police to protect the witness when her life is in extreme danger?'\r\n\r\nShe ends up staying at his house overnight because of various reasons, such as—\r\n\r\nScenario 1:\r\nXiang Wan: 'Detective Bai, you have no right to detain me...'\r\n\r\nDetective Bai: 'I remember you're the one who requested to stay at my house?'\r\n\r\nScenario 2:\r\nXiang Wan: 'There's no need for that. Detective Bai, I can return...'\r\n\r\nDetective Bai: 'You've not cleared of suspicion yet. If something happens, at least you'll have an alibi.'\r\n\r\nScenario 3:\r\nXiang Wan: “Why did you bring me to your house again?'\r\n\r\nDetective Bai: 'You haven't released a new chapter today!' he said, enunciating each syllable, 'I want to read your latest chapter before telling you of our latest investigations.'\r\n\r\n'…'>"
}