{
	"url": "https://www.novelupdates.com/series/i-turned-wild-after-being-doted-on-by-the-big-bosses/",
	"title": "I Turned Wild After Being Doted On By The Big Bosses - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/11/被大佬们团宠后我野翻了.jpeg",
	"noveltype": "(CN)",
	"genre": "Comedy   Drama   Fantasy   Romance   ",
	"tags": "Adapted to Manhua   Beautiful Female Lead   Calm Protagonist   Celebrities   Complex Family Relationships   Doting Older Siblings   Female Protagonist   Genius Protagonist   Handsome Male Lead   Hidden Abilities   Hiding True Identity   Modern Day   Multiple Reincarnated Individuals   Obsessive Love   Older Love Interests   Possessive Characters   Reincarnation   Second Chance   Showbiz   Slow Romance   Tragic Past   Underestimated Protagonist   ",
	"rating": "(3.6 / 5.0, 33 votes)",
	"author": "Su Xianning   苏闲佞   ",
	"year": "\n2020",
	"ranking": "#5262   #6263   #6388   #5887   #6843   ",
	"reviewcount": "12 Reviews sorted by",
	"description": "After she wakes up from being reborn, she becomes the little pitiful girl who is sent into a mental hospital by her biological elder brothers. Her biological elder brothers only dote on the fake young miss, the ‘younger sister’ who is switched at birth. She despises her in any possible way. So, Pei Yunge makes trouble and deals with the fake young miss, waiting for them to tell her to scram. However, the brothers’ attitudes are extremely strange.\n\nPresident Qin sneers. “My younger sister destroyed a shop? Buy the entire mall for my younger sister to tr*sh!”\n\nBest Actor Qin raises an eyebrow. “She sent herself to the casting couch? What am I then, dead?”\n\nGod Qin’s expression is dark. “You repeatedly played tricks and bullied Ge’er. Did you think I was blind?”\n\nPei Yunge: “?”\n\nAfter returning to eight years ago, before the Qin family goes bankrupt, the brothers only cares about their biological younger sister that died so terribly because of them. So what if she is talentless and s*upid? She remains the apple of their eye, one they swear to protect and love! Just as the brothers take determined steps and find Pei Yunge…\n\n“My Yunyun got first place in the world championship again. What a good girl.” The refined and dignified man smiles charmingly.\n\nAfter her real identity is exposed, she is seethes with rage. She grabs the man and bites him. “Don’t even think about humoring me home.”\n\nThe three biological brothers: “?”>"
}