{
	"url": "https://www.novelupdates.com/series/realizing-this-is-a-wuxia-world-after-cultivating-for-300-years/",
	"title": "Realizing This Is A Wuxia World After Cultivating For 300 Years - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/08/Realizing-This-Is-A-Wuxia-World-After-Cultivating-For-Years.jpg",
	"noveltype": "(CN)",
	"genre": "Adventure   Fantasy   Martial Arts   Xianxia   Xuanhuan   ",
	"tags": "Cultivation   Male Protagonist   Overpowered Protagonist   Time Skip   Transmigration   ",
	"rating": "(3.7 / 5.0, 17 votes)",
	"author": "Sole Cloud Flying Cave   孤云飞岫   ",
	"year": "\n2021",
	"ranking": "#2352   #1056   #9734   #13808   #12928   ",
	"reviewcount": "3 Reviews sorted by",
	"description": "Cui Heng was transmigrated to another world and the system told him that the new world he was in was a high-grade Xianxia world.\r\n\r\nIt was a world where Celestial Kings soared the sky and terrifying monsters ruled the lands. The strong would destroy a planet if their mood was bad and Cui Heng trembled in fear when he learned of how scary the new world was.\r\n\r\nThankfully, the system had granted him the protection that last for 300 years. As long as he remained in the safety zone, he would not receive any damage.\r\n\r\nWith his safety secured, he began his cultivation training for the next 300 years.\r\n\r\nThroughout the years as he trained, some people entered his safety zone by mistake.\r\n\r\nThere was a peasant who was once a monk and a beggar. Despite that, he still had the dream of bringing peace to the land and saving the lives of millions.\r\n\r\nThere was a noble who was once called the once-in-a-million-year genius. Yet, luck wasn’t at his side and his talent fell and was laughed at by others for years.\r\n\r\nThere was a princess whose only wish was to find her older brother. She could’ve become a celestial but decided to remain in the human realm to wait for her brother’s return.\r\n\r\nThere was a weak lady who was plagued with illness from birth but had the goal of adventuring and helping the poor and weak.\r\n\r\n…\r\n\r\nCui Heng befriended these people and even gave them a few pointers before they left.\r\n\r\n300 years later, when the protection period had ended, he had finally mastered the Golden Core. Even then, he was still reluctant to go to the outside world.\r\n\r\nBut when he did, he realized that the world was merely a world of Wuxia.>"
}