{
	"url": "https://www.novelupdates.com/series/the-master-of-metaphysics-is-the-movie-queen/",
	"title": "The Master of Metaphysics is The Movie Queen - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/04/The-Master-of-Metaphysics-is-The-Movie-Queen.jpg",
	"noveltype": "(CN)",
	"genre": "Adventure   Comedy   Fantasy   Josei   Romance   Slice of Life   Supernatural   ",
	"tags": "Beasts   Beautiful Female Lead   Celebrities   Cold Protagonist   Cultivation   Dense Protagonist   Female Protagonist   Feng Shui   Ghosts   Handsome Male Lead   Hard-Working Protagonist   Love Interest Falls in Love First   Modern Day   Reincarnation   Romantic Subplot   Second Chance   Showbiz   Transmigration   Underestimated Protagonist   ",
	"rating": "(4.0 / 5.0, 144 votes)",
	"author": "Come Seven Months   月七兮   ",
	"year": "\n2020",
	"ranking": "#4265   #4050   #2281   #724   #4078   ",
	"reviewcount": "50 Reviews sorted by",
	"description": "A metaphysical master Gong Qingyao never dreamed that one day she would be transmigrated into two thousand years later. \n\nAfter transmigration, Gong Qingyao has two goals in life. \n\n1. Make good use of her metaphysical skills.\n\n2. Acting well. \n\nBut what did this person who has been following her want? \n\nQin Ze: “Me? I’m your third life goal.” \n\nDuring a press conference.\n\nReporter A: “I heard that you can participate in this reality show because of unspoken rules?” \n\nGong Qingyao glanced at the reporter. Her husband and wife palace has collapsed. Her eyebrows were sunken and there was a black air: “Your husband cheated, if you go home now, you can still catch him.” \n\nReporter B: “According to insider, your scene in the middle and late stages of this show has increased because you have a close relationship with the director.” \n\nGong Qingyao glanced at this other reporter. \n\nA person’s parents’ house was on the forehead. Looking at this reporter parents’ house, his left forehead was narrow and collapsed, indicating that his father has passed away, while his right forehead was also sinking and darkly stagnant: “Your mother is sick and it is life-threatening. You are recommended to return quickly.” \n\nThe reporters took a step back in silence. \n\nGong Qingyao: “Are there any more questions?” \n\nReporters: “…” No, no. \n\n“Did you find out? Any products with commercials or endorsements by Gong Qingyao will be sold out!” \n\n“What’s this! Anyone who has partnered with Gong Qingyao will call her ‘Sister Yao’, even the best actor is no exception!” \n\n“Well, Gong Qingyao doesn’t seem to have any anti fans, even if there are, they will turn into fans within a month.”>"
}