{
	"url": "https://www.novelupdates.com/series/god-and-devil-world/",
	"title": "God and Devil World - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2017/04/godanddevilworld.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Drama   Ecchi   Fantasy   Harem   Martial Arts   Mature   Sci-fi   Seinen   Tragedy   Xuanhuan   ",
	"tags": "Antihero Protagonist   Apocalypse   Army   Army Building   Artifacts   Artificial Intelligence   Average-looking Protagonist   Beast Companions   Beasts   Beautiful Female Lead   Bloodlines   Books   Cannibalism   Corruption   Determined Protagonist   Domestic Affairs   Dragons   Evil Protagonist   Evolution   Farming   Firearms   Game Elements   Generals   Gods   Hard-Working Protagonist   Kingdom Building   Leadership   Level System   Loli   Magic   Maids   Male Protagonist   Military   Mind Control   Misunderstandings   Modern Day   Monsters   Multiple Realms   Mutated Creatures   Nationalism   Pets   Polygamy   Prostit**es   Racism   R*pe Victim Becomes Lover   R*pe   Ruthless Protagonist   Selfish Protagonist   S*x S*aves   Skill Books   S*ave Harem   S*aves   Survival   Vampires   Wars   Weak to Strong   Zombies   ",
	"rating": "(3.6 / 5.0, 1738 votes)",
	"author": "Asset Exploding   Zi Chan Bao Zeng   资产暴增   ",
	"year": "\n2013\r\n",
	"ranking": "#6970   #2000   #147   #128   #356   ",
	"reviewcount": "363 Reviews sorted by",
	"description": "In less than an instant the world as we knew it was at its end. \n\nThat’s right. The Apocalypse. In a single blink Zombies appeared and mutated monsters began to rampage all throughout the world. Now it was the human species turn to fight for survival and planetary dominance! \n\nOn the same day that the world descends into chaos we meet Yue Zhong. Initially only hoping to get to his friends and escape to a refugee camp our protagonist sets out, inadvertently building a team along the way. After a series of fortuitous events and a few serious hunches our hero decides it’s time to do more than just survive! \n\nYue Zhong begins to form the foundations of an enormous survival plan… before he suddenly discovers that he has only gotten over the first hurdle…. Unbeknownst to Yue Zhong and company, the world outside of China is mostly a wasteland! Country sized swathes of nuclear radiation and an extreme shortage of supplies in the world after the nuclear explosions was quickly becoming the “norm”. Mutants, Evolved animals and what’s worse, intelligent out of control dinosaurs had quickly appeared and claimed their own sections of the planet. There were several innately powerful Evolved races which appeared that were more than 10 times stronger than humans, nearly all of them possessing bodies impenetrable by normal bullets. The fabled orcs’ were another of these Evolved races, the leader of which had in fact enslaved many of the remaining human beings. \n\nUnceremoniously exposed to such a cold and heartless new world, Yue Zhong is faced with a choice: Find a deep dark hole and hope it goes back to “normal”? Or overcome all obstacles and struggle towards Evolution!!!>"
}