{
	"url": "https://www.novelupdates.com/series/didnt-expect-that-did-you/",
	"title": "Didn’t Expect That, Did You? - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/06/Didnt-Expect-That-Did-You.jpg",
	"noveltype": "(CN)",
	"genre": "Drama   Fantasy   Romance   Yuri   ",
	"tags": "Acting   Beautiful Female Lead   Female Protagonist   Modern Day   Multiple Reincarnated Individuals   Reincarnation   Second Chance   Time Travel   ",
	"rating": "(4.5 / 5.0, 51 votes)",
	"author": "热到昏厥   ",
	"year": "\n2021",
	"ranking": "#3133   #4184   #6743   #4155   #9940   ",
	"reviewcount": "5 Reviews sorted by",
	"description": "Wen Yu’s pursuit of Shao Cixin was not out of sincerity, but rather to get back at her ex-girlfriend. In her eyes, Shao Cixin was worthless. But they still became each other’s wives because of a business marriage.\n\nShao Cixin liked her and treated her very well, giving her the moon and the stars. And it wasn’t until Shao Cixin’s death that she realized that she was the one who loved her the most in the world.\n\nShe regretted it. If she could start her life over, she would never let Shao Cixin down again!\n\nAnd then she really did start her life over. This time, she would never let Shao Cixin go!\n\nBut she didn’t get to enjoy it for long before she saw Shao Cixin holding her sister Wen Zhihan’s arm, with a smile on her face. And then Wen Zhihan said to her, “Come, call me sister-in-law.”\n\nWen Yu: ?\n\nShao Cixin met someone who was not a good person. After marrying her heartthrob of many years, she realized that not only did she not love her at all, even after marriage she was still in contact with her ex-girlfriend.\n\nShe was disheartened and haggard, realizing that she had fed a dog with all her sincerity. Then she encountered a disaster and died unexpectedly. And then… she was reborn.\n\nShe restarted her life and swore that she would never walk down the same path again!\n\nWen Yu?\n\nGet lost, you b*tch!\n\nMarriage?\n\nIsn’t Wen Zhihan, with her gentle and pure personality, more fragrant?\n\nHowever, after getting to know each other, she realized that Wen Zhihan was not gentle and pure at all!!!>"
}