{
	"url": "https://www.novelupdates.com/series/those-days-of-saving-the-school-heartthrob/",
	"title": "Those Days of Saving The School Heartthrob - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/04/heartthrob1b.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Romance   School Life   Slice of Life   Yaoi   ",
	"tags": "Cold Love Interests   Cute Protagonist   Devoted Love Interests   Dreams   Friendship   Handsome Male Lead   Love Interest Falls in Love First   Modern Day   Popular Love Interests   Previous Life Talent   Time Travel   ",
	"rating": "(4.1 / 5.0, 26 votes)",
	"author": "Zheng Zheng Yu Shang   蒸蒸与上   ",
	"year": "\n2018",
	"ranking": "#2000   #2000   #7986   #8665   #6823   ",
	"reviewcount": "6 Reviews sorted by",
	"description": "Ji Mingyue thinks that his life is decent, and there is no reason to be reborn. Then God asked him to come again from high school, it must be to rewrite the tragic fate of high school grass and his crush, Lin Feng!\n\nIn order to save the male god, Ji Mingyue flexed his muscles.\n\nThe first step is to volunteer to do the same at the same table to monitor him in order to prevent the decline in the school grades;\n\nIn the second step, in order to prevent the school grass from being lonely, try to be friends;\n\nThe third step, in order to prevent the school grass’s best relatives from being demon monsters, and caring for the sick and weak mothers of the school grass, invite the school grass to come home for vacation!\n\nStep by step jio print, very nice!\n\nSave, save, suddenly one day …\n\nLin Feng looked down at him with clear eyes: “Do you like me?”\n\nJi Mingyue: “No no no no no …”\n\nLin Feng: “I like you too.”\n\n“…” Ji Mingyue decisively changed his words, “No, no, no, it’s impossible to dislike you!”\n\n*Small cookies, Xueba Qing cold attack x rich second generation vigor.\n\nIn my last life, I was ignorant and stumbling. This is the story of returning from the best time in my life, trying to grow up while falling in love, and becoming better people together.\n\nThe bright moon is like frost, the good wind is like water, and the scenery is infinite.>"
}