{
	"url": "https://www.novelupdates.com/series/destined-marriage-with-fragrance/",
	"title": "Destined Marriage with Fragrance - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2017/06/unnamed-file.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Drama   Josei   Martial Arts   Romance   ",
	"tags": "Ancient China   Average-looking Protagonist   Broken Engagement   Calm Protagonist   Charming Protagonist   Clever Protagonist   Female Protagonist   Love Interest Falls in Love First   Polite Protagonist   Politics   Smart Couple   Strong Love Interests   Transmigration   ",
	"rating": "(4.0 / 5.0, 211 votes)",
	"author": "Qian Lu   淺綠   ",
	"year": "\n2015",
	"ranking": "#1473   #1143   #1027   #2090   #1240   ",
	"reviewcount": "31 Reviews sorted by",
	"description": "She is a quiet and gentle business woman, Bai Yifan. Due to a strange bracelet, she crossed to a different world and become a wealthy woman – Murong Shu Qing. The past unruly temper disappeared and replaced with a fresh elegance, calm and quiet temperament.\n\nHe is the country’s general with a massive army – Xuan Yuan Yi. Wild and domineering attitude makes the country’s princess go crazy for him. He is tied for marriage with Murong Shu Qing but he came to break off their engagement. After Bai Yifan takes over, her elegant temperament attracts his heart and soul. He won the symbol of the magpie bridge during the Qi Lian Festival and vows to marry her.\n\nHe is the indifferent and natural killer – Mo Can. During his escape, he met Shu Qing and ended up being saved. This seemingly delicate lady brings him an extraordinary life experience. The next time they met again, he lives to protect her.\n\nHe is the country’s prestigious emperor – Tian Cheng. Meeting coincidentally, he fell in love at first sight with Murong Shu Qing. He was interested in her temperament and ability in business. He vows to seize her in any ways possible.\n\nShu Qing and Xuan Yuan Yi work together to face their enemies but they were no match to Tian Cheng’s cup of poison wine. Can the days be saved with the elegance of a woman? Can they bring a genuine happy ending to the Legend of Niu Long and Zhi Nu?>"
}