{
	"url": "https://www.novelupdates.com/series/the-transmigrated-cannon-fodder-overthrows-the-male-protagonist/",
	"title": "The Transmigrated Cannon Fodder Overthrows the Male Protagonist - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2018/04/The-Transmigrated-Canon-Fodder-Overthrows-the-Male-Protagonist.jpg",
	"noveltype": "(CN)",
	"genre": "Adult   Adventure   Comedy   Drama   Fantasy   Romance   Smut   Tragedy   ",
	"tags": "Ancient China   Beautiful Female Lead   Charming Protagonist   Cheats   Doting Love Interests   Fated Lovers   Female Protagonist   First-time Interc**rse   Handsome Male Lead   H*ndjob   Incest   Interdimensional Travel   Love Interest Falls in Love First   Male Yandere   Multiple Identities   Obsessive Love   Possessive Characters   R*pe   S*xual Abuse   System Administrator   Transmigration   World Hopping   ",
	"rating": "(4.3 / 5.0, 265 votes)",
	"author": "Cha Mi   茶蘼   ",
	"year": "\n2017",
	"ranking": "#2318   #2681   #759   #3308   #628   ",
	"reviewcount": "51 Reviews sorted by",
	"description": "She was an average company employee, but she unexpectedly died in a car accident. Fortunately—or not, her soul synchronized with a shameless system called “Take Down the Male Protagonist” which is classified as a “Capture” system. To be exact, the main point of this system is to capture the male protagonist’s… penis.\r\n\r\n“Come here! We need to deepen our mutual understanding and have ourselves a good pillow talk—no, no! I mean, let’s just have a good chat about life!”\r\n\r\n“Where is the newbie package?! What about my employee’s benefits?! Hey, System, don’t pretend to bug out all of a sudden, hand them over!”\r\n\r\n“Hmm, let’s see…the employee’s benefits are pretty good… pretty good… But, you mind telling me what the heck are these ‘Ten Great Tools’? This… What on earth is this scent that’s coming from my body?? And just what is this ‘instant recovery constitution’ that supposedly will let me ‘play to my heart’s content without being broken’?! System, get your ASS out here! We need to talk! Are you for real or just pulling my leg?!”\r\n\r\n“I never agreed to take down these male protagonists! Not a single one of them follows the prescribed storyline. I don’t want to end up under them; they are simply too awful! None of their words can be trusted—not a single one!! Out of all their lies, the worst are ‘Be obedient, I won’t move.’, ‘Believe me, this will be the last time.’ and, ‘I just want to kiss you!’\r\n\r\n“System, the settings must be incorrect! These guys are completely unlike the plot description! I’m feeling so wronged here!!!”\r\n\r\n——\r\n\r\nThe Ten Great Tools: For Chinese, men and women had 10 great attributes/characteristics that would make their private parts great or ideal for intercourse. In this case, the ten great tools referred to the ten types of ideal shapes and characteristics of a woman’s private part.>"
}