{
	"url": "https://www.novelupdates.com/series/please-take-a-step-out-of-the-portrait/",
	"title": "Please Take A Step Out Of The Portrait - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/01/Please-Take-A-Step-Out-Of-The-Portrait.png",
	"noveltype": "(KR)",
	"genre": "Fantasy   Romance   ",
	"tags": "Beautiful Female Lead   Complex Family Relationships   European Ambience   Female Protagonist   Handsome Male Lead   Love at First Sight   Love Interest Falls in Love First   Male Yandere   Time Travel   Yandere   ",
	"rating": "(4.1 / 5.0, 12 votes)",
	"author": "Jurim   쥬림   ",
	"year": "\n2021",
	"ranking": "#2000   #2000   #9351   #5637   #8352   ",
	"reviewcount": "1 Review sorted by",
	"description": "She thought that she had died, but when she opened her eyes it was 200 years in the future.\n\n“I fell in love with you the moment I saw your visage in the portrait.”\n\nEverything was foreign, all except for the large portrait that was hanging in the room.  \n\nIndeed. That’s a portrait of her. The painting that her older sister created with her as the model, became a masterpiece that was auctioned for the highest bid ever after 200 years had passed. \n\nShe has unknowingly become the most famous beauty in art history.  And this person that kept approaching me was the youngest Young Master of the most powerful family of this time and owned this expensive portrait. \n\n“Be with me forever.”\n\nThis person was clearly a lunatic, falling in love with someone from 200 years ago after merely getting a glimpse of the portrait. \n\nVivian got up from her seat. \n\n“I want to go back.”\n\nAhh.\n\n“I want to go back to where my older sister is.”\n\nSo it was because of this. \n\nAs Edmund listened to her words that she wanted to go back to the past because she wanted to save her sister, emotions disappeared from Edmund’s face.\n\n“Vivian.”\n\nUnbeknownst to Edmund himself, dark emotions slowly rose from the floor like the mist at dawn. \n\n“You aren’t going anywhere.”>"
}