{
	"url": "https://www.novelupdates.com/series/poison-genius-consort/",
	"title": "Poison Genius Consort - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/11/Poison-Genius-Consort.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Drama   Romance   Xuanhuan   ",
	"tags": "Adapted to Drama   Adapted to Manhua   Alternate World   Ancient China   Arranged Marriage   Beautiful Female Lead   Bickering Couple   Black Belly   Calm Protagonist   Character Growth   Clever Protagonist   Cold Love Interests   Complex Family Relationships   Devoted Love Interests   Doctors   Doting Love Interests   Female Protagonist   Handsome Male Lead   Hiding True Abilities   Jealousy   Late Romance   Medical Knowledge   Misunderstandings   Modern Knowledge   Mysterious Past   Poisons   Politics   Possessive Characters   Power Couple   Power Struggle   Protagonist Falls in Love First   Schemes And Conspiracies   Slow Romance   Strong Love Interests   Transmigration   Transported Modern Structure   Transported to Another World   Tsundere   Ugly to Beautiful   ",
	"rating": "(4.2 / 5.0, 713 votes)",
	"author": "Jie Mo   芥沫   ",
	"year": "\n2015",
	"ranking": "#4265   #4789   #123   #10271   #324   ",
	"reviewcount": "135 Reviews sorted by",
	"description": "Easily cowed and bullied, she was the useless, ugly woman with no talent in medical skills. Supported by millions, he was Tianning’s most respected duke with the power to move all under Heaven. On their wedding day the bridal sedan was carried to the front doors, but the Duke of Qin’s gates were shut tight.\n\nThey told her, ‘Come back tomorrow.’\n\nAll alone, she walked step-by-step full of pride through the duke’s doors. Little could they imagine, this unattractive good-for-nothing was a beautiful, genius doctor of poisons!\n\n—\n\nAfter transmigrating to the past, poisons expert Han Yunxi finds herself on the verge of being married off to the country’s second most powerful man, the Duke of Qin. Her future life seems set–except her husband is an unfeeling ice block, her in-laws think she’s a eyesore, the empress dowager wants to use her for her own goals, and poison-related plots abound.\n\nAlone, the intelligent (and sensible) Yunxi must carve her own space from the intricate web of court intrigue and the jianghu, relying on her words, wits, and wisdom to survive. Adapt when necessary, use force when required; to survive and thrive is the name of the game to a prosperous life.\n\nNo matter what, she’ll prove her right to live!>"
}