{
	"url": "https://www.novelupdates.com/series/oscar/",
	"title": "Oscar - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/12/oscar5.jpg",
	"noveltype": "(KR)",
	"genre": "Mature   Romance   Smut   Supernatural   ",
	"tags": "Angels   Beautiful Female Lead   Charismatic Protagonist   Charming Protagonist   Demons   Enemies Become Lovers   Fallen Angels   Female Protagonist   Handsome Male Lead   Jealousy   Male Yandere   Obsessive Love   R-18   S*xual Abuse   Sister Complex   Twins   Wars   ",
	"rating": "(4.1 / 5.0, 51 votes)",
	"author": "김빠   ",
	"year": "\n2019",
	"ranking": "#3923   #4671   #6234   #9148   #5072   ",
	"reviewcount": "3 Reviews sorted by",
	"description": "“Have you ever seen Kamael’s c**k?”\n\n“What..?”\n\n“You know, f**cking. Have you ever seen something of your goddamn twin brother?”\n\n“…Oscar…. !”\n\nHis hand suddenly clasped her chest. The unrefined desire for possession flowed from the grasp.\n\n“Has Kamael ever licked your n*pples? Has his c**k ever moved between your legs? Have you ever groaned after accepting it? Have you ever licked each other’s saliva while lying on the floor like you did with me?”\n\nAnnette shook her head in silence with a frowned face.\n\n“Open your mouth right away and answer. Before I burn this place down.”\n\n“I can’t imagine doing that with Kamael. Oscar.”\n\nThe devil let out a metallic sound with shining red eyes.\n“Say no instead of saying you can’t imagine.”\n\n“…what do you mean?”\n\n“Tell me you don’t want to do that with any asshole other than me, f**k….”\n\nOscar’s elbows touched the ground with her head in the middle. The white forearm swelled up as if it was bursting with stiff blood.\n\n“…Say you only love me.”\n\n***\n\nSince the beginning, while the celestial and demonic worlds continued to fight endlessly against each other, they concluded several agreements and entered into a potential peace.\n\nAnd this peace ended when the angel Annette met a bird in the forgotten forest of heaven.>"
}