{
	"url": "https://www.novelupdates.com/series/i-dont-want-to-work-hard-anymore/",
	"title": "I Don’t Want to Work Hard Anymore - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/05/I-Dont-Want-to-Work-Hard-Anymore.jpg",
	"noveltype": "(CN)",
	"genre": "Romance   Yuri   ",
	"tags": "",
	"rating": "(4.3 / 5.0, 4 votes)",
	"author": "御川不洗手   ",
	"year": "\n2021",
	"ranking": "#2000   #2000   #13094   #9320   #11910   ",
	"reviewcount": "No Reviews",
	"description": "National-level Film Empress Tan Yue, plays a low-key and non-hype role, from childhood to 30 years of age, has become a fruitful Gaoling flower in the entertainment industry.\r\n\r\nShe has been in hot search for two days because of a photo, but the protagonist in it is not her.\r\n\r\nIn the photo, her bodyguard has a rigorous uniform, long waist, and thin legs, with gorgeous features. She gently reached out her hand to support the female star who got out of the car that wore a bright red dress.\r\n\r\n'Listen to Ji' in the hot search.\r\n\r\n——Bodyguard sister, I can!\r\n\r\n——Please God grant me a bodyguard sister!\r\n\r\nThey've been seeing the bodyguard for a long time, but they can't figure out why. With Tan Yue's increasing popularity, the female bodyguard who has been guarding her side is getting more and more shots, and they are even on par with Tan Yue's.\r\n\r\nOne day, a video came on hot search. The uniformed bodyguard frowned at Tan Yue who was wearing a cool evening dress and quickly took off her coat and put it on her.\r\n\r\nTan Yue touched the beautiful side face of the bodyguard and pulled her tie to kiss her.\r\n\r\nTan Yue: She's my girlfriend.\r\n\r\nGaoling Flower, a national-level actress, and her loyal dog bodyguard.\r\n\r\nSome Film Empress are beautiful during the day, while at night they hold their lips to their abstinence bodyguards.\r\n\r\nSome bodyguards are abstinent during the day with a face like frost. At night they hug their sister and hum saying that they don’t want to work hard.>"
}