{
	"url": "https://www.novelupdates.com/series/tower-of-the-moon/",
	"title": "Tower of The Moon - Novel Updates",
	"image": "https://www.novelupdates.com/img/noimagefound.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Fantasy   Mature   ",
	"tags": "Female Protagonist   Schemes And Conspiracies   S*x Friends   ",
	"rating": "(4.2 / 5.0, 5 votes)",
	"author": "",
	"year": "\nN/A",
	"ranking": "#2000   #2000   #13153   #13810   #11575   ",
	"reviewcount": "No Reviews",
	"description": "In the fertile plains to the north, among the numerous rolling mountains, stands the majestic Snow Gate Pass. Nobody knows when, by whom, or for what purpose the Snow Gate Pass was constructed. To the north of the Snow Gate Pass, is a vast and mysterious kingdom of ice, that’s considered to be the birthplace of magic, with many wondrous legends about it, such as ancient ruins, the Tower of the Moon, the Tree of Life, the Flower of Immortality, ice dragons……\r\n\r\nA group of “merchants” are currently in the capital city of the north, in search of a local guide that can take them deeper into the far north. But since winter is approaching, the mayor of the city has gone back on his word for various reasons. Just as they were hesitating on how to proceed, a northern girl suddenly appeared, calling herself a bounty hunter, and that she’ll be the group’s guide, into the most dangerous canyon in the north, the ancient dragon’s tomb – the Frozen Bone Cliffs.\r\n\r\nThe leader of the group is a mysterious young man that everyone calls “young master.” With no other choice, he was forced to sign a contract with the girl, and agreed to various conditions that she set.\r\n\r\nHowever, an assassination attempt was made on the girl on the same night that she accepted the contract. The assassin was a mysterious shadow with purple eyes. From then on, the group’s troubles were unending.\r\n\r\nThe young master’s mysterious past was also slowly revealed, it turned out that he had the power of “Dream Perception,” and was a holder of the long-lost northern Moon Clan tribe’s foresight abilities.>"
}