{
	"url": "https://www.novelupdates.com/series/orc-eiyuu-monogatari-sontaku-retsuden/",
	"title": "Orc Eiyuu Monogatari Sontaku Retsuden - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/12/Orc-Eiyuu-Monogatari-Sontaku-Retsuden.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Comedy   Fantasy   Harem   Romance   Seinen   ",
	"tags": "Adapted to Manga   Aristocracy   Beastkin   Character Growth   Confident Protagonist   Demi-Humans   Demon Lord   Demons   Determined Protagonist   Dragons   Dwarfs   Elves   Enemies Become Allies   Fairies   Famous Protagonist   Fantasy World   Friends Become Enemies   Handsome Male Lead   Harem-seeking Protagonist   Honest Protagonist   Human-Nonhuman Relationship   Humanoid Protagonist   Knights   Magic Beasts   Male Protagonist   Misunderstandings   Monsters   Multiple POV   Naive Protagonist   Orcs   Overpowered Protagonist   Polite Protagonist   Polygamy   Protagonist Strong from the Start   R*pe   Ruthless Protagonist   Strong Love Interests   Succubus   Sword Wielder   Unrequited Love   Wars   World Travel   ",
	"rating": "(4.3 / 5.0, 132 votes)",
	"author": "Rifujin na Magonote   理不尽な孫の手   ",
	"year": "\n2019",
	"ranking": "#4617   #6315   #1728   #5296   #2023   ",
	"reviewcount": "15 Reviews sorted by",
	"description": "Bash, the Orc Warrior, is a Hero. \n\nDuring the war, he crushed and defeated all that stood in his path. He is respected by all Orcs as the Orc among Orcs.\n\nHowever, Bash has a secret.\n\nHe has no experience with women – he, the Hero, was a virgin.\n\nFor Orcs, who hold combat and sexual prowess in high regard, being a virgin was tremendously shameful.\n\n[The fact that I’m a not only a virgin, but a virgin Orc Hero, is a shame for all of Orcish society. I want a wife too!]\n\nWith this in mind, he decides to embark on a journey.\n\nIn order to protect the pride and honor of his race, but mostly to finally get his d*ck wet, he decides to go to leave on a grand quest to find himself a woman.>"
}