{
	"url": "https://www.novelupdates.com/series/i-am-your-sister/",
	"title": "I Am Your Sister - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/06/I_Am_Your_Sister.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Drama   Fantasy   Josei   ",
	"tags": "Apathetic Protagonist   Charismatic Protagonist   Charming Protagonist   Cold Love Interests   Cold Protagonist   Female Protagonist   Gamers   Late Romance   MMORPG   Monsters   Past Plays a Big Role   Romantic Subplot   Second Chance   Siblings Not Related by Blood   Time Travel   Virtual Reality   ",
	"rating": "(4.3 / 5.0, 39 votes)",
	"author": "唤云   ",
	"year": "\nN/A",
	"ranking": "#6970   #2000   #6166   #5055   #6849   ",
	"reviewcount": "16 Reviews sorted by",
	"description": "As everyone knows, there is a plucky sort of male host. He is evil, charming and crazy. He is cold and has no feeling. He holds the land under the heavens in his palms. He has numerous confidants, but all of them can be forsaken and utilized. The true white moonlight of this master is only one.\n\nUnfortunately, Li Xin was the former. \n\nIn a mysterious space, a man looked at the delicate and soft woman, like a pear blossom after the rain, and sighed. “Have you finished reading? This is your world. A novel featuring Lu Zigui.” \n\nAs one of the most miserable beauties who was cheated by the protagonist to devote herself to him all throughout her life, she was ultimately sacrificed for the sake of his “true love”. The man had thought that once she saw the truth of the unilateral “love” between them, she would cry bitterly or maybe cause havoc.\n\nHowever…… \n\nAfter reading the final word, Li Xin casually closed the book, her expression as usual and lightly said, “You mean, my brother is not Lu Zigui, but Xu Yan. I recognised the wrong person, right?” \n\nThe man was dumbfounded by her tranquil manner, not resembling that of an implicated party, and hesitated, “……En.”\n\nLi Xin: “So, what do you want to see me for?” \n\nMan: “……If I said I could return you to the past?” \n\nLi Xin: “Good.” \n\nLooking at the woman’s slender figure fading into the brilliant rays of light, the man was at a loss and said blankly to himself, “Wasn’t this procedure too simple?……” \n\nShuShuShu, heads are falling from the brushing.*\n\n*This is a pun. The character 苏 (shu) used here means revive and also sounds like 梳头 (also pronounced shu) which means brushing your hair.>"
}