{
	"url": "https://www.novelupdates.com/series/who-moved-my-ashes/",
	"title": "Who Moved My Ashes - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/11/CB67BF1B-A3FA-4765-BA00-1B874F81A14A.png",
	"noveltype": "(CN)",
	"genre": "Comedy   Drama   Romance   Slice of Life   Yuri   ",
	"tags": "Beautiful Female Lead   Business Management   Death   Death of Loved Ones   Devoted Love Interests   Doting Love Interests   Female Protagonist   First Love   Ghosts   Heartwarming   Love Interest Falls in Love First   Modern Day   Second Chance   Secrets   Short Story   Unconditional Love   ",
	"rating": "(4.6 / 5.0, 184 votes)",
	"author": "思镜渠   ",
	"year": "\nN/A",
	"ranking": "#1326   #2000   #3843   #3375   #3857   ",
	"reviewcount": "23 Reviews sorted by",
	"description": "Jiang Xichu was Chen Man’s secretary for many years. There was an inevitable dispute in the workplace. On this day, she just had a big fight with Chen Man. Before she passed away, she was stabbed to death by a psychopath who retaliated against society. Not long after her death, Jiang Xichu learned from the civil servants of the underworld that Chen Man didn’t feel guilty and had embezzled her well-deserved salary. Even her funeral was held casually, her colleagues weren’t able to attend and give their condolences. She goes back into the world full of anger and was ready to frighten the heartless woman, Chen Man. When she arrived at Chen Man’s bedroom, she saw Chen Man held an urn full of her ashes, while slowly looking at her pictures when she was alive while looking haggard.\r\n\r\nA year later, Chen Man also died. The cause of death: suicide caused by severe depression. Jiang Xichu left Chen Man’s home with a complicated mood. She wanted to go back to the underworld and ask Chen Man about it. However, after stepping out of the home, she was reborn again.\r\n\r\nOnce again in the world, general manager Chen made her breathless.\r\n\r\nJiang Xichu: …\r\n\r\nYou little actress girl, you play your two faces very smoothly!>"
}