{
	"url": "https://www.novelupdates.com/series/the-elegant-dancing-years/",
	"title": "The Elegant Dancing Years - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/07/Screen-Shot-2019-07-25-at-6.00.32-PM.png",
	"noveltype": "(CN)",
	"genre": "Action   Adult   Fantasy   Historical   Mature   Romance   Yaoi   ",
	"tags": "Age Progression   Ancient China   Appearance Different from Actual Age   Black Belly   Calm Protagonist   Charismatic Protagonist   Charming Protagonist   Clever Protagonist   Cold Love Interests   Cunning Protagonist   Depictions of Cruelty   Devoted Love Interests   Doting Love Interests   Empires   First-time Interc**rse   F*llatio   Handsome Male Lead   H*ndjob   Imperial Harem   Incest   Jealousy   Kingdoms   Manly Gay Couple   Obsessive Love   Older Love Interests   Possessive Characters   Power Couple   Power Struggle   Prophecies   Reincarnation   Reversible Couple   Royalty   Ruthless Protagonist   Schemes And Conspiracies   Second Chance   Secrets   Shota   Smart Couple   Strong Love Interests   Time Skip   Transmigration   Wars   Weak to Strong   ",
	"rating": "(4.2 / 5.0, 121 votes)",
	"author": "Huo Li   火狸   ",
	"year": "\n2008",
	"ranking": "#3017   #3791   #2638   #1474   #2319   ",
	"reviewcount": "22 Reviews sorted by",
	"description": "“I really want to taste and see…” Lying on the bed, the man licked his lips, his finger tips lingered on what could only be described as the most delicious dish.\n\n“Of course you can,” his expression didn’t change, “If you want to see me bleed to death, fa…ther….” he suddenly muttered out the last few words, Qi Mingyue’s six year old arms opened up, and ignored the man’s expressions as he sat up and left.\n\nWhen he was the number one of a host club, he died from a gunshot. When he woke up he was a prince, and he met that man. The cunning and two faced, flirtatious and inconsistent man, but when it came to himself, it was unconditional love and care… so what if they were father and son?\n\nAs an emperor, he saw many different people. To him, everyone on this earth weren’t that much different from one another. Boring. But this prince was up to par with even himself. He is as calm as water, and as cold as the moon… so what if he was destined to murder his own mother?\n\nJust love him already, that’s it…>"
}