{
	"url": "https://www.novelupdates.com/series/shijou-saikyou-orc-san-no-tanoshii-tanetsuke-harem-tzukuri/",
	"title": "Shijou Saikyou Orc-san no Tanoshii Tanetsuke Harem Tzukuri - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/09/Shijou-Saikyou-Orcsan-no-Tanoshii-Tanetsuke-Harem-Tzukuri.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adult   Adventure   Ecchi   Fantasy   Harem   Romance   ",
	"tags": "Adapted to Manga   Beastkin   Beautiful Female Lead   Blacksmith   Business Management   Cohabitation   Comedic Undertone   Cooking   Cunning Protagonist   Demon Lord   Demons   Discrimination   Domestic Affairs   Elves   Family   Famous Parents   First-time Interc**rse   Half-human Protagonist   Handsome Male Lead   Harem-seeking Protagonist   Harsh Training   Heartwarming   Heroes   Honest Protagonist   Love at First Sight   Magic   Male Protagonist   Merchants   Nobles   Orcs   Overpowered Protagonist   Perverted Protagonist   Politics   Polygamy   Priestesses   Proactive Protagonist   Protagonist Falls in Love First   Protagonist Strong from the Start   R-18   Reincarnated in Another World   Restaurant   Royalty   Shameless Protagonist   Strong Love Interests   Strong to Stronger   Student-Teacher Relationship   Teachers   Threesome   Time Skip   Transmigration   ",
	"rating": "(3.7 / 5.0, 66 votes)",
	"author": "Tsukiyo Rui   月夜　涙（るい）   ",
	"year": "\n2019",
	"ranking": "#3633   #3310   #3145   #1519   #2534   ",
	"reviewcount": "6 Reviews sorted by",
	"description": "The history strongest reincarnated orc being unrivaled and making harem!\n\nOrk was reincarnated as the son of a female knight and an orc.\nBecause he was born similar to his mother, he got bullied in the orc village.\nThat Ork was awakened to the strongest bloodline from his encounter with a beautiful elf.\n\nBecause he was born as an orc――\n\nhe wanted to do it with beautiful girls!\n\nHe wanted to be lovey dovey with girls every day!\n\nTo make women wanted from the bottom of their heart to be embraced by him, he had no choice but to be a strong orc!!\n\nThrough this and that, Ork obtained the strongest power in history and began his journey to create his harem.\nUsing the power that he had obtained, Ork mowed down all the obstacles during his journey, climbed up in the world, and made love with beautiful girls one after another――!>"
}