{
	"url": "https://www.novelupdates.com/series/the-second-coming-of-gluttony/",
	"title": "The Second Coming of Gluttony - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/01/The-Second-Coming-of-Avarice.jpg",
	"noveltype": "(KR)",
	"genre": "Action   Adventure   Comedy   Drama   Fantasy   Harem   Mature   Psychological   Seinen   ",
	"tags": "Adapted to Manhwa   Alternate World   Amnesia   Beautiful Female Lead   Caring Protagonist   Character Growth   Charismatic Protagonist   Death   Demons   Dense Protagonist   Depictions of Cruelty   Dragons   Eye Powers   Fallen Angels   Family Conflict   Famous Protagonist   Fantasy World   Fated Lovers   First-time Interc**rse   Friendship   Gambling   Game Elements   Gate to Another World   Ghosts   Goddesses   Godly Powers   Gods   Gore   Grinding   Guilds   Handsome Male Lead   Hard-Working Protagonist   Harsh Training   Kingdoms   Late Romance   Leadership   Level System   Love Interest Falls in Love First   Male Protagonist   Marriage   Masochistic Characters   Mercenaries   Mind Break   Mind Control   Modern Day   Monsters   Multiple POV   Naive Protagonist   Near-Death Experience   Obsessive Love   Parallel Worlds   Parasites   Past Plays a Big Role   Personality Changes   Phoenixes   Polygamy   Poor to Rich   Precognition   Pregnancy   Resurrection   Reverse R*pe   Romantic Subplot   Royalty   Saving the World   Schemes And Conspiracies   Second Chance   Seven Deadly Sins   Seven Virtues   Spear Wielder   Special Abilities   Spirits   Strength-based Social Hierarchy   Strong Love Interests   Succubus   Survival Game   Sword And Magic   Teamwork   Time Skip   Transported to Another World   Tsundere   Wars   Weak to Strong   Witches   ",
	"rating": "(4.4 / 5.0, 2753 votes)",
	"author": "Ro Yu-jin   로유진   ",
	"year": "\n2017",
	"ranking": "#2510   #4059   #21   #27   #13   ",
	"reviewcount": "453 Reviews sorted by",
	"description": "“The son of god Gula has returned.”hoo\n\n\nI was lost in the world of gambling.\n\nI turned my back on my family and even betrayed my lover.\n\nI wasted every day of my life.\n\nIt was a life of tr*sh.\n\nThe reality told me thus:\n\nThat I would amount to nothing no matter what I did.\n\nIn order to change my pathetic life, I chose fantasy, instead.\n\nEven then, it was the same story.\n\nI wondered if salvation would come at the end of the long road.\n\nBut, I was forced to kneel down in defeat in front of a powerful entity.\n\nThe tower I built up with my own hands crumbled into nothingness.\n\nJust for once, I dearly wished to know the truth about myself.\n\n“Come closer, my child…”\n\nI will not hold back this time.>"
}