{
	"url": "https://www.novelupdates.com/series/insanely-pampered-wife-divine-doctor-fifth-young-miss/",
	"title": "Insanely Pampered Wife: Divine Doctor Fifth Young Miss - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2018/01/InsanelyPamperedWifeDivineDoctorFifthYoungMiss.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Fantasy   Gender Bender   Josei   Romance   School Life   Xuanhuan   ",
	"tags": "Adapted to Manhua   Alchemy   Arrogant Characters   Beast Companions   Beautiful Female Lead   Black Belly   Clever Protagonist   Comedic Undertone   Cross-dressing   Cultivation   Dense Protagonist   Devoted Love Interests   Doting Love Interests   Fast Learner   Female Protagonist   Genius Protagonist   Handsome Male Lead   Hard-Working Protagonist   Hiding True Abilities   Love Interest Falls in Love First   Magical Space   Mythical Beasts   Pill Concocting   Ruthless Protagonist   Shameless Protagonist   Slow Romance   Spirits   Strong Love Interests   Time Skip   Transmigration   Weak to Strong   ",
	"rating": "(4.1 / 5.0, 269 votes)",
	"author": "扇骨木   ",
	"year": "\n2015",
	"ranking": "#594   #6161   #278   #8979   #825   ",
	"reviewcount": "41 Reviews sorted by",
	"description": "She was the Fifth Young Miss of the revered General’s Residence, but was seen to be useless as trash. Promiscuous and flirtatious to a fault, she was finally killed by mistake under the hands of the attendants of the man she was chasing; She was a genius favoured by the Heavens but ultimately murdered by an insidious plot and all who shared her bloodline pursued and exterminated which caused her to lust for revenge to be paid in blood. The day the genius had unwittingly taken up the body of that useless trash and opened her eyes, her fate had completely changed!!!\r\n\r\nRefining elixirs and the smelting of weapons were tough?\r\nThat did not daunt her.\r\n\r\nBeast Tamers were rare?\r\nShe had easily gained the title of Emperor Beast Tamer!\r\n\r\nForced marriages!?\r\nMen being arrogant because they are good looking?\r\nShe stretches her hand out and easily pulls devilishly handsome men to her: The Demonic King brothers would easily take their place. A devilish glance, a slight shimmer of movement, and that man would suddenly disappear the next moment. He turned back around, his devilish smile alluring: “Let’s continue with the topic, let’s have a child!”\r\n\r\nThis is another interesting story with transmigrating and very fun filled characters that will delight you.>"
}