{
	"url": "https://www.novelupdates.com/series/garudeina-oukoku-koukoku-ki/",
	"title": "Garudeina Oukoku Koukoku Ki - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2016/11/Garudeina-Oukoku-Koukoku-Ki.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Drama   Fantasy   Harem   Romance   Shounen   ",
	"tags": "Animal Characteristics   Beastkin   Discrimination   Domestic Affairs   Dragons   Game Elements   Humanoid Protagonist   Kingdom Building   Kingdoms   Lack of Common Sense   Magic   Male Protagonist   Multiple POV   Overpowered Protagonist   Overprotective Siblings   Protagonist Strong from the Start   R-15   Race Change   Siblings Not Related by Blood   Sister Complex   Transmigration   Transported to Another World   Unreliable Narrator   Younger Sisters   ",
	"rating": "(3.9 / 5.0, 276 votes)",
	"author": "Sakura Saku   Sakuragi Kaito   桜朔   桜木海斗   ",
	"year": "\n2015\r\n",
	"ranking": "#2000   #6280   #1005   #2334   #573   ",
	"reviewcount": "15 Reviews sorted by",
	"description": "A world where swords, bows, and magic flutter about.\n\nAmagi Shigehisa, who was taking his university entrance exams, suddenly transferred into such a world without any warning.\n\nAs the strongest race, Dragunir.\n\nWho and for what purpose? Without harboring this question for long, Shigehisa confronts an excessively heartless and harsh reality.\n\nShigehisa transferred into the North Tenshia Continent.\n\nThere, with the exception of humans, the Beast people like the Wolfmen tribe, Tigermen tribe, and others, experience extreme discrimination and oppression, and are forced into a life-threatening lifestyle every day.\n\nThus, Shigehisa made a decision.\n\n“By my own means, I will make a kingdom for the sake of fluffiness!”\n\nBecause of a man who possesses a lifespan and power unmatched by humans, a battle which involves the whole continent starts.\n\nShigehisa, revising his name to “Georg Stanford”, the protagonist in a RPG he played during his high school days, brings together the beast people from every place in the continent.>"
}