{
	"url": "https://www.novelupdates.com/series/the-fierce-illegitimate-miss/",
	"title": "The Fierce Illegitimate Miss - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2017/07/fiercemiss.jpg",
	"noveltype": "(CN)",
	"genre": "Romance   ",
	"tags": "Ancient China   Arrogant Characters   Beautiful Female Lead   Betrayal   Calm Protagonist   Charismatic Protagonist   Cold Protagonist   Confident Protagonist   Cunning Protagonist   Death of Loved Ones   Depictions of Cruelty   Doting Love Interests   Female Protagonist   Handsome Male Lead   Near-Death Experience   Poisons   Proactive Protagonist   Protagonist Strong from the Start   Ruthless Protagonist   Schemes And Conspiracies   Shameless Protagonist   Sharp-tongued Characters   Tomboyish Female Lead   Torture   Transmigration   Transported to Another World   Underestimated Protagonist   ",
	"rating": "(4.0 / 5.0, 250 votes)",
	"author": "Xi Ruyi   喜如意   ",
	"year": "\n2013",
	"ranking": "#6970   #1435   #1805   #1399   #1268   ",
	"reviewcount": "43 Reviews sorted by",
	"description": "Yu Linglong is the shu (born of a concubine) daughter in a general’s family. Since her mother was only a tribute dancer, her position is the lowest of the low. She used to live with her mother outside the father’s residence, and they only received some monthly money from him. He didn’t bother seeing them. But when her mother dies, she moves into the general’s residence.\n\nThe general is a very irresponsible and violent man. He doesn’t really get attached to women, just letting his lust dictate his actions. His wife is a jealous woman, who killed one of his previous concubines, because he doted on her too much. She similarly wants to get rid of Yu Linglong, in part to vent her frustrations over her husband’s cheating habits.\n\nBecause the sixth miss – the general’s legitimate daughter, was bitten by a snake, she needs detoxification. The cure was apparently getting poisoned by scorpions, to fight one poison with another. But since she’s already weak, they decided it would be better if she drank the blood of someone poisoned by scorpions instead. The general’s madam naturally decided to use Yu Linglong’s blood. During the process of getting bitten by the scorpion, the original timid Yu Linglong died of fright (and maybe poison? it’s never made clear). Then Yu Mei takes over her body.\n\nYu Mei is a modern woman. She was some mafia boss, so she’s very capable with fighting and overbearing attitude. She died because the man she fell in love with betrayed her and killed her. So she doesn’t trust easily afterward.\n\nSince she took over Yu Linglong’s body, she refuses to adapt to the circumstances of a lowly illegitimate daughter, and uses her violence to fight for a peaceful life, where no one will challenge her and plot against her. Basically, she beats them up into submission. In the meantime, she acquires a tail – a very persistent prince, who only seems to stick to her harder, the colder she treats him. Did ancient men have such heavy tastes, she wonders.>"
}