{
	"url": "https://www.novelupdates.com/series/ichiman-nen-ikita-furofushi-no-ore-shinu-houhou-o-sagashite-tabishitetara-naze-ka-eiyuu-ni-natteta/",
	"title": "Ichiman-nen Ikita Furofushi no Ore, Shinu Houhou o Sagashite Tabishitetara Naze ka Eiyuu ni Natteta - Novel Updates",
	"image": "https://www.novelupdates.com/img/noimagefound.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Comedy   Fantasy   Seinen   ",
	"tags": "Appearance Different from Actual Age   Curses   Fantasy World   Immortals   Male Protagonist   Overpowered Protagonist   Protagonist Strong from the Start   Witches   World Travel   ",
	"rating": "(3.4 / 5.0, 17 votes)",
	"author": "Miraijin A   未来人A   ",
	"year": "\n2019",
	"ranking": "#2000   #2000   #7204   #3878   #9212   ",
	"reviewcount": "3 Reviews sorted by",
	"description": "”I’ve been tired of living…”\n\nMy name is Perez Gantor. I’ve become immortal for 10.000 years and had tired of it.\n\nIt was when a witch curses me with immortality and back then I was saying, “You called this curse, no, this is a blessing!” Now I want to punch that guy very much. Being unkillable is very tiring. Just keep living was already pretty exhausting and almost made me crazy. To be honest, at the time I turned 5,000 years old, I was already at my limit. But the only thing that holds me until now is my will to survive. I even almost tried everything just to pass my time.\n\nBut, I’ve been sick of it! Now I’m going to stop it!\n\nSo I have left my home to set out on a journey to break the curse and die.\n\nIn the span of my life for 10,000 years, I’ve become so overpowered and so knowledgeable after trained a lot and studying in my spare time. Afterward, using them on my travels and unknowingly I had solved the problems that occurred in various places. Because of this, they began to call me a hero.\n\nBeing treated like a hero, many people start depending on me and leading it more difficult to find a way to die.\n\n“When the hell am I going to die?!”\n\nI was screaming from the bottom of my heart.>"
}