{
	"url": "https://www.novelupdates.com/series/do-you-know-how-to-capture-a-villain/",
	"title": "Do You Know How to Capture a Villain? - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/08/Do-You-Know-How-to-Capture-a-Villain.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Romance   Xianxia   ",
	"tags": "Beautiful Female Lead   Cold Love Interests   Cultivation   Dense Protagonist   Devoted Love Interests   Fantasy World   Female Protagonist   Handsome Male Lead   Lack of Common Sense   Naive Protagonist   Slow Growth at Start   Slow Romance   Strong Love Interests   Sword And Magic   System Administrator   Transmigration   ",
	"rating": "(4.2 / 5.0, 10 votes)",
	"author": "扶桑知我   ",
	"year": "\n2022",
	"ranking": "#1768   #1572   #10462   #3004   #10596   ",
	"reviewcount": "1 Review sorted by",
	"description": "Ji Qingzhou was anthropophobic and foolish. She had no redeeming qualities, except for her face.\n\nOnce she transmigrated, she was bound to a Guide System to save the world.\n\nShe was tasked with capturing Shen Rongyu, the sinister, beautiful, mighty, gloomy villain and Great Shixiong of Xuanyun Sect, and to prevent him from destroying the immortal cultivation world in the future.\n\nCan Ji Qingzhou, who had been single for 20 years, learn how to capture a villain?\n\nOf course not.\n\nShe started off terribly, and muddled through the tasks that the system issued.\n\n*****\n\nShen Rongyu was practicing swordsmanship, leaving bright and shiny sword glints on the snow. Ji Qingzhou should have stood by and applauded to show her admiration for her Shixiong[1].\n\nHowever, she was preoccupied with eating cakes, and accidentally fed some cakes to Shen Rongyu’s sword that killed and drank blood without limit.\n\nAfter she left, Shen Rongyu lifted his sword and shook it several times to make the sword spit out the pastries.\n\nWhile treating an injured Shen Rongyu, she accidentally discovered another old injury of his. She should have shed tears to show her heart ache for him.\n\nShe squeezed her eyes for a long time but could not shed any tears. She only touched his wound and said dryly, “Shixiong, your tattoo is quite cool indeed.”\n\nShen Rongyu was so angry with her that he became ill for three more months.\n\nShe finally had a chance to talk with Shen Rongyu under the moon, and she should have taken this opportunity to further cultivate their feelings.\n\nHowever, Ji Qingzhou overslept. The next morning, she brought Shen Rongyu breakfast and asked him if he wanted to dine with her.\n\nShen Rongyu, who had waited all night, said drowsily, “I won’t eat.”\n\nIn the end, the orthodox sects were subverted. Shen Rongyu stepped on white bones and blood, covered her eyes with one hand, and shielded her eyes from the scarlet view.\n\nJi Qingzhou was very nervous. ‘Is it my turn?’ Her long eyelashes trembled uneasily on his palm.\n\nShe was about to instruct the system to prepare her funeral, but to her surprise, Shen Rongyu leaned over and brushed his lips past her ear.\n\nIn the darkness, he spoke in a low and paranoid tone.\n\n“Ji Qingzhou, now that everything has come to this, can you be more serious about targeting me?”\n\nTL Note:\n\n1 Shixiong – elder martial brother>"
}