{
	"url": "https://www.novelupdates.com/series/unscrupulous-enchantress-the-eldest-young-miss-has-arrived/",
	"title": "Unscrupulous Enchantress: The Eldest Young Miss has Arrived! - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/02/Unscrupulous-Enchantress-The-Eldest-Young-Miss-has-Arrived.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Comedy   Harem   Martial Arts   Mature   Romance   Xuanhuan   ",
	"tags": "Beast Companions   Beasts   Beautiful Female Lead   Black Belly   Calm Protagonist   Cheats   Clever Protagonist   Clingy Lover   Cold Love Interests   Cunning Protagonist   Demi-Humans   Demons   Female Protagonist   Godly Powers   Gods   Handsome Male Lead   Love Interest Falls in Love First   Love Rivals   Loyal Subordinates   Magic Beasts   Magical Space   Master-Servant Relationship   Overpowered Protagonist   Persistent Love Interests   Polyandry   Reverse Harem   Ruthless Protagonist   Saints   Shameless Protagonist   Slow Romance   Strength-based Social Hierarchy   Strong Love Interests   Strong to Stronger   Sword And Magic   Transmigration   Transported to Another World   Tsundere   Unconditional Love   ",
	"rating": "(4.0 / 5.0, 122 votes)",
	"author": "Wan Ye Xing Cheng   ",
	"year": "\n2015",
	"ranking": "#1037   #402   #1690   #6255   #1978   ",
	"reviewcount": "21 Reviews sorted by",
	"description": "Luan Hualie is just too pitiful! She was just playing a game when she was suddenly transported into another world to become the Young Miss. Just this is okay, but she actually doesn’t have the slightest bit of power!\r\n\r\nHowever, at this moment she had long stopped being the originally powerless eldest young miss. Mythical weapons and pets in her hand, what is there to fear underneath the heavens?\r\n\r\nShe rose above the mountains and brought down the oceans, and even more so subdued great amounts of devil beasts and holy beasts!\r\n\r\nWhen she swept away the entire continent with her powerful and imposing manner, who could tell she was originally that ridiculous eldest young miss of Lu Family?\r\n\r\nHe, the prince of Qin, a black-bellied little shotacon, played the pig to eat the tiger. In the midst of the collisions and crossing of swords, how did his mind and body fall into enemy hands?\r\n\r\nHe, the spawn of the devil, slaughtered and felled the whole world. Without heart, without emotion, without desire. A long contest, countless fights. Why did a brilliant ray of light start to penetrate that frozen world of his?\r\n\r\nHe, the beautiful man saved from the slave market, obviously had excellent martial arts. Yet, how was he reduced to the most inferior slave? Faced with her salvation, why were his thoughts in a whirl?\r\n\r\nAnd there was still him!>"
}