{
	"url": "https://www.novelupdates.com/series/the-generals-vampire-omega/",
	"title": "The General’s Vampire Omega - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/02/The-Generals-Vampire-Omega.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Comedy   Fantasy   Mystery   Romance   Sci-fi   Shounen Ai   Supernatural   ",
	"tags": "Amnesia   Bickering Couple   Bloodlines   Couple Growth   Crime   Criminals   Cute Protagonist   Doting Love Interests   Drugs   Evil Religions   Familial Love   Family   Famous Parents   Fantasy World   Fated Lovers   Handsome Male Lead   Heartwarming   Hidden Abilities   Hiding True Identity   Human-Nonhuman Relationship   Identity Crisis   Investigations   Lack of Common Sense   Love Interest Falls in Love First   Marriage   Military   Murders   Mystery Solving   Naive Protagonist   Older Love Interests   Omegaverse   Police   Politics   Power Couple   Secrets   Smart Couple   Sudden Strength Gain   Unreliable Narrator   Vampires   Wealthy Characters   ",
	"rating": "(4.4 / 5.0, 321 votes)",
	"author": "Little Baldy   秃子小贰   ",
	"year": "\n2020",
	"ranking": "#2773   #3043   #2013   #972   #1647   ",
	"reviewcount": "77 Reviews sorted by",
	"description": "As a newborn vampire, Luo ZhouZhou’s instincts are ingrained in his genes making him embark on a constant lifelong quest for a matching mate. His mate’s blood must be warm and sweet, with the scent of red caltrop fruit. However, after almost twenty years of searching without any luck, Luo ZhouZhou felt himself withering away until he traveled to an unknown time and space.\r\n\r\nGetting accustomed to his new human life (not human, vam-pi-re!) is far from easy, but when he ends up at the office of the Bayard district’s police station, he finally finds the smell he has been searching for all this time.\r\n\r\nOnly a whiff and I know he’s the mate I’ve been looking for!\r\n\r\nIn a strange place with pheromones and secondary genders, the naive Luo ZhouZhou, who knows nothing about the workings of this ABO world, has to find the owner of that scent. And there’s also an omega killer on the loose!\r\n\r\nWhat are omegas and alphas? Some kind of personal slaves? If only this General Chu Feng would leave this vampire in peace so he can fulfill his lifelong quest, dammit!>"
}