{
	"url": "https://www.novelupdates.com/series/i-have-a-treasure-cabinet/",
	"title": "I Have a Treasure Cabinet - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/05/I-Have-a-Treasure-Cabinet.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Shounen Ai   ",
	"tags": "Clever Protagonist   Comedic Undertone   Debts   Doting Parents   Game Elements   Level System   Shameless Protagonist   Strong Love Interests   Survival Game   System Administrator   Unlucky Protagonist   Weak to Strong   Younger Love Interests   ",
	"rating": "(3.8 / 5.0, 26 votes)",
	"author": "Long Qi   龙柒   ",
	"year": "\n2022",
	"ranking": "#3133   #6367   #7882   #7250   #8204   ",
	"reviewcount": "4 Reviews sorted by",
	"description": "Li Shaoxi woke up and learned that his family had a debt of 80 million yuan.\r\n\r\n80 million! Where could he get so much money?\r\n\r\nLi Shaoxi was feeling desperate when he heard a cold voice. “If you survive for three days, you can take away anything you can carry with you from the game.”\r\n\r\n“The countdown begins. 3, 2…”\r\n\r\nWhat the? He didn’t say he wanted to join… eh? The first game was actually Treasure Miner? Wasn’t this the single player mini-game with big treasures that manipulated a lousy old man with a blatant perspective cheat?\r\n\r\nWhat did that voice say? Could he bring the rubies, sapphires, big gold nuggets and small gold bricks in the game back to reality?\r\n\r\nMy god! The poor, crying Young  Master Li instantly stood up!\r\n\r\nLater, Li Shaoxi found that his thoughts were too small. Out of the countless players all over the world who were involved in the game, only he could bring things back to reality.\r\n\r\nWasn’t it just making 80 million? The bigshots who were waiting to be fed spontaneously started bidding.\r\n\r\n“I will give you 10 million for this skill book!”\r\n\r\n“50 million!”\r\n\r\n“100 million!”\r\n\r\nLi Shaoxi was stunned and swallowed down the unspoken words, ‘Um, I have 100 copies of this skill book…’\r\n\r\nWas 100 million serious? What bigshots!\r\n\r\nThe even more outrageous thing was:\r\n\r\nHe brought back a top chef from a food game.\r\n\r\nHe brought back a city from an infrastructure game.\r\n\r\nHe brought back a boyfriend from a dating game.\r\n\r\nJian Yue, who was brought out: “You like me…”\r\n\r\nLi Shaoxi exclaimed, “Don’t take the words in the game seriously…”\r\n\r\nIt was over. He had provoked a bigshot who shouldn’t be provoked. Was it too late to run away now?>"
}