{
	"url": "https://www.novelupdates.com/series/my-daughter-grew-up-to-rank-s-adventurer/",
	"title": "My Daughter Grew Up to “Rank S” Adventurer. - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2018/05/srankgirl.jpg",
	"noveltype": "(JP)",
	"genre": "Comedy   Fantasy   Shounen   Slice of Life   ",
	"tags": "Abandoned Children   Adapted to Manga   Adopted Children   Adventurers   Childcare   Fantasy World   Misunderstandings   Multiple Protagonists   Parent Complex   Protagonist Strong from the Start   Sword And Magic   ",
	"rating": "(4.6 / 5.0, 204 votes)",
	"author": "Mojikakiya   門司柿家   ",
	"year": "\n2017",
	"ranking": "#1732   #4219   #904   #1347   #527   ",
	"reviewcount": "24 Reviews sorted by",
	"description": "After losing his leg as a startup adventurer, he retired to his hometown in the countryside. Doing things such as collecting medicinal herbs, exterminating magic beasts and wild beasts, and helping with the villagers’ farm work, it’s hard to decide whether to call our protagonist an adventurer or a handyman. And while doing these things his age quickly approached thirty.\r\n\r\nOne day while searching the mountains for herbs, he discovered an abandoned child. Thinking that he couldn’t just leave it, he took it home and raised it until his age approached forty.\r\n\r\nHis now grown-up daughter had also wanted to become an adventurer, likely from growing up watching her father. Although her father had taught her the sword since she was young for self-defense, her talent at it was quite impressive. Thinking that it would be better for her not to be stuck out in the country for the rest of her life, our protagonist sent her to the adventurers’ guild in the Capital.\r\n\r\nHis daughter officially became an adventurer.\r\n\r\nAfter another five years, the protagonist, now in his forties, is still acting as a pseudo-adventurer in the countryside. However his daughter is now a distinguished S Class adventurer but hasn’t returned home once yet…\r\n\r\n“Just when will I get to see Daddy again…!?”>"
}