{
	"url": "https://www.novelupdates.com/series/raiders-counterattack-quick-transmigration/",
	"title": "Raiders Counterattack [Quick Transmigration] - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/07/Raiders-Counterattack-Quick-Transmigration.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adult   Drama   Fantasy   Romance   Yaoi   ",
	"tags": "Amnesia   Aristocracy   Artificial Intelligence   Calm Protagonist   Celebrities   Doting Love Interests   First-time Interc**rse   Futuristic Setting   Handsome Male Lead   Love Interest Falls in Love First   Military   Modern Day   Seme Protagonist   System Administrator   Transmigration   Transported into a Game World   Vampires   World Hopping   ",
	"rating": "(4.5 / 5.0, 42 votes)",
	"author": "持续修仙   ",
	"year": "\n2020",
	"ranking": "#1583   #2499   #6087   #3515   #6264   ",
	"reviewcount": "7 Reviews sorted by",
	"description": "[For unknown reasons, the two protagonists are entangled and quarreling. You stray into it, you take Xiao Shou away, and you send him home. When Xiao Gong thinks that you are a rival in love, he gets jealous and understands his feelings for Xiao Shou.]\n\n\nChu Qianze turned the pen in his hand in a circle and smashed it against the drum next to him, the loud drum sound resounding around him.\n\nFacing the two people who looked over at him together, he pulled out a polite smile, which was very dazzling under the neon light.\n\n“I’m sorry, you are ruining my eyes.”\n\nLater:\n\n[Xiao Gong bought you N rose bouquets!]\n\n\nFeeling the gazes of the people around him, the flashing lights that flared from time to time, and a few gasps, Chu Qianze’s mouth twitched: “Is this a new way to surprise people?”\n\n***\n\n[Xiao Gong couldn’t stand the entanglement of Bamboo Horse, so he asked someone to come and play his lover. He wanted to make this childhood friend give up completely. According to their plan, the two would later act in a fake role. This task is very simple; you just need to express disbelief.]\n\n\nChu Qianze, who had just arrived in the world and was getting acquainted with his surroundings, was inexplicably pulled by a man and was held in his arms.\n\n“I already have someone I like; it’s him!”\n\nChu Qianze looked at the person blankly, but saw that the other person turned his eyes away, his breath a little disordered.\n\n“..?”>"
}