{
	"url": "https://www.novelupdates.com/series/blooming-romance/",
	"title": "Blooming Romance - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2018/11/9de5131bgy1ft85ybrxhej20ef0kv412.jpg",
	"noveltype": "(CN)",
	"genre": "Adult   Drama   Romance   Slice of Life   Yaoi   ",
	"tags": "Calm Protagonist   Caring Protagonist   Childcare   Clingy Lover   Complex Family Relationships   Cute Children   Cute Story   Devoted Love Interests   Doting Love Interests   Early Romance   First-time Interc**rse   Glasses-wearing Protagonist   Handsome Male Lead   Hard-Working Protagonist   Love Interest Falls in Love First   Lovers Reunited   Marriage   Misunderstandings   Modern Day   Mpreg   Possessive Characters   Wealthy Characters   Younger Love Interests   ",
	"rating": "(4.3 / 5.0, 295 votes)",
	"author": "寒菽   ",
	"year": "\n2018",
	"ranking": "#5262   #2000   #906   #2738   #655   ",
	"reviewcount": "49 Reviews sorted by",
	"description": "After receiving his terminal illness diagnosis, Chu Xun could finally let go of everything. The most important thing of being alive is after all, one’s own happiness.\n\nDumping a jerk, getting back at his as*hole colleagues, firing his dumbass boss, staying in a luxurious house, enjoying a feast and bedding a young, energetic and handsome guy—Chu Xun very coolly did what he didn’t dare to do in the past!\n\nAll his savings were spent and as he laid down waiting for his death, the doctor apologetically told him, “I’m so sorry, we misdiagnosed you.”\n\n“…” Chu Xun felt faint.\n\nHe did another checkup and thought, he did feel unwell recently though?\n\nThe doctor looked grim.\n\nChu Xun’s heart skipped a beat. “Don’t tell me it wasn’t a misdiagnosis after all. Am I sick?”\n\nDoctor: “You do not have a terminal illness, but you are… You are pregnant.”\n\nChu Xun: “???” Ermm, he’s a guy?\n\nAnd later, the child’s father, that young, energetic and handsome man, who also happened to be a 26-year-old billionaire, Lin Yanchen, appeared and handed out a marriage certificate already signed by him. “I’ll take responsibility. Let’s get married.”\n\nChu Xun only realised now that his 30-years-late love life, as though blooming blossoms, was flooding in.>"
}