{
	"url": "https://www.novelupdates.com/series/i-became-hugely-popular-after-becoming-a-cannon-fodder-star/",
	"title": "I Became Hugely Popular After Becoming a Cannon Fodder Star - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/06/I-Became-Hugely-Popular-After-Becoming-a-Cannon-Fodder-Star.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Drama   Romance   Shounen Ai   ",
	"tags": "Acting   Celebrities   Charismatic Protagonist   Doting Love Interests   Friendship   Handsome Male Lead   Heartwarming   Love at First Sight   Love Interest Falls in Love First   Modern Day   Movies   Pets   Power Couple   Previous Life Talent   Showbiz   Slow Romance   Smart Couple   Transmigration   Wealthy Characters   ",
	"rating": "(4.1 / 5.0, 102 votes)",
	"author": "惗肆   ",
	"year": "\n2020",
	"ranking": "#1430   #1503   #2940   #1828   #2751   ",
	"reviewcount": "32 Reviews sorted by",
	"description": "The original owner of the body had a face that went against the gods and could clearly rely on this face to dominate the entertainment industry. However, he believed in the instigation of his brainless agent and took part in a special ‘drinking party.’ He ended up disfigured and ruined.\r\n\r\nHe was an 18th tier cannon fodder who only appeared in three chapters. He simply had the word ‘miserable’ engraved on his forehead.\r\n\r\nThe movie emperor Ji Li transmigrated into this book and ripped up the terrible character design on the spot. He examined his appearance in the mirror—\r\n\r\nThere was no rhyme or reason to it. Why do dishonest things? With this face, wasn’t it good to start a career on his own?\r\n\r\nIt was fragrant.\r\n\r\n***\r\n\r\nJi Li just wanted to take the career line. He used his sinister insight to pick up unexpected work—\r\n\r\nHe wanted to be the third male lead in a movie and was ridiculed by his fans.\r\n\r\nHe wanted to pick up the advertisement of a small perfume brand and was stabbed by a rival for having no future prospects.\r\n\r\nHe wanted to accept a poor travel variety show and his agent team frantically tried to stop him.\r\n\r\nAs a result, Ji Li became hugely popular in three years! A big explosion! A top traffic!\r\n\r\nEveryone: ??? My face hurts. [Lighting a cigarette through the vicissitudes of life.JPG]\r\n\r\nJi Li: Thank you for the invitations. I am just an average worker in the entertainment industry [Puts out the cigarette butt.JPG]>"
}