{
	"url": "https://www.novelupdates.com/series/obligation-of-an-arranged-marriage/",
	"title": "Obligation of an Arranged Marriage - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/04/Obligation-of-an-Arranged-Marriage.jpg",
	"noveltype": "(KR)",
	"genre": "Adult   Drama   Fantasy   Mature   Romance   Smut   ",
	"tags": "Adopted Children   Adopted Protagonist   Aristocracy   Arranged Marriage   Beautiful Female Lead   Cautious Protagonist   Childhood Love   C*nnilingus   Cohabitation   Cold Love Interests   Couple Growth   Different Social Status   Doting Love Interests   European Ambience   Female Protagonist   First Love   First-time Interc**rse   Flashbacks   Forced into a Relationship   Handsome Male Lead   Hard-Working Protagonist   Jealousy   Kuudere   Love Interest Falls in Love First   Marriage   Marriage of Convenience   Misunderstandings   Nobles   Nudity   Obsessive Love   Orphans   Possessive Characters   Pregnancy   Quiet Characters   R-18   Reluctant Protagonist   Royalty   Schemes And Conspiracies   Secret Crush   Short Story   Unrequited Love   Wealthy Characters   ",
	"rating": "(3.9 / 5.0, 84 votes)",
	"author": "백설홍   ",
	"year": "\n2019",
	"ranking": "#555   #851   #4906   #2646   #4282   ",
	"reviewcount": "12 Reviews sorted by",
	"description": "“Eila, I think you forgot, but I have a wife. It is you.”\r\n\r\nAfter meeting properly for the first time in 12 years, Leon spoke to Eila with a firm voice.\r\n\r\n'So the heir I'm talking about is the child between you and me.”\r\n\r\nLeon's long, thick fingers ran through her hair. Then he gently touched her face, and his thumb caressed her lips. When her white teeth and red tongue was exposed over her slightly open lips, he looked ecstatic and said.\r\n\r\n“I hope you will fulfill the obligation of this marriage that you have been putting off, Eila.”\r\n\r\n* * *\r\n\r\n'Eila.'\r\n\r\nLeon's voice was earnest even though the person he was speaking to was in his arms.\r\n\r\nDid Eila know? How long he had been waiting for this day.\r\n\r\nLeon did not let her go from his arms for a long while. The soft touch of her body against his chest and the pounding of her small heart was absolutely lovely. His hands ran through her hair and shoulders over and over again, as if he couldn't believe she was in his arms. It was a careful touch, as if touching the most precious treasure in the world.\r\n\r\nTraces of his desire which he poured out over and over again were flowing from between her legs. He looked at the traces of himself flowing underneath for a moment.\r\n\r\nMy body only heats up for one person. Only to his wife right in his arms.>"
}