{
	"url": "https://www.novelupdates.com/series/ishura/",
	"title": "Ishura - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/12/Ishura_1609085212.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Drama   Fantasy   ",
	"tags": "Adapted to Manga   Award-winning Work   Battle Competition   Cheats   Demon Lord   Gore   Heroes   Monsters   Multiple POV   Multiple Protagonists   Mythical Beasts   Non-humanoid Protagonist   Past Plays a Big Role   Politics   Ruthless Protagonist   Survival   Transported to Another World   ",
	"rating": "(3.3 / 5.0, 9 votes)",
	"author": "Keiso   珪素   ",
	"year": "\n2017",
	"ranking": "#2000   #2000   #12894   #12558   #12277   ",
	"reviewcount": "No Reviews",
	"description": "The worlds enemy that spread terror to everything in the horizon, the 'real demon king' was defeated by someone.\r\nThe name and existence of that one hero is still unknown.\r\nNow that the age of terror was over, it was necessary to determine who that person was.\r\n\r\nAt the worlds largest city――the Yellow Capital, the strongest were gathering.\r\nThe one that gained victory there would be determined to be the hero.\r\nA new era was about to begin, an important game to create idols of heroes.\r\n\r\nFor twenty five years, being subject to torment by the demon king, a reality that was far away to the extremes.\r\nAn era where all races sought strength in the face of one threat, perhaps it produced a threat not less than the Demon King.\r\n\r\nAt the time the tale they sought came to a sudden end, only the Shura that desired a place to battle remained.\r\n\r\n――At present, the names of the Shura were fifteen.\r\n\r\nThe Willow sword Soujirou\r\nArs the Starry\r\nKia of the worlds words\r\nSaianop of the inexhaustible flow\r\nGently singing Nastique\r\nHorizons roar Melle\r\nNoise cut Shalk\r\nRosklei the absolute\r\nSilent Uhaku\r\nMagic Two\r\nWinter's Ruknoka\r\nObsidian Linalis\r\nBox of destitute wisdom Mestel Exil\r\nRepulsive Troa\r\nReverse Logic Hiroto>"
}