{
	"url": "https://www.novelupdates.com/series/getting-married-without-my-badge/",
	"title": "Getting Married Without My Badge - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/06/Getting-Married-Without-My-Badge.jpg",
	"noveltype": "(KR)",
	"genre": "Comedy   Fantasy   Romance   ",
	"tags": "Bickering Couple   Enemies Become Lovers   European Ambience   Female Protagonist   Handsome Male Lead   Military   Rivalry   Younger Sisters   ",
	"rating": "(3.6 / 5.0, 28 votes)",
	"author": "라티네   ",
	"year": "\n2022",
	"ranking": "#2836   #4714   #8542   #7461   #8418   ",
	"reviewcount": "3 Reviews sorted by",
	"description": "“Damn it!”\n\nShe was not promoted because of her ex-boyfriend and superior.\n\nNoah put up with it, but there was only one thing she could do, reaching the end of her patience.\n\n“Let's get rid of the insignia and fight!”\n\n“It’s not fun. Let’s make the winner’s wish come true”\n\nAnd the two of them…\n\n~*~\n\n“Are we going to share the sword as a wedding gift when we make our wedding vows?”\n\n“If it’s okay to cut the lieutenant general with that sword, I will gladly do it.”\n\n“You want a red dress? You are fierce, my bride…”\n\n“Have you finally lost your mind?”\n\n“By the way, my eyes are also red, did you wear it for me?”\n\n“If only it could be stained with the blood of the lieutenant general.”\n\n“Then, starting today, I will collect them one drop at a time.”\n\n“Don’t suffer like that, I’d rather kill you at once.”\n\n“Noah, you are so hot and fierce…! You should say that in bed!”\n\n“Just die the first night.”\n\n“Then bury me in a couple’s tomb. I’ll wait till you die. How about the sea?”\n\n“I prefer the land.”\n\nNoah shuddered as she pondered over and over what Leto had said. Why did she have a relationship with a guy like that?\n\n“I’m not really crazy…”\n\nNo matter how much she thought about it, she couldn’t come up with a proper answer other than his face and body.\n\n“…”\n\nAnd Ami’s gaze at such a friend was only cold.\n\n“You’re weird too.”>"
}