{
	"url": "https://www.novelupdates.com/series/rebirth-merchant-wonderful-space-hunting-for-military-officer/",
	"title": "Rebirth Merchant: Wonderful Space Hunting for Military Officer - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/04/28045s.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Fantasy   Gender Bender   Josei   Romance   School Life   Supernatural   ",
	"tags": "Adopted Protagonist   Apathetic Protagonist   Arrogant Characters   Beautiful Female Lead   Business Management   Calm Protagonist   Cautious Protagonist   Cheats   Cold Love Interests   Cold Protagonist   Confident Protagonist   Couple Growth   Cross-dressing   Cruel Characters   Cunning Protagonist   Devoted Love Interests   Eye Powers   Female Protagonist   Firearms   Handsome Male Lead   Hidden Abilities   Hiding True Identity   Love Interest Falls in Love First   Loyal Subordinates   Magical Space   Military   Modern Knowledge   Mysterious Family Background   Older Love Interests   Overpowered Protagonist   Poor to Rich   Previous Life Talent   Protagonist Strong from the Start   Reincarnation   Revenge   Second Chance   Secret Organizations   Siblings Not Related by Blood   Slow Romance   Strong Love Interests   Wealthy Characters   ",
	"rating": "(3.6 / 5.0, 43 votes)",
	"author": "Wu Qingkuang   一舞轻狂   ",
	"year": "\n2017",
	"ranking": "#2000   #2000   #3239   #6341   #3956   ",
	"reviewcount": "9 Reviews sorted by",
	"description": "In her last life, as a cold-blooded assassin, she died without leaving her body behind and was reborn to the time when she was 15 years old with a supernatural ability.\n\nTeaching a lesson to the parents whom are jerks, playing around with the selfish younger sister, slapping the faces of weirdo relatives.\n\nOutstanding and high combat ability, who said that both looks and intelligence can’t be applied to the same person? With that said, she got the attention of a military officer.\n\n“You’re suspected for the crime of murder, hacking into the general server system…… There’s too many crimes to be listed, you need to be apprehended immediately.”\n\nSong Ye raised her eyebrow and got onto the military officer, “According to Young Master Qin, if I want to be cleared off of those crimes, is there any good suggestion for it?”\n\nA certain someone’s eyes darkened and said, “Marry me.”>"
}