{
	"url": "https://www.novelupdates.com/series/in-different-world-with-naruto-system/",
	"title": "In Different World with Naruto System - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2016/06/In-Different-World-With-Naruto-System.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Fantasy   Martial Arts   Mystery   Shounen   Slice of Life   Xuanhuan   ",
	"tags": "Beast Companions   Beautiful Female Lead   Bloodlines   Body Tempering   Cheats   Clever Protagonist   Confident Protagonist   Cultivation   Death of Loved Ones   Eye Powers   Fanfiction   Fast Cultivation   Friendship   Game Elements   Genius Protagonist   Handsome Male Lead   Hard-Working Protagonist   Hiding True Abilities   Late Romance   Magical Space   Male Protagonist   Monster Girls   Multiple Identities   Multiple Realms   Ninjas   Overpowered Protagonist   Playful Protagonist   Revenge   Romantic Subplot   Ruthless Protagonist   Spatial Manipulation   Special Abilities   Strength-based Social Hierarchy   Strong Love Interests   Sudden Strength Gain   Summoning Magic   Sword And Magic   Time Manipulation   Transmigration   Transported to Another World   Underestimated Protagonist   Unique Cultivation Technique   Wars   Weak to Strong   World Travel   ",
	"rating": "(3.3 / 5.0, 793 votes)",
	"author": "Fishball Vinegar Rice   鱼丸酱醋米   ",
	"year": "\n2014",
	"ranking": "#2000   #2000   #242   #1278   #1054   ",
	"reviewcount": "112 Reviews sorted by",
	"description": "At Divine Wind Continent, there is cultivation system—douqi, illusion and magic.\n\nRen Tian You was a fan of Naruto, and a single moment of carelessness caused him to arrive in different world.\n\nUnexpectedly, only to discover that his body possessed Naruto system!\n\nWhat? You will use douqi! I, your father’s taijutsu is also not weak! Look at my shadow dance!\n\nWhat? You will use illusions! I, your father however have every illusions’ ancestor, Sharingan! Look at my Tsukuyomi!\n\nWhat? You are a magician! I, your father am a ninja! Look at my fire style——– grand fireball!>"
}