{
	"url": "https://www.novelupdates.com/series/cute-beast-store-no-138/",
	"title": "Cute Beast Store No. 138 - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/08/16699s.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Fantasy   Romance   Supernatural   Xuanhuan   Yaoi   ",
	"tags": "Animal Characteristics   Arrogant Characters   Beast Companions   Beasts   Clever Protagonist   Cold Love Interests   Complex Family Relationships   Contracts   Demi-Humans   Dense Protagonist   Fantasy World   Forced Marriage   Futuristic Setting   Handsome Male Lead   Hard-Working Protagonist   Hiding True Abilities   Hiding True Identity   Human-Nonhuman Relationship   Love Interest Falls in Love First   Poor to Rich   Power Couple   R*pe   Shameless Protagonist   Smart Couple   Special Abilities   Store Owner   Strong Love Interests   Transmigration   Wealthy Characters   ",
	"rating": "(3.5 / 5.0, 161 votes)",
	"author": "Dǎ JiāngShī   Fighting zombies   打僵尸   ",
	"year": "\n2012",
	"ranking": "#5262   #4713   #1865   #968   #1890   ",
	"reviewcount": "31 Reviews",
	"description": "Thousands of years ago, a small planet collided with Earth and destroyed the world. In five days, ninety percent of humans had been wiped out, leaving behind the last ten percent to earnestly struggle on death’s door.\n\nJinyu was one of those people who survived. Due to a special heredity trait, he could understand beast language. After the apocalyptic disasters, Jinyu had been living for a month with the few small beast brothers that he’d subdued. Previously, Jinyu had thought that he would live like that until he died. Yet, inexplicably, one day he opened his eyes to find that he was in a monstrous, lawless world that was full of vitality and life.\n\nJinyu’s transmigration into the future let him skip over almost one hundred thousand years. In the year 106825, beasts rule the galaxies and ‘pure’ humans are extinct. As the one and only ‘pure’ human left in the entire universe, Jinyu braves this new chaotic world to find a place for himself and thus begins to work at Beast Store number 138.>"
}