{
	"url": "https://www.novelupdates.com/series/i-am-more-paranoid-than-the-villainess/",
	"title": "I Am More Paranoid Than The Villainess - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/07/I-Am-More-Paranoid-Than-The-Villainess.jpeg",
	"noveltype": "(CN)",
	"genre": "Comedy   Drama   Fantasy   Mature   School Life   Yuri   ",
	"tags": "Beautiful Female Lead   Calm Protagonist   Clever Protagonist   Cold Protagonist   Confident Protagonist   Enemies Become Lovers   Poor to Rich   Protagonist Falls in Love First   Transmigration   Tsundere   Yandere   ",
	"rating": "(4.2 / 5.0, 32 votes)",
	"author": "妘染   ",
	"year": "\n2022",
	"ranking": "#564   #424   #6907   #1627   #8897   ",
	"reviewcount": "2 Reviews sorted by",
	"description": "Shen Man traveled into an old-fashioned dog blood novel and became the beautiful, IQ-lacking Virgin Mary heroine.\n\nWhen she took over the body, she realized that it had just been drugged.\n\nIn her blurry line of sight, there stood a beautiful and delicate girl — the villainess Lin Shu from the novel.\n\n“Shen Man, enjoy tonight,” said Lin Shu, smiling proudly. Suddenly, she was pulled into a scorching hot embrace.\n\nShen Man lifted the corners of her lips and smiled evilly, “Then do you know I like women?”\n\n———-\n\nLin Shu never thought that she would have a spring breeze with a woman.\n\nAnd that woman was the person she hated most — Shen Man\n\n“I will never like a woman, let alone you!” Lin Shu said firmly.\n\nShen Man’s slender fingers brushed the girl’s delicate lips. She smiled gently, with paranoia “Shushu, you are already my person, so you can only like me.”\n\nThe girl trembled and her cheeks flushed.\n\n———-\n\nShen Man knew that the Lin Shu from the novel would eventually become crazy from paranoia.\n\nShe thought her actions had already changed the plot, but she didn’t expect that Lin Shu still became… paranoid.\n\nThe cute little girl had grown into a mature beauty.\n\nLin Shu lifted Shen Man’s exquisite chin with gloomy eyes, “Long time no see, my Sister Man…”\n\nShen Man smiled. She grabbed Lin Shu’s waist and lightly bit her earlobe, whispering, “Baby, you’re really making me more and more surprised.”>"
}