{
	"url": "https://www.novelupdates.com/series/the-charming-cannon-fodder/",
	"title": "The Charming Cannon Fodder - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/11/charmingfodder1.jpg",
	"noveltype": "(CN)",
	"genre": "Fantasy   Romance   Tragedy   ",
	"tags": "Apathetic Protagonist   Beautiful Female Lead   Cold Protagonist   Cruel Characters   Female Protagonist   Modern Day   Past Plays a Big Role   Past Trauma   Transmigration   World Hopping   ",
	"rating": "(3.2 / 5.0, 20 votes)",
	"author": "宁归   ",
	"year": "\n2020",
	"ranking": "#2000   #2000   #8090   #7590   #7309   ",
	"reviewcount": "4 Reviews sorted by",
	"description": "Ying Rusheng was bound to a cannon fodder system. The system gave her two options:\n\nA. Be a qualified cannon fodder, even if the male lead abused her thousands of times, she would treat the male lead as her first love.\n\nB. Counterattack.\n\nGiven the low IQ of the host, the smart system recommended option A. \n\nYing Rusheng: I originally wanted to choose A to lie down, but if you say that, I won't choose A.\n\nLater, the system discovered that his host wasn't tortured to death by the male lead, but that the male lead and the second male lead were tortured to death by her, and loved her to death. \n\nSystem: ... \n\n[World One: Why is the third-rate actresses so miserable] \n\nNo one knew that the third-rate actress that everyone scolded was a genius painter, but unfortunately, the genius painter was destroyed by the one she loved and his aristocratic family, and she couldn't even pick up the brush again.\n\nLater, the male lead found out that he loved only the one who had never looked back from the beginning to the end; \n\nThe aristocratic family was even more repentant, because the third rate actress who they suppressed was actually their real daughter.\n\n[World II: The sweet and gentle person is sly, ah!] \n\nIn the beginning, the step-sister was the female lead, the step-brother was the male lead, and the uncle was the supporting character.\n\nSo Ying Rusheng chose task A happily, thinking that she could lie down and win, but didn't expect her step-sister to be a man at all. \n\nYing Rusheng: Emmm>"
}