{
	"url": "https://www.novelupdates.com/series/the-legend-of-the-railway-hero/",
	"title": "The Legend of the Railway Hero - Novel Updates",
	"image": "https://www.novelupdates.com/img/noimagefound.jpg",
	"noveltype": "(JP)",
	"genre": "Adventure   Comedy   Fantasy   Seinen   ",
	"tags": "Aristocracy   Domestic Affairs   Dragons   Elves   Fantasy World   Hard-Working Protagonist   Industrialization   Kingdom Building   Kingdoms   Leadership   Male Protagonist   Management   Modern Knowledge   Nobles   Politics   Power Struggle   Royalty   Summoned Hero   Sword And Magic   Transported to Another World   Wars   ",
	"rating": "(3.3 / 5.0, 10 votes)",
	"author": "Hayama Soujirou   葉山宗次郎   ",
	"year": "\n2015",
	"ranking": "#2000   #2000   #10465   #7049   #10431   ",
	"reviewcount": "1 Review sorted by",
	"description": "“Did a demon lord appear?”\n\n“Stop wasting time blabbering nonsense.”\n\nWhile on his way home, Tamagawa Teruya, an ordinary high school student with a peculiar hobby had lost consciousness. He woke up enveloped by light, apparently transported to the Kingdom of Lutetia in another world with the help of a reckless magical experiment.\n\nTo Teruya’s immense disappointment, the Kingdom was on the verge of ruin. One not brought about by a giant dragon attack or a hostile demon lord, but by its own railway system which allowed goods from other places to flood the country leading to an economic collapse. And just when the Queen and the ruling elite were at their wits’ end, our hero appeared and came alight upon hearing the word ‘railway’.\n\nThat was because Tamagawa Teruya was a train-otaku, someone who loved the railways with the deepest of passions, easily three times as much as he loved rice. And with the help of the knowledge every train-otaku carried in their head, he rose to the challenge and saved the day.\n\nThus rose the curtains of a story in which a high school senior that is a railway maniac becomes a hero by employing his knowledge of trains.>"
}