{
	"url": "https://www.novelupdates.com/series/predatory-marriage/",
	"title": "Predatory Marriage - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/03/predatory-marriage.jpg",
	"noveltype": "(KR)",
	"genre": "Adult   Drama   Fantasy   Mature   Romance   Smut   Tragedy   ",
	"tags": "Amnesia   Aristocracy   Arranged Marriage   Beautiful Female Lead   Betrayal   Bloodlines   Boss-Subordinate Relationship   Brainwashing   Broken Engagement   Calm Protagonist   Character Growth   Clever Protagonist   Cold Love Interests   Complex Family Relationships   Cruel Characters   Demons   Determined Protagonist   European Ambience   Family Conflict   Fantasy World   Fated Lovers   Fearless Protagonist   Female Protagonist   First-time Interc**rse   F*llatio   Handsome Male Lead   Hiding True Abilities   Human-Nonhuman Relationship   Jealousy   Kidnappings   Kingdoms   Love Interest Falls in Love First   Love Triangles   Loyal Subordinates   Magic   Male Yandere   M*sturbation   Mind Control   Misunderstandings   Nobles   Obsessive Love   Outdoor Interc**rse   Possessive Characters   Power Struggle   Pregnancy   R-18   Revenge   Royalty   Second Chance   S*aves   Special Abilities   Strong Love Interests   Weak to Strong   Wealthy Characters   Yandere   ",
	"rating": "(4.4 / 5.0, 477 votes)",
	"author": "Saha   사하   ",
	"year": "\n2020",
	"ranking": "#528   #527   #444   #3057   #206   ",
	"reviewcount": "101 Reviews sorted by",
	"description": "Princess Leah wrote a suicide note ahead of her wedding.\r\n\r\nIt was because she was certain that she would die after the wedding night; a miserable end of a princess who devoted her life to the country and to the royal family.\r\n\r\nBut before giving up her life, Leah planned her last revenge to the family, one that would surely leave them in ruins even after she became a cold corpse.\r\n\r\nShe would bring them shame by being a non-virgin bride.\r\n\r\n“Why did you throw away your first experience? Don’t you just want to run away?”\r\n\r\n“I… I want to die.” Leah impulsively confided to the man she slept with for one night.>"
}