{
	"url": "https://www.novelupdates.com/series/nine-star-hegemon-body-art/",
	"title": "Nine Star Hegemon Body Art - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/06/Nine-Star-Hegemon-Body-Art.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Comedy   Harem   Martial Arts   Xuanhuan   ",
	"tags": "Adapted to Manhua   Adopted Protagonist   Alchemy   Army Building   Arranged Marriage   Arrogant Characters   Artifact Crafting   Assassins   Battle Academy   Beast Companions   Beautiful Female Lead   Bloodlines   Body Tempering   Broken Engagement   Brotherhood   Calm Protagonist   Charismatic Protagonist   Clever Protagonist   Cruel Characters   Cultivation   Dao Comprehension   Death   Death of Loved Ones   Demi-Humans   Determined Protagonist   Devoted Love Interests   Dragons   Early Romance   Enemies Become Lovers   Famous Protagonist   Fast Cultivation   First-time Interc**rse   Godly Powers   Handsome Male Lead   Harem-seeking Protagonist   Harsh Training   Hated Protagonist   Heavenly Tribulation   Hot-blooded Protagonist   Kind Love Interests   Kuudere   Leadership   Loli   Long Separations   Love Interest Falls in Love First   Loyal Subordinates   Magic Beasts   Magical Space   Male Protagonist   Money Grubber   Multiple Realms   Mysterious Family Background   Mythical Beasts   Nobles   Pill Based Cultivation   Pill Concocting   Polygamy   Poor to Rich   Popular Love Interests   Prophecies   Protagonist Falls in Love First   Romantic Subplot   Ruthless Protagonist   Shameless Protagonist   Sharp-tongued Characters   Skill Creation   Spies   Spirit Advisor   Stoic Characters   Strength-based Social Hierarchy   Strong Love Interests   Strong to Stronger   Tragic Past   Transplanted Memories   Unconditional Love   Unique Cultivation Technique   Weak to Strong   World Travel   ",
	"rating": "(3.2 / 5.0, 428 votes)",
	"author": "Ordinary Magician   平凡魔术师   ",
	"year": "\n2015",
	"ranking": "#70   #33   #76   #72   #1114   ",
	"reviewcount": "102 Reviews sorted by",
	"description": "Long Chen, a crippled youth who cannot cultivate, is constantly targeted and bullied by his fellow noble heirs. After a particularly vicious beating, he wakes up and realizes a Pill God’s soul has somehow merged with him, giving him additional memories. Among those memories is the mysterious 'Nine Star Hegemon Body Art', a cultivation technique even he can train in, but its secrets and origin are still a mystery to him. Relying on his improved instincts as he finally begins to cultivate, he realizes a huge conspiracy is underfoot within the Phoenix Cry Empire, one involving his father, the members of the imperial family, and even the emperor himself.\n\nIn order to solve the mysteries around him, he must rely on his new alchemy techniques and the powerful but baffling Nine Star Hegemon Body Art. Countless enemies block him as he attempts to climb to the peak of the cultivation world.\n\nHis destined fate was to only be a chess piece, but he will not bow to the will of the Heavens.>"
}