{
	"url": "https://www.novelupdates.com/series/my-sweet-heart/",
	"title": "My Sweet Heart - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/01/My-Sweet-Heart_1611381102.jpg",
	"noveltype": "(KR)",
	"genre": "Adult   Drama   Fantasy   Mature   Romance   Smut   ",
	"tags": "Absent Parents   Abusive Characters   Aggressive Characters   Aristocracy   Average-looking Protagonist   Character Growth   C*nnilingus   Complex Family Relationships   Couple Growth   Court Official   Cruel Characters   Dense Protagonist   Depictions of Cruelty   Different Social Status   Doting Love Interests   Early Romance   Emotionally Weak Protagonist   European Ambience   Familial Love   Family   Family Conflict   Female Protagonist   First Love   First-time Interc**rse   F*llatio   Handsome Male Lead   H*ndjob   Introverted Protagonist   Kingdoms   Love at First Sight   Low-key Protagonist   Marriage   Mature Protagonist   Misunderstandings   Naive Protagonist   Nobles   Obsessive Love   Past Plays a Big Role   Past Trauma   Playboys   Popular Love Interests   Pregnancy   Protagonist Falls in Love First   Quiet Characters   R-18   Royalty   R*pe   Secret Crush   Selfless Protagonist   Sharp-tongued Characters   Shy Characters   Stalkers   Timid Protagonist   Tragic Past   Unconditional Love   Underestimated Protagonist   Weak Protagonist   Wealthy Characters   ",
	"rating": "(3.7 / 5.0, 58 votes)",
	"author": "Baek Mokran   백목란   ",
	"year": "\n2018",
	"ranking": "#3133   #3773   #4391   #6025   #4060   ",
	"reviewcount": "5 Reviews sorted by",
	"description": "‘Oh my God! Oh my God!’\n\nIsabel, who had been secretly following Agares, was now unknowingly one step closer to him.\n\n“Who are you? The goddess of the beautiful night?”\n\n“P-please let go.”\n\n“You’re the one hiding in a man’s room.”\n\nJust as she had dreamed, just as she had always wished for, Agares’ tongue penetrated her mouth. \n\nThe miraculous night she spent laying with him passed, and she had thought that he would never remember her, but…\n\n“It’s you.”\n\n“What—what are you talking about?”\n\n“It’s you. The woman who ate me and ran away.”>"
}