{
	"url": "https://www.novelupdates.com/series/the-regressed-demon-lord-is-kind/",
	"title": "The Regressed Demon Lord is Kind - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/06/The-Regressed-Demon-Lord-is-Kind.jpg",
	"noveltype": "(KR)",
	"genre": "Action   Adventure   Comedy   Fantasy   Mystery   ",
	"tags": "Adventurers   Age Regression   Antihero Protagonist   Appearance Different from Actual Age   Aristocracy   Beast Companions   Beautiful Female Lead   Calm Protagonist   Charismatic Protagonist   Clever Protagonist   Cold Protagonist   Comedic Undertone   Complex Family Relationships   Cunning Protagonist   Demon Lord   Elemental Magic   Enemies Become Allies   Evil Organizations   Evil Religions   Family Conflict   Fantasy World   Former Hero   Genius Protagonist   Handsome Male Lead   Heroes   Kingdoms   Lack of Common Sense   Late Romance   Lost Civilizations   Love Interest Falls in Love First   Loyal Subordinates   Magic   Magic Beasts   Magical Technology   Male Protagonist   Master-Servant Relationship   Multiple POV   Multiple Timelines   Mystery Solving   Narcissistic Protagonist   Nobles   Overpowered Protagonist   Past Plays a Big Role   Playful Protagonist   Power Couple   Previous Life Talent   Priestesses   Proactive Protagonist   Religions   Ruthless Protagonist   Sadistic Characters   Saints   Secret Organizations   Servants   Shameless Protagonist   Sharp-tongued Characters   Slow Romance   Spatial Manipulation   Strong Love Interests   Strong to Stronger   Sudden Strength Gain   Sword And Magic   Sword Wielder   Time Travel   Torture   Twisted Personality   Underestimated Protagonist   World Tree   ",
	"rating": "(4.3 / 5.0, 529 votes)",
	"author": "Hungry Panda   배고픈판다   ",
	"year": "\n2020",
	"ranking": "#1   #1   #124   #2   #274   ",
	"reviewcount": "93 Reviews sorted by",
	"description": "My whole life, all I wanted was power.\n\nI churned the world into rivers of blood and eventually gained the title, ‘Demon Lord of Strength’. However, all this became useless when I lost to a party of heroes.\n\nBut what can a loser say? As I laid dying, I was forced to listen to the hero’s gibberish:\n\n“If you are born again, I hope that you will live a kind life!”\n\nBut huh? When I opened my eyes again, I was back in the past.\n\n“What do I have to do to live a kind life?”\n\nThis is the beginning of an ex-Demon Lord’s journey to live a ‘kind’ life.>"
}