{
	"url": "https://www.novelupdates.com/series/kidnapped-dragons/",
	"title": "Kidnapped Dragons - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/10/Kidnapped-Dragons-Picture.jpg",
	"noveltype": "(KR)",
	"genre": "Action   Comedy   Drama   Fantasy   Mature   Romance   School Life   Slice of Life   Supernatural   ",
	"tags": "Academy   Age Progression   Age Regression   Antihero Protagonist   Apathetic Protagonist   Appearance Different from Actual Age   Calm Protagonist   Character Growth   Childcare   Clones   Cohabitation   Cold Protagonist   Complex Family Relationships   Cute Children   Death   Demons   Dense Protagonist   Depictions of Cruelty   Depression   Determined Protagonist   Distrustful Protagonist   Dragons   Evil Organizations   Familial Love   Family   Firearms   Guardian Relationship   Harsh Training   Hiding True Abilities   Hiding True Identity   Human-Nonhuman Relationship   Hunters   Interdimensional Travel   Love Interest Falls in Love First   Magic   Magical Space   Male Protagonist   Manipulative Characters   Military   Mind Break   Mind Control   Modern Day   Multiple POV   Multiple Realms   Multiple Timelines   Murders   Mysterious Past   Obsessive Love   Overpowered Protagonist   Past Plays a Big Role   Past Trauma   Post-apocalyptic   Protagonist Strong from the Start   Psychopaths   Returning from Another World   Ruthless Protagonist   Saving the World   Schemes And Conspiracies   Second Chance   Seeing Things Other Humans Can't   Servants   Slow Romance   Spatial Manipulation   Stoic Characters   Strong to Stronger   Suicides   Survival   Sword And Magic   Time Loop   Torture   Tragic Past   Tsundere   Yandere   ",
	"rating": "(4.6 / 5.0, 683 votes)",
	"author": "Yuzu   ",
	"year": "\n2019",
	"ranking": "#2   #3   #161   #5   #260   ",
	"reviewcount": "92 Reviews sorted by",
	"description": "– The planet [Earth] has entered the abnormal state [Apocalypse].\n\n– You have failed in saving the Earth. The Authority, [Vintage Clock (EX)] rewinds the world’s time.\n\nFor Yu Jitae, it was a message he had seen many times.\n\nIt was tiresome.\n\nIt would have been great had he died with everyone else.\n\nBut he couldn’t, for his authorities that made him the strongest existence, brought him back in time whenever he died.\n\nAnd even with his strength, he couldn’t protect the broad earth against the maddened dragons.\n\n– The world’s time will soon begin.\n\nAs the clock resumed ticking in the direction it should, his 7th iteration came to a start.\n\nFortunately, he finally had the gist of it.>"
}