{
	"url": "https://www.novelupdates.com/series/marchioness-brothel/",
	"title": "Marchioness Brothel - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/12/Marchioness-Brothel.jpg",
	"noveltype": "(CN)",
	"genre": "Josei   Mature   Psychological   Romance   Tragedy   ",
	"tags": "Ancient China   Beautiful Female Lead   Betrayal   Calm Protagonist   Cold Protagonist   Complex Family Relationships   Cruel Characters   Cunning Protagonist   Death of Loved Ones   Female Protagonist   Handsome Male Lead   Love Interest Falls in Love First   Love Rivals   Love Triangles   Revenge   Royalty   Schemes And Conspiracies   Slow Romance   Torture   Tragic Past   ",
	"rating": "(4.0 / 5.0, 23 votes)",
	"author": "Qin Jian   秦简   ",
	"year": "\nN/A",
	"ranking": "#2000   #2000   #9176   #9498   #10286   ",
	"reviewcount": "4 Reviews sorted by",
	"description": "There was an old saying, in a woman’s sudden growth, a scumbag would forever be involved.\n\nThe childhood fiancé, Qin Si to cling to the higher ups, tied her up and sent her in a carriage to be Marquis Zi Yi’s concubine.\n\nMarquis Zi Yi, Xiao Guan Xue who had enjoyed all sort of beauties, to entertain his guest, gifted her as a toy to the poker face general as a s*ave.\n\nThe cold, heartless general, Pei Xuan to receive the noble princess, sold her to the Divine Fragrance House for ten silver liang.\n\nThat day, because she was unwilling to prostitute herself she was fiercely hit to death by the procuress.\n\nIn merely three years, from wife to concubine to prostitute and down to death, Jiang Xiao Lou had thought she would never have a chance to change her life.\n\nWho knew her life was too strong, the King of Hell didn’t dare to receive so she had to climb out from the coffin.\n\nThis time, she had no way to retreat, no way to escape, she could only face directly the dangerous and hopeless life.\n\nWhen the weak girl was forced to the extreme bumped against the prestigious and influential men clique, fighting her destiny, overthrowing the universe, stirring the perilous world and towering waves! If anyone dared to trample on her again, don’t blame her for raising the abattoir hatchet, a direct and resolute attack would come to him, littering the field with corpse…>"
}