{
	"url": "https://www.novelupdates.com/series/i-quit-being-the-male-leads-rival/",
	"title": "I Quit Being The Male Lead’s Rival - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/07/I-Quit-Being-The-Male-Leads-Rival.jpg",
	"noveltype": "(KR)",
	"genre": "Comedy   Fantasy   Romance   ",
	"tags": "Abusive Characters   Aristocracy   Beautiful Female Lead   Bickering Couple   Enemies Become Lovers   European Ambience   Family Conflict   Female Protagonist   Handsome Male Lead   Knights   Love Interest Falls in Love First   Misunderstandings   Mob Protagonist   Multiple POV   Nobles   Reincarnated in Another World   Reincarnation   Royalty   Strong Love Interests   Sword And Magic   Sword Wielder   Tomboyish Female Lead   ",
	"rating": "(4.3 / 5.0, 218 votes)",
	"author": "Yoo Na Jin   유나진   ",
	"year": "\n2021",
	"ranking": "#469   #327   #1261   #656   #1483   ",
	"reviewcount": "48 Reviews sorted by",
	"description": "One day, as usual, Annabelle remembered the memories of her previous life.\n\nIt was revealed that she has been reincarnated as the second most popular character in a novel.\n\nShe also did all kinds of bad things to the male lead, and in the end, she is the person who will end up in prison! \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n‘In the end, I’ll get caught. It’s crazy!’ \n\nAnabelle begins to save Ian from danger by intercepting the conspiracies that were laid out one by one to prevent her impending doom.\n\nBut in the process, she caught the attention of some unexpected people…\n\n“Oh my, that’s the spirit of chivalry our family pursues! I like that a lot!” \n\nIan’s mother’s eyes began to sparkle at her. \n\n“Would you like to be my partner to the opera?” \n\nAfter saving Ian, the prince keeps flirting…\n\n“Ian, I’ve decided to quit being your rival and live a new life.”\n\n“A new life?”\n\n“To stop paying attention to a man like you who’s always up and down, marry a man with no character, and live a normal life.”\n\n“Who’s the opponent? And why am I up and down?” \n\nThe male lead, Ian, keeps obsessing over me for some reason.\n\n“Why do you not talk harshly to me these days…? Do it again.”\n\nEveryone just seems to be a little weird!>"
}