{
	"url": "https://www.novelupdates.com/series/shrouding-the-heavens/",
	"title": "Shrouding the Heavens - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/06/shroudingtheheaven2.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Drama   Fantasy   Harem   Martial Arts   Xianxia   ",
	"tags": "Adapted to Anime   Adapted to Manhua   Age Regression   Artifacts   Beasts   Body Tempering   Confident Protagonist   Cultivation   Cunning Protagonist   Dao Comprehension   Demons   Determined Protagonist   Dragons   Enemies Become Allies   Fantasy World   Gods   Handsome Male Lead   Hard-Working Protagonist   Hiding True Abilities   Hiding True Identity   Immortals   Legends   Lucky Protagonist   Male Protagonist   Monsters   Multiple Realms   Mythical Beasts   Romantic Subplot   Ruthless Protagonist   Soul Power   Strength-based Social Hierarchy   Time Skip   Transported to Another World   Underestimated Protagonist   Unique Cultivation Technique   Weak to Strong   World Travel   ",
	"rating": "(3.9 / 5.0, 267 votes)",
	"author": "Chen Dong   辰东   ",
	"year": "\n2010",
	"ranking": "#2000   #2000   #1729   #11907   #1869   ",
	"reviewcount": "39 Reviews sorted by",
	"description": "In the far reaches of the dark and frozen universe, nine enormous dragon corpses were tied with an ancient bronze coffin. It seems that they were set there since the birth of the universe. Such astonishing scene was captured by a space probe floating in the outer space.\n\nNine dragons and the mysterious bronze coffin made people wonder that whether they came back to ancient times or just reached the other shore of the universe. A giant mythical world was unfolded, where immortality gradually appeared and paranormal events continuously occurred.\n\nCountless people started to find their own tracks (The Dao) in such mythical realm. Their passion was like turbulent ocean wave which would never cease. The heat in their blood was like erupting volcanoes. Their desire for power and immortality dragged them down to the chasm without knowing it.\n\nThirty-three classmates held a reunion after graduating. Their friendship was tested, as the bronze coffin took them away from earth and arrived in another unknown planet. The desire for living forced them to follow the path of the ancient gods. Entering a new world of cultivation, will any of them reach immortality, or will they all die along the way?>"
}