{
	"url": "https://www.novelupdates.com/series/the-unhappy-clingy-man/",
	"title": "The Unhappy Clingy Man - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/02/The-Unhappy-Clingy-Man.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Historical   Josei   Martial Arts   Romance   ",
	"tags": "Ancient China   Beautiful Female Lead   Cold Protagonist   Female Protagonist   Handsome Male Lead   Love Interest Falls in Love First   Military   Obsessive Love   Politics   Possessive Characters   Strong Love Interests   Sword Wielder   Tsundere   ",
	"rating": "(4.2 / 5.0, 65 votes)",
	"author": "Mo Yan   莫顏   ",
	"year": "\nN/A",
	"ranking": "#2000   #2000   #6249   #12435   #6880   ",
	"reviewcount": "8 Reviews sorted by",
	"description": "*The Four Great Female Constables – Book 3/4 (story of the second senior sister)\n\n\nIn this life, the biggest ‘unresolved case’ that Gong Wuhuan handled involved Gong Changxiao.\n\nShe was certain she had killed him but why is this man still alive?\n\nWhen the man stared at her with that greedy look, he was like a cat staring at a fish.\n\nAnd what made it most unbearable was that he kept calling her…….wife.\n\n“Wife, you can’t kill your husband, do you understand?  Otherwise, who will help to warm your bed and watch over you at night?”\n\nSuddenly, she thrust out the sword……..it didn’t kill him.\n\n“Wife, don’t fight anymore because Husband is afraid that my martial arts is too powerful and may hurt you by mistake.  My heart will hurt.”\n\nShe shot out a concealed weapon…..it missed.\n\n“Wife, you must not castrate your husband’s second brother.  Without him, you won’t have happiness.\n\nPa!  She slapped his face fiercely, hitting right on target.  She was stunned.\n\nShe saw him stroking his face with enjoyment.  “As Husband expected, Wife’s hands are so soft.”\n\nInstantly, Gong Wuhuan’s heart sank to the bottom and she had a hunch.\n\nIt’s afraid this man will be haunting her like a lingering ghostly soul that refuses to scatter until her death!>"
}