{
	"url": "https://www.novelupdates.com/series/private-tutor-2/",
	"title": "Private Tutor - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/07/Private-tutor.jpeg",
	"noveltype": "(KR)",
	"genre": "Adult   Romance   Smut   ",
	"tags": "European Ambience   Female Protagonist   Teachers   ",
	"rating": "(3.3 / 5.0, 12 votes)",
	"author": "마뇽   ",
	"year": "\n2022",
	"ranking": "#4617   #4733   #10888   #7243   #10312   ",
	"reviewcount": "No Reviews",
	"description": "Pia survived a plague that swept the entire city.\n\nWhile struggling to find a job in a city that was almost in ruins, she was offered a job as a tutor at a job agency.\n\nPia arrives at Depodil House, a mansion nestled in a field close to a wasteland thousands of kilometers from the city.\n\nIn Depodil House lived Henry Dale, a sickly man with a young son.\n\nThe employees are gloomy and speechless.\n\nHenry Dale, an employer who rarely gets out of his bedroom due to his weakness.\n\nAnd Leon, Henry’s young son, whom Pia must teach.\n\nPia, who is teaching and caring for seven-year-old Leon, who follows her very well, discovers signs of abuse in Leon.\n\nWas it that sickly Baron Henry Dale who was abusing Leon?\n\nFrom the day Pia begins to doubt that Henry, strange things begin to happen to her.\n\n‘It wasn’t a dream.’\n\nPia, who had a relationship with a man with no face in her dream, thought it was a dream, but the next day she discovers that it was not a dream through the naked traces left in her bed.\n\n‘It’s the dream again.’\n\nHowever, the lewd dreams continue, and Pia suspects that Henry is the one who beats her every night.\n\nConvinced that he  was doing something like this after putting her to sleep in the tea she was drinking, Pia pretended to drink the tea, hid the knife under her pillow, and pretended to be asleep, waiting for the night to come.\n\nAnd just after the wall clock rang the midnight bell, Pia heard the door to her bedroom open.\n\nThe door to the bedroom opened and the sound of footsteps approaching the bed drew closer, and Pia, who was wielding a sword hidden under the pillow at the man riding on top, she was stunned by the identity of the man in front of her .>"
}