{
	"url": "https://www.novelupdates.com/series/the-lame-daoist-priest/",
	"title": "The Lame Daoist Priest - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2016/10/TLDP.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Comedy   Fantasy   Harem   Horror   Martial Arts   Romance   Slice of Life   Supernatural   Xuanhuan   ",
	"tags": "Artifacts   Average-looking Protagonist   Beautiful Female Lead   Caring Protagonist   Cultivation   Demonic Cultivation Technique   Demons   Devoted Love Interests   Friendship   Ghosts   Hard-Working Protagonist   Male Protagonist   Marriage   Master-Disciple Relationship   Modern Day   Monsters   Racism   Spirits   Weak to Strong   ",
	"rating": "(4.0 / 5.0, 122 votes)",
	"author": "Little Flying Swan   Xiǎo fēié   小飞鹅   ",
	"year": "\n2014",
	"ranking": "#2000   #2000   #3068   #9693   #3905   ",
	"reviewcount": "8 Reviews sorted by",
	"description": "My old man really had no common sense when he chose my name. He was just watching a movie on television, Li Xiaolong’s Way of the Dragon movie. It was then that dad suddenly experienced a heavenly revelation and pounded the table: “It’s Li Xiaolong!”. And thus, due to such a heavenly coincidence, my father named me Xiaolong after Bruce Lee’s name. Since the beginning when I was born, bad luck always followed me and ONLY happened to me, I even almost died electrocuted when I was peeing under the electric pole.\n\nIt wasn’t until one day:\n\n“Since you were born, no matter how dangerous the things that happened around you, you didn’t die right? That was because of the Red Arrow mark. Great misfortune will always follow you until you’re dead. Only by practicing Taoism will you be rid of this predicament.”\n\n~~~~~~~~~~~~~~~~~~~~~\n\nThough timid, Xiaolong himself was a bit superstitious but that did not outweigh his disbelief, reluctantly he believed the dying old man, even if it felt like the old swindler was just making another joke out of him. It wasn’t until when he was shown what a ghost would look like did he start to accept “the reality”.\n\nThe dying old man eventually died, and his spirit proved to him that he was seeing “the real thing”. He left him a legacy of 50 thousand RMB in cash, and 1.5  million debt in papers. But his most important legacy were the Dao teachings compiled in a thick book and his follower, the ancient female high-leveled spirit, Murong Daiyu who became Xiaolong`s half-master afterward.\n\n~~~~~~~~~~~~~~~~~~~~~\n\nThe female spirit said gently: “You are now the succeeding disciple of 54th Bull Celestial Daoist Master, as well as the sole candidate for 55th generation head.\n\n“Wait a minute”, I interrupted: “I only heard about Celestial Master Zhang Daoling who found The Way of Celestial Masters, I’ve never heard about this Bull Celestial Master…”>"
}