{
	"url": "https://www.novelupdates.com/series/the-villain-is-being-suspiciously-kind/",
	"title": "The Villain is Being Suspiciously Kind - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/07/36AF3805-AA8C-4E2A-B109-FF72BDB74180.jpeg",
	"noveltype": "(KR)",
	"genre": "Drama   Fantasy   Romance   Shoujo   ",
	"tags": "Aristocracy   Beautiful Female Lead   Business Management   Calm Protagonist   Child Abuse   Childhood Friends   Complex Family Relationships   Dwarfs   European Ambience   Family   Female Protagonist   First Love   Handsome Male Lead   Love at First Sight   Love Interest Falls in Love First   Magic   Male Yandere   Mob Protagonist   Nobles   Obsessive Love   Possessive Characters   Reincarnated in Another World   Revenge   Siblings   Strong Love Interests   Time Skip   Transmigration   Unrequited Love   Yandere   Younger Sisters   ",
	"rating": "(4.1 / 5.0, 87 votes)",
	"author": "Doreda   도레다   ",
	"year": "\n2019",
	"ranking": "#5262   #6381   #2962   #4008   #1192   ",
	"reviewcount": "13 Reviews sorted by",
	"description": "In this story the heroine, Citrina is a transmigrator.\r\n\r\nIn the original story, the female protagonist’s sister, Citrina, worked hard like a dog for her family only to be killed by the villain.\r\n\r\nSo she decided to change the original plot, in the direction where she will befriend the villain and prevent him from blackening.\r\n\r\n“Citrina, I will do everything you need to do.”\r\n\r\nGood. After many failures, she was able to be acquainted with the villain. Everything’s perfectly great.\r\n\r\nI think I already saved my life, so it’s time to leave and make money, and come back as a successful person.\r\n\r\n“Don’t be nice… only to me.”\r\n\r\n“I’m not nice to anyone else. ”\r\n\r\nThe villain in the novel smiled tenderly.\r\n\r\n“I’ll only be nice to you.”\r\n\r\nHim being kind and friendly is a little suspicious.\r\n\r\n____\r\n\r\n“Don’t ask anyone else. Use me instead.”\r\n\r\n“I… you?”\r\n\r\n‘Use you?’\r\n\r\nCitrina looked at him. Then, his lips formed in a single line.\r\n\r\nAs he looked at her, Desian whispered, as if repeating to her.\r\n\r\n“Use me however you want.”\r\n\r\nWith that, he reached out. He slowly tucked the hair that flowed down, in Citrina’s ears. His hands added color to her hair.\r\n\r\nThe hand that touched her was a little cold, it gave her chills.\r\n\r\n“In fact…”\r\n\r\nA soft whisper came out from Desian’s lips.\r\n\r\n“Don’t use anyone but me.”>"
}