{
	"url": "https://www.novelupdates.com/series/the-former-wife-of-invisible-wealthy-man/",
	"title": "The Former Wife of Invisible Wealthy Man - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/07/novelimage.png",
	"noveltype": "(CN)",
	"genre": "Comedy   Fantasy   Romance   Supernatural   ",
	"tags": "Acting   Arranged Marriage   Beautiful Female Lead   Celebrities   Famous Protagonist   Fated Lovers   Female Protagonist   Ghosts   Handsome Male Lead   Love Interest Falls in Love First   Low-key Protagonist   Modern Day   Power Couple   Pregnancy   Reincarnation   Secret Identity   Showbiz   Slow Romance   Spirits   Tragic Past   Transmigration   Unconditional Love   Wealthy Characters   ",
	"rating": "(4.2 / 5.0, 357 votes)",
	"author": "Bìxià Bù Shàng Cháo   陛下不上朝   ",
	"year": "\nN/A",
	"ranking": "#500   #2265   #286   #1134   #403   ",
	"reviewcount": "90 Reviews sorted by",
	"description": "Ye Sui has been transmigrated into a book and became the venomous villain. And because she looked a little similar to the white lotus female protagonist, she was regarded as a replacement by the male protagonist. Ye Sui was also married to the main character’s third Uncle, Chen Shu, who was jinxed to ruin the life of whoever marries him.\n\nImmediately after she got transmigrated, she became the malicious and conceited villainess with a husband named Chen Shu, who was about to divorce her. Ye Sui could see ghosts, however, as soon as she touched Chen Shu, the ghosts would disappear.\n\nChen Shu, who was preparing for divorce,was shocked upon his return to his home. As his wife suddenly hugged his thigh and begged, “No divorce, even if you beat me to death I will not sign the divorce paper.”\n\nChen Shu: “…”\n\nIt was rumored that Ye Sui has a hard life. She married Chen Shu, a good for nothing husband who escaped death at the age of 30. But this sickly husband of hers actually had tens of billions of dollars in wealth.\n\nYe Sui almost believed that her life is doomed until she slowly realized it.\n\nHer husband is omnipotent and the family is getting richer and richer.\n\nThat Tea is actually a priceless vintage tea..\n\nA replica vase in Tang Dynasty was actually authentic…\n\nShe soon found out her husband, Chen Shu, was a super rich and invisible wealthy man.>"
}