{
	"url": "https://www.novelupdates.com/series/the-dukes-imposter-sister/",
	"title": "The Duke’s Imposter Sister - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/03/imposter-sister.jpg",
	"noveltype": "(KR)",
	"genre": "Adult   Drama   Josei   Mature   Romance   Smut   ",
	"tags": "Ancient Times   Aristocracy   Arranged Marriage   Arrogant Characters   Beautiful Female Lead   Broken Engagement   Calm Protagonist   Caring Protagonist   Character Growth   Childhood Love   C*nnilingus   Cold Love Interests   Complex Family Relationships   Cousins   Cruel Characters   Dark   Death of Loved Ones   Depictions of Cruelty   Destiny   Determined Protagonist   Different Social Status   Empires   European Ambience   Fallen Nobility   Family Conflict   Fantasy World   Fated Lovers   Female Protagonist   First Love   First-time Interc**rse   Handsome Male Lead   Hiding True Identity   Jealousy   Kingdoms   Knights   Love at First Sight   Love Interest Falls in Love First   Maids   Male Yandere   Marriage of Convenience   Masochistic Characters   M*sturbation   Misunderstandings   Nobles   Obsessive Love   Politics   Possessive Characters   Power Struggle   Pragmatic Protagonist   R-18   Revenge   Royalty   Sadistic Characters   Schemes And Conspiracies   Servants   Siblings Not Related by Blood   S*ave Protagonist   S*aves   Strong Love Interests   Time Skip   Tragic Past   Wealthy Characters   Yandere   ",
	"rating": "(4.0 / 5.0, 179 votes)",
	"author": "Rose Line   로즈라인   ",
	"year": "\n2020",
	"ranking": "#4265   #6213   #1520   #735   #642   ",
	"reviewcount": "24 Reviews sorted by",
	"description": "The lost princess of Grandia, Gris Benedict, had become a s*ave in a brothel at the age of nine. She was fortunate enough to have escaped her prison after eleven years. But the condition was to live under the grace of the House of Byrenhag.\n\nShe had accepted so in order to survive; it was a worthy proposition.\n\nOne day, she got a small, cute animal from her fake brother, the Lord Byrenhag. She thought it would be her first and last present from him, but then he kept bringing her bigger gifts.\n\nWhen the time came that he finally tried to give himself, Gris foresaw that their relationship would end in a catastrophe.>"
}