{
	"url": "https://www.novelupdates.com/series/come-eat-mr-bunny-rabbit/",
	"title": "Come Eat Mr. Bunny Rabbit - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/02/Come-Eat-Mr-Bunny-Rabbit.jpg",
	"noveltype": "(CN)",
	"genre": "Fantasy   Romance   School Life   Shounen Ai   ",
	"tags": "Animal Characteristics   Beastkin   Businessmen   Clingy Lover   Cute Children   Cute Protagonist   Cute Story   Delinquents   First Love   First-time Interc**rse   Handsome Male Lead   Love Interest Falls in Love First   Male Yandere   Mature Protagonist   Modern Day   Possessive Characters   Strong Love Interests   Student-Teacher Relationship   Teachers   Wealthy Characters   Yandere   Younger Love Interests   ",
	"rating": "(3.9 / 5.0, 50 votes)",
	"author": "KLBB   ",
	"year": "\n2021",
	"ranking": "#4080   #3060   #5390   #2584   #6342   ",
	"reviewcount": "6 Reviews sorted by",
	"description": "Fleming Giant rabbits—— one of the largest breed of rabbits in the world.\n\nThey can reach up to 1.8m in length, worthy of being a giant among rabbits.\n\nBut no matter how giant a rabbit is, they are still rabbits. With their bodies several times bigger, their need for a feeling of security would be several times bigger.\n\nThe rabbit teacher outside the nursery school getting on the bike ready to get off work, Wen Ming, was a textbook standard of that.\n\nBorn in a family with many children, and also taller than friends the same age in his childhood, Wen Ming, all this time, was never given the role of being spoiled and playing coy.\n\nNot obtaining any satisfaction from the needs of love and care, after Wen Ming grew up, he went off to become an early childhood educator that cared for others.\n\nAll that he hoped for his entire life was extremely simple, he hoped that there would be one day his wish of being spoiled in his lover’s embrace could be realized.\n\nThe Wen Ming of today still rushes about on the broad, great path of blind dates.\n\nBarbaric gong X beautiful shou, giant wolf X giant rabbit.\n\nAfter Wen Ming met Jiang Rui:\n\nWen Ming: Hello.\n\nJiang Rui: How did you know I’m 196?\n\nWen Ming: …… I don’t.\n\nJiang Rui: Oh. (196)\n\nWen Ming: ?\n\nJiang Rui: Want to eat a meal together tonight? Dunno what is suitable to eat for a 196(cm) guy.\n\nWen Ming: ……>"
}