{
	"url": "https://www.novelupdates.com/series/picked-up-a-scammer-rabbit/",
	"title": "Picked up a Scammer Rabbit - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/04/Picked-up-a-Scammer-Rabbit.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Fantasy   Shounen Ai   ",
	"tags": "Clingy Lover   Cute Protagonist   First-time Interc**rse   Handsome Male Lead   Heartwarming   Human-Nonhuman Relationship   Love at First Sight   Love Interest Falls in Love First   Modern Day   Shapeshifters   Transformation Ability   ",
	"rating": "(3.9 / 5.0, 16 votes)",
	"author": "咯咯咯鸽子精   ",
	"year": "\n2021",
	"ranking": "#2000   #2000   #7744   #10477   #6967   ",
	"reviewcount": "4 Reviews sorted by",
	"description": "When An Xingzhou ran home in the downpour, he was violently scammed* at the street corner by a rabbit that fell from the sky, hitting his chest directly.\n\n*T/N: This refers to a very specific scam—the scammer demands compensation from the victim after creating an “accident”. (In this case, the “accident” is the bunny bumping into An Xingzhou.)\n\nHis heart almost stopped beating from the slam, and he hid under the eaves and held up the rabbit in front of himself.\n\nPinkish white, it was extremely small, soaked, and trembling.\n\nAn Xingzhou, in a rare act of kindness, carried the soft, weak, and helpless rabbit back home. He didn’t think that this rabbit could speak human, opening its mouth to call him “wife”.\n\nAn Xingzhou: This is absurd.\n\nAfterward, the rabbit became human, handsome, confident, and elegant. But as soon as he opened his mouth, he exposed his true nature: Wife, hurry and rub my little head.\n\nAnd An Xingzhou was forced to rub it: the rabbit would cry whenever he took back his hand and turn back to its original form to rub against him in his lap.\n\nAn Xingzhou rubbed it perfunctorily but perfunctorily was no good either. The rabbit was a rabbit with high demands.\n\nAfter An Xingzhou rubbed it perfunctorily for several consecutive days, that rabbit sat in his lap and became human with a bang, hugging him and shouting “Wife, do you not love me anymore?!”\n\nAn Xingzhou: …\n\nAn Xingzhou looked at the live stream chat, which had blown up: F*ck, I’m live streaming!>"
}