{
	"url": "https://www.novelupdates.com/series/chusans-liuyi-childrens-day/",
	"title": "Chusan’s Liuyi Children’s Day - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/06/Chusans-Liuyi-Childrens-Day.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Romance   Yaoi   ",
	"tags": "Adopted Children   Corruption   Tragic Past   ",
	"rating": "(4.3 / 5.0, 15 votes)",
	"author": "She Xie Dian Dian   蛇蝎点点   ",
	"year": "\nN/A",
	"ranking": "#6970   #2000   #11293   #11073   #9158   ",
	"reviewcount": "1 Review sorted by",
	"description": "When Hong Kong was in the 1980s, bully triads were dominant and the society was in insecurity. The police were corrupt at that time. The infamous unruled area, Snapdragon Walled City (based on Kowloon Walled City), was especially chaotic. Over a dozen big and small triads settled over there.\r\n\r\nThe golden hatchet man* Xia Liuyi in Xiao Qi Tong founded a film studio to launder money under the boss’s command. The female lead of the film was their sister-in-law; the male lead was a threatened popular star; the director has only shot X-rated films – they need one more educated person to write a story.\r\n\r\nWasn’t that an easy task?\r\n\r\nBoss Liuyi took action promptly. He picked the only college student in this area – He Chusan who was coming home with his little backpack. He Chusan said: “I can’t write a screenplay. I’m studying economics.” Xia Liuyi said: “Beat him.” He Chusan became a golden screenwriter obediently.\r\n\r\nAfter finishing this film, He Chusan thought he was already freed. Rest assured, he went to school with his little backpack again. However, he stepped on the Xia Liuyi covered with blood just in front of his home. The stage of a triad boss who was a snapdragon in this chaotic world and a white-collar elite from an innocent family, two parallel lines that seemed not to cross each other, and a messy, unreasonable fate, has its curtain lifted……\r\n\r\n*In this book hatchet man literally means “the hired beater (打手)”, and Xia Liuyi was a top-ranked hatchet man. >"
}