{
	"url": "https://www.novelupdates.com/series/i-became-the-young-wife-of-the-martial-arts-novels-male-lead/",
	"title": "I Became the Young Wife of the Martial Arts Novel’s Male Lead - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/12/I-Became-the-Young-Wife-of-the-Martial-Arts-Novels-Male-Lead.jpg",
	"noveltype": "(KR)",
	"genre": "Drama   Fantasy   Romance   ",
	"tags": "Ancient Times   Arranged Marriage   Character Growth   Couple Growth   Fantasy World   Female Protagonist   Time Travel   Transmigration   Villainess Noble Girls   ",
	"rating": "(3.8 / 5.0, 15 votes)",
	"author": "Rana   ",
	"year": "\n2021",
	"ranking": "#6970   #4720   #11658   #10658   #7883   ",
	"reviewcount": "No Reviews",
	"description": "Inside the martial arts novel which the male lead fully seized, I possessed the male lead’s distant ancestor.\n\nIn order to be faithful to the role of supporting male lead, I worked my bones off and built the best family.\n\nAfter that, I closed my eyes comfortably. However—\n\n“What?! Did you say that my family is doomed?”\n\nWhen I opened my eyes again, it was 300 years later.\n\nMy family, which I had reestablished so tenaciously, was on the verge of collapsing.\n\nFurthermore, the disgraceful political marriage of the male lead, whom I devoted my whole life to support, with the original villainess was ahead.\n\nHowever, the biggest problem was…\n\n“Why did I become that villainess!?”\n\n***\n\nNow that I married the male lead, I decided to make my ruined family stand again.\n\nIf the original female lead appears later, wouldn’t he let me stealthily slide out?\n\nThat’s what I thought, however…\n\n“Our Housemistress, isn’t she a chance given by God to revive the North Sea Ice Palace?”\n\n“I never thought that Housemistress would think about us like this… I was really touched.”\n\n…Why do you all look so affectionate like that?\n\nMoreover,\n\n“Sometimes, I feel like Wife is too good for me.”\n\nThe male lead’s gaze which was staring at me sparkled with endless obsession.\n\n“… Still, I don’t want to let you go.”\n\nNo, I mean, the original female lead has appeared, right? Why are you like this to me!?>"
}