{
	"url": "https://www.novelupdates.com/series/the-crazy-forensic-doctor-consort/",
	"title": "The Crazy Forensic Doctor Consort - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/09/3039s.jpg",
	"noveltype": "(CN)",
	"genre": "Adventure   Drama   Fantasy   Gender Bender   Mystery   Romance   Slice of Life   ",
	"tags": "Adapted to Manhua   Ancient China   Beautiful Female Lead   Calm Protagonist   Clever Protagonist   Cold Protagonist   Crime   Cross-dressing   Cute Children   Doctors   Female Protagonist   Gore   Handsome Male Lead   Investigations   Love Interest Falls in Love First   Modern Knowledge   Money Grubber   Mystery Solving   Pets   Power Couple   R*pe Victim Becomes Lover   Royalty   R*pe   Transmigration   ",
	"rating": "(3.7 / 5.0, 29 votes)",
	"author": "Shei jia MM   谁家MM   ",
	"year": "\n2019",
	"ranking": "#6970   #2000   #5410   #11528   #5449   ",
	"reviewcount": "4 Reviews sorted by",
	"description": "She was a 21st century’s forensic doctor. With her medical expertise, she uses her scalpels to save life and investigate the dead. Unfortunately, she transmigrated to the body of the unfavourable first daughter of Liu residence. At first sight, he looks handsome and charming; with his crotch erected underneath his half-naked body. She smiled and asked, “Have you been drugged, sir? A cure? One treatment costs two hundred taels.” He frowned dangerously as if to judge whether is she worth for him to give his body to her willingly. She quickly used her silver needles on seven acupuncture points and teasingly stared at his crotch. “Look, you calmed down immediately, aren’t I good?” The moment she finished her words, his member grew larger again. She got pinned down by this wretched prince, “I’ll give you four hundred taels, change another treatment method.” “F***!” She got unlucky, and that was how her son Liu XiaoLi got into her stomach.\n\n…… On a fateful day, Liu XiaoLi was refining his medicine-making skill. The little punk walked towards his mom……>"
}