{
	"url": "https://www.novelupdates.com/series/princess-sherrys-tale/",
	"title": "Princess Sherry’s Tale - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/02/Princess-Sherrys-Tale.jpg",
	"noveltype": "(KR)",
	"genre": "Adult   Fantasy   Harem   Romance   Smut   ",
	"tags": "Beautiful Female Lead   Charismatic Protagonist   Charming Protagonist   Confident Protagonist   European Ambience   Female Protagonist   Handsome Male Lead   R-18   Reverse Harem   Royalty   Seduction   Unrequited Love   ",
	"rating": "(2.8 / 5.0, 13 votes)",
	"author": "Eileen   Eilyn   아일린   ",
	"year": "\n2019",
	"ranking": "#2000   #2000   #10712   #5637   #8411   ",
	"reviewcount": "No Reviews",
	"description": "Princess Kasheira, trapped in a purely political engagement, is drawn to the new, and strikingly attractive knight. The newly appointed guard knight is not only the princess’s type, but he is a virgin, and so she sets out to seduce him in what she thinks will be an easy conquest before she is locked down into a loveless marriage. \n\nHowever, the knight proves to be more difficult to seduce than she first assumed, and just when she finally gets him where she wants him, her former fiancé, the beloved war hero, comes back and complicates everything, including her political engagement with a fiancé she did not think cared for her. \n\nWhen the lines become blurred, she no longer knows who the predator is and who is the prey in this twisted game of seduction, and the consequences of her choices are greater than she could have imagined…\n\n“Tol, I told you to call me Sherri.”\n\n“I don’t think so, Miss Kasheira. And please call me Tolcher.”\n\nBetween his iron will and his strong sense of duty, it hadn’t been easy to get him to this point. Good thing she loves a challenge. \n\nSoon enough, however, he is right where she wants him, begging her, “I want… to… put it in. Please…. oh, please…”\n\nBut once his passion is unleashed, he becomes animalistic and wild, and his inexperience no longer matters. Soon she finds herself begging him, and wonders if he is more than she can handle?\n\nAnd just when she thinks that she has what she wants, her former fiancé, the returning war hero, comes back to the capital, and it quickly becomes clear that he has his own plans.\n\n“…there’s something I have to say that I couldn’t say then, Sherri.”\n\nHer current fiancé, with whom she thought she had a purely political engagement, is also behaving strangely. He begins to stake his claim on her, reminding her in a rough voice that “The only one who can give you a lawful successor is me, princess.”\n\nIn the end, the princess will need to choose between passion, love, and duty. Or will she?>"
}