{
	"url": "https://www.novelupdates.com/series/until-i-a-fallen-nobleman-was-called-the-great-sage-with-my-hazure-skill-super-jack-of-all-trades/",
	"title": "Until I, A Fallen Nobleman, Was Called the Great Sage With My Hazure (?) Skill “Super Jack-of-All-Trades” - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/04/Until-I-a-Fallen-Nobleman-was-Called-the-Great-Sage-with-my-Hazure-skill-Super-jackofallTrades.jpg",
	"noveltype": "(JP)",
	"genre": "Fantasy   Romance   School Life   ",
	"tags": "Adapted to Manga   Age Progression   Arrogant Characters   Child Protagonist   Childhood Friends   Doting Parents   Fallen Nobility   Familial Love   Fantasy World   Hard-Working Protagonist   Magic   Male Protagonist   Nobles   Poor Protagonist   Poor to Rich   Reincarnated in Another World   Revenge   Sword And Magic   Time Skip   Weak to Strong   ",
	"rating": "(2.7 / 5.0, 49 votes)",
	"author": "Yagami Nagi   八神　凪   ",
	"year": "\n2020",
	"ranking": "#1326   #1575   #2392   #4028   #4993   ",
	"reviewcount": "5 Reviews sorted by",
	"description": "Hideo Sanmon, a man who was never loved by his parents.\r\n\r\nAfter dying in an accident, he is reincarnated as 'Lars Irving'.\r\n\r\nThis time, by some twist of fate, he is doted on by his parents and brother.\r\nLars' family was poor, but his kind parents and brother were exactly what he was looking for in a family, and the four of them lived happily together.\r\nIn addition, he knew that the skill he had been given, 'Super jack-of-all-Trades,' was being talked about behind his back as being 'out of place,' but his parents didn't care, so he just took it easy and went about his day.\r\n\r\n...... One day, however, he learns that his father was originally a lord.\r\n\r\n--But one day, he learns that his father used to be a lord, and after a lot of research, he suspects that his father's downfall was a trap set by the current lord, so he begins to take action to bring his parents back to be the lord.\r\n\r\nIn fact, it will be a little while before Lars, who solves a variety of difficult problems using his extraordinary cheat skill, 'Super jack-of-all-Trades' becomes known as the Great Sage.\r\n\r\nThis is a story about a man who uses a cheat skill called 'Super jack-of-all-Trades' to solve various problems.>"
}