{
	"url": "https://www.novelupdates.com/series/can-drink-a-cup-of-nothing/",
	"title": "Can Drink A Cup of Nothing - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/07/Can-Drink-A-Cup-of-Nothing.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Fantasy   Yaoi   ",
	"tags": "Ancient China   Army   Enemies Become Lovers   Handsome Male Lead   Hard-Working Protagonist   Mature Protagonist   Multiple Reincarnated Individuals   Revenge   Royalty   Second Chance   Suicides   Transmigration   Yandere   ",
	"rating": "(4.1 / 5.0, 21 votes)",
	"author": "Raven   Wang Ya   妄鸦   ",
	"year": "\n2022",
	"ranking": "#778   #893   #9386   #3978   #8285   ",
	"reviewcount": "3 Reviews sorted by",
	"description": "The Third Prince, Zong Luo and the King of Beining, Yu Beizhou, have been at odds with each other.\n\nWater and fire were never compatible. Their tit for tat confrontation was exhaustible.\n\nUnfortunately, things went awry. After an imperial edict came, Zong Luo laughed facing the heavens. His ink hair was scattered, he closed his eyes, and committed suicide under the city gate.\n\nHowever, he woke up again. \n\nFollowing that, he became entwined with Yu Beizhou once more, till death eventually came upon him.\n\nHis enemy’s face was stunning, flamboyant, and sinful. Only after staring at him did he only notice  a little bit of light floating within his unfathomable eyes.\n\n“Senior martial brother,” Yu Beizhou said in a low voice, grasped his sword in hand, and touched his eyebrows intimately, “We meet again.”\n\n…….\n\nThat night, Zong Luo had a dream.\n\nHe dreamed that after his death, the man sewed up his uncollected body, and kept it in an ice coffin for nine years.\n\nGlory, wealth, and world domination that will last for thousands of generations- Zong Luo didn’t want it, but Yu Beizhou got it all.\n\nHowever, no one knows that after going to court every day, after the tyrant dismissed the palace servants, he would walk into the cold bedchamber alone.\n\n“Senior martial brother, it’s already nine years.” Yet it’s still so cold no matter how warm it is.\n\n“I hate you so much.” He held the body in his arms and muttered to himself.\n\n-Hate is the strongest form of love->"
}