{
	"url": "https://www.novelupdates.com/series/the-disobedient-girl-awakened/",
	"title": "The Disobedient Girl Awakened - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/06/The-disobedient-girl-awakened.jpg",
	"noveltype": "N/A",
	"genre": "Comedy   Romance   School Life   Shoujo   ",
	"tags": "Absent Parents   Complex Family Relationships   Delinquents   Female Protagonist   Handsome Male Lead   Late Romance   Love Interest Falls in Love First   Love Triangles   Modern Day   Sibling Rivalry   System Administrator   Transplanted Memories   ",
	"rating": "(3.4 / 5.0, 54 votes)",
	"author": "夕千井一   ",
	"year": "\n2021",
	"ranking": "#2000   #6262   #4802   #2389   #6017   ",
	"reviewcount": "16 Reviews sorted by",
	"description": "Xia Yao’s self-awareness awakened and she found out she was only a vicious female character with reduced wisdom created by an author.\n\nThe heroine of the novel was the gentle, kind, and considerate fake daughter who had been adopted after Xia Yao’s disappearance. After being lost for a decade, the true daughter returned to her biological family but unlike what she had dreamed of, the parents weren’t home and the brother favored the fake daughter, ignoring Xia Yao.\n\nIn the novel, everybody liked the fake daughter and three young men fell in love with her, while the true daughter was eaten by jealousy and driven to insanity. And in order to harm the fake daughter, she had stumbled and fallen to her death.\n\nBut now~\n\nXia Yao: IQ is finally online, goodbye dog protagonists, I just want to learn!\n\nOne day, she took her sister to viciously surround the heroine in the restrooms. After leaking the news, the three men of the fake daughter rushed to the scene. They kicked the door open and…\n\n“Everything is wrong! Are you worthy of your parents or the teacher’s careful lectures?”\n\nThey saw the girl sitting on the sink, her palm smashing on the mirror and a severe expression on her face. Around her, mathematical formulas were written all over the glass.\n\nThe fake daughter’s eyes were full of tears: “Woooo~ I’m sorry, I am not worthy….”\n\nMale Lead 1: “Xia Yao, it’s so late, let’s go home.\n\nMale Lead 2: “Xia Yao, you didn’t even call me for the private tutoring session!”>"
}