{
	"url": "https://www.novelupdates.com/series/the-royal-deal/",
	"title": "The Royal Deal - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/08/takecareofmyself3.jpg",
	"noveltype": "(KR)",
	"genre": "Adult   Comedy   Fantasy   Romance   Smut   ",
	"tags": "Aristocracy   Calm Protagonist   C*nnilingus   Confident Protagonist   Contracts   European Ambience   Female Protagonist   Handsome Male Lead   Jealousy   Lazy Protagonist   Love Interest Falls in Love First   Marriage   Marriage of Convenience   Nobles   Past Trauma   Politics   R-18   Royalty   Schemes And Conspiracies   Transmigration   ",
	"rating": "(3.8 / 5.0, 92 votes)",
	"author": "Seharum   세하름   ",
	"year": "\n2020",
	"ranking": "#1691   #1440   #2302   #2751   #1817   ",
	"reviewcount": "30 Reviews sorted by",
	"description": "It’s been 11 years since I’ve lived for others and not for me.\r\n\r\nThe moment I cried out wanting to get away from my exhausting life, I opened my eyes in the body of some Count’s 20-year-old daughter.\r\n\r\nSince this happened, I decided to live my life freely as a single woman.\r\n\r\nBut…\r\n\r\n“I need a lady to act as my fake wife for a certain period of time.”\r\n\r\n“A contract marriage?”\r\n\r\n“The term is one year. When the time is up, I’ll give you divorce with no strings attached.”\r\n\r\nThe Duke of the Empire whom I had happened to meet at a ball was hitting on me.\r\n\r\nTurns out he’s no other than the Emperor’s beloved brother, Duke Scade!\r\n\r\nHold on, it’s just going to end in a clean divorce with no strings attached?\r\n\r\n“You should also give me alimony. Give me one of the best lands of the Ducal household with 10 years’ worth of profit.”\r\n\r\n“…..What?”\r\n\r\n“If you don’t want to do that, then we cannot get married.”\r\n\r\nThis time I’m going to live a life taking care of the things I need first!\r\n\r\n***\r\n\r\n“I’ll escort you since it’s late.”\r\n\r\nWhere to? My bedroom is just around the corner.\r\n\r\n“Tonight, I’ll do my best.”\r\n\r\nNo, I don’t need you to do that.\r\n\r\n“Did you just look at that man?”\r\n\r\nExcuse me, Duke, you said it’s for a limited time only, so why do you keep obsessing over me?>"
}