{
	"url": "https://www.novelupdates.com/series/transmigrated-into-a-heartthrob-novel-and-went-ooc/",
	"title": "Transmigrated into a Heartthrob Novel and Went OOC - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/10/20200424000245.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Harem   Romance   Shounen Ai   Xuanhuan   Yaoi   ",
	"tags": "Abusive Characters   Adapted to Drama CD   Amnesia   Ancient Times   Androgynous Characters   Carefree Protagonist   Charming Protagonist   Cohabitation   Cold Love Interests   Cultivation   Cute Protagonist   Demons   Dense Protagonist   Devoted Love Interests   Handsome Male Lead   Honest Protagonist   Jealousy   Lazy Protagonist   Long Separations   Love Interest Falls in Love First   Love Triangles   Magic Beasts   Magic Formations   Masochistic Characters   Misunderstandings   Multiple POV   Popular Love Interests   Possessive Characters   Sadistic Characters   Senpai-Kouhai Relationship   Time Skip   Transmigration   Transported to Another World   Younger Love Interests   ",
	"rating": "(4.3 / 5.0, 114 votes)",
	"author": "东施娘   ",
	"year": "\n2020",
	"ranking": "#1072   #2192   #3421   #3305   #2333   ",
	"reviewcount": "28 Reviews",
	"description": "Fang Chaozhou found himself transmigrating into a Danmei novel, as a character who had the exact same name as himself. He became the Second Brother of the Protagonist and he had no clue who the ML was.\n\nIn the original book, Fang Chaozhou loves the Protagonist and is madly in love with his Junior Brother; as he blocks swords for him, kills monsters for him, and bangs against any wall for him.\n\nAnd now…\n\nFang Chaozhou: Forget it, there are too many suitors, I’d better wash up and sleep.\n\nSince Fang Chaozhou gave up on pursuing his Junior Brother, the Protagonist’s other suitors saw that Fang Chaozhou had become enlightened. They became good friends with him, sharing their little secrets with him from time to time.\n\nSuitor No. 1: Last time I picked celestial grass for Junior Brother and he said thank you.\n\nFang Chaozhou (surprised): Junior Brother must like you!\n\nSuitor No. 2: Junior Brother went on a mission with me last time, and asked me to pay attention to my safety.\n\nFang Chaozhou (confirming): He absolutely likes you, as he didn’t run away.\n\nSuitor No. 3: His clothes were torn when he fought the monster last time. I lent him my coat, but he didn’t want it.\n\nFang Chaozhou (touching his chin): I’m sure it must be because he likes you. He’s too shy.\n\n…\n\nLater, the Junior Brother came to his door.\n\nHis Junior Brother who has a beautiful face coldly asks: Second Brother, someone has been spreading rumors every day that I like others, does this mean he likes me?\n\nFang Chaozhou coughed twice: Junior Brother, if you have something to say, can you untie the immortal rope on my body first?>"
}