{
	"url": "https://www.novelupdates.com/series/after-transmigrating-into-a-cannon-fodder-real-daughter-the-plot-changes/",
	"title": "After Transmigrating into a Cannon Fodder Real Daughter, the Plot Changes - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/03/After-Transmigrating-into-a-Cannon-Fodder-Real-Daughter-the-Plot-Changes.jpg",
	"noveltype": "(CN)",
	"genre": "Drama   Fantasy   Romance   School Life   ",
	"tags": "Abandoned Children   Calm Protagonist   Complex Family Relationships   Female Protagonist   Poor to Rich   Slow Romance   Tragic Past   Transmigration   ",
	"rating": "(3.7 / 5.0, 34 votes)",
	"author": "风铃笑   ",
	"year": "\n2021",
	"ranking": "#2158   #2154   #4563   #1839   #5755   ",
	"reviewcount": "8 Reviews sorted by",
	"description": "Jiang Li transmigrated into a true and false daughter novel and became the cannon fodder in the book. On the first day of transmigrating, the wealthy parents came to the door and said that Jiang Li was their biological daughter who had been living outside for fifteen years.\r\n\r\nAccording to the plot: Full of joy and anticipation, the novel Jiang Li went home with her parents, but found that the parents and brother only cared about the adopted daughter.\r\n\r\nThe elder brother also warned her more than once: My sister is not in good health, so don’t you dare make trouble with her.\r\n\r\nBecause the novel ‘Jiang Li’ was targeted everywhere by the female lead’s supporters, she was full of resentment and gradually became blackened.\r\n\r\nOf course Jiang Li refused to follow the original plot, so she decided to find this body’s maternal grandfather.\r\n\r\nAfter arriving at the Feng family, with the support of maternal grandfather and several older cousin brothers, Jiang Li suddenly became everyone’s favorite.\r\n\r\nOnly her youngest uncle Feng Qi had a cold face and was lukewarm to her.\r\n\r\nBut a month later, Feng Qi took her everywhere to show off: “This is my niece, biological!”\r\n\r\nThree years later, the Jiang family came to the door and asked Jiang Li to donate a kidney to Jiang Ruo. They persuaded her to be kind, saying that people can still live with one kidney.\r\n\r\nFeng Qi rushed home from the scientific research institute and protected Jiang Li behind his back, “The person who can bully Xiao Lizi has not been born yet!”\r\n\r\nSeeing that the Jiang family still did not give up, Feng Qi coldly looked at his elder sister who had cut off her relationship with the family after eloping many years ago, “Sister, Xiao Lizi and Jiang Ruo are not related at all, but their kidney can successfully match each other. Does your pig brain have no doubts at all?”\r\n\r\nAfter that, the Jiang family ran away with tails between their legs, and they no longer dared to make trouble with Jiang Li.\r\n\r\nJiang Li looked at Feng Qi curiously, “Uncle, how do you know that Jiang Ruo is Jiang family’s illegitimate daughter?”\r\n\r\nFeng Qi said confidently, “I was just talking nonsense. Who knows if I hit it right.”\r\n\r\nJiang Li:……\r\n\r\nWhat Jiang Li didn’t know was that not long after she returned to the Feng family, Feng Qi ordered people to investigate the Jiang family.\r\n\r\nHe kept silent over the years, only because he didn’t want that brainless sister to come snatching his precious niece.\r\n\r\nBut later, his niece was snatched for real.\r\n\r\nAt that moment, he really wanted to break that bastard’s leg!!!>"
}