{
	"url": "https://www.novelupdates.com/series/gold-medal-coach/",
	"title": "Gold Medal Coach - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/05/Our-Omega-Coach-is-GoldClass.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Romance   Shounen Ai   Sports   ",
	"tags": "Calm Protagonist   Caring Protagonist   Cold Protagonist   e-Sports   Gamers   Handsome Male Lead   Hard-Working Protagonist   Love Interest Falls in Love First   Master-Disciple Relationship   Omegaverse   Protagonist Strong from the Start   Sharp-tongued Characters   Teamwork   Younger Love Interests   ",
	"rating": "(4.4 / 5.0, 64 votes)",
	"author": "Die Zhiling   蝶之灵   ",
	"year": "\n2022",
	"ranking": "#538   #616   #4253   #722   #5043   ",
	"reviewcount": "8 Reviews sorted by",
	"description": "There was a legendary player known as Wing who appeared in the pro league for Gun King in the Chinese division.\n\nHe landed his shots with deadly precision and absolute confidence. Under his leadership, a third-rate team in the minor league clawed their way to the major league, ultimately winning the annual championship and becoming the strongest dark horse in history.\n\nHowever, Wing suddenly announced his retirement after winning the championship. Many netizens had speculated on the reasons for his retirement. No one knew that he was an Omega suffering from a “pheromone disorder”.\n\nFive years later, the Chinese national team was eliminated in the first round of the Gun King World Championship. The national team’s coach resigned on the spot under pressure. \n\nIn a time of crisis, Jiang Shaoyu, who was once known as Wing, returned to China and was entrusted with the position of the national team’s coach. The national team was a mix of both good and bad players who couldn’t get along with each other at all. This was especially true for certain Alphas who would quarrel the moment they met.\n\nThe assistant was full of worries, “These gods can’t be controlled at all!”\n\nJiang Shaoyu: “It’s fine. Leave their training to me.”\n\nAnd so, Coach Jiang started his daily sharp tongue mode——\n\n“This is the standard of a player on the national team?”\n\n“Are scripts even needed when playing against you? I can win even when playing casually.”\n\n“Are all of you inters? Giving free kills away one after another?”\n\n“If you can’t defeat the others, just delete the game then.”\n\nThe glib-tongued Coach Jiang, who had a tendency to never swear when training others, once scolded the entire team until their mental states had collapsed. That was until one day, they saw the scene of Coach Jiang secretly injecting Omega inhibitors into himself.\n\nEveryone was collectively dazed, “This fierce and savage coach was actually an Omega?”\n\n“Even if he’s an Omega, he’s the boss kind that cannot be defeated even in a team fight!”\n\nA gaming god: “Seeking help. How do I write a 1000-word self-reflection essay?”\n\nA popular streamer: “I’m not streaming today. I’ll face the wall and repent.”\n\nAn amateur king: “Who am I? Where am I? Why am I even playing games? I really doubt my life.”\n\nAn Alpha youth: “What was the experience of being scolded to tears by an Omega like? As we cried more, we got used to it.”\n\nThe netizens: “???”\n\nWhy does something feel wrong with this year’s national team?>"
}