{
	"url": "https://www.novelupdates.com/series/worlds-fastest-level-up-as-a-result-of-the-awakening-of-my-incompetence-skill-transfer-within-dungeon-i-became-the-strongest-without-being-restricted-by-the-rules-of-the-dungeon/",
	"title": "World’s Fastest Level up! ~As a Result of the Awakening of My Incompetence Skill [Transfer Within Dungeon], I Became the Strongest Without Being Restricted by the Rules of the Dungeon~ - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/04/Worlds-Fastest-Level-up-As-a-Result-of-the-Awakening-of-My-Incompetence-Skill-Transfer-Within-Dungeon-I-Became-the-Strongest-Without-Being-Restricted-by-the-Rules-of-the-Dungeon.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Comedy   Fantasy   Harem   Romance   Shounen   ",
	"tags": "Ability Steal   Accelerated Growth   Adapted to Manga   Adventurers   Brother Complex   Cheats   Childhood Friends   Conditional Power   Dense Protagonist   Dungeons   Elemental Magic   Game Elements   Grinding   Guilds   Hard-Working Protagonist   Hidden Abilities   Level System   Love Interest Falls in Love First   Magic   Magical Technology   Male Protagonist   Modern Day   Naive Protagonist   Poor Protagonist   Poor to Rich   Sister Complex   Strong Love Interests   Strong to Stronger   Sudden Strength Gain   Sword And Magic   Underestimated Protagonist   Unique Weapons   Weak to Strong   Younger Sisters   ",
	"rating": "(3.5 / 5.0, 105 votes)",
	"author": "Yamata Nagato   八又ナガト   ",
	"year": "\n2020",
	"ranking": "#1604   #2545   #725   #598   #1694   ",
	"reviewcount": "23 Reviews sorted by",
	"description": "It’s been 20 years since dungeons suddenly appeared in the world.\r\n\r\nHumanity got supernatural powers like Level, Status, and Skill.\r\n\r\nDreaming of becoming rich quickly, Amane Rin, an adventurer challenged to capture dungeons.\r\n\r\nEven though he possessed a skill unique to even adventurers [Transfer within dungeon], he was deemed as incompetent because of the poor usability of the skill.\r\n\r\nHowever, the turning point for him came.\r\n\r\nAfter a year since he started capturing dungeons, [Transfer within Dungeon] evolved with a level up.\r\n\r\nAs a result, Rin became an existence unrestricted by the rules of the dungeon.\r\n\r\nRin, who became the only singularity, continued to level up with overwhelming speed and climbed to the strongest position in the world in the blink of an eye.\r\n\r\nThis is the story of a boy who was looked down upon because of his incompetence but eventually became the strongest in the world.>"
}