{
	"url": "https://www.novelupdates.com/series/the-neighboring-aarya-san-who-sometimes-acts-affectionate-and-murmuring-in-russian/",
	"title": "The Neighboring Aarya-san who Sometimes Acts Affectionate and Murmuring in Russian - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/06/The-Neighboring-Aaryasan-who-Sometimes-Acts-Affectionate-and-Murmuring-in-Russian.jpeg",
	"noveltype": "(JP)",
	"genre": "Comedy   Romance   School Life   Slice of Life   ",
	"tags": "Adapted to Manga   Award-winning Work   Beautiful Female Lead   Calm Protagonist   Caring Protagonist   Childhood Love   Clever Protagonist   Cold Love Interests   Dense Protagonist   Lazy Protagonist   Love Interest Falls in Love First   Male Protagonist   Misunderstandings   Multiple POV   Past Trauma   Popular Love Interests   Siblings   Student Council   Tsundere   Younger Sisters   ",
	"rating": "(4.3 / 5.0, 202 votes)",
	"author": "Sunsunsun   燦々SUN   ",
	"year": "\n2021",
	"ranking": "#1391   #540   #2415   #2281   #1759   ",
	"reviewcount": "19 Reviews sorted by",
	"description": "Smart, refined, and strikingly gorgeous, half-Russian half-Japanese Alisa Mikhailovna Kujou is considered the idol of her school. With her long silver hair, mesmerizing blue eyes, and exceptionally fair skin, she has captured the hearts of countless male students while being highly admired by all others. Even so, due to her seemingly unapproachable persona, everyone remains wary around the near-flawless girl.\n\nOne of the few exceptions is Alisa’s benchmate Masachika Kuze, a relatively average boy who spends his days watching anime and playing gacha games. Despite his nonchalant demeanor, Masachika is the sole student to receive Alisa’s attention. Unable to be fully honest, Alisa is frequently harsh on Masachika and only expresses her affection in Russian. Unbeknownst to her, however, Masachika actually understands the language yet simply pretends otherwise for his own amusement.\n\nAs the odd pair continues to exchange witty and playful remarks, their relationship gradually grows more romantic and delightful—and Alisa might finally learn to freely convey her true feelings.>"
}