{
	"url": "https://www.novelupdates.com/series/the-king-of-hells-genius-pampered-wife/",
	"title": "The King of Hell’s Genius Pampered Wife - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2017/10/the-king-of-hells-genius-pampered-wife.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Drama   Gender Bender   Romance   Tragedy   Xuanhuan   ",
	"tags": "Assassins   Beast Companions   Beautiful Female Lead   Betrayal   Black Belly   Cheats   Cooking   Cultivation   Doctors   Female Protagonist   Genius Protagonist   Handsome Male Lead   Love Interest Falls in Love First   Loyal Subordinates   Magical Space   Pets   Poisons   Transmigration   Ugly to Beautiful   Underestimated Protagonist   Unique Weapon User   Weak to Strong   ",
	"rating": "(3.9 / 5.0, 337 votes)",
	"author": "Remembrance Zi   Xiang Si Zi   相思梓   ",
	"year": "\nN/A",
	"ranking": "#763   #724   #157   #1031   #520   ",
	"reviewcount": "44 Reviews sorted by",
	"description": "At the feast of the Gluttonous House’s auction, there was a little girl with an exceptional furnace constitution for offer at a sky-high price. Everyone wanted to lay their hands on her. Suddenly, the little girl in the golden cage opened her eyes, radiating a cold gaze. She was no longer cowardly.\n\n    She was the gold medal assassin of the 21st century, transmigrating to become the good-for-nothing humiliation that everyone bullied, third miss Nalan Hexi of the genius doctor’s manor.\n\n    Meridians completely crippled, no innate skill to cultivate? What is she afraid of? She is the exceptional miracle doctor, and these injuries were nothing in her eyes.\n\n    Father doesn’t dote on her, mother doesn’t love her, everyone schemes against her? Humph, an alternate dimension in hand and an invincible spirit pet as well, she can destroy the small Nalan Manor with a flip of her hand!\n\n    Ugly complexion, malnourished and sickly in appearance, no one wants her? She recovered her unparalleled looks with the blink of an eye and gained a dozen good looking men as bodyguards!\n\n    That overbearing man who’d been sticking to her since the auction. Who said I was destined to be yours? I am my own, no one can decide my future!\n\n    A certain man: Then I am yours, will that do?>"
}