{
	"url": "https://www.novelupdates.com/series/poisonous-flowers-are-beautiful/",
	"title": "Poisonous Flowers are Beautiful - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/07/Poisonous-Flowers-are-Beautiful.jpg",
	"noveltype": "(KR)",
	"genre": "Adult   Drama   Fantasy   Romance   Smut   ",
	"tags": "Beautiful Female Lead   Devoted Love Interests   European Ambience   Female Protagonist   First Love   Handsome Male Lead   Magic   Past Plays a Big Role   Protagonist Falls in Love First   R-18   Reincarnation   Second Chance   Short Story   Tragic Past   ",
	"rating": "(4.1 / 5.0, 16 votes)",
	"author": "숨길   ",
	"year": "\n2019",
	"ranking": "#1921   #1641   #9315   #3210   #8099   ",
	"reviewcount": "1 Review sorted by",
	"description": "Adele, the Princess of Chenzel, was strictly raised as a tool.\n\nFor a while, she was happy to be married to the Prince of Delt, Reholtein.\n\nReholtein, who she loved more than anyone else, suddenly collapsed.\n\nThe venomous blood flowing through Adele’s body.\n\nWords of the curse openly circulated, and the nickname ‘The Witch of Chenzel’.\n\nIt was all true; Adele realized too late.\n\nAfter killing a loved one with her own hands.\n\nHe was her spring at the end of a long winter and the day at the end of a long night.\n\nFor the first time, she got greedy and loved.\n\n“Rech, I’ll save you at all costs this time.”\n\nA second chance came to Adele, who was named a witch and burned at the stake.\n\n***\n\nA dizzying sensation passed over her, like a weak electricity was flowing. It was a feeling that she had never experienced before. As it was repeated twice, no, thrice, Adele’s bottom got wet. It felt like something was flowing from the inside, not because of his saliva.\n\n“Ha, ah!”\n\nWithout realizing it, her voice was high. Adele hastily covered her mouth with her hand. Even the voice that came out of her throat was unfamiliar to her, but Reholtein looked only skillful.  Adele clenched her fingers and pulled Reholtein’s hair with her fingertips.\n\n“Stop, uh, there’s……. Rech, Re…….”\n\nThe first stimulus made her body twist, and her voice trembled slightly. By the time she thought the limit was about to come, Reholtein suddenly stopped moving.\n\n“Reholtein……?”\n\nHis face caught her eye through the heat-blurred vision. Between her legs were the ears of Reholtein, who had buried his face.\n\n“Once again, please call me, Adele.”\n\n“Huh, wait… What?”\n\n“My name. Like how you called me earlier.”>"
}