{
	"url": "https://www.novelupdates.com/series/the-baby-isnt-yours/",
	"title": "The Baby Isn’t Yours - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/03/EMkCM5BUcAIx6rQ.jpeg",
	"noveltype": "(KR)",
	"genre": "Comedy   Drama   Fantasy   Romance   Slice of Life   ",
	"tags": "Adapted to Manhwa   Beautiful Female Lead   Childcare   Childhood Friends   Couple Growth   Dense Protagonist   Devoted Love Interests   Doting Love Interests   Famous Protagonist   Female Protagonist   First Love   Handsome Male Lead   Hiding True Identity   Kingdoms   Knights   Love Interest Falls in Love First   Magic   Male Yandere   Misunderstandings   Mysterious Past   Nobles   Orphans   Overpowered Protagonist   Popular Love Interests   Possessive Characters   Power Couple   Pregnancy   Protagonist Strong from the Start   Secret Crush   Strong Love Interests   Sword And Magic   ",
	"rating": "(4.1 / 5.0, 164 votes)",
	"author": "Allondrie   아롱드리   ",
	"year": "\n2019",
	"ranking": "#2836   #2482   #1931   #3677   #517   ",
	"reviewcount": "9 Reviews sorted by",
	"description": "“This baby isn’t yours.”\n\nSimon’s eyes glistened coldly at my words. Apparently he’s smiling, but in a strange and spine-chilling tone, Simon asked me.\n\n“…Oh, really?”\n\nThat low, shady voice, pretending to be gentle. The anger in his voice was cold and cruel enough to freeze his surroundings.\n\n“Then, which bastard does that child belongs to?”\n\nHe’s angry. I’ve known him for a long time that’s why I could tell. That’s the voice that comes out when he can no longer hold back his anger. But then… why the hell is he so upset?\n\n“If you’ll know, what are you going to do?”\n\n“That jerk can’t even be a good father so…”\n\n“…… so what?”\n\n“I can’t let him live.”\n\nOh no. I’m in trouble. After seeing his blue eyes lit with fire, there’s no way I could tell him now that it’s his child.\n\n***\n\nKalia, the great war hero who ended the war. One day finds out that she’s… pregnant?! Of all people, the father of her baby, the one she spent the passionate night with, is  Simon Terroan, an imperial sorcerer and her best friend. Kaila believes that Simon doesn’t want a baby, so while Simon is away, she declares her retirement and vanishes to hide the truth about her pregnancy and to safely give birth to her baby.\n\nBut the truth is, Simon loved Kalia more than anyone else.\n\nAnd so, the frantic search for her begins.>"
}