{
	"url": "https://www.novelupdates.com/series/the-yandere-came-during-the-night/",
	"title": "The Yandere Came During the Night - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/04/The-yandere-that-came-in-the-night.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Historical   Josei   Romance   Slice of Life   Supernatural   ",
	"tags": "Absent Parents   Adapted to Manhua   Adopted Protagonist   Ancient China   Beautiful Female Lead   Brother Complex   Buddhism   Caring Protagonist   Charming Protagonist   Childhood Love   Confident Protagonist   Cunning Protagonist   Devoted Love Interests   Disabilities   Doting Love Interests   Doting Older Siblings   Familial Love   Female Protagonist   Heartwarming   Love Interest Falls in Love First   Lucky Protagonist   Male Yandere   Nobles   Overprotective Siblings   Possessive Characters   Power Couple   Precognition   Reincarnation   Schemes And Conspiracies   Siblings Not Related by Blood   Sister Complex   Smart Couple   Strong Love Interests   Time Skip   Transmigration   ",
	"rating": "(4.3 / 5.0, 523 votes)",
	"author": "Casanovanic Bookworm   Feng Liu Shu Dai   風流書呆   风流书呆   ",
	"year": "\n2014",
	"ranking": "#493   #1470   #602   #332   #490   ",
	"reviewcount": "151 Reviews sorted by",
	"description": "Two families’ children were switched at birth. One of the families is a household that does business, and the other is a household of a marquis. There is a vast difference in status.\n\nUnfortunately, Yu Xiang transmigrated as a person that was originally from a business household and was brought up in marquis’s residence. As soon as she arrived, the truth about her lineage was exposed, her legs were disabled, and she was still bearing the reputation of “the unlucky star”. In desperation, she had to hug her elder brother’s thigh firmly and attempt to live her days first. When the original daughter of the marquis’s family returns, Yu Xiang will return the position to her.\n\nA few years later, the original daughter returned, Yu Xiang was prepared to leave, but she found that her technique of holding his thighs was too professional. Her older brother refused to let her go!\n\nThe marquis concealed his smile with the wine cup: How can his pampered wife, that grew up with him, leave whenever she wants?>"
}