{
	"url": "https://www.novelupdates.com/series/unfortunately-not-a-grown-up/",
	"title": "Unfortunately, Not a Grown Up - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/11/Pianpian-Does-not-Grow-Up.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Romance   School Life   ",
	"tags": "College/University   Coming of Age   Depression   Determined Protagonist   Emotionally Weak Protagonist   Female Protagonist   Gamers   Handsome Male Lead   Hiding True Identity   Inferiority Complex   Long Separations   Lovers Reunited   Misunderstandings   Modern Day   Online Romance   Persistent Love Interests   Sister Complex   Slow Growth at Start   Slow Romance   Time Skip   Tragic Past   ",
	"rating": "(3.3 / 5.0, 15 votes)",
	"author": "Long Qi   龙柒   ",
	"year": "\n2021",
	"ranking": "#4265   #2000   #9893   #11907   #9690   ",
	"reviewcount": "2 Reviews sorted by",
	"description": "During the winter vacation, Ji Pianpian, whose future has already been decided, played a popular online game, and met the hateful man who “killed” her thousands of times.\r\n\r\nJi Pianpian: “You have guts to kill me again!”\r\n\r\nShen Du stabbed her in the chest with a sword, mercilessly.\r\n\r\nLater, the god, who chased his wife at the crematorium, apologized: “Don’t be angry, I was blind at the beginning.”\r\n\r\nJi Pianpian vows to be shameless and kill him thousands of times: “Lie flat and wait.”\r\n\r\nDu-shen: “Okay, baby.”\r\n\r\nAfter a while, Ji Pianpian received a video request——\r\n\r\nThe man leaned against the head of the bed, his black shirt was fully unbuttoned, his tie loosened to his collarbone. Then the hem of his clothes stretched along his strong chest to his abdominal muscles, while the belt locks his pants and his mermaid line is sexy and ambiguous.\r\n\r\nIn the video, Shen Du’s brows and eyes are lazy, and his accent is seductive: “I’m lying flat, waiting for you.”\r\n\r\nJi Pianpian covered her eyes, her voice trembling: “…who, who made you lie on the bed!”\r\n\r\nLater, when he learned that his little girlfriend had just turned eighteen, Shen Du’s black eyelashes drooped: “You are still young, when you grow up you should resent me as an old man.”\r\n\r\nJi Pianpian: “How old should I be?”\r\n\r\nShen Du said slowly: “In another five years.”\r\n\r\nJi Pianpian wanted to say something but stopped, holding out a sentence: “…It doesn’t have to be five years.”\r\n\r\nShen Du: “?”\r\n\r\nJi Pianpian: “You’re already eating tender grass, you old cow!”>"
}