{
	"url": "https://www.novelupdates.com/series/almighty-your-persona-has-collapsed/",
	"title": "Almighty Your Persona Has Collapsed - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/03/Almighty-Your-Persona-Has-Collapsed.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Comedy   Drama   Fantasy   Romance   School Life   ",
	"tags": "Acting   Calm Protagonist   Celebrities   Cold Protagonist   College/University   Complex Family Relationships   Cultivation   Doting Love Interests   Female Protagonist   Genius Protagonist   Glasses-wearing Love Interests   Hackers   Handsome Male Lead   Hidden Abilities   Kind Love Interests   Love Interest Falls in Love First   Medical Knowledge   Modern Day   Multiple Identities   Pharmacist   Pill Concocting   Power Couple   Showbiz   Strength-based Social Hierarchy   Strong Love Interests   Wealthy Characters   ",
	"rating": "(3.0 / 5.0, 7 votes)",
	"author": "Road of Flowers   Yīlù Fán Huā   一路烦花   ",
	"year": "\nN/A",
	"ranking": "#3633   #3197   #10681   #13810   #11954   ",
	"reviewcount": "2 Reviews sorted by",
	"description": "[Showbiz+Star Student+Semi-Fantasy+Antilogic] \r\n\r\n \r\n\r\nMeng Fu was 16 years old when the Jiang family came looking for her. They said that she had been mistakenly swapped with someone else since a young age. Before she can react, her body is occupied by the soul of a female journalist from an alternate world for two years. \r\n\r\n \r\n\r\nShe finally manages to reclaim her body, however... \r\n\r\n \r\n\r\nMother from a wealthy family: 'The young master of the Tong family studied abroad, while you dropped out of high school. Although this betrothal is arranged by both families when both of you were young, there is no need to insist on the marriage.' \r\n\r\n \r\n\r\nFather: 'Xinran is also my daughter. I hope you will get along well with her and learn from her.' \r\n\r\n \r\n\r\nYounger brother: 'I only have one elder sister, and she is Jiang Xinran.' \r\n\r\n \r\n\r\n** \r\n\r\nBefore reclaiming her body, Meng Fu was ranked fourth in the Global Idol girl group program. She was a bimbo that all netizens hated, and the daughter that the Jiang family refused to recognize. However, after she reclaims her body, no offence, but no other contestant is a match for her. \r\n\r\n \r\n\r\nInitially, fans from major forums insist that Meng Fu leaves the girl group and showbiz, attacking her with harsh criticisms. A group of fans retaliate and speak up for Meng Fu. \r\n\r\n \r\n\r\nUntil later, a powerful figure publishes a post: [Reposting my new drama] \r\n\r\n \r\n\r\nSomeone commented: [You got the wrong account.] \r\n\r\n \r\n\r\nThe fans who discover the truth suddenly come back to their senses: [There is no need to speak up for Meng Fu, the big shot.] \r\n\r\n \r\n\r\nMale protagonist Su Cheng: The genius heir of the ancient martial arts family that lives in seclusion. He who is super manly and mysterious is free from all desires. \r\n\r\n \r\n\r\nFemale protagonist Meng Fu: The top star student who claims to know a bit of everything. She is a non-linear thinker, a master performer, a money-grubber, she is unrivaled in every aspect.>"
}