{
	"url": "https://www.novelupdates.com/series/a-villainess-for-the-tyrant/",
	"title": "A Villainess For The Tyrant - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/01/A-Villain-Is-a-Good-Match-for-a-Tyrant.jpg",
	"noveltype": "(KR)",
	"genre": "Comedy   Drama   Fantasy   Mature   Romance   ",
	"tags": "Adapted to Manhwa   Aristocracy   Arranged Marriage   Assassins   Beautiful Female Lead   Bickering Couple   Carefree Protagonist   Character Growth   Charismatic Protagonist   Charming Protagonist   Cold Love Interests   Comedic Undertone   Couple Growth   Depictions of Cruelty   Devoted Love Interests   Doting Love Interests   Dragons   Early Romance   Empires   European Ambience   Famous Protagonist   Fantasy Creatures   Female Protagonist   First-time Interc**rse   Forced Marriage   Handsome Male Lead   Hard-Working Protagonist   Kingdoms   Knights   Love at First Sight   Love Interest Falls in Love First   Loyal Subordinates   Magic   Magic Beasts   Maids   Marriage   Multiple POV   Nobles   Past Plays a Big Role   Past Trauma   Popular Love Interests   Power Couple   R-15   Royalty   Schemes And Conspiracies   Seduction   Shameless Protagonist   Spirits   Strength-based Social Hierarchy   Sword And Magic   Tragic Past   Unconditional Love   Villainess Noble Girls   Wealthy Characters   ",
	"rating": "(4.4 / 5.0, 163 votes)",
	"author": "Yoo Iran   유이란   ",
	"year": "\n2019",
	"ranking": "#3633   #1825   #2156   #5884   #731   ",
	"reviewcount": "21 Reviews sorted by",
	"description": "“I would rather just go out with a bang!”\n\nFor Princess Cecile, being married off to the emperor of a neighboring empire was unavoidable. But wait, isn’t this the same Emperor Estian who’s notorious for being a heartless sadist? In order to maintain her final shred of dignity, the fearless Cecile demands that her future husband carry her all the way from the carriage to the wedding chapel! If this is her fate, she might as well put up a fight before dying at the hands of the handsome emperor. After all, the only way to fight fire is with… more fire?!\n\nCan Cecile become a villain even more fearsome than her tyrant husband?>"
}