{
	"url": "https://www.novelupdates.com/series/after-rebirth-i-was-entangled-with-the-tyrant/",
	"title": "After Rebirth, I Was Entangled with the Tyrant - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/10/after-rebirth.png",
	"noveltype": "(CN)",
	"genre": "Comedy   Romance   School Life   Shounen Ai   Slice of Life   ",
	"tags": "Cold Love Interests   Cute Protagonist   Determined Protagonist   Devoted Love Interests   Doting Older Siblings   Doting Parents   Familial Love   Family Business   First Love   Friendship   Hard-Working Protagonist   Heartwarming   Love at First Sight   Love Interest Falls in Love First   Misunderstandings   Modern Day   Past Plays a Big Role   Past Trauma   Possessive Characters   Quiet Characters   Reincarnation   Schemes And Conspiracies   Second Chance   Slow Romance   Strong Love Interests   Tragic Past   Wealthy Characters   ",
	"rating": "(4.5 / 5.0, 304 votes)",
	"author": "浊酒润喉   ",
	"year": "\n2019",
	"ranking": "#2033   #2185   #1814   #2136   #1417   ",
	"reviewcount": "54 Reviews sorted by",
	"description": "In his previous life, Chi Fang was taken care of by his family and grew up. When the Chi family fell  and his parents and brothers were not there, Chi Fang propped up the Chi family alone. Relying on several projects of Yuchi Group, Chi Fang barely kept the Chi family. \n\nHowever, he did not hold on. After rebirth, Chi Fang returned to high school. This time, he decided to study hard, protect his family, and reach the pinnacle of life. \n\nHowever, he never expected that the future owner of Yuchi Group would be his high school classmate? But– isn’t this big guy too cold? No seatmate, no friends, alone, but it is an unpredictable school bully!\n\nChi Fang looked at the back of the boss, thinking of the previous projects to save himself, carefully probing out his paw and poking at the boss’ arm.\n\n——Now, classmate, are we friends? o (^ 0 ^) o\n\nYu Mo has been clever since he was a child. He is a little taciturn, doesn’t like being touched, and never fears anything. However, he found himself inexplicably ‘afraid’ of Chi Fang in his class. Obviously, the man was soft and cute like a little white rabbit, but he cared inexplicably.\n\nLater, he found that the bunny seemed black.\n\nLater, he found that his feelings for the little black rabbit were not right.\n\nUntil one day, Yu Mo suddenly realized, seriously: Chi Fang, I like you.\n\nA two-way crush.\n\nIt happened that I turned around, and you were always behind me.\n\nSo, two people holding hands, happily going to college and breaking the bad story ~>"
}