{
	"url": "https://www.novelupdates.com/series/demon-kingthe-parting-of-the-orchid-and-cang/",
	"title": "Demon King/The Parting of the Orchid and Cang - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2016/07/s28260894.jpg",
	"noveltype": "(CN)",
	"genre": "Adventure   Comedy   Drama   Gender Bender   Josei   Psychological   Romance   Xianxia   ",
	"tags": "Adapted to Anime   Adapted to Drama   Adapted to Manhua   Bickering Couple   Black Belly   Body Swap   Cold Love Interests   Comedic Undertone   Demon Lord   Demons   Determined Protagonist   Enemies Become Lovers   Female Protagonist   Handsome Male Lead   Heaven   Hell   Immortals   Mythology   Protagonist Falls in Love First   Sharing A Body   Strong Love Interests   Stubborn Protagonist   Tsundere   ",
	"rating": "(4.3 / 5.0, 162 votes)",
	"author": "Jiu Lu Fei Xiang   九鹭非香   ",
	"year": "\n2014",
	"ranking": "#455   #902   #2529   #6256   #1938   ",
	"reviewcount": "24 Reviews sorted by",
	"description": "After hatching endless plots and suffering innumerable hardships, the demons of the Demonic Realm finally managed to resurrect the Ancient Demon King.\n\nThe demons of the Demonic Realm had hoped that the Ancient Demon King would not only lead them in waging a war against the Heavenly Realm and enable them to lord their superiority over the Immortals, he would also ultimately gain control over the entire realm.\n\nGradually, however, they discovered that their thoughts were very, very wrong.\n\nWhilst it is true that this Ancient Demon King still retains his aura of superiority and possesses unlimited powers, he…\n\nHe seems to be a mental case…\n\nIt’s alright even if he changes orders and does things in an incomprehensible way.\n\nBut what’s with his habit of muttering under his breath, nagging and conversing with himself the entire day!\n\nSmall Orchid: He’s not ill, he’s just despicable (贱jian)…can’t stand to see (见jian) people live a good life.\n\nDong Fang: I am only unable to endure seeing you live a good life.\n\nSmall Orchid: …\n\n*T/N: The Chinese pronunciation for the word “despicable” is the same as the word “see” – thus, the author is trying to show that Small Orchid, while trying to scold Dong Fang, is also careful not to incur his wrath, which is why she tried to imbue another meaning into her sentence after scolding him.>"
}