{
	"url": "https://www.novelupdates.com/series/criminal-investigation-notes/",
	"title": "Criminal Investigation Notes - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/06/Criminal-Investigation-Notes.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Mystery   Psychological   Shounen Ai   ",
	"tags": "Amnesia   Calm Protagonist   Clever Protagonist   Couple Growth   Crime   Criminals   Detectives   Doting Love Interests   Genius Protagonist   Handsome Male Lead   Investigations   Love Interest Falls in Love First   Lovers Reunited   Modern Day   Mystery Solving   Past Trauma   Pets   Police   Power Couple   Secret Organizations   Smart Couple   Strong Love Interests   ",
	"rating": "(4.4 / 5.0, 16 votes)",
	"author": "清韵小尸   ",
	"year": "\n2020",
	"ranking": "#3133   #6300   #9612   #7856   #7512   ",
	"reviewcount": "3 Reviews sorted by",
	"description": "The investigation of a severed limbs case was stalled. Lu Junchi, captain of the Major Crimes Unit, went to the Chinese police academy to ask for advice. Captain Lu originally thought he would get the advice of a respected old professor. Unexpectedly, he met the sick and weak beauty, Su Hui, who gave him some advice.\r\n\r\nBefore the reasoning, Lu Junchi belatedly wondered if this Beauty Su was just a pretty face. After the actual evidence, Lu Junchi belatedly thought that this Beauty Su wasn’t a pretty face, he was the one who was silly and foolish.\r\n\r\nLu Junchi was grateful for Su Hui’s help in this case. He appreciated Su Hui’s talent but was afraid that the weak and sick Su Hui wouldn’t be able to live a convenient life. Therefore, he became a Daddy Long Legs uncle and sent warmth to Su Hui day and night. He sent and sent…\r\n\r\nLater, he took the big beauty home.\r\n\r\nCaptain Lu didn’t know that this crippled beauty Su Hui, who had extremely poor eyesight, was deaf in one ear and could run 200 meters in three minutes, would turn out to be a criminal psychology profiling expert who scared criminals. He didn’t know that Su Hui had multiple identities or that he was an old acquaintance…\r\n\r\nSu Hui was proficient in criminal psychology portraits and had extremely meticulous reasoning ability. He went deep into the hearts of the criminals to reveal their secrets. He had the courage to go into extreme danger and walked through a hail of bullets with no fear. His heart was like a rock as he fought against evil, like a reed that couldn’t be defeated. He looked so weak while actually being so tough.\r\n\r\nNo one knew that his world was actually a foggy mess on the verge of collapse. The surrounding liveliness was like a silent movie to him. This was until he met the person who helped him put everything together, retrieving his lost memories and finding the truth of everything to put him back on the road of life.\r\n\r\nSu Hui: Do you know what ‘hope’ is in my dictionary?\r\n\r\nLu Junchi: ?\r\n\r\nSu Hui: It is you.>"
}