{
	"url": "https://www.novelupdates.com/series/alchemy-emperor-of-the-divine-dao/",
	"title": "Alchemy Emperor of the Divine Dao - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2018/01/Alchemy-Emperor-of-the-Divine-Dao-.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Fantasy   Harem   Martial Arts   Mature   Xuanhuan   ",
	"tags": "Alchemy   Appearance Different from Actual Age   Arranged Marriage   Arrogant Characters   Artifacts   Beast Companions   Beautiful Female Lead   Bloodlines   Body Tempering   Broken Engagement   Cold Love Interests   Comedic Undertone   Cultivation   Curses   Cute Children   Dao Comprehension   Death of Loved Ones   Dragons   Enemies Become Allies   Enemies Become Lovers   Fast Learner   Friendship   Gods   Handsome Male Lead   Heavenly Tribulation   Immortals   Kingdom Building   Kingdoms   Late Romance   Long Separations   Lucky Protagonist   Magic Formations   Magical Space   Male Protagonist   Money Grubber   Multiple Realms   Mysterious Family Background   Mythical Beasts   Nobles   Older Love Interests   Phoenixes   Pill Based Cultivation   Pill Concocting   Polygamy   Pregnancy   Previous Life Talent   R*pe Victim Becomes Lover   Romantic Subplot   Royalty   Schemes And Conspiracies   Shameless Protagonist   Sharp-tongued Characters   Soul Power   Spatial Manipulation   Spirit Advisor   Strength-based Social Hierarchy   Sword Wielder   Threesome   Time Manipulation   Time Skip   Transmigration   Unique Cultivation Technique   Weak to Strong   ",
	"rating": "(3.3 / 5.0, 183 votes)",
	"author": "Flying Alone   孤单地飞   ",
	"year": "\n2015",
	"ranking": "#2000   #2000   #779   #2786   #2914   ",
	"reviewcount": "30 Reviews sorted by",
	"description": "An ultimate warrior, the one and only Alchemy Emperor, Ling Han, died in his quest to achieve godhood. Ten thousands years later, he, with the 'Invincible Heaven Scroll', was reborn in the body of a young man with the same name. From then on, winds and clouds moved as he set himself against the uncountable geniuses of this new era. His path of becoming a legend has begun once more. Of all eras underneath the heavens, I am the strongest!>"
}