{
	"url": "https://www.novelupdates.com/series/after-squandering-my-money-i-became-viral/",
	"title": "After Squandering My Money, I Became Viral! - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/01/After-squandering-my-money-I-became-viral.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Fantasy   Shoujo   Slice of Life   ",
	"tags": "Beautiful Female Lead   Calm Protagonist   Female Protagonist   Kind Love Interests   Lucky Protagonist   Modern Day   Poor Protagonist   Poor to Rich   Reincarnation   Romantic Subplot   Second Chance   Showbiz   System Administrator   ",
	"rating": "(3.5 / 5.0, 11 votes)",
	"author": "壶一条   ",
	"year": "\n2021",
	"ranking": "#2000   #2000   #11129   #12116   #10726   ",
	"reviewcount": "2 Reviews sorted by",
	"description": "Cheng Youyou became famous when she was young, but as years passed by she became more and more transparent in the entertainment industry.\r\n\r\nAs the time she couldn't make money continued, she died. She was only left with 10 dollars.\r\n\r\nAfter her death, she knew that she was a cannon fodder who was destined to not survive in the entertainment industry.\r\n\r\nThe heroine of the original Novel has a money-absorbing system that can suck all the money Cheng Youyou should have earned into her bag.\r\n\r\nOnly 23 years old, after Cheng Youyou was born again: I love it, but it's a prodigal.\r\n　\r\nReluctant to buy clothes, but she needed to buy! Expensive beauty spa, do it! Luxurious hair care, go!\r\nNetizen screamed: She! Is! Prodigal!\r\n\r\nParticipate in variety shows,\r\nDuring the dragon boat race mission, the guests took out: oars, bamboo poles...\r\nCheng Youyou: An electric motor, go!\r\n　\r\nEscape from the room, horror NPCs approaching, all guests screaming and avoiding but...\r\nCheng Youyou chased the npc: Friends, your foundation is really white, where did you buy it? I also want to buy.\r\n\r\nNetizen: Cheng ​Youyou has really high traffic, hahaha\r\nResult: Sit firmly in the c position in variety shows and she will get the highest pay\r\n\r\nReceived a very promising script,\r\nResult: The acting is extremely real, please look after it.\r\nMoney sucking system: This is too difficult, Cheng Youyou has too much money to suck up, forget it.\r\n\r\nCheng Youyou:? ? ? She didn't die.\r\n\r\nSeeing a lot of zeros in the bank balance: Go on...Being Prodigal>"
}