{
	"url": "https://www.novelupdates.com/series/after-the-stand-in-shou-faked-his-death/",
	"title": "After the Stand-in Shou Faked His Death - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/01/After-the-Standin-Shou-Faked-His-Death.jpeg",
	"noveltype": "(CN)",
	"genre": "Drama   Psychological   Romance   Slice of Life   Yaoi   ",
	"tags": "Acting   Adapted to Manhua   Character Growth   Cohabitation   Cold Love Interests   Dense Protagonist   Depression   Lack of Common Sense   Modern Day   Protagonist Falls in Love First   Second Chance   Showbiz   Tragic Past   Unrequited Love   Wealthy Characters   ",
	"rating": "(3.6 / 5.0, 123 votes)",
	"author": "咸鱼大西瓜   ",
	"year": "\n2021",
	"ranking": "#2182   #970   #2979   #1693   #3566   ",
	"reviewcount": "38 Reviews sorted by",
	"description": "Xu ChengYan had been together with the eldest young master of the He family for five years, always on call and he yielded to everything. Even though He Yang always treated him with a cold face, Xu ChengYan was willing, thinking that as long as he was the most special one to He Yang, one day he would be able to melt the iceberg.\n\nUntil one day, He Yang’s white moonlight returned to China.\n\nXu ChengYan saw with his own eyes that the man who was always cold and indifferent in front of him was extremely gentle in front of the white moonlight. It was also at this time that Xu ChengYan realized that he was just a substitute. Icebergs will melt, but the person who melted this iceberg was not him. The exhausted Xu ChengYan finally woke up. He chose to let go, packed his luggage and left by himself.\n\nAnd when He Yang came back and saw the empty apartment, he just smiled and made a bet with the group of good-for-nothing friends: within five days, Xu ChengYan will come back.\n\nOn the first day, Xu ChengYan did not come back. The next day, Xu ChengYan still didn’t come back.\n\nOn the fifth day, Xu ChengYan finally returned. It was just that what was waiting for He Yang was Xu ChengYan’s icy cold corpse, which could no longer be recovered.\n\nThree years later, He Yang was still the aloof and indifferent eldest young master of the He family.\n\nAt a banquet, He Yang suddenly saw a familiar figure. He Yang lost his self-control, rushed forward like a madman, and stood in front of the black-haired young man.\n\n“Yanyan.”\n\nThe eldest young master of the He family, who had always been indifferent, was holding the young man’s hand tightly at this time, his eyes were slightly red.\n\n“Go back with me, okay?”\n\nThe dazzling black-haired youth just smiled and moved the man’s hand away.\n\n“Sorry Sir, you have mistaken the wrong person.”>"
}