{
	"url": "https://www.novelupdates.com/series/national-film-empress-was-sweet-as-honey/",
	"title": "National Film Empress Was Sweet As Honey - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/08/5ecdbc99eafa3.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Drama   Fantasy   Gender Bender   Josei   Romance   ",
	"tags": "Beautiful Female Lead   Cross-dressing   Cute Children   Doting Love Interests   Female Protagonist   Handsome Male Lead   Love Interest Falls in Love First   Misunderstandings   Modern Day   Possessive Characters   Pregnancy   Showbiz   Tomboyish Female Lead   Tragic Past   Twins   ",
	"rating": "(3.0 / 5.0, 31 votes)",
	"author": "祁木伢   ",
	"year": "\n2018",
	"ranking": "#6970   #6376   #5501   #7990   #6867   ",
	"reviewcount": "3 Reviews sorted by",
	"description": "“Young Master Ye! What happened that year was an accident! I didn’t mean to do it!”\n\n“So, you don’t want to be responsible for it?” The handsome, quiet, elegant and magnificent man narrowed his eyes dangerously.\n\nThere were two little buns next to him. One on the left and one on the right. Both also looked at her anxiously……\n\nDuring her coming of age ceremony, her scum older sister set her up and she ended up giving birth to two dead babies with unknown father.\n\nFour years later, the king returned!\n\nA jerk and a lowly bit*h tried to oppress her but received a slap on the face.\n\nThose who owed her, don’t even think about running away!\n\nWithout paying attention, she became the notorious ghost doctor, the God of Painters that was revered by tens of thousands, and she even easily got her hands on a world-class giant star spirit tablet…..\n\nOnce not careful, she was picked up by Ye Lixiao, the rumour ruthless and cold-blooded Patriarch of Ye Family that everyone was also afraid of.\n\nEveryone also said that Ye Lixiao was someone with a clear heart, did not have much desire and did not like to go near the opposite sex.\n\nXing Luo: F***! If she knew who it was that simply spread this kind of rumours, she would definitely kill that bastard!>"
}