{
	"url": "https://www.novelupdates.com/series/running-away-with-the-nemesis-cub/",
	"title": "Running Away With The Nemesis’ Cub - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/08/Running-Away-With-The-Nemesis-Cub.jpg",
	"noveltype": "(CN)",
	"genre": "Mature   Romance   Smut   Yaoi   ",
	"tags": "Bickering Couple   Childish Protagonist   Cohabitation   Doting Love Interests   Doting Older Siblings   Enemies Become Lovers   Engagement   F*llatio   Handsome Male Lead   H*ndjob   Living Abroad   Marriage   Modern Day   Mpreg   Older Love Interests   Omegaverse   Reverse R*pe   Tsundere   Wealthy Characters   ",
	"rating": "(4.3 / 5.0, 129 votes)",
	"author": "Hao Ju Yi Da Ju   好橘一大橘   ",
	"year": "\n2022",
	"ranking": "#165   #143   #4234   #940   #4789   ",
	"reviewcount": "23 Reviews sorted by",
	"description": "He runs and he chases, he can’t get away.\n\nThe Omega slept with his nemesis Alpha and then ran away, only to find out soon after that he was pregnant.\n\nIt was purely on a whim and he thought that if his rival found out, he might kill him, but he didn’t want to give up the baby, so he decided to have it quietly without his nemesis knowing.\n\nThe Omega was afraid of attracting the Alpha’s attention, so he kept his presence to a minimum and went away to hide just in case and planned to come back after the birth and say it was adopted.\n\nHowever, Omega didn’t expect to be caught by the Alpha while he was raising the fetus. He was wearing a very pregnant dress and the Alpha was dumbfounded by his belly.\n\nWhen passing by, the Alpha felt that the scent was a bit familiar. At the time, he couldn’t remember where he had smelled it. When he realised that the scent was the same as the Omega pheromones from that night, everything became clear.\n\nHe rushed off to confront the Omega, only to find that Omega had quietly run off again.\n\nThe Alpha’s assistant hesitantly asked the Alpha if he still wanted to search, the Alpha rubbed his face and gritted his teeth, “Search, why not, my wife has run off with my cub!”>"
}