{
	"url": "https://www.novelupdates.com/series/a-tale-of-strategies-for-the-throne/",
	"title": "A Tale of Strategies For the Throne - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/06/throne.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Fantasy   Yaoi   ",
	"tags": "Adopted Protagonist   Age Progression   Age Regression   Ancient Times   Androgynous Characters   Aristocracy   Army   Assassins   Bodyguards   Brother Complex   Caring Protagonist   Character Growth   Charismatic Protagonist   Charming Protagonist   Clever Protagonist   Comedic Undertone   Couple Growth   Curses   Cute Protagonist   Death   Death of Loved Ones   Depictions of Cruelty   Destiny   Determined Protagonist   Devoted Love Interests   Discrimination   Divine Protection   Doting Love Interests   Doting Older Siblings   Dreams   Empires   Enemies Become Lovers   First Love   Gods   Handsome Male Lead   Hard-Working Protagonist   Helpful Protagonist   Kingdom Building   Kingdoms   Knights   Leadership   Limited Lifespan   Long Separations   Love Interest Falls in Love First   Lovers Reunited   Loyal Subordinates   Male Yandere   Multiple Timelines   Mysterious Illness   Nobles   Obsessive Love   Older Love Interests   Overprotective Siblings   Past Plays a Big Role   Past Trauma   Pets   Power Couple   Proactive Protagonist   Prophecies   Royalty   Second Chance   Selfless Protagonist   Siblings Not Related by Blood   S*aves   Slow Romance   Terminal Illness   Time Loop   Time Skip   Tragic Past   Transmigration   Unconditional Love   Wars   ",
	"rating": "(4.6 / 5.0, 125 votes)",
	"author": "Tian Luo Shui   天洛水   ",
	"year": "\n2018",
	"ranking": "#5262   #2000   #3043   #5401   #2823   ",
	"reviewcount": "28 Reviews sorted by",
	"description": "If you don’t ascend the throne, you will die.\n\nSo, brave youth, alongside your loyal knights, defeat monsters, level up, kill the BOSS, and ascend the throne to claim your destiny!\n\nTo break the curse that he will die before ever reaching adulthood, Garlan had no choice but to return to his previous previous previous previous reincarnation where he was supposed to be the son of destiny. There, he must defeat the big BOSS Heimos who had defied fate to kill him and seize the throne in that past life, thus fulfilling his destiny to become king.\n\nHe decided to give it a try. After all, he did have the superpower golden finger of five possible redos.\n\nAnd then…………\n\nThis son of destiny, capable of reloading his save file for five retries… was killed by his nemesis four times.\n\nGarlan: “…………” Wait a minute, wasn’t I supposed to be the son of destiny?\n\nFine fine fine, I’m not gonna fight anymore. If you’re so ruthless, go ahead! If you’re so handsome, go be king yourself!\n\nWith only one life left, still aching from the pain of getting killed four times… Garlan decided to give up fighting for the throne in favor of getting far far away from Heimos and becoming a free little elf.\n\nAnd then….. he sat on the throne, and became the Sage King adored by the masses.\n\nGarlan: “???”\n\nA certain changer of fate: “Every single time I confess my love, I get turned down. This sucks.”\n\nA certain son of destiny: “Every single time, I get confessed to by the very person who killed me, in the very same places I got killed last time, last last time, and last last last time. My heart is very tired.”>"
}