{
	"url": "https://www.novelupdates.com/series/the-obsessive-second-male-lead-has-gone-wild/",
	"title": "The Obsessive Second Male Lead Has Gone Wild - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/07/The-Obsessive-Second-Male-Lead-Has-Gone-Wild.jpg",
	"noveltype": "(KR)",
	"genre": "Fantasy   Romance   Shoujo   ",
	"tags": "Absent Parents   Aristocracy   Child Abuse   European Ambience   Female Protagonist   Handsome Male Lead   Knights   Loner Protagonist   Magic   Male Yandere   Marriage   Priests   Rivalry   Single Parent   Strong Love Interests   Weak Protagonist   ",
	"rating": "(3.7 / 5.0, 74 votes)",
	"author": "수비   ",
	"year": "\n2020",
	"ranking": "#5262   #4786   #3995   #5458   #1463   ",
	"reviewcount": "4 Reviews sorted by",
	"description": "\n\nJust before her wedding, she got struck with memories from her previous life, about a novel that she had read before.\n\nIf she didn’t kick up a fuss right now to call off the wedding, then she’s going to be stuck with a husband who’d kill her through poison!\n\nSo she kissed the priest who was officiating the wedding, but suddenly, she was surrounded by paladins.\n\n“Commander, are you alright?”\n\nOne of the paladins asked loudly as he approached the priest whose lips had been stolen.\n\n‘What? Excuse me?’\n\nHe’s the Commander of the Holy Knights?!\n\n* * *\n\nRurutia, who had only a few days left to live, wanted to spend her remaining days in a temple that treated her with warmth.\n\nFor those remaining days, she started a business for the temple, and, surprisingly, everything she touched became a hit!\n\n“Miss, you have the whole world at your fingertips!”\n“Miss, are you really not a God who descended from above?”\n\nIt was confusing enough that a large number of people became her devout followers, but more than that, the second male lead—the Commander of the Holy Knights—was acting especially strange.\n\n“All I want is to be your husband.”\n\nHe said this with a hint of obsession in his eyes.\n\n“Take responsibility for stealing my first kiss.”\n\nShe messed with the plot too much.\nThe future has changed.\n>"
}