{
	"url": "https://www.novelupdates.com/series/pride-and-sanctimony/",
	"title": "Pride and Sanctimony - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/12/Pride-and-Sanctimony.jpg",
	"noveltype": "(KR)",
	"genre": "Drama   Fantasy   Romance   ",
	"tags": "Abusive Characters   Academy   Aristocracy   Arrogant Characters   Betrayal   Calm Protagonist   Character Growth   Child Abuse   Childcare   Clever Protagonist   Clingy Lover   Cold Protagonist   Couple Growth   Cruel Characters   Curses   Cute Children   Different Social Status   Empires   Enemies Become Lovers   European Ambience   Family Conflict   Female Protagonist   First Love   Genius Protagonist   Handsome Male Lead   Hard-Working Protagonist   Hated Protagonist   Heartwarming   Jealousy   Loner Protagonist   Long Separations   Lovers Reunited   Manipulative Characters   Multiple POV   Nobles   Pets   Playboys   Popular Love Interests   Possessive Characters   Pragmatic Protagonist   Pregnancy   Protagonist Falls in Love First   Quiet Characters   Royalty   Sharp-tongued Characters   Time Skip   ",
	"rating": "(4.2 / 5.0, 84 votes)",
	"author": "Baek Mokran   백목란   ",
	"year": "\n2021",
	"ranking": "#3923   #3617   #4013   #3518   #4452   ",
	"reviewcount": "13 Reviews sorted by",
	"description": "“Arrogant Prince. You’re not the only one who can toy with others.”\n\nValentia Syner, the greatest mind in all of the Imperial Academy’s history.\n\nHer fellows at the academy called her “The Iron Maiden”. Some did it out of jealousy. Others, out of contempt. But no one ever approached Valentia. Even her own family avoided her.\n\nThe first person to ever reach out to Valentia was the playboy of the Imperial family—the Prince, Lexus.\n\n“Who dares to slap the Imperial Prince?”\n\nTheir first meeting went terribly. They exchanged awful words and there was even a slap involved. But over time, the two of them became very close.\n\nHowever, Valentia discovered a terrible truth just before she was about to confess something to Lexus—she was pregnant with his child.\n\nValentia had to run away to protect herself.\n\nAnd then a few years passed.\n\n“Did he just say you were his mom?”\n\nThat awful man, Lexus appeared once more before Valentia, who was living a quiet life with her lovely son, Elijah.>"
}