{
	"url": "https://www.novelupdates.com/series/become-the-apex-of-the-black-tyrant-ceo/",
	"title": "Become the Apex of the Black Tyrant CEO - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/12/blacktyrantceo2.jpg",
	"noveltype": "(CN)",
	"genre": "Drama   Fantasy   Mature   Romance   Sci-fi   Supernatural   ",
	"tags": "Abandoned Children   Beautiful Female Lead   Businessmen   Death   Devoted Love Interests   Doting Love Interests   Female Protagonist   First Love   First-time Interc**rse   Handsome Male Lead   Love Interest Falls in Love First   Male Yandere   Marriage   Modern Day   Multiple Identities   Multiple Transported Individuals   Obsessive Love   Past Plays a Big Role   Past Trauma   Possessive Characters   Strong Love Interests   System Administrator   Time Skip   Transmigration   ",
	"rating": "(3.7 / 5.0, 80 votes)",
	"author": "Kumu zaisheng   枯木再生   ",
	"year": "\n2019",
	"ranking": "#1010   #411   #1508   #1331   #2590   ",
	"reviewcount": "14 Reviews sorted by",
	"description": "Song Jinxi really likes the abstinent, overlord villain in a novel about a sadomasochistic president.\n\n \n\nThe villain is handsome and indifferent, smarter than a demon, coldhearted and less lustful, and his aura is so cool that it makes one’s legs soft!\n\n \n\nA system is bound between them. She was told that the villain has blackened and wants to kill the male and female leads and destroy the world.\n\n \n\nThe two-dimensional world is facing the danger of collapse, and Song Jinxi turns into a righteous fighter and transmigrates into the novel.\n\n \n\nThe first time she transmigrated, the villain was still a little beanie, and in order to save him, she sacrificed her life honorably.\n\n \n\nThe second time she transmigrated, the villain grew into a young boy, and in order to save him, she sacrificed her life again.\n\n \n\nThe third time she transmigrated, she died again.\n\n \n\nThe three worst things in the villain’s childhood were avoided by her, but he is still blackened and wants to destroy the world again.\n\n \n\nSong Jinxi transmigrated for the fourth time, but she did not expect to be caught by the villain as soon as she landed.\n\n \n\nThe villain, who had grown into a tyrannical CEO, pressed the petite girl against the wall and whispered in her ear in a very dangerous voice:\n\n \n\nIf you dare die again, I will let everyone in this world be buried with you.>"
}