{
	"url": "https://www.novelupdates.com/series/greetings-ninth-uncle/",
	"title": "Greetings, Ninth Uncle - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/05/ninth.jpg",
	"noveltype": "(CN)",
	"genre": "Drama   Fantasy   Josei   Romance   ",
	"tags": "Ancient China   Aristocracy   Beautiful Female Lead   Black Belly   Broken Engagement   Calm Protagonist   Charming Protagonist   Clever Protagonist   Cunning Protagonist   Determined Protagonist   Devoted Love Interests   Doting Love Interests   Female Protagonist   Flashbacks   Handsome Male Lead   Hard-Working Protagonist   Love Interest Falls in Love First   Mature Protagonist   Multiple Reincarnated Individuals   Older Love Interests   Possessive Characters   Power Couple   Pragmatic Protagonist   Pregnancy   Royalty   Schemes And Conspiracies   Second Chance   Secret Identity   Selfish Protagonist   Smart Couple   Tragic Past   Twins   Villainess Noble Girls   ",
	"rating": "(4.6 / 5.0, 455 votes)",
	"author": "September Flowing Fire   九月流火   ",
	"year": "\n2019",
	"ranking": "#21   #68   #289   #118   #341   ",
	"reviewcount": "122 Reviews sorted by",
	"description": "Cheng Yujin was the elder twin sister, who was supposed to be engaged to an excellent man. However she later learned that her fiance, Marquis Jingyong, had proposed to her because he mistakenly recognized her as her younger twin sister. Marquis Jingyong and her younger sister had a deep relationship, and after many twists and turns, finally broke through all hardships and became eternal lovers. While Cheng Yujin was the villain who replaced her sister’s good marriage, kept framing her sister, and hindered the main couple to be together. A really wicked older sister and poisonous late wife.\n\nAfter the younger twin sister was reborn, she revealed Cheng Yujin’s ‘conspiracy’ early on. Everyone scorned her, and her so-called fiance was indifferent. Cheng Yujin sneered and tore off their engagement letter in front of her fiance.\n\nEveryone was gloating and happily waiting to see her regret her actions. However, before Marquis Jingyong had a chance to see Cheng Yujin’s regret, he saw his former fiancee marrying his uncle.\n\nThe ninth uncle of Cheng family was truly a hidden dragon, his real power frightening everyone.\n\n***\n\nCheng Yujin, this coquettish little wife, lightly lifted her eyebrows and casually said, “A mere Marquis Jingyong, is he worthy? Do you think that robbing him away will affect me?”\n\nAlmost forgot to say, ninth uncle wasn’t surnamed Cheng. His real name was Li Chengjing, the crown prince.>"
}