{
	"url": "https://www.novelupdates.com/series/shinka-no-mi-ln/",
	"title": "Shinka no Mi (LN) - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/01/shinkanomi_v1b.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Comedy   Drama   Ecchi   Fantasy   Harem   Mystery   Romance   Shounen   Supernatural   ",
	"tags": "Ability Steal   Accelerated Growth   Adapted to Anime   Adapted to Manga   Adventurers   Anti-Magic   Appearance Changes   Artifact Crafting   Artifacts   Assassins   Awkward Protagonist   Battle Academy   Beastkin   Beautiful Female Lead   Betrayal   Bloodlines   Bullying   Caring Protagonist   Charming Protagonist   Cheats   Childhood Friends   Childhood Love   Clever Protagonist   Demi-Humans   Demon Lord   Demons   Devoted Love Interests   Discrimination   Dragons   Dungeons   Dwarfs   Elemental Magic   Elves   Evil Gods   Evil Religions   Evolution   Fairies   Famous Protagonist   Fantasy World   Fast Learner   Fat to Fit   Friendship   Game Elements   Genetic Modifications   Genius Protagonist   Goblins   Godly Powers   Gods   Handsome Male Lead   Hard-Working Protagonist   Harsh Training   Human-Nonhuman Relationship   Human Weapon   Identity Crisis   Inheritance   Inscriptions   Kingdoms   Level System   Magic   Magic Formations   Magical Space   Magical Technology   Male Protagonist   Monster Girls   Monsters   Multiple POV   Multiple Transported Individuals   Mythical Beasts   Naive Protagonist   Ninjas   Orcs   Overpowered Protagonist   Polygamy   Psychic Powers   Race Change   Royalty   Samurai   Saving the World   Skill Assimilation   Skill Creation   S*aves   Slow Growth at Start   Spatial Manipulation   Special Abilities   Spirit Advisor   Spirits   Strong Love Interests   Strong to Stronger   Sword And Magic   Timid Protagonist   Transported to Another World   Ugly Protagonist   Ugly to Beautiful   Unique Weapon User   Unique Weapons   Unlucky Protagonist   Vampires   Weak to Strong   Wealthy Characters   Wizards   World Travel   Yandere   ",
	"rating": "(3.4 / 5.0, 76 votes)",
	"author": "Miku   美紅   ",
	"year": "\n2014",
	"ranking": "#2000   #2000   #4417   #7465   #3204   ",
	"reviewcount": "1 Review sorted by",
	"description": "Seiichi Hiiragi had such a terrible appearance that negative adjectives such as ugly, unpleasant, dirty, and smelly were thrown at him non-stop. Seiichi was constantly bullied at school, and every day he just waited to go back home. One day, all of a sudden a voice from the broadcast speaker said that he were to be transferred to a different world; the voice came from a God itself.\n\nThat would not concern Seiichi alone, but his whole school. They would go to a fantasy world where levels, standings, skills and similar things existed, as if in a game. However, the God wouldn’t do all of that on its own volition, but because people from the other world were performing summoning rituals in order to conjure brave man and women to their world. While all the classes were forming a group waiting to be transfereed, of all of his classmates Seiichi alone was rejected, and sent to a different place entirely. For the first time in his life, once reached his destination, he would eat the “Evolution Fruit”. That experience would drastically change Seiichi‘s life.\n\nThis story is about Seiichi being rejected by his classmates. At the end of the fairy tale his struggles are rewarded, he survives that new world, eventually proving to be a winner.>"
}