{
	"url": "https://www.novelupdates.com/series/sweet-nothings/",
	"title": "Sweet Nothings - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/05/qingqingwowo3.jpg",
	"noveltype": "(CN)",
	"genre": "Drama   Psychological   Romance   Tragedy   ",
	"tags": "Amnesia   Beautiful Female Lead   Childhood Love   Cold Love Interests   Contracts   Devoted Love Interests   Family Conflict   Female Protagonist   First Love   Handsome Male Lead   Male Yandere   Modern Day   Obsessive Love   Past Trauma   Possessive Characters   Showbiz   Singers   Tragic Past   Transplanted Memories   Unconditional Love   Wealthy Characters   ",
	"rating": "(4.4 / 5.0, 52 votes)",
	"author": "Chuan Lan   川澜   ",
	"year": "\n2019",
	"ranking": "#2053   #1704   #5140   #3102   #4157   ",
	"reviewcount": "8 Reviews sorted by",
	"description": "Late at night, Yan Qing drove across the cross-river bridge, who would have anchored halfway.\n\nAt a glance, she saw a handsome man standing not far away, so she stepped forward for help, but she never thought of—\n\nThe man actually grabbed the railing, raised his long legs, and was about to jump off the bridge.\n\nYan Qing felt like a dream.\n\nHowever, she pulls it out and saves Huo Yunshen, who is ruthless in the outside world.\n\nHowever, this Huo family boss is seriously inconsistent with imagination.\n\nNot only was he inexplicably haunting his wife, she was treated like a treasure, he even fell on her knees, his eyes were scarlet, he stubbornly begged her:\n\n“Qingqing, don’t leave me anymore.”\n\n—\n\nRumors have it that the President Huo wife is dead and loved, so he will be cold and unsympathetic, and do not even look at women.\n\nDidn’t expect a little star who made her debut soon to embrace his thigh? !\n\nInsiders proclaimed everywhere: “It’s just a stand-in that looks like old love, what’s to be proud of!”\n\nBefore long, “Little Star” Yan Qing held the grand prize and smiled sweetly in front of the camera: “Formally clarify, Mr. Huo’s old love is me.”\n\nThat night, Huo Yunshen came to the scene personally, took off his coat and wrapped her in his arms. Facing countless reporters, he only said:\n\n“There is no new love and old love, she is the only one in my life.”\n\n—\n\nYan Qing did not know that she had lost her memory.\n\nShe don’t know …\n\nThere is a man in this world who, in the three years since she lost her life, is as insane as it is dead.>"
}