{
	"url": "https://www.novelupdates.com/series/you-are-the-supporting-role/",
	"title": "You are the Supporting Role - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/10/You-are-the-Supporting-Role.jpeg",
	"noveltype": "(KR)",
	"genre": "Adult   Comedy   Fantasy   Harem   Josei   Romance   Smut   ",
	"tags": "Acting   Black Belly   Charming Protagonist   C*nnilingus   Contracts   Cunning Protagonist   Death   Demons   Determined Protagonist   European Ambience   Evil Protagonist   Female Protagonist   First-time Interc**rse   Human-Nonhuman Relationship   Kind Love Interests   Knights   Mob Protagonist   Nobles   Outdoor Interc**rse   Personality Changes   Poor Protagonist   Possession   Possessive Characters   Power Struggle   R-18   Reverse Harem   Royalty   Seduction   Selfish Protagonist   Shameless Protagonist   Sword Wielder   Transmigration   Tsundere   Unlucky Protagonist   Villainess Noble Girls   Weak to Strong   Yandere   ",
	"rating": "(3.7 / 5.0, 112 votes)",
	"author": "Lachik De   라치크   ",
	"year": "\n2020",
	"ranking": "#2425   #1231   #1960   #985   #1772   ",
	"reviewcount": "17 Reviews",
	"description": "The seductive woman’s body was ethereal, beautiful, and sweet. \n\nNo man would be able to come to his senses with that enchanting curvaceous figure in front of his eyes.\n\nThe man had his head bowed between her legs, sucking the honey from her shivering petals. The elastic tip of the tongue licked up the vagina long, and the swollen clitoris end was sucked. At the same time, his thick fingers went in and out of her vagina and dug inside. At that moment, her white body convulsed with terrible pleasure.\n\n“Oh, no, no, no more!”\n\nShe begged, cried, and climaxed. But the man wasn’t satisfied with this. \n\nHe pushed his tongue into the twitching tunnel and began to lick to the inside of the convulsions. \n\nLike a foolish bug that drowns in honey.\n\nSo he didn’t even notice. \n\nThe sly smile that rose to her delicate face, as she groaned beneath him.>"
}