{
	"url": "https://www.novelupdates.com/series/sumi-de-ii-desu-kamawanaide-kudasai/",
	"title": "Sumi de ii Desu. Kamawanaide Kudasai - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2017/02/a13lphiz0pl.jpg",
	"noveltype": "(JP)",
	"genre": "Comedy   Fantasy   Harem   Romance   Shoujo   ",
	"tags": "Adapted to Manga   Ancient Times   Cross-dressing   Dense Protagonist   Female Protagonist   Otome Game   Reverse Harem   Transmigration   Transported into a Game World   ",
	"rating": "(4.2 / 5.0, 70 votes)",
	"author": "Mako   まこ   ",
	"year": "\n2015",
	"ranking": "#2000   #2000   #4372   #2902   #3310   ",
	"reviewcount": "3 Reviews sorted by",
	"description": "When I noticed, I was surrounded by a bunch of people wearing kimonos. When I looked into the river water, what was there was a young child… Eh, it’s me!?\r\n\r\nThe place where I washed ashore was a gaudy neighborhood, Yoshiwara. Huh? But it looks like the ones behind the lattice are men.\r\n\r\nThe ones who picked up the still young me from that strange place was an old man from a brothel called the『Amazuki Brothel』.\r\n\r\nThe place I was brought to was a men filled red light district. It seems that over here, men who had no choice but to become prostitutes were called Yuudan (male courtesan). Then I was given the name Nogiku and made to hide from the female customers and provide assistance.\r\n\r\nFor some reason I was also given courtesan training, but I’m not male!! I don’t want to learn how to seduce women!!\r\n\r\nHowever, when I became 16 I looked at the handsome men who’d grown up with me as comrades and realized. This was the world of『Seeing a Dream Male Courtesan District ～A night spent together～』. I couldn’t even recall about myself but for some reason I remembered that I had played that game.\r\n\r\nNogiku was that otome game’s villain character. She got in the way of the protagonist’s love who sought to get closer to the men, and in the end she would even kill, she was a woman who wasn’t choosey of her methods. Because she was that type of woman she was given hellish punishment by the protagonist and co, but…\r\n\r\nI don’t want thaaaaAAAt! I won’t interfere. I can only consider my fellows as older brothers, as something like comrades in arms!! I intend to help stealthily from the shadows.>"
}