{
	"url": "https://www.novelupdates.com/series/shuangwen-female-main-character-doesnt-want-to-be-a-sensation/",
	"title": "Shuangwen Female Main Character Doesn’t Want To Be a Sensation - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/05/Shuangwen-female-main-character-doesnt-want-to-be-an-sensation.jpeg",
	"noveltype": "(CN)",
	"genre": "Comedy   Fantasy   ",
	"tags": "Acting   Appearance Different from Actual Age   Beautiful Female Lead   Calm Protagonist   Celebrities   Charismatic Protagonist   Charming Protagonist   Clingy Lover   Cold Love Interests   Cooking   Famous Parents   Famous Protagonist   Female Protagonist   Handsome Male Lead   Late Romance   Mature Protagonist   Modern Day   Poor to Rich   Protagonist Strong from the Start   Romantic Subplot   Showbiz   Strong Love Interests   Sudden Wealth   Transmigration   Wealthy Characters   ",
	"rating": "(4.1 / 5.0, 20 votes)",
	"author": "大哥喝冰阔落   ",
	"year": "\n2021",
	"ranking": "#3017   #2318   #6687   #4595   #7165   ",
	"reviewcount": "4 Reviews sorted by",
	"description": "After finishing the 999th quick transmigration task diligently, Shizhi can finally choose a world to pass the days of her retirement.\r\n\r\nShizhi broke her fingers in raising conditions——\r\n\r\nThen, with a wish to welcome a better new life, she transmigrated into the heroine of a shuangwen* in the entertainment circle. She was beautiful and in good shape, but she didn’t have money. She was also notorious and heavily in debt.\r\n\r\n*shuangwen – specific genre of novels, usually has a lot of face-slapping so reading it makes the reader feel “shuang” (refreshing)\r\n\r\nShizhi: ? ? ?\r\n\r\nSystem: Host, rush forward boldly, tear, force, pull and step on it quickly. After becoming the top celebrity, you can be discovered by the housekeeper of the richest man and inherit hundreds of millions of properties!\r\n\r\nShizhi: Why would I go to such trouble? She was here to retire.\r\n\r\nShe turned to the rich housekeeper directly, “Dear, do you think I look like your dead master’s daughter?” Hundreds of millions of property get.>"
}