{
	"url": "https://www.novelupdates.com/series/the-villain-runs-wild/",
	"title": "The Villain Runs Wild - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/06/The-Villain-Runs-Wild.jpg",
	"noveltype": "(CN)",
	"genre": "Adventure   Drama   Psychological   Romance   Sci-fi   Shounen Ai   Yaoi   ",
	"tags": "Abusive Characters   Acting   Alternate World   Arrogant Characters   Artificial Intelligence   Clever Protagonist   Confident Protagonist   Confinement   Cultivation   Cunning Protagonist   Devoted Love Interests   Handsome Male Lead   Male Yandere   Manipulative Characters   Manly Gay Couple   Modern Day   Multiple Realms   Obsessive Love   Omegaverse   Possessive Characters   Protagonist Strong from the Start   Second Chance   Shameless Protagonist   Siblings Not Related by Blood   Strong Love Interests   System Administrator   Transmigration   Wealthy Characters   World Hopping   ",
	"rating": "(4.3 / 5.0, 60 votes)",
	"author": "Xiao Wu Jun   小吾君   ",
	"year": "\n2021",
	"ranking": "#898   #230   #5455   #1234   #4559   ",
	"reviewcount": "6 Reviews sorted by",
	"description": "Lin Sui transmigrated into the cannon fodder of a cultivation text, a cannon fodder with a human cauldron constitution, destined to be a servant. Lin Sui, unwilling to resign himself to it, seduced the Son of Heaven, but when he cut out his Dao bone and transferred it to himself, the Heavenly Law struck him down.\n\nThat Dao bone in his body became the System that restrained him, issuing the order: You must retrieve all of his soul, serve him as your master in every world, and spare no effort for him until your dying day!\n\nLin Su was all smiles as he agreed, but all his life, the thing he loathed most was others telling him what to do.\n\nTherefore…\n\nIn the first world, he was an arrogant and domineering, rich and powerful Young Master, while the other person was a pitiful and humble illegitimate child.\n\nHe humiliated him by saying he was only fit to carry his shoes, and spoke words of love next to his ear when the noise of the crowd boiled over.\n\nSystem: You motherxxxxxx [beep——]\n\nLin Sui, innocently: Aren’t I serving him as my master?\n\nIn the second world, he was a newly-promoted top talent in the entertainment industry, while the other person was a former Best Actor who went silent after an accident.\n\nHe ridiculed and suppressed him, saying deserved to make a comeback even if he was past his prime, and kissed the scars on his body at night, leaving resources behind to gracefully leave afterwards.\n\nSystem: [beep——]\n\nLin Sui, spreading his hands: Am I still not sparing enough effort?\n\nIn the third world, he was an S-rank Alpha, while the other person was a mentally-damaged former SSS-rank Alpha.\n\nHe looked down on him, saying that useless people also deserved to get back on the battlefield, and when no one was around he said ‘since you can’t smell pheromones, then I will be your omega’, and almost lost his life giving himself to the other person.\n\nSystem: …..\n\nLin Sui, smiling: Is my dying day enough?\n\nEven though, in the end, he was tucked away in a golden house by the wealthy upstart, captured by the triple gold Best Actor, and completely embraced by the Imperial Marshal, he was still happy.\n\nSystem, weeping bitter tears: Big brother, I’m begging you, I won’t tell you what to do any more!>"
}