{
	"url": "https://www.novelupdates.com/series/transition-to-another-world-landmines-included/",
	"title": "Transition to Another World, Landmines Included - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/01/bobbk9hhcj4hih4fdarm72q87eif_lqh_ck_hv_3sd0.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Fantasy   Slice of Life   ",
	"tags": "Ability Steal   Adapted to Manga   Adventurers   Alchemy   Archery   Beastkin   Cheats   Childhood Friends   Cooking   Depictions of Cruelty   Elemental Magic   Elves   Fantasy World   Game Elements   Level System   Male Protagonist   Modern Knowledge   Multiple Transported Individuals   Pragmatic Protagonist   Spear Wielder   Special Abilities   Teamwork   Transported to Another World   ",
	"rating": "(3.9 / 5.0, 88 votes)",
	"author": "Itsuki Mizuho   いつきみずほ   ",
	"year": "\n2018",
	"ranking": "#2000   #3257   #2542   #3756   #3393   ",
	"reviewcount": "13 Reviews sorted by",
	"description": "“Hey there! I’m a Dark God! Not a bad one though, I swear!”\n\nSo quipped the dark god (or so he called himself) before he sent my classmates and me away into another world, following our deaths in an accident that no one could have seen coming.\n\nAnd what a swell guy he was, creating new skills at our behest and offering us all kinds of support. How is he a dark god again?\n\n…There definitely used to be a time when I thought that way, at least.\n\nWe should have been more careful. There are probably dozens of my classmates who thought they were getting their hands on a real cheat skill, something that would make them invincible, but now they have to deal with some rather unfortunate repercussions. I mean, he was pretty clear right from the start that we wouldn’t be getting any actual cheat skills.\n\nI suppose they might just be reaping what they sow, in the end.\n\nOh, me? Well, I’m joining up with a couple of friends. We’ve known each other since we were kids, and now we’re set on leading lives where we won’t have too much to worry about. This new world we’re in might feel like a game, but it’s really anything but.>"
}