{
	"url": "https://www.novelupdates.com/series/still-i-am-the-brave-hero-who-was-expelled-from-his-country-and-party-because-of-his-long-standing-back-pain-was-struck-down-by-a-beautiful-elf-osteopath-who-healed-him-thank-you-now-i-can-fight/",
	"title": "[Still I Am] the Brave Hero, Who Was Expelled From His Country and Party Because of His Long-Standing Back Pain, Was Struck Down by a Beautiful Elf Osteopath Who Healed Him. Thank You, Now I Can Fight Again–! [Saving the World] - Novel Updates",
	"image": "https://www.novelupdates.com/img/noimagefound.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Comedy   Ecchi   Fantasy   Harem   Romance   Shounen   Slice of Life   ",
	"tags": "Betrayal   Demon Lord   Early Romance   Elves   Fantasy World   First-time Interc**rse   Former Hero   Heroes   Love at First Sight   Male Protagonist   Near-Death Experience   Overpowered Protagonist   Parody   Polygamy   Protagonist Falls in Love First   R-15   Threesome   ",
	"rating": "(3.4 / 5.0, 57 votes)",
	"author": "Manashiro Kanata (Kanatan)   マナシロカナタ（かなたん）   ",
	"year": "\n2021",
	"ranking": "#2686   #6326   #4184   #1729   #6510   ",
	"reviewcount": "6 Reviews sorted by",
	"description": "The hero Crow was the strongest hero who defeated the Demon King.\n\nHowever, when he overworked his body to the limit in the battle against the Demon King, he injured his back and has been suffering from severe back pain ever since.\n\nCrow was then expelled from the heroic party and the kingdom.\n\nHe was unable to walk due to his back pain, and finally collapsed in the forest.\n\nBut then Alice Bell, a beautiful elf who has a reputation for being a great physical therapist in the neighborhood, appears in front of him!\n\nThis is the first time that I’ve ever seen such a thing.\n\nYou’ll be able to get a lot more than that.　What are you doing all of a sudden?\n\n“Can you stand up now?\n\nA new kind of “back pain fantasy” for all those with back pain!\n\nIf you have back pain, you’ll surely be able to relate to the depth of the protagonist’s gratitude for being healed!\n\nIf you have back pain, you’ll be able to relate to the depth of the protagonist’s gratitude for being cured!\n\n(Note: This is a story that can be enjoyed by those who do not have back pain.) This is a tale of saving the world for the second time, starting with an old-fashioned real hero who helps the weak and saves the world, but is banished due to back pain.\n\nThis is the second world salvation story that begins when a real hero is banished due to back pain.>"
}