{
	"url": "https://www.novelupdates.com/series/new-game-plus-the-struggles-of-a-popular-vrmmo-livestreamer/",
	"title": "New Game Plus! ~The Struggles of a Popular VRMMO Livestreamer~ - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2016/05/CivEt5QVEAAWGI0.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Comedy   Fantasy   Harem   Romance   School Life   ",
	"tags": "Adapted to Manga   Adventurers   Androgynous Characters   Animal Characteristics   Anti-social Protagonist   Appearance Changes   Artificial Intelligence   Average-looking Protagonist   Beastkin   Cheats   Clan Building   Demi-Humans   Elves   Famous Protagonist   Fantasy Creatures   Game Ranking System   Gamers   Hard-Working Protagonist   Hidden Abilities   Hiding True Abilities   Hiding True Identity   Kind Love Interests   Level System   Loner Protagonist   Male Protagonist   Misunderstandings   MMORPG   Neet   Overpowered Protagonist   Personality Changes   Popular Love Interests   Protagonist Strong from the Start   Quiet Characters   Samurai   Secret Identity   Secretive Protagonist   Shy Characters   Strong to Stronger   Sword And Magic   Sword Wielder   Underestimated Protagonist   Virtual Reality   Wealthy Characters   ",
	"rating": "(4.1 / 5.0, 197 votes)",
	"author": "Murakami Mondo   邑上主水   ",
	"year": "\n2015",
	"ranking": "#6970   #4189   #2359   #3235   #1223   ",
	"reviewcount": "9 Reviews sorted by",
	"description": "A popular Sword and Magics VRMMO that countless livestreamers play, 「Dragon’s Krone」. Of the many streamers, the No. 1 most viewed player, Edogawa Ran, is so popular that he is even sponsored by a major corporation. But in real life, Ran had zero friends; a lonely highschool boy who had trouble talking to people.\n\nThen, on a day like any other, as Ran was spending his lunch break bitterly alone, someone approached him. The girl who he adored, Ninomiya Suzu, casually walked up and said the words.\n\n「Would you like to play Dragon’s Krone together?」\n\nUsing a LV 1 character, with his previous knowledge and techniques, he is unmatched in this virtual reality world. The struggles (in order to become a Riajuu) of a certain livestreamer.>"
}