{
	"url": "https://www.novelupdates.com/series/how-could-this-cat-tease-me/",
	"title": "How Could This Cat Tease Me? - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2018/09/howcouldthiscatteaseme.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Romance   Shounen Ai   ",
	"tags": "Acting   Celebrities   Love Interest Falls in Love First   Modern Day   Non-humanoid Protagonist   Pets   Shapeshifters   Showbiz   Straight Uke   Transformation Ability   ",
	"rating": "(4.2 / 5.0, 55 votes)",
	"author": "Zheng Zheng Yu Shang   蒸蒸与上   ",
	"year": "\n2017",
	"ranking": "#2000   #2000   #4102   #7355   #2789   ",
	"reviewcount": "7 Reviews sorted by",
	"description": "Record #1:\n\nThe entire entertainment circle knew that Xia Rong and Su Chi seemed to be natural enemies. They debuted at the same time and became popular at the same time. The two opposed each other in their careers, while their fans constantly ripped into each other in a frenzy.\n\nXia Rong began with this thought as well, all the way until he found out Su Chi’s secret… Su Chi could actually shapeshift?!\n\nSu Chi: “The issue of me turning into a cat, help me keep it a secret.”\n\nXia Rong: “Why should I?!”\n\nSu Chi: “Since you petted me… For an entire night?”\n\nXia Rong: “…”\n\nRecord #2:\n\nEver since Xia Rong found out that Su Chi could turn into a cat, moreover, shapeshift ignored the location, time, as well as the person in question’s wishes, the other often relied on him to help cover up.\n\nThe former rival became the obedient cat under his palm, and Xia Rong happily rubs the cat, “Hahahaha. Su Chi, even you have a day where you’re like this! Meow… Meow meow meow ao?”\n\nSurprises always come suddenly.\n\nXia Rong was unresigned, “Meow ow ow ow! Is shapeshifting into a cat contagious?!”\n\nSu Chi: “Don’t be afraid, I’ll steal cat food to raise you ^_^”\n\nDespite that some people appear to be well off, in reality, not only do they secretly have a cat, that cat is also their boyfriend =v=>"
}