{
	"url": "https://www.novelupdates.com/series/the-maid-who-became-a-knight/",
	"title": "The Maid Who Became a Knight - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/02/The-Maid-Who-Became-a-Knight.jpg",
	"noveltype": "(KR)",
	"genre": "Comedy   Drama   Fantasy   Josei   Romance   ",
	"tags": "Aristocracy   Clever Protagonist   Cute Protagonist   Dense Protagonist   Determined Protagonist   Different Social Status   Discrimination   European Ambience   Fast Learner   Female Protagonist   Gladiators   Handsome Male Lead   Hard-Working Protagonist   Honest Protagonist   Knights   Love Interest Falls in Love First   Maids   Master-Servant Relationship   Misunderstandings   Nobles   Orphans   Polite Protagonist   Poor Protagonist   Popular Love Interests   Righteous Protagonist   Selfless Protagonist   Servants   Shameless Protagonist   Stubborn Protagonist   Sword And Magic   Sword Wielder   Underestimated Protagonist   ",
	"rating": "(4.1 / 5.0, 56 votes)",
	"author": "Park Mina   박미나   ",
	"year": "\n2018",
	"ranking": "#2000   #2000   #5342   #3695   #3617   ",
	"reviewcount": "10 Reviews sorted by",
	"description": "Late at night, a suspicious maid came to the handsome Count’s bedroom!\n\nLeasis, the mysterious maid who took control of the continent’s hero, Count Dratius.\n\nThe turbulent romance between a maid who only knows to walk straight and the law-abiding Count!\n\n“Marquis Schwalnon, what did you just say to my maid? You said she didn’t know the basics.”\n\nMy maid. Leasis’ cheeks heated up as she heard unbelievable words coming out of his mouth. She felt like she had a fever higher than when she had been sick after clearing a garden of its snow in the middle of winter.\n\nShe lowered her head. It seemed as if ten firecrackers had exploded in her chest, but at the same time, it was thrilling. She bit her lips, trying to calm down.\n\nMeanwhile, Hizen returned to his usual self. He leaned on the chair with a relaxed smile. He looked so arrogant.\n\n“Don’t insult my maid again.”\n\nYou’re the idiot who doesn’t even know the basics.\n\nThe shape of Hizen’s mouth made Schwalnon tremble.>"
}