{
	"url": "https://www.novelupdates.com/series/nido-tensei-shita-shounen-wa-s-rank-boukensha-toshite-heion-ni-sugosu-zense-ga-kenja-de-eiyudatta-boku-wa-raisede-wa-jimi-ni-ikiru/",
	"title": "Nido Tensei Shita Shounen wa S-rank Boukensha Toshite Heion ni Sugosu ~ Zense ga Kenja de Eiyūdatta Boku wa Raisede wa Jimi ni Ikiru ~ - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/08/Nido-Tensei-Volume-01.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Comedy   Fantasy   ",
	"tags": "Adapted to Manga   Adventurers   Beautiful Female Lead   Demi-Humans   Dense Protagonist   Dragons   Fantasy World   Former Hero   Lack of Common Sense   Magic   Male Protagonist   Misunderstandings   Monsters   Naive Protagonist   Overpowered Protagonist   Previous Life Talent   Protagonist Strong from the Start   Reincarnation   Strong to Stronger   Unreliable Narrator   World Travel   ",
	"rating": "(3.0 / 5.0, 76 votes)",
	"author": "Juuichiya Sui   十一屋 翠   ",
	"year": "\n2018",
	"ranking": "#4617   #2154   #2408   #2775   #2627   ",
	"reviewcount": "5 Reviews sorted by",
	"description": "“I reincarnated again.”\n\nA certain baby, called Rex, was a reincarnated person possessing two previous lives, one where he had been the Hero, and one where he had been the Sage.\n\n“Be careful not to get involved in conspiracy and turmoil in this life.”\n\nRex, who had learned the dangers of being conspicuous from the memory of the previous lives, vows to live plainly.\n\n“And become an adventurer who is a symbol of freedom, a longing profession from the previous life!”\n\nRex, who became an adventurer after longing to fulfil his wishes, enjoys the daily life of earning money with an unobtrusive request.\n\n“I’m sorry, while collecting herbs I was attacked by a dragon and I hunted it.”\n\nRex was unaware to the fact that his plainness is messy.\n\n“Even so, the adventurer rank is easy to rise.”\n\nBoys who are not aware of it still outweigh the surrounding human beings.>"
}