{
	"url": "https://www.novelupdates.com/series/monogatari-series/",
	"title": "Monogatari Series - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2015/08/monogatari.png",
	"noveltype": "(JP)",
	"genre": "Comedy   Drama   Ecchi   Harem   Mystery   Psychological   Romance   School Life   Supernatural   ",
	"tags": "Absent Parents   Adapted to Anime   Adapted to Drama CD   Adapted to Manga   Anti-social Protagonist   Award-winning Work   Curses   Folklore   Ghosts   Helpful Protagonist   Immortals   Loli   Male Protagonist   Nudity   Perverted Protagonist   Quirky Characters   Romantic Subplot   Strong Love Interests   Tsundere   Unreliable Narrator   Vampires   Yandere   ",
	"rating": "(4.4 / 5.0, 126 votes)",
	"author": "Nisio Isin   西尾 維新   ",
	"year": "\n2006\n",
	"ranking": "#2000   #2000   #5851   #4972   #3276   ",
	"reviewcount": "3 Reviews sorted by",
	"description": "The Monogatari series centers on Koyomi Araragi, a third year high school student who is almost human again after briefly becoming a vampire. One day, a classmate named Hitagi Senjōgahara, who infamously never talks to anyone, falls down the stairs into Koyomi’s arms.\n\nHe discovers that Hitagi weighs next to nothing, in defiance of physics. Despite being threatened by her, Koyomi offers his help, and introduces her to Meme Oshino, a middle-aged homeless man who helped him stop being a vampire.\n\nSome volumes are split into multiple stories which are identified by the ‘s1,2,3…’ in the releases.\n\nVolumes 1-2: Bakemonogatari, 3: Kizumonogatari, 4-5: Nisemonogatari, 6-7: Nekomonogatari, 8: Kabukimonogatari , 9: Hanamonogatari, 10: Otorimonogatari, 11: Onimonogatari, 12: Koimonogatari, 13: Tsukimonogatari, 14: Koyomimonogatari, 15-17: Owarimonogatari, 18: Zokuowarimonogatari, 19:  Orokamonogatari, 20: Wazamonogatari, 21: Nademonogatari\n\nThe author has also split the volumes into various seasons: First Season: Volumes 1-6, Second Season: Volumes 7-12, Final Season: Volumes 13-18, Off Season: Volumes 19-21>"
}