{
	"url": "https://www.novelupdates.com/series/portrait-of-queen-berta-i-accidentally-got-pregnant-with-his-majestys-child/",
	"title": "Portrait of Queen Berta: I Accidentally Got Pregnant With His Majesty’s Child - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/08/QueenBerta3b.jpg",
	"noveltype": "(JP)",
	"genre": "Drama   Fantasy   Josei   Romance   ",
	"tags": "Adapted to Manga   Calm Protagonist   Childcare   Clever Protagonist   Complex Family Relationships   Female Protagonist   Forced Marriage   Imperial Harem   Politics   Pregnancy   R-15   Royalty   ",
	"rating": "(3.6 / 5.0, 25 votes)",
	"author": "Himawari   Nishino Himawari   向日葵   西野向日葵   ",
	"year": "\n2019",
	"ranking": "#2000   #2000   #7929   #11529   #6540   ",
	"reviewcount": "1 Review sorted by",
	"description": "Berta’s marriage was suddenly arranged, she will become the second consort of the King.\r\n\r\nThe current royal family that values the lineage over all, with several generations of consanguineous marriages, to preserve its “purity”.\r\n\r\nThe politics of the Kingdom, following the idea of the pure blood noblemen’s superiority, caused the national power to decline.\r\n\r\nTo retain the power of the Kingdom, the Royal Family decided to take a desperate measure, a marriage with a woman from the ethnic group to which belongs the majority of the population.\r\n\r\nThe bitterness of this act… Those who were previously considered a subjugated group of people living on the frontiers.\r\n\r\nThe chosen bride is Berta, the first daughter of the current lord of Kasha, the largest estate on the frontier and also a powerful faction.\r\n\r\nThe marriage life started in hard mode, a husband that doesn’t love her, a Queen that hates her, however, she still is forced to fulfill her role duties.\r\n\r\nBerta has decided to endure the hardship, that were already expected by her, and wait for the day when there’s no more need of her in the palace, and she can return home.\r\n\r\nHowever, Berta’s initial plans are ruined by an unexpected situation.\r\n\r\nAfter passing three nights with the King, as the royal rules dictated for a newlywed bride, Berta got pregnant with His Majesty’s child!!>"
}