{
	"url": "https://www.novelupdates.com/series/the-husky-and-his-white-cat-shizun/",
	"title": "The Husky and His White Cat Shizun - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/02/68e5b5ddly1fnmbscs6uaj21ck1vz7wh.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Drama   Mature   Romance   Smut   Tragedy   Xianxia   Yaoi   ",
	"tags": "Adapted to Manhua   Age Progression   Character Growth   Clingy Lover   Cruel Characters   Cultivation   Death of Loved Ones   Demons   Dense Protagonist   Doting Love Interests   Exorcism   First-time Interc**rse   Flashbacks   F*llatio   Ghosts   Handsome Male Lead   Hell   Hidden Abilities   Hiding True Identity   Interconnected Storylines   Love at First Sight   Love Interest Falls in Love First   Magic   Male Yandere   Manly Gay Couple   Marriage   Master-Disciple Relationship   Misunderstandings   Multiple POV   Mystery Solving   Obsessive Love   Outdoor Interc**rse   Past Plays a Big Role   Possessive Characters   Power Couple   Quirky Characters   Resurrection   Revenge   R*pe   Second Chance   Seme Protagonist   Shameless Protagonist   Sharp-tongued Characters   S*aves   Slow Romance   Strong Love Interests   Time Travel   Torture   Tragic Past   Tsundere   Unreliable Narrator   Unrequited Love   Zombies   ",
	"rating": "(4.4 / 5.0, 1256 votes)",
	"author": "Meatbun Doesn't Eat Meat   肉包不吃肉   ",
	"year": "\n2017",
	"ranking": "#344   #602   #578   #2297   #103   ",
	"reviewcount": "335 Reviews",
	"description": "Mo Ran thought becoming Chu Wanning’s disciple was a mistake.\n\nHis shizun was really too much like a cat while he himself was a dumb pup who’d only slobber and wag his tail.\n\nDogs and cats were different by nature; originally, the dumb pup didn’t want to reach his furry paws out to that cat.\n\nAt first he thought, dogs should be with dogs, like his shixiong, beautiful and tame like a cute Japanese Spitz, and the two of them together would surely be a match made in heaven.\n\nYet, after having died and reborn, after having lived two lives, the one he hauled back each time to his den in the end was always the one he couldn’t stand at first: that snow-white kitty shizun.>"
}