{
	"url": "https://www.novelupdates.com/series/after-the-bankruptcy-of-the-supporting-male-lead/",
	"title": "After the Bankruptcy of the Supporting Male Lead - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/06/ABSML.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Slice of Life   Yaoi   ",
	"tags": "Alternate World   Apathetic Protagonist   Carefree Protagonist   Celebrities   Hated Protagonist   Love Interest Falls in Love First   Misunderstandings   Older Love Interests   Shameless Protagonist   Sharp-tongued Characters   Slow Romance   System Administrator   Transmigration   Transported to Another World   Wealthy Characters   Writers   ",
	"rating": "(4.3 / 5.0, 114 votes)",
	"author": "Distant Spring Breeze   春风遥   ",
	"year": "\n2019",
	"ranking": "#1093   #4697   #2723   #2244   #2071   ",
	"reviewcount": "26 Reviews sorted by",
	"description": "After transmigrating into a bankrupt supporting male lead unable to pay utility bills and blocked from finding a job anywhere, Chen Zhan decided to… get rich writing an autobiography!\n\nRecalling the life of the vicious supporting male lead, he wrote a trilogy of his life, 《Confessions: The Birth and Death of a Rebellious Youth’s Emotions》,  《The Years When I Harassed the Queen of Film》, 《The Egg that Tried to Crush the Stone: Hatred for the Rich Me Me Slander the Rich CEO》….\n\nAmong them, 《Confessions》caused an uproar as soon as it was published.\n\nIn the beginning:\n\nFemale Lead: He’s just looking for attention.\n\nMale Lead: If the heavens want him to die, they must first make him (Chen Zhan) crazy.\n\nPasserbys A, B, C: Rubbish novels, whoever reads them is s*upid!\n\nThen-\n\nThey all secretly became Chen Zhan’s readers.\n\nLater, “Confessions” was completed, and the netizens: His talent was exhausted and this was just a temporary win.\n\nThe next day, it was revealed that Chen Zhan had captured the most mysterious and wealthy upstart in Y City.\n\nChen Zhan: Please support my new book: 《The Years When the Male God Chased Me》.\n\nNetizens: …You won!!!>"
}