{
	"url": "https://www.novelupdates.com/series/director-loves-no-one/",
	"title": "Director Loves No One - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/12/DIRECTOR-LOVES-NO-ONE.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Drama   Romance   ",
	"tags": "Acting   Appearance Different from Actual Age   Beautiful Female Lead   Calm Protagonist   Celebrities   Charismatic Protagonist   Female Protagonist   Modern Day   Mysterious Past   Possession   Slow Romance   Wealthy Characters   ",
	"rating": "(4.4 / 5.0, 37 votes)",
	"author": "Jiang Yue Nian Nian   江月年年   ",
	"year": "\n2020",
	"ranking": "#6970   #4811   #6128   #6797   #6098   ",
	"reviewcount": "7 Reviews sorted by",
	"description": "Thirty years ago, Chu Xiaxing was a well-known and talented young female director.\r\n\r\nThirty years later, Chu Xiaxing was still unmarried, temperamental, and hard-core an elderly woman.\r\n\r\n※\r\nShe spent her life practicing her dream of being a director, received countless major awards, and left a big legacy in the history of filmmaking, but was alone in her final years, and even her funeral was organized by her niece.\r\n\r\nBy chance, Chu Xiaxing had possessed the popular actress embroiled with scandal, Chu Xiaxin, who slit her wrists, and took over the bad life of the other person.\r\n\r\n※\r\nOn the set, the director repeatedly berated and made things difficult for Chu Xiaxin, who had joined the group at the expense of funding, accused the other party of poor acting skills, yet the director suffered a brazen rebuke.\r\n\r\nChu Xiaxing: Nonsense, obviously it' s you who cannot direct the scene.\r\n\r\nDirector (sneer): If you can, why don't you do it? You can be the director!\r\n\r\nChu Xiaxing: Alright.\r\n\r\nDirector: ???\r\n\r\nThe scandal-troublesome actress Chu Xiaxin suddenly announced that she had changed her career to become a director, instantly shocking the entire world internet!What's even more frightening is that ...... she filmed pretty damn good? Actually crushed a bunch of veteran directors!>"
}