{
	"url": "https://www.novelupdates.com/series/the-world-class-extras-walkthrough/",
	"title": "The World-Class Extra’s Walkthrough - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/12/The-WorldClass-Extras-Walkthrough.jpg",
	"noveltype": "(KR)",
	"genre": "Action   Adventure   Fantasy   Psychological   Shounen   ",
	"tags": "Accelerated Growth   Adventurers   Aristocracy   Average-looking Protagonist   Cheats   Determined Protagonist   European Ambience   Fallen Nobility   Game Elements   Game Ranking System   Gamers   Grinding   Hard-Working Protagonist   Level System   Male Protagonist   Royalty   Survival Game   Transmigration   Transported into a Game World   Weak to Strong   ",
	"rating": "(4.3 / 5.0, 32 votes)",
	"author": "찬괭   ",
	"year": "\n2020",
	"ranking": "#3017   #2815   #8045   #8664   #6852   ",
	"reviewcount": "1 Review sorted by",
	"description": "[God Dog]: I’m looking for someone to attempt life for a second time.\n\nAt the joke-like chatting, I ended up responding with a joke.\n[JjamBbong Taste Clementine]: Second time, let’s go go go go.\n\n[God Dog]: Are you confident? It’s not going to be easy, you know?\n\n[JjamBbong Taste Clementine]: Don’t I just have to do the same thing over again in this shitty game? Hehehehe.\n\nBut the result of this...\n\n“The third prince of the Magic Kingdom, Guillaume!”\n\n“……Who?”\n\nI became the third prince inside of that game.\nAn eerily shining cold steel blade touched my neck.\nThis, though unbelievable, had become my reality.\n\n“Now, third prince. Any last words?”\n\n“……What is this b*tchy situation?”\n\n“Haha, b*tchy? Those definitely sound like the words of a wastrel. Goodbye. Third Prince.”\n\nThe miserable end of an extra NPC.\nJust as the blade was about to fall on my neck...!\n\n[Gameplay has started.]\n[Player ‘Kim Kyung Sam’ will lay as the ‘Wastrel Third Prince’!]\nThe game I grinded my life into had become my reality.\n\nBut...\n‘I will not die.’\n‘And I will not be defeated.’\nBecause I know this game from the beginning to the end.>"
}