{
	"url": "https://www.novelupdates.com/series/the-second-life-cheat-reincarnation-mage-if-the-strongest-reincarnated-after-1000-years-life-would-be-too-easy/",
	"title": "The Second Life Cheat Reincarnation Mage ~If The Strongest Reincarnated After 1000 Years, Life Would Be Too Easy~ - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/07/lifeeasy1000years_v1_resized.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Ecchi   Fantasy   Harem   Mature   Romance   School Life   Seinen   ",
	"tags": "Academy   Adapted to Manga   Adventurers   Beautiful Female Lead   Cheats   Cunning Protagonist   Demons   Depictions of Cruelty   Determined Protagonist   Dragons   Dungeons   Evil Gods   Fantasy Creatures   Fantasy World   Genius Protagonist   Godly Powers   Handsome Male Lead   Hard-Working Protagonist   Heroes   Hidden Abilities   Hiding True Abilities   Hiding True Identity   Kind Love Interests   Love Interest Falls in Love First   Magic   Magic Beasts   Male Protagonist   Monsters   Narcissistic Protagonist   Overpowered Protagonist   Past Plays a Big Role   Polygamy   R-15   Reincarnation   Ruthless Protagonist   Strong Love Interests   Strong to Stronger   Sword And Magic   Sword Wielder   Tsundere   ",
	"rating": "(2.9 / 5.0, 37 votes)",
	"author": "Utsuzawa Shikiso   鬱沢色素   ",
	"year": "\n2019",
	"ranking": "#3802   #4864   #6514   #11074   #5355   ",
	"reviewcount": "1 Review",
	"description": "Having become overwhelming strong, a mage was bored with his life and decided to reincarnate in another era about 1000 years later.\n\nBut after reincarnation, the mage now known as Kurt saw a world where magic had declined, and the mages of the era are overall much weaker than those of 1000 years ago.\n\nIt also seems that Kurt is being look down upon for his Gold Magic as it is called defective magic power in this era.\n\nIn order to investigate the mysterious decline of magic in this era, Kurt enrolled into the Magic Academy at the Royal Capital and showed his extraordinary talent where he would become unparalleled in this second life of his too!?>"
}