{
	"url": "https://www.novelupdates.com/series/god-level-stone-gambler/",
	"title": "God-level Stone Gambler - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/02/Godlevel-stone-gambler-interstellar.jpg",
	"noveltype": "(CN)",
	"genre": "Fantasy   Mecha   Yaoi   ",
	"tags": "Apocalypse   Calm Protagonist   Clever Protagonist   Cold Protagonist   Futuristic Setting   Gambling   Genius Protagonist   Handsome Male Lead   Older Love Interests   Overpowered Protagonist   Protagonist Strong from the Start   Strong Love Interests   Strong to Stronger   Transported to Another World   Wealthy Characters   ",
	"rating": "(4.0 / 5.0, 44 votes)",
	"author": "檀幽筑梦   ",
	"year": "\n2019",
	"ranking": "#748   #1381   #4191   #1126   #4575   ",
	"reviewcount": "13 Reviews sorted by",
	"description": "In the post-apocalyptic world, Bai Jing has awakened his most useless ability – Sense Perception: the ability to sense active objects (including zombies) within 20 meters of him. \n\nBut he was brutally left behind by his teammates during a mission… When he wakes up again, Bai Jing is transported to the future mecha era!  In this era where all energy is provided by emeralds, Bai Jing accidentally comes into contact with gambling stones, and his most useless powers in his previous life become the strongest in gambling stones. Bai Jing went from being a gambling apprentice to a gambling master, and eventually reached the highest peak of the gambling world – a divine gambling master! \n\nGu Yuanzhao, heir to the first interstellar plutocracy, the youngest Major General in history, and voted the most charming man in the stars – is the dream man of all young men and women in the Empire.\n\nOne day, however, Gu Yuanzhao actually publicly admits to having a partner, and it’s a gambling master they have never heard of. Gu Yuanzhao’s fans were furious: “There are so many gamblers out there, who is this Bai Jing? He’s from the slums and he’s ugly!” Unexpectedly, the next day, the bigwigs came out to defend Bai Jing. \n\nThe chairman of the gambling guild dispelled the rumour: “This is the only god-ranked gambler in our guild!” \nThe head of the statistics bureau dispelled the rumour: “Bai Jing is already worth tens of billions of dollars and is ranked in the top ten of the rich list!”\nGu Group’s senior management disproved the rumor: “Bai Jing and Young Master Gu are of equal face value and equal strength!”\n\nOn the third day, fans saw Bai Jing who had taken off his glasses and were all too shocked to speak.\n\n#My CP has come true! # Later, they found out: the beautiful face of the world was him, the divine gambling master was him, the genius energy master was him. All the titles were his!>"
}