{
	"url": "https://www.novelupdates.com/series/true-daughter-she-is-the-almighty-boss/",
	"title": "True Daughter, She is the Almighty Boss - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/04/True-Daughter-She-is-the-Almighty-Boss.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Drama   Fantasy   Romance   School Life   ",
	"tags": "Beautiful Female Lead   Calm Protagonist   Complex Family Relationships   Doting Love Interests   Female Protagonist   Genius Protagonist   Handsome Male Lead   Hidden Abilities   Hiding True Identity   Late Romance   Low-key Protagonist   Modern Day   Multiple Identities   Power Couple   Reincarnated in Another World   Strong Love Interests   Transmigration   Underestimated Protagonist   ",
	"rating": "(3.4 / 5.0, 29 votes)",
	"author": "卿浅   ",
	"year": "\n2020",
	"ranking": "#2318   #626   #5685   #5808   #6545   ",
	"reviewcount": "8 Reviews sorted by",
	"description": "Ying Zijin, the former big man, woke up and became the youngest daughter of the Ying family who had been missing for 15 years, and decisively adopted a child to replace her.\n\nAfter returning, everyone ridiculed her for not being smart and capable, sensible and elegant.\n\nHer parents even regarded her as a family taint, and warned her not to think about the position of the eldest lady. If there is an adopted daughter by name, she should be acquainted, or she will be sent back.\n\nYing Zijin: Let’s go, don’t send it.\n\nWhile the Ying family was celebrating happily and everyone else was sitting and watching the real daughter’s joke, bigwigs from various fields were dispatched one after another—\n\n  \n\nThe top-ranking actor with the top fan fighting capacity: Miss Ying, if you need anything, just ask.\n\nHeir to the large conglomerate family who monopolizes the global economy: Ying Family? what? Boss, just kill it, right?\n\nChina’s first hidden ancient warrior: Who dares to bully the master?\n\nA genius teenager with an IQ of 228: My sister.\n\nThe man with the most enchanting face curled his lips and smiled lazily: “Well, call me brother-in-law.”\n\nBig guys:? ? ?\n\nThe identity of the true daughter of the original big boss was restored overnight, the whole network exploded, and the Ying family went crazy, crying and begging her to come back.\n\nThe International Giant Family: Excuse me, let me introduce, this is our eldest.>"
}