{
	"url": "https://www.novelupdates.com/series/there-is-no-place-for-fakes/",
	"title": "There Is No Place For Fakes - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/10/There-Is-No-Place-For-Fakes.jpg",
	"noveltype": "(KR)",
	"genre": "Drama   Fantasy   Romance   Shoujo   ",
	"tags": "Abandoned Children   Aristocracy   Beautiful Female Lead   Cautious Protagonist   Character Growth   Child Abuse   Depression   Distrustful Protagonist   European Ambience   Family Conflict   Female Protagonist   Hated Protagonist   Nobles   Pacifist Protagonist   Personality Changes   Prophecies   Royalty   Single Parent   Villainess Noble Girls   ",
	"rating": "(4.1 / 5.0, 58 votes)",
	"author": "오앤   ",
	"year": "\n2020",
	"ranking": "#4080   #4832   #4594   #6262   #2881   ",
	"reviewcount": "6 Reviews sorted by",
	"description": "Conspiring with her mother to impersonate the princess, Philomel – a fake princess who caused the war by separating the tower and the empire – is executed when all sins are found. Truly suited to be the villain…..\n\n“I mean, it’s not enough to kill the Philomel in the book for her mistakes!” Philomel shouted and threw the book she was reading. She was just curious about the suspicious book she picked up in the garden, but the Princess Philomel in the book, just die!\n\n“Which big guy wrote a novel with the background of the real imperial family?”\n\nI want to believe that it is only fiction, but somehow everything that happens after that looks exactly like the book. “As long as this happens… the only goal is survival!” 9-year-old Philomel changes her reputation to survive, finds Ellencia, the emperor’s real daughter, and leaves for a new life. But…\n\n“Come find my daughter right now!” The emperor, who knew he’d hate her, opened his eyes and looked for her.\n\n“I’m here. Come back with me to the Imperial Palace.” As well as her fiancé, who had seemed uninterested in her.\n\n“What’s wrong with coming to see my daughter?” Even her biological father begins to intrude into her life?\n\nWill Philomel be able to reveal the identity of the suspicious book and find her new life? A long romance fantasy.>"
}