{
	"url": "https://www.novelupdates.com/series/the-young-generals-wife-is-mr-lucky/",
	"title": "The Young General’s Wife Is Mr. Lucky - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/03/315556_243.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Comedy   Fantasy   Romance   Slice of Life   Supernatural   Xuanhuan   Yaoi   ",
	"tags": "Arranged Marriage   Cooking   Cultivation   Cute Protagonist   Dense Protagonist   Devoted Love Interests   Doting Love Interests   Fairies   Familial Love   Fantasy World   Futuristic Setting   Handsome Male Lead   Hard-Working Protagonist   Human-Nonhuman Relationship   Love Interest Falls in Love First   Loyal Subordinates   Lucky Protagonist   Marriage of Convenience   Military   Naive Protagonist   Previous Life Talent   Soldiers   Special Abilities   Strong Love Interests   Transmigration   Unique Cultivation Technique   Virtual Reality   Zombies   ",
	"rating": "(3.7 / 5.0, 134 votes)",
	"author": "Demon Fox With Fiery Tail   灸尾妖狐   ",
	"year": "\n2018",
	"ranking": "#2836   #3798   #2029   #4680   #1707   ",
	"reviewcount": "41 Reviews sorted by",
	"description": "Yu Jinli* was a koi fish who had cultivated for a thousand years. \n\nHe had taken the shape of a human being, and possessed the ability to predict fortune and change luck.\n\nHe was supposed to be a popular Mr. Lucky but who could have thought that…\n\n“Sir, your forehead is covered by gloomy air. I’m afraid there is a looming threat of fatal disaster waiting for you…” Yu Jinli said with all seriousness.\n\nAll of a sudden, a big flower pot descended from above and hit that man directly on the head.\n\n“Buddy, the top of your head is green. I’m afraid that…”\n\nBefore Yu Jinli finished, the young man opposite him received a call and headed to a hotel nearby to catch his girlfriend in the act of adultery.\n\n“Brother, you…”\n\nEveryone cried: Lord General, please take good care of your wife and don’t let him throw curses around… TAT\n\nYu Jinli felt frustrated: Obviously, I’m warning them with good intentions.\n\nThe nationally acknowledged most perfect man, the young general: Dear, don’t get upset because of those shortsighted people. Come home with me and I’ll make you chestnuts roasted with brown sugar.\n\nThose “shortsighted” people: …\n\n*Note: The two Chinese characters “Jin Li” in the name sounds similar to the two Chinese characters for koi fish. ‘Jinli’ is now a symbol of luck in internet slang.>"
}