{
	"url": "https://www.novelupdates.com/series/interstellar-super-doctor/",
	"title": "Interstellar Super Doctor - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/08/Interstellar-Super-Doctor_1628751033.png",
	"noveltype": "(CN)",
	"genre": "Action   Comedy   Mecha   Romance   Sci-fi   Yaoi   ",
	"tags": "Clever Protagonist   Doctors   Familiars   Futuristic Setting   Generals   Handsome Male Lead   Healers   Hidden Abilities   Level System   Love Interest Falls in Love First   Magical Space   Military   Overpowered Protagonist   Pharmacist   Power Couple   Sealed Power   Sharp-tongued Characters   Spirit Users   Strong Love Interests   System Administrator   Transmigration   Tsundere   ",
	"rating": "(4.0 / 5.0, 163 votes)",
	"author": "Hanmen Yatou   Humble Servant Girl   寒门丫头   ",
	"year": "\n2018",
	"ranking": "#3710   #690   #1656   #330   #2439   ",
	"reviewcount": "43 Reviews sorted by",
	"description": "Taking the Sword Heroes game system with him, Xiào Mu transmigrated into an interstellar world. Then he became a guide who has waste level physical strength but OP spiritual power. While trying to improve his spiritual power, activate skills, and make medicine… He unknowingly became a heartthrob in the hearts of the imperial sentinels.\n\nLeo, the youngest major general in the empire, has rejected the Golden Tower’s matching suggestion for the 102nd time, stated, “Instead of marrying a weak chicken guide, I would rather live with inhibitors for the rest of my life!”\n\nLeo is the only single sentinel in the empire who has SS level in both physical and spiritual power. He hates wastes and disdained weak chickens the most. Later, he fell in love with Xiào Mu, the weakest person in the empire in terms of physical strength.\n\nXiào Mu’s daily routine after work: Sorry, the appointment for spiritual treatment this week is full, please come back next week.\n\nThe assistant glanced at the terminal: Boss, quickly come to your senses! The appointment for treatment has already reached 2 years later.\n\nLeo’s daily life after falling in love: You want to pursue Xiào Mu? I’ll see you at the challenge arena!>"
}