{
	"url": "https://www.novelupdates.com/series/after-the-global-evolution-i-stand-at-the-top-of-the-food-chain/",
	"title": "After the Global Evolution, I Stand at the Top of the Food Chain - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/09/After-the-Global-Evolution-I-Stand-at-the-Top-of-the-Food-Chain.jpg",
	"noveltype": "(CN)",
	"genre": "Fantasy   Horror   Psychological   Sci-fi   Shounen Ai   Yaoi   ",
	"tags": "Anti-social Protagonist   Apathetic Protagonist   Apocalypse   Calm Protagonist   Charismatic Protagonist   Charming Protagonist   Clever Protagonist   Cold Protagonist   Doctors   Dragons   Gore   Handsome Male Lead   Healers   Human Experimentation   Insects   Love Interest Falls in Love First   Military   Mutations   Mysterious Family Background   Older Love Interests   Parasites   Power Couple   Psychopaths   Ruthless Protagonist   Special Abilities   Strong Love Interests   System Administrator   Time Manipulation   Weak to Strong   ",
	"rating": "(4.5 / 5.0, 86 votes)",
	"author": "Qi Liu   七流   ",
	"year": "\n2021",
	"ranking": "#1837   #2198   #4480   #2928   #3132   ",
	"reviewcount": "13 Reviews sorted by",
	"description": "In 2121, a terrible pollution disease swept through the world.\n\n“We call it distortion, but perhaps, the history records of later generations will call it an evolution.”\n\nThe world experienced involution.\n\nToday, that person’s head split into two. Tomorrow, that flower would grow fangs. The day after that, that fish would climb ashore with its legs…\n\nLu Yan: And I am merely a mediocre doctor who treats the pollution disease.\n\n*\n\nPatient A: When I first grew 18 tentacles, I was having a great time eating [beep—] by the seaside. As soon as Dr. Lu came, he cut 17 of them for me. He’s really a brilliant doctor!2\n\nPatient B: I am a poisonous mushroom. My spores are highly toxic and can be parasitic. I gave birth to hundreds of thousands of microspores, which made it worse for my already poor family. Dr. Lu helped me practice family planning when he came. This great kindness will forever be remembered!\n\nPatient C: I have eight mouths. I was a picky eater and only ate meat, so I set up a slaughterhouse for this purpose. But then, Dr. Lu cured my picky eating. This woman of faith is willing to be a vegetarian for the rest of her life in exchange for Dr. Lu’s happiness and well-being in this life.\n\nLu Yan, the top of the food chain, the eternal god.>"
}