{
	"url": "https://www.novelupdates.com/series/fair-trade/",
	"title": "Fair Trade - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/09/Fair-Trade.jpeg",
	"noveltype": "(KR)",
	"genre": "Action   Adult   Drama   Mature   Romance   Smut   ",
	"tags": "Beautiful Female Lead   Criminals   Evil Organizations   Female Protagonist   Love Triangles   Modern Day   Organized Crime   R-18   ",
	"rating": "(3.5 / 5.0, 48 votes)",
	"author": "Jin Soye   진소예   ",
	"year": "\n2019",
	"ranking": "#2642   #1981   #6359   #4972   #4589   ",
	"reviewcount": "1 Review sorted by",
	"description": "“How does it feel to be the one to be deceived?”\n\nSei flinched and shrinked away from him. The man she saw up close had an unrealistic appearance beyond her imagination. With his features, it was hard to guess his age.\n\n“So, what if the food was mixed with something? You shouldn’t have eaten it without knowing what was in it.”\n\n“What are you…”\n\n“If you were hungry, you should have rather ordered room service. If you had, we wouldn’t have met like this.”\n\nGulping nervously, Sei recalled a plate of high-end cookies on a mini bar. The man was looking down at her with a strange smile as if it was all fun for him.\n\nNo matter how handsome and angel-like he looked, she didn’t want to deal with anything that wasn’t normal. She just hoped he was not some crazy psycho.\n\n“I’d love to put it in your mouth, but I’m sure it’ll ruin this pretty face. So let’s stop here. In return…”\n\nThe man while saying the vulgar words grabbed her wrist and let her hold his manhood. Surprised by his thickness that couldn’t be held in one hand, she tried to pull her hand out of his grasp, but it was futile. His cold grayish-blue eyes held her body immobile.\n\n“Sei.”\n\nShe snapped out of her reverie when she heard his low voice calling out her name.\n\n“I’ll repeat it only once. Don’t you dare think Giulio Parenti is above me. Because if I won't kill you, that means Parenti too would not be able to kill you. Do you understand?”\n>"
}