{
	"url": "https://www.novelupdates.com/series/li-hans-little-farmers-wife-from-the-mountains/",
	"title": "Li Han’s Little Farmer’s Wife from the Mountains - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/03/Li-Hans-Little-Farmers-Wife-from-the-Mountains.jpg",
	"noveltype": "(CN)",
	"genre": "Fantasy   Historical   Romance   Slice of Life   ",
	"tags": "Age Progression   Ancient China   Business Management   Doting Parents   Farming   Female Protagonist   Magical Space   Poor to Rich   Transmigration   Ugly to Beautiful   ",
	"rating": "(3.8 / 5.0, 12 votes)",
	"author": "五女幺儿   ",
	"year": "\n2018",
	"ranking": "#2000   #2000   #8935   #8526   #8191   ",
	"reviewcount": "4 Reviews sorted by",
	"description": "Traveling to the ancient countryside, with broken houses and walls, no parents, no money, no food in her hands, a large group of scumbags who want to take advantage of her, as well as a village idiot who wants to marry her.\n\n    Shen Ruolan is depressed, Hey! What should I do if I am dealt a bad hand?\n\n    This cold salad is definitely not done, you can only start from scratch.\n\n    As a result, she built greenhouses, raised poultry, dug fish ponds, and sold secret recipes. With all her energy, she finally made her life flourish and abused the scumbags to abandon their armor and cry for their mothers.\n\n    Ms. Shen became famous and the matchmaker who came to propose marriage had to step through the threshold. She was wondering who to choose. A man with no ethics came to her door in the middle of the night.\n\n    “Lan’er, we have both slept together and you are still thinking about marrying someone else, do you not want to be responsible?”\n\n    Shen Ruolan said softly, “You are saying that I slept with you? Where is the evidence?”\n\nThe sleepy man replied slowly, “Evidence, I have left it in your stomach, and you can see it in nine months !”\n\n    …\n\nNine months later, the evidence came to fruition, and the man was extremely proud: “Look, the evidence is conclusive, What else do you want say?”\n\n    Shen Ruo gritted her teeth: “I gave birth to the child. How can you prove that it is yours?”\n\n    Yo! you want me to admit it?\n\n    The man’s face turned dark: “Want to be reckless? Because you are so beautiful? Let’s make another one for comparison!”\n\n    So saying, he fell down….>"
}