{
	"url": "https://www.novelupdates.com/series/i-dont-want-to-be-loved/",
	"title": "I Don’t Want to Be Loved - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/02/idwtbl-1.jpg",
	"noveltype": "(KR)",
	"genre": "Adult   Drama   Fantasy   Josei   Romance   Smut   Tragedy   ",
	"tags": "Absent Parents   Abusive Characters   Affair   Age Progression   Ancient Times   Aristocracy   Beautiful Female Lead   Betrayal   Bullying   Butlers   Character Growth   Childhood Friends   Childhood Love   Coming of Age   Complex Family Relationships   Contracts   Court Official   Cousins   Cowardly Protagonist   Cruel Characters   Cute Children   Dark   Death   Death of Loved Ones   Depictions of Cruelty   Depression   Destiny   Devoted Love Interests   Divorce   Doting Love Interests   Empires   European Ambience   Fallen Nobility   Family Conflict   Female Protagonist   First Love   First-time Interc**rse   Flashbacks   Handsome Male Lead   Inheritance   Jealousy   Kingdoms   Love Interest Falls in Love First   Loyal Subordinates   Maids   Marriage   Marriage of Convenience   Misunderstandings   Multiple Reincarnated Individuals   Naive Protagonist   Nobles   Past Plays a Big Role   Past Trauma   Politics   Popular Love Interests   Power Struggle   Pregnancy   R-18   R*pe Victim Becomes Lover   Reincarnation   Revenge   Royalty   R*pe   Schemes And Conspiracies   Second Chance   Selfish Protagonist   Shameless Protagonist   Sickly Characters   Strong Love Interests   Time Travel   Tragic Past   Unreliable Narrator   Wars   Weak Protagonist   Wealthy Characters   ",
	"rating": "(3.9 / 5.0, 530 votes)",
	"author": "Starlight   ",
	"year": "\n2019",
	"ranking": "#5262   #2000   #462   #1217   #251   ",
	"reviewcount": "133 Reviews",
	"description": "Rihannan Alessin, a queen rotting in prison.\n\nDespaired and without hope, she drank poison and died. But… unbeknownst to her, the deity gave her a second chance at life. She was twelve again. And this time, she would live life differently.\n\nSix years later, she chooses to become Arundell’s queen…\n\n“If you’re asking me to step down from the marriage proposal, I can’t.”\n\n“Marry me and let us divorce after a year.”\n\nAnd this time, the time limit of their marriage would last a year.\n\nA husband she knew who was different than before… she tried not to love him again, but each time, her heart kept shaking.>"
}