{
	"url": "https://www.novelupdates.com/series/this-time-i-became-the-fiance-of-a-dukes-daughter-but-she-is-rumored-to-have-bad-personality-and-ten-years-older/",
	"title": "This Time, I Became the Fiance of a Duke’s Daughter. But She is Rumored to have Bad Personality, and Ten Years Older - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2018/06/thistimeduke.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Fantasy   Harem   Romance   ",
	"tags": "Aristocracy   Arranged Marriage   Assassins   Beautiful Female Lead   Magic   Male Protagonist   Nobles   Older Love Interests   Politics   Polygamy   Protagonist Strong from the Start   Sharp-tongued Characters   ",
	"rating": "(3.8 / 5.0, 102 votes)",
	"author": "Ichimura Tetsunosuke   市村 鉄之助   ",
	"year": "\n2016",
	"ranking": "#2000   #2000   #3921   #2927   #3096   ",
	"reviewcount": "8 Reviews sorted by",
	"description": "Unbeknownst to him, a fiancé had been decided for sixteen year old Jared Murphy. He was the eldest son of the Baron Family, but due to other plans he had, he would not succeed the inheritance of his family. The woman he’d be married to was Olivier Alway, daughter of Duke Alway. She was beautiful woman infamous for her horrendous personality and vulgar mouth. Moreover, she was ten years older than him.\n\nJared had a small ambition, wishing to become an adventurer to leave the aristocratic life behind, but who knew that it’d in a matter of moments the moment Olivier Alway appeared in his life. Instead, he’d have to become a court magician, a position many yearned for.\n\nAs Jared overcomes factional disputes, discords between knights and magicians, magical beasts exterminations, and conflicts with secret organizations in a dramatic fashion, he slowly unravels who Olivier truly is as a person. Slowly, he begins to know her better.\n\nAs he threads his own path, he’ll meet students, knights, magicians, and heroines of noble background from the same school.\n\nThis is the story of a magician who became the fiancé of the duke’s daughter as he rises up to become a court magician.>"
}