{
	"url": "https://www.novelupdates.com/series/ecstas-online/",
	"title": "Ecstas Online - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/08/My0mLyw.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adult   Adventure   Comedy   Drama   Fantasy   Harem   Mecha   Mystery   Romance   Sci-fi   Seinen   Tragedy   ",
	"tags": "Adapted to Drama CD   Adapted to Manga   Antihero Protagonist   Artificial Intelligence   Average-looking Protagonist   Beautiful Female Lead   Boss-Subordinate Relationship   Breast Fetish   C*nnilingus   Cunning Protagonist   Curses   Demi-Humans   Demon Lord   Demons   Elves   First-time Interc**rse   F*llatio   Game Elements   Hard-Working Protagonist   Hiding True Abilities   Hiding True Identity   Kind Love Interests   Leadership   Level System   Loner Protagonist   Loyal Subordinates   Magic   Male Protagonist   Monsters   Multiple Transported Individuals   Naive Protagonist   Nudity   Older Love Interests   Overpowered Protagonist   Perverted Protagonist   Popular Love Interests   Proactive Protagonist   R-18   Special Abilities   Strong Love Interests   Threesome   Transported into a Game World   Underestimated Protagonist   Vampires   Virtual Reality   Weak to Strong   ",
	"rating": "(4.0 / 5.0, 246 votes)",
	"author": "Kuji Masamune   久慈マサムネ   ",
	"year": "\n2016",
	"ranking": "#3802   #4675   #1799   #4455   #962   ",
	"reviewcount": "12 Reviews sorted by",
	"description": "The bottom of the school caste, Doumeguri Kakeru, is transmigrated into the one who reigns as the strongest in the VR game 《Exodia Exodus》, the Demon Lord Hellshaft.\n\nMoreover, he has even obtained the “forbidden power” (adult mode)!\n\nHowever, the enemy that appeared before him (the Players) are the girl that he yearns for, Asagiri Ririko, and his other classmates that he recognizes.\n\nAsagiri and the others believe that they can return to their original world if they defeat the Demon Lord Hellshaft, but in truth, everyone’s lives will be in danger if the Demon Lord dies――!?\n\nIn order to save his precious one, Doumeguri/Hellshaft will ambush his classmates with the strongest power!>"
}