{
	"url": "https://www.novelupdates.com/series/fall-in-love-with-mr-nian-slowly/",
	"title": "Fall in Love with Mr. Nian Slowly - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/06/Fall-in-Love-with-Mr.-Nian-Slowly-Cover.jpg",
	"noveltype": "(CN)",
	"genre": "Adult   Josei   Mature   Romance   School Life   Slice of Life   ",
	"tags": "Broken Engagement   Businessmen   Couple Growth   Delusions   Female Protagonist   Possessive Characters   Power Couple   Prison   Revenge   Slow Romance   Smart Couple   Unconditional Love   Voice Actors   ",
	"rating": "(3.7 / 5.0, 53 votes)",
	"author": "Leaf Snow   Ye Xue   葉雪   ",
	"year": "\nN/A",
	"ranking": "#2000   #2000   #5658   #10478   #6897   ",
	"reviewcount": "14 Reviews sorted by",
	"description": "Due to the machination of her boyfriend and “bestie” , Xu Luosang who used to be a noble lady of a rich family was reduced to hiding her identity in order to rise up again. Her fiance put her father in jail and all that love turned to hate. So she lies about her age, hides her beauty and starts working as a carer in order to regain her power so she could save her father.\n\nOur story begins with her nursing Nian Junting, a high-handed and narcissistic president, who suffered an accident and is  unable to move and also unable to get it up. Being a man-child, the words he says are always the opposite of what the other party wants.\n\nShe thought their relationship was nothing more than a deal, so she left continuing her plans in her revenge, but time proved that he really loved her. He kept pestering her shamelesly, even obtaing a marriage certificate. His righteosness and fairness charmed her in time…..but will he make her fall in love again?\n\nHis sister: “Luosang must have reaped a significant amount of bad karma in her past lives to have been fancied by her brother.”\n\nHim: “If I make Zhong Yi fall into the water every day, will you kiss me and feed me every day?”\n\nLuosang’s mouth corners twitched slightly. ‘Really? Are you jealous of a dog?’>"
}