{
	"url": "https://www.novelupdates.com/series/person-with-an-inferior-ability-returning-from-demon-world-ln/",
	"title": "Person with An Inferior Ability Returning From Demon World (LN) - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/08/makaikaeri_v3.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Fantasy   Harem   Romance   School Life   ",
	"tags": "Adapted to Manga   Alternate World   Beautiful Female Lead   Childhood Friends   Demons   Dense Protagonist   Friendship   Human-Nonhuman Relationship   Love Interest Falls in Love First   Magic   Male Protagonist   Polygamy   Poor Protagonist   Protagonist Strong from the Start   Secret Organizations   Secrets   Spirits   ",
	"rating": "(2.9 / 5.0, 56 votes)",
	"author": "Tasuro   たすろう   ",
	"year": "\n2016",
	"ranking": "#6970   #2000   #4061   #7991   #3795   ",
	"reviewcount": "8 Reviews sorted by",
	"description": "Hiroto Domori (Domori Hiroto)was born into the Domori family, a family of the strongest spirit swordsman who inherited the unusual abilities.\n\nBecause, he inherited spiritual and magical powers from his father and mother that contradicts each other. If only the magical side was sealed, his spiritual power simply leaked out and he was unable to use either of them, resulting in a peculiar constitution that prevented him from inheriting his powers.\n\nFor this reason, he received training in the Sendo from his grandfather (Kazura) Tenzo’s acquaintance Soni.\n\nYuto showed his natural ability in learning the Sendo. Through the process, he learned that Senki does not repel either spiritual or magical power, and was able to wield the powerful and unparalleled power of simultaneous use of spiritual and magical power…\n\nThat power came at a serious price.\n\nWhen he enters high school, his grandfather Kazura, a super free spirit, spends all his money on living expenses, he is kicked out of his home for a reckless reason because he is having a hard time making ends meet, and he enrolls in Horajin Kibayashi High School, which allows him to pay his tuition as long as he can pay in full.\n\nHe starts high school life with his childhood friend Mari, who played with Yuto in the past, and his friends Ichigo and Shizuka, but due to various misfortunes, the family’s finances are in a state of flux.\n\nUnable to find a good part-time job and unable to shake off his financial worries, Yuto decides to take the World Ability Agency’s rank certification test, a taboo in the Domori family, in order to make ends meet.>"
}