{
	"url": "https://www.novelupdates.com/series/a-story-of-a-cannon-fodder-who-firmly-believed-he-was-the-protagonist-misunderstood-the-actual-protagonist-as-the-cannon-fodder-and-ended-up-victorious/",
	"title": "A Story of a Cannon Fodder who Firmly Believed He was the Protagonist, Misunderstood the Actual Protagonist as the Cannon Fodder, and Ended up Victorious - Novel Updates",
	"image": "https://www.novelupdates.com/img/noimagefound.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Comedy   Fantasy   Harem   Shounen   Tragedy   ",
	"tags": "Calm Protagonist   Dense Protagonist   Determined Protagonist   Dungeons   Elemental Magic   European Ambience   Fearless Protagonist   Gods   Handsome Male Lead   Hard-Working Protagonist   Knights   Male Protagonist   Misunderstandings   Mob Protagonist   Multiple POV   Orphans   Reincarnated in a Game World   Reincarnated in Another World   Reincarnation   Righteous Protagonist   Romantic Subplot   Ruthless Protagonist   Sword And Magic   Weak to Strong   ",
	"rating": "(4.4 / 5.0, 88 votes)",
	"author": "Sasuga Yuyushita   流石ユユシタ   ",
	"year": "\n2021",
	"ranking": "#509   #403   #2917   #677   #5341   ",
	"reviewcount": "8 Reviews",
	"description": "God: “I’ll lie to this guy and tell him that I reincarnated him as the protagonist, when actually I just reincarnated him as cannon fodder (LOL).”\r\n\r\nA high school boy who longed for the protagonists that appeared in fiction got hit by a truck and died. He was then called before God, who told him that he will be reincarnated inside a game based on a novel. Our boy was happy to be told that he was going to be reincarnated as Protagonist… However, he was actually reincarnated as mere cannon fodder inside utsuge!! (T/N: Utsuge translates as “melancholy/depressing game” and that’s basically it.)\r\n\r\nAnd so, the guy was played by god’s scheme … Well, such a thing didn’t happen though. He firmly held onto his belief and the vision of his ideal which then changed the world.\r\n>"
}