{
	"url": "https://www.novelupdates.com/series/i-used-non-humans-as-actors-for-those-years/",
	"title": "I Used Non-humans as Actors for Those Years - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/07/I-used-nonhumans-as-actors-for-those-years.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Romance   Shounen Ai   Supernatural   Xuanhuan   ",
	"tags": "Calm Protagonist   Ghosts   Modern Day   Seeing Things Other Humans Can't   Seme Protagonist   Showbiz   Slow Romance   ",
	"rating": "(4.4 / 5.0, 10 votes)",
	"author": "Cyan Wings   Qing Se Yu Yi   青色羽翼   ",
	"year": "\n2021",
	"ranking": "#6970   #2000   #10651   #11315   #10041   ",
	"reviewcount": "3 Reviews sorted by",
	"description": "Question: What is it like for non-humans to watch thrillers?\n\nA: Shuangwen! (refreshing with lots of face slapping)\n\nNewcomer director Zhong Jiudao rented a famous murder house to shoot a scene in order to save money. The mansion has been uninhabited for many years, but there are many ghosts before the founding of the Country. They gathered behind Zhong Jiudao, wanting to teach a lesson to this human who was fighting with them for territory. Who knew that Zhong Jiudao unhurriedly took out the script and read it to the residents of the murderous house.\n\nGhosts: Huh? Substitute oneself for the ghost character in the script, and it is quite cool!\n\nZhong Jiudao put away the script and asked the group of ghosts: Are you interested in making a movie? Actors will have money burned for them.\n\nGhosts: What type of film is it?\n\nZhong Jiudao: A ghostly protagonist’s revenge Shuangwen.\n\nThe ghosts raised their hands one after another: I, I want to shoot!\n\nZhong Jiudao: Competition for posts, audition here.\n\n—\n\nEighteen-line transparent Luo Huai, who has just graduated from film and television school, takes over a supporting role in a horror movie. Although the crew is a little poor, the director has a good personality, the staff is kind, and the seniors who play the ghosts are good and enthusiastic and will patiently guide him to shoot.\n\nGhost Senior: You can’t do this, you want to act real, if you are not sincere, how can you trick those humans into your own territory?\n\nLuo: Huh?\n\nGhost Senior: Wrong, it is the truth that can pull the audience into your acting skills.\n\nLuo: Thank you seniors! The seniors are so nice!>"
}