{
	"url": "https://www.novelupdates.com/series/i-became-the-villains-own-daughter/",
	"title": "I Became the Villain’s Own Daughter - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/12/I-became-the-villains-own-daughter.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Drama   Romance   Slice of Life   Supernatural   Tragedy   ",
	"tags": "Beautiful Female Lead   Child Protagonist   Childcare   Childish Protagonist   Cute Protagonist   Familial Love   Female Protagonist   Handsome Male Lead   Lucky Protagonist   Multiple Reincarnated Individuals   Naive Protagonist   Reincarnation   Second Chance   Tragic Past   Transmigration   Villainess Noble Girls   Wealthy Characters   ",
	"rating": "(4.2 / 5.0, 57 votes)",
	"author": "Qu Xiaoxi   曲小兮   ",
	"year": "\n2020",
	"ranking": "#4265   #3569   #2780   #3899   #2963   ",
	"reviewcount": "16 Reviews sorted by",
	"description": "The villain, Lu Junhan, is so treacherous and cunning that he has done all sorts of bad things, and there is nobody in Hai Cheng who is not afraid of him.\n\nBut in the end, he died tragically at the male lead’s hands, becoming the biggest joke in the Hai Cheng circle!\n\nTo change this tragic outcome, the little Koi princess was reincarnated and became Lu Li, the daughter of Lu Jun Han.\n\nThe three-and-a-half-year-old little dumpling clenched her fist: I’m going to protect my father’s life! No one can bully him!\n\nWho the hell is bullying whom?\n\nLater…\n\nLu Junhan: “Someone! Strip him naked and throw him in the pool.”\n\nLu Li: “Dad, I’ll do it! I’ll take off his clothes.”\n\n“…… “Lu Junhan paused: “Forget it, taking off your clothes is a nuisance, cut off one of his hands for me -”\n\nBefore he finished speaking, Lu Li revealed her weapon first: “I’ll do it! Dad, I can do this too!”\n\nLu Junhan: “……”\n\nAfterward, a reporter asked, “Mr. Lu, what made you change your mind and vow to be a good person?”\n\nLu Junhan remained silent with a smile.\n\nIn order not to lead the child astray, he had to put away all his tyrannical ruthlessness, set a good example, turn the little dumpling back onto the right path, and always be on the lookout for others who might cheat her away!\n\n……\n\nBut who knew that the precious daughter, who was raised with great care and protection, would end up being snatched by a little devil!\n\nThe little devil king, who has always been lawless, sinister, and ruthless, looked like a good boy: “Li Li, they all say you like good people.”>"
}