{
	"url": "https://www.novelupdates.com/series/i-dont-need-a-husband/",
	"title": "I Don’t Need A Husband - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/04/I-Dont-Need-A-Husband.png",
	"noveltype": "(KR)",
	"genre": "Adult   Drama   Fantasy   Mature   Romance   Smut   ",
	"tags": "Beautiful Female Lead   Empires   European Ambience   Female Protagonist   Hiding True Identity   Possessive Characters   Royalty   ",
	"rating": "(3.5 / 5.0, 25 votes)",
	"author": "Mucury   ",
	"year": "\n2020",
	"ranking": "#3923   #4717   #9677   #6615   #8373   ",
	"reviewcount": "1 Review sorted by",
	"description": "Empress of the Larchen Empire, Isilis.\n\nShe spends the night with Berthas, a man she meets at a resort, unable to overcome the annoyance of the nobles who insist on her having an heir.\n\n“It’s, it’s strange…! Hah!”\n“It should be good.”\nBerthas whispered as he watched her petals dripping with love liquid. He quickly put himself in the wet place. Berthas felt himself being tightened from all around.\n\nHe can’t get away from this woman.\n\n“It will be better now.”\nHe moved his body slowly as Berthas felt her insides warmly wrap around him. Her soft inside felt good. Feeling the thrill of excitement rush to the top of his head, he violently pounded her.\n\nHe thought, ‘I should have this woman…’\n…This woman who gave her everything to him.\n\n“Will you stay by my side?”\n“Yes…”\n“That’s a promise.”\n\nBut, how futile was that thought.\n\nAs if the promise meant nothing to her, Isilis disappeared from his side without a word. It was as if the long night that seemed to never end did not exist in the first place.\n\nBerthas wandered in search of her.\n\nThe moment he finally met her again, he realized that Isilis was the Empress of the Larchen Empire, and that she had slept with him to have her heir.\n\n“Was it because…you need a child?”\nBerthas’ trembling voice turned to Isilis. As though he was the only one who remembered and pondered about the past, his heart was pounding as if it had been engulfed in a scorching fire.\n\n“That’s right.”\nFrom her red lips, an answer that broke even a single expectation came out.\n\nGazing at her with wounded eyes at the answer he had not hoped for, beyond the wounds in his eyes, the obsession that had never been extinguished until now was swirling with a darker color.\n\n“Then, what about me? What have I been to you?”>"
}