{
	"url": "https://www.novelupdates.com/series/saikyou-juzoku-tensei-cheat-majutsushi-no-slow-life/",
	"title": "Saikyou Juzoku Tensei ~Cheat Majutsushi no Slow Life~ - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2016/10/6119Xyh2LoL.jpg",
	"noveltype": "(JP)",
	"genre": "Adventure   Comedy   Fantasy   Mystery   Romance   Shounen   Supernatural   ",
	"tags": "Adapted to Manga   Adventurers   Alchemy   Bookworm   Brother Complex   Chuunibyou   Clingy Lover   Cowardly Protagonist   Crafting   Curious Protagonist   Cute Children   Dolls/Puppets   Elemental Magic   Elves   Emotionally Weak Protagonist   Fast Learner   Genius Protagonist   Gods   Indecisive Protagonist   Inferiority Complex   Lack of Common Sense   Love Triangles   Magic   Male Protagonist   Manipulative Characters   Marriage   Misunderstandings   Multiple Reincarnated Individuals   Naive Protagonist   Nobles   Otaku   Overpowered Protagonist   Possession   Pregnancy   Prophecies   Psychopaths   Puppeteers   Reincarnated in Another World   Reincarnation   Religions   Shota   Spear Wielder   Tribal Society   Underestimated Protagonist   World Tree   Yandere   Younger Sisters   ",
	"rating": "(3.3 / 5.0, 176 votes)",
	"author": "Nekoko   猫子   ",
	"year": "\n2016",
	"ranking": "#2836   #2000   #991   #1154   #870   ",
	"reviewcount": "20 Reviews sorted by",
	"description": "I, who should have died after being hit by a car, was born again in another world.\r\n\r\nHowever, I was born in a shady minor family that used magic and controlled wooden puppets called the Marren Clan.\r\n\r\nPossessing a strong interest in magic since my previous life, I spend my time zealously studying magic to the point where even the people in the vicinity draw back.\r\n\r\nOne day, I heard I was to be married to my little sister when I turned 16 in accordance with the traditions of the Marren Clan and decided to flee to the city.\r\n\r\nFor now, since I have the strongest magic, I guess I should idle around making only enough money so that I don’t have to work for my whole life.>"
}