{
	"url": "https://www.novelupdates.com/series/unfathomable-doomsday/",
	"title": "Unfathomable Doomsday - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/08/ud.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Mystery   Psychological   Sci-fi   Tragedy   Xuanhuan   ",
	"tags": "Apocalypse   Artifacts   Blood Manipulation   Bloodlines   Calm Protagonist   Cautious Protagonist   Cheats   Clever Protagonist   Confident Protagonist   Corruption   Cruel Characters   Cultivation   Cunning Protagonist   Dark   Death of Loved Ones   Demons   Determined Protagonist   Evil Protagonist   Evolution   Fanfiction   Firearms   Futuristic Setting   Game Elements   Hard-Working Protagonist   Human Experimentation   Humanoid Protagonist   Hunters   Magic   Male Protagonist   Modern Day   Monsters   Mutated Creatures   Parody   Religions   Revenge   Ruthless Protagonist   Special Abilities   Survival   Vampires   Wars   Weak to Strong   World Travel   Zombies   ",
	"rating": "(3.8 / 5.0, 92 votes)",
	"author": "姐姐的新娘   ",
	"year": "\n2014",
	"ranking": "#6970   #2000   #3377   #11077   #4597   ",
	"reviewcount": "11 Reviews sorted by",
	"description": "First, this isn’t a story about how to seek survival during Doomsday! It’s rather about how to bring about the end of of times, to bring down the curtain on the world. It’s about how to set off a Zombie frenzy, how to lead the Devil into invasion, and how to guide the descent of Zerg! In this game of doom, I’m the source of everything!\r\n\r\nSecond, I need to thank those brethren who accompanied me until now. My thanks go to the Lich Monarch, Arthas Menethil (game: World of Warcraft), bringer of endless winter and death; to Alex Mercer (game: Prototype), who created life by consuming viruses; to the Worst Spirit Tokisaki Kurumi (Light Novel: Date a Live), controller of time; to the Magus Ascendant Xerath (Game: League of Legends), imprisoned by runes.\r\n\r\nLadies and Gentlemen, lets bring about a carnival of doom!>"
}