{
	"url": "https://www.novelupdates.com/series/when-an-alien-is-bound-to-a-world-saving-system/",
	"title": "When an Alien Is Bound to a World-Saving System - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/07/alien.png",
	"noveltype": "(CN)",
	"genre": "Action   Comedy   Romance   Sci-fi   Yaoi   ",
	"tags": "Aliens   Apocalypse   Artificial Intelligence   Fearless Protagonist   Futuristic Setting   Human-Nonhuman Relationship   Love Interest Falls in Love First   Power Couple   Protagonist Strong from the Start   Saving the World   Special Abilities   Strong Love Interests   System Administrator   Transformation Ability   World Hopping   Zombies   ",
	"rating": "(4.3 / 5.0, 115 votes)",
	"author": "暖暖的茶   ",
	"year": "\n2018",
	"ranking": "#2917   #2367   #2236   #4038   #1825   ",
	"reviewcount": "17 Reviews sorted by",
	"description": "After the last alien in the world was bound to a stupid but cute salvation system who mistakenly thought he was human:\n\nA resource depleted world:\n\nAlien: 'I can help reduce their population down to 5% in a short period of time. This way, this planet can develop sustainably.”\n\nSystem 2d14 was frightened to tears. [No, don’t! Lord Host!]\n\n-\n\nA certain day:\n\nSystem 099 was shocked: [Lord Host, the record for your first mission was actually b-broken by a rookie!]\n\nBig boss Huo Li instantly raised an eyebrow with interest. “Oh? Who was it?”\n\nA certain alien happily thought that he was invincible amongst all carbon-based lifeforms! Until…… he came across a pervert with powerful psychic abilities!\n\nA startled alien: “Hey! Why can’t I control myself?!”\n\nExtremely powerful psychic ability user gong x ultimate evolution of carbon-based lifeforms shou\n\nLoyal dog with a very strong sense of responsibility gong x always pretending to be human black bellied shou\n\nIn the beginning, there was a love-hate relationship and mutual dissing. Later on, there was a pair of husbands joining hands to fight monsters~>"
}