{
	"url": "https://www.novelupdates.com/series/zhuolu/",
	"title": "Zhuolu - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/03/Deer-Crystal.jpeg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Comedy   Xianxia   Yaoi   ",
	"tags": "Age Progression   Ancient China   Blood Manipulation   Cultivation   Death   Death of Loved Ones   Demonic Cultivation Technique   Devoted Love Interests   First Love   Ghosts   Handsome Male Lead   Hated Protagonist   H*ndjob   Kidnappings   Long Separations   Misunderstandings   Monsters   Multiple Reincarnated Individuals   Murders   Mysterious Past   Nobles   Politics   Power Couple   Power Struggle   Proactive Protagonist   Protagonist Falls in Love First   Reincarnation   Revenge   Royalty   Ruthless Protagonist   Second Chance   Secrets   Shameless Protagonist   Soul Power   Time Skip   Tragic Past   Twins   Wars   ",
	"rating": "(4.3 / 5.0, 84 votes)",
	"author": "Lu Ye Qian He   绿野千鹤   ",
	"year": "\n2017",
	"ranking": "#2000   #6203   #4383   #4186   #3464   ",
	"reviewcount": "4 Reviews sorted by",
	"description": "Ancient texts in cinders; the Dao unexpectedly collapsed; when deer crystal appeared, the world flourished, and all vied for it.\r\n\r\nTen thousand withered bones; the emperor’s orders; be deserving of imperial favour, and bear the monarch’s sentiments; it’s fate.\r\n\r\nLin Xin served as the imperial household’s butcher knife for an entire lifetime. Vicious and merciless, he never regretted it. The only thing he felt remorse over was that he never attained Shen Lou’s heart before he died. Reborn, he decides that he’ll pretend to be obedient and coax Shen Lou into being his.\r\n\r\nShen Lou was the paragon of the world his entire lifetime. Ascetic, never breaking the rules, his only improper act was liking that devil Lin Xin. Reborn, he decides to disregard the world, and get Lin Xin to marry him early.\r\n\r\nCruel and ruthless melodramatic shou x smiling but not speaking, scheming gong.>"
}