{
	"url": "https://www.novelupdates.com/series/eh-everyone-cant-use-ancient-magic-%ef%bd%9ea-fallen-noble-who-was-judged-to-have-zero-magic-power-will-be-peerless-in-the-school-life-with-the-strongest-magic%ef%bd%9e/",
	"title": "Eh, Everyone Can’t Use Ancient Magic!!??? ～A Fallen Noble Who Was Judged To Have Zero Magic Power Will Be Peerless In The School Life With The Strongest Magic～ - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/01/Eh-Everyone-Cant-Use-Ancient-Magic-A-Fallen-Noble-Who-Was-Judged-To-Have-Zero-Magic-Power-Will-Be-Peerless-In-The-School-Life-With-The-Strongest-Magic.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Comedy   Fantasy   School Life   ",
	"tags": "Academy   Aristocracy   Average-looking Protagonist   Calm Protagonist   Demon Lord   Demons   Fantasy World   Magic   Male Protagonist   Sword And Magic   Weak to Strong   ",
	"rating": "(3.6 / 5.0, 8 votes)",
	"author": "Mikado Tetsurou   三門鉄狼   ",
	"year": "\n2020",
	"ranking": "#2000   #2000   #9847   #3031   #9242   ",
	"reviewcount": "1 Review sorted by",
	"description": "Rent Farrant discovered a magic book in his home library when he was a child.\r\n\r\nThe book was left behind by his ancestor, the legendary great magician, and it contained all kinds of information about magic. Rent read the book and continued his magic training, and became proficient in all kinds of magic.\r\n\r\nEventually, Rent grew up and came to the Magic Academy in the royal capital. He took the entrance exam, but the value that came out when measuring his magic power was,\r\n\r\n「Zero magic power.」\r\n\r\nWithout understanding why, Rent was admitted to the lowest class, Class C. The students there are all failures.\r\n\r\nSarah, even though she comes from a prestigious knight’s family, she was dropped into Class C because of her rebellious attitude towards the examiner.\r\n\r\nDiene, from a merchant family, was forced to enroll because she was told to look for a noble husband to make connections.\r\n\r\nMuno, from an orphanage, he can’t read and write letters.\r\n\r\nWhile taking classes with them, the principal of the Magic Academy notices Rent's talent.\r\n\r\n「The reason you were considered to have zero magic power was the measurement tool’s fault. Your magic power can’t be measured by modern magic. What you are using is the lost ancient magic.」\r\n\r\nRent, who is the last user of ancient magic, was dropped into the lowest class, Class C, but he decided to teach magic to his classmates.\r\n\r\nHis classmates are considered failures by the standards of modern magic, but for Rent, they have plenty of room to grow.\r\nIn order to get to Class A with all of his classmates, Rent begins his struggle.>"
}