{
	"url": "https://www.novelupdates.com/series/trapped-in-a-webnovel-as-a-good-for-nothing/",
	"title": "Trapped in a Webnovel as a Good-For-Nothing - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/01/Trapped-in-a-Webnovel-as-a-GoodForNothing.jpg",
	"noveltype": "(KR)",
	"genre": "Action   Adventure   Fantasy   Supernatural   ",
	"tags": "Ability Steal   Adapted to Manhwa   Aggressive Characters   Alchemy   Animal Characteristics   Businessmen   Calm Protagonist   Caring Protagonist   Cautious Protagonist   Character Growth   Clever Protagonist   Cunning Protagonist   Demon Lord   Demons   Determined Protagonist   Dungeons   Evil Organizations   Eye Powers   Family Conflict   Famous Parents   Famous Protagonist   Fantasy World   Friendship   Game Elements   Game Ranking System   Goblins   Gunfighters   Handsome Male Lead   Hard-Working Protagonist   Healers   Leadership   Level System   Loyal Subordinates   Lucky Protagonist   Magic   Male Protagonist   Misunderstandings   Modern Day   Personality Changes   Reincarnated in Another World   Sadistic Characters   Siblings   Skill Assimilation   Spear Wielder   Transformation Ability   Transmigration   Transported to Another World   Weak to Strong   Wealthy Characters   ",
	"rating": "(4.1 / 5.0, 94 votes)",
	"author": "So YooHyun   소유현   ",
	"year": "\nN/A",
	"ranking": "#2000   #6195   #3267   #2108   #1828   ",
	"reviewcount": "17 Reviews",
	"description": "While working overtime through several nights, he fell asleep for a short while. When he woke up, he seemed to be possessing the villain of the webnovel he was reading.\r\n\r\n'Well, how typically cliché... to the point where I'd end up dead if I were to follow the predetermined fate. Darn it.'\r\n\r\nHe need to find a way to survive.\r\n\r\nThe first way to survive as a good-for-nothing villain in the webnovel.\r\n'Convince as many people as possible to be on my side.'\r\n\r\nThe second way to survive as a good-for-nothing villain in the webnovel.\r\n'Become strong enough to protect myself.'\r\n\r\nLastly, the third way to survive as a good-for-nothing villain in the webnovel.\r\n'Never become friendly with that proud and insane 'Returnee Master'.'\r\n\r\nBut what should he do?\r\nEven before he possessed the body, the original owner already caused an incident.\r\n\r\n'Use your money to kill the 'Returnee Master' who has yet to regain his power? Are you crazy? Then who will stop the Demon King?'\r\n\r\nThis is the beginning of the modern-day survival + dungeon-raider fantasy story of Choi YuSeong, the possessed villain who wants to live a laid-back lifestyle!>"
}