{
	"url": "https://www.novelupdates.com/series/after-i-became-an-omega-i-caressed-the-campus-hunks-dragon-tail/",
	"title": "After I Became an Omega, I Caressed the Campus Hunk’s Dragon Tail - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/07/After-I-Became-an-Omega-I-Caressed-the-Campus-Hunks-Dragon-Tail_1626377114.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Fantasy   Romance   School Life   Supernatural   Yaoi   ",
	"tags": "Abandoned Children   Amnesia   Animal Characteristics   Bullying   Calm Protagonist   Child Abuse   Clingy Lover   Cold Protagonist   Complex Family Relationships   Contracts   Destiny   Doting Love Interests   Dragons   Handsome Male Lead   Jealousy   Love Interest Falls in Love First   Male Yandere   Modern Day   Multiple Transported Individuals   Obsessive Love   Omegaverse   Past Plays a Big Role   Pets   Possessive Characters   Second Chance   Shapeshifters   Smart Couple   Strong Love Interests   Transformation Ability   Transmigration   Tsundere   ",
	"rating": "(3.7 / 5.0, 143 votes)",
	"author": "Di Yu   狄与   ",
	"year": "\n2020",
	"ranking": "#1515   #3296   #2634   #757   #2592   ",
	"reviewcount": "20 Reviews",
	"description": "Shi Yu has a secret – he is a dragon’s mate from the other world. He builds nests, collects gold coins, and dreams of meeting dragons. As a result, Shi Yu became the newest white moonlight after his differentiation into Omega.\n\nBeing confessed for N+1 days, he refused people, saying, “I only like dragons.”\n\nPassing by, was the most beautiful male on campus. Jiang’s footsteps lurched.\n\nJiang ChengLi has a secret – he is an ice dragon. As the flower of the high mountain, the entire school’s little omegas dream of being marked by him. Jiang ChengLi has never been attracted to any Omega pheromones until he had a charming dream after hitching a ride with a newly differentiated Omega.\n\nIn the dream, the Omega kissed his dragon horns, rubbed his dragon belly, and held his slimy dragon tail!\n\nLater, Jiang ChengLi’s pheromones went out of control, he turned into a small dragon cub and was picked up by the Omega in his dream! Shi Yu picked up an ice dragon cub. Snow white body, round belly, super-soft tail. He put the dragon cub into his pocket then kissed the little horn, rubbed the belly and tail before going to bed.\n\nLater, the ice dragon cub turned into Jiang ChengLi, his tail winding around his feet, “Let me bite you, I’ll give you all of my tail.”\n\nOne sentence introduction: Do not touch the tail of the dragon!>"
}