{
	"url": "https://www.novelupdates.com/series/reincarnated-vampire-princess-and-former-hero-trample-over-mankind/",
	"title": "Reincarnated Vampire Princess and Former Hero, Trample Over Mankind - Novel Updates",
	"image": "https://www.novelupdates.com/img/noimagefound.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Fantasy   Shoujo Ai   Tragedy   Yuri   ",
	"tags": "Army   Child Protagonist   Conditional Power   Dark   Death   Death of Loved Ones   Demon Lord   Demons   Depictions of Cruelty   Dwarfs   Elves   Enemies Become Allies   Enemies Become Lovers   Evil Gods   Gods   Human-Nonhuman Relationship   Level System   Multiple POV   Multiple Reincarnated Individuals   Non-humanoid Protagonist   Power Couple   Reincarnated in Another World   Reincarnation   Resurrection   Revenge   Romantic Subplot   Ruthless Protagonist   Strong Love Interests   Teamwork   Vampires   Wars   Weak to Strong   ",
	"rating": "(4.3 / 5.0, 58 votes)",
	"author": "Hiro Hayami   早海ヒロ   ",
	"year": "\n2020",
	"ranking": "#209   #288   #3049   #274   #5325   ",
	"reviewcount": "6 Reviews",
	"description": "Senjo Yona, a girl who was severely bullied and eventually killed in a gas explosion.\n\nAfter her death, she is reborn as『Lean Bloodlord』, the daughter of a vampire chieftain, through the power of the evil god Isuzu.\n\nThere, a peaceful and harmonious life awaits her that is incomparable to her previous life. Surrounded by her loving parents, she made friends and lived a life of smooth sailing.\n\n―――But that time suddenly comes to an end because of humans who, for unreasonable reasons, want to eradicate the vampire race.\n\n「Ah, I see. My life is ruined because there are humans.」\n\nOn the other hand, there is a girl who has been treated as a nuisance in a certain village.\n\nShe has the qualities of a『Hero』and has tremendous talent and potential for the future, but her mind has been broken by humans, she has been brainwashed, and she is being used as a living weapon.\n\n「In truth… I don’t want to protect people. I don’t want to be a hero.」\n\nEventually, they met, two people with an intense hatred for humans. And they become a disaster for humans.\n\nThis is the story of two girls whose lives were ruined by humans and who once lost everything but their lives, and how they now use every means at their disposal to destroy humans and take revenge.>"
}