{
	"url": "https://www.novelupdates.com/series/when-the-villainess-became-the-male-leads-obsession/",
	"title": "When the Villainess Became the Male Lead’s Obsession - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/11/When-the-Villainess-Became-the-Male-Leads-Obsession_1638253653.jpg",
	"noveltype": "(KR)",
	"genre": "Fantasy   Romance   ",
	"tags": "Beautiful Female Lead   European Ambience   Female Protagonist   Love Interest Falls in Love First   Obsessive Love   Possessive Characters   Transmigration   Villainess Noble Girls   ",
	"rating": "(3.9 / 5.0, 34 votes)",
	"author": "Soda Sshi   소다씨   ",
	"year": "\n2021",
	"ranking": "#2000   #2000   #7344   #4564   #5003   ",
	"reviewcount": "1 Review sorted by",
	"description": "I possessed a villainess character, the female protagonist’s elder sister, who harassed the main characters. I wouldn’t bother them because I didn’t want to die in the male protagonist’s hand like in the original story.\n\nI tried my best to connect the two, but…\n\n“Do you… Do you hate me because I was a bad kid?”\nThe male protagonist was acting weird.\n\nLater on, I tried to send him to the wizard tower as it was written in the original story, but for some reason, he tried so hard not to go even if he had to die.\n\nI ended up saying what I shouldn’t have said to make him go.\n“What’s the benefit of having you by my side?”\n\n“I will listen to you from now on. I won’t whine. I won’t come to find you even if I miss you. I will just wait for you. So… So please….”\n\n“I don’t need you.”\nTo him who begged, I answered coldly enough that I would never be there. You’ll forget everything about me anyway.\n\nA few years later, the male protagonist, whom I thought had forgotten me, came to me without forgetting my existence. Not for my sister, who was the original female protagonist, but for me.\n\n“How can I forget you?”\n\nI wanted to ask him back. How come you still remember me?\n\n“It’s a pity that your father died before I could prove my worth.”\n\n“You don’t have to prove anything. You, You don’t have to do that…”\n\n“If you say that I don’t have to do it anymore now…”\nHe grabbed my chin as he lowered himself.\n“It would be difficult for me. Elysia.”\n\nIt would be difficult for me as well if you continue to be like this…>"
}