{
	"url": "https://www.novelupdates.com/series/arrogant-consort-adored-by-war-prince/",
	"title": "Arrogant Consort Adored By War Prince - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/07/Arrogant-Consort-Adored-By-War-Prince.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Drama   Fantasy   Josei   Martial Arts   Romance   ",
	"tags": "Adapted to Manhua   Adopted Children   Ancient China   Army   Army Building   Arranged Marriage   Arrogant Characters   Beautiful Female Lead   Black Belly   Broken Engagement   Calm Protagonist   Character Growth   Charismatic Protagonist   Clever Protagonist   Cold Love Interests   Complex Family Relationships   Confident Protagonist   Cunning Protagonist   Cute Children   Devoted Love Interests   Doting Love Interests   Eidetic Memory   Engagement   Family   Fearless Protagonist   Female Protagonist   Generals   Handsome Male Lead   Hiding True Identity   Kingdom Building   Kingdoms   Long Separations   Love Interest Falls in Love First   Loyal Subordinates   Marriage   Military   Modern Knowledge   Multiple POV   Older Love Interests   Persistent Love Interests   Politics   Popular Love Interests   Power Couple   Pregnancy   Previous Life Talent   Protagonist Strong from the Start   Royalty   Ruthless Protagonist   Schemes And Conspiracies   Sharp-tongued Characters   Smart Couple   Strategist   Strong Love Interests   Strong to Stronger   Transmigration   Wars   ",
	"rating": "(2.6 / 5.0, 8 votes)",
	"author": "凉音小荷   ",
	"year": "\n2018",
	"ranking": "#2000   #2000   #10525   #9320   #10026   ",
	"reviewcount": "1 Review sorted by",
	"description": "She was a secret agent that had transmigrated from the 21st century, the “Living Queen of Hell” Zisu. She could defeat her scheming bit*h of a stepmother, pretend to be a pitiful white lotus, and play around with playboys. It was just that her personality was slightly cold and overbearing!\n\nShe was played by fate, after her engagement was called off, she was forced to marry the “War Ghost” by an imperial order?\n\nRumors say that the “War Ghost” was a man who was in control of the military force and had such a high status that even the emperor feared him. However, he was a cold-blooded, bloodthirsty and cruel person who was ruthless in killing others. He was almost 20 years old but not a family dared to marry their daughters to him!\n\nNever would they have imagined that… even heroes have a weakness for the charms of a beautiful woman. When the War Ghost meets the Living Queen of Hell, he becomes wrapped around her little finger, willingly being henpecked by her!\n\nRumors say that the Seventh Prince adored his wife dearly, as long as the Seventh Prince Consort wishes to obtain this world, he would dominate this world without hesitation and present it to her with both hands! As long as the Seventh Prince Consort was happy, he was willing to do anything…\n\n“Are you really willing to do anything?” Yu Zisu smiled playfully.\n\n“Of course, Su’er, don’t play with fire.” Ye Xiuming replied in a deep hoarse voice.\n\n“I want that man I saw… Mmm… Ye Xiuming, you bast*rd…”\n\n“That isn’t included!”>"
}