{
	"url": "https://www.novelupdates.com/series/bye-bye/",
	"title": "Bye-Bye - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/08/ByeBye.jpg",
	"noveltype": "(KR)",
	"genre": "Drama   Mature   Psychological   Romance   Slice of Life   Smut   Yaoi   ",
	"tags": "Adapted to Manhwa   Business Management   Businessmen   Character Growth   Charismatic Protagonist   Childcare   Clingy Lover   Cold Love Interests   Complex Family Relationships   Couple Growth   Cute Protagonist   Death of Loved Ones   Depression   Different Social Status   Doting Love Interests   Family Conflict   Handsome Male Lead   Inferiority Complex   Love Interest Falls in Love First   Modern Day   Mpreg   Mysterious Past   Obsessive Love   Older Love Interests   Omegaverse   Past Plays a Big Role   Past Trauma   Possessive Characters   Suicides   Unreliable Narrator   Weak to Strong   Wealthy Characters   ",
	"rating": "(4.4 / 5.0, 117 votes)",
	"author": "Sorim   소림   ",
	"year": "\n2018",
	"ranking": "#590   #1047   #3796   #2546   #3099   ",
	"reviewcount": "23 Reviews sorted by",
	"description": "“I was in a one-sided love.”\n\nOn a rainy night, Seo-yu was standing on the Mapo Bridge to die.\n\nUnlicensed high school student Sung-hyun, who was passing by, was surprised to see him and causes an accident.\n\nSung-hyun proposes a deal to Seo-yu, saying that his brother is going to kill him.\n\n“You, I will give you money, so please help me tell my brother.”\n\nSeo-yu decides to receive 3 million won and lies to Sung-hyun's older brother, Sung-hoon.\n\nBut Sung-hoon, who is familiar with Sung-hyun's personality, doesn't believe it.\n\n“How much did you get?”\n\n“….”\n\n“I'm asking you how much he paid you.”\n\n“Ahaha. You really don't trust people. I didn’t take it.”\n\nSung-hoon seems to believe only when Seo-yu shows his determination.\n\nHe finally received 3 million won on the day the work was completed.\n\nHe secretly contacted Sung-hyun first and told him the promised price, but the person changed and Sung-hoon appeared instead of Sung-hyun.\n\n“It’s been a while, Seo-yu-ssi.”\n\nWhy is his older brother here?\n\nWill Seo-yu be able to overcome this crisis well?>"
}