{
	"url": "https://www.novelupdates.com/series/i-couldnt-tell-you-who-it-was/",
	"title": "I Couldn’t Tell You Who It Was - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/12/I-Couldnt-Tell-You-Who-It-Was.jpg",
	"noveltype": "(KR)",
	"genre": "Drama   Horror   Mature   Mystery   Psychological   Romance   Smut   Supernatural   Yaoi   ",
	"tags": "Adapted to Manhwa   Appearance Changes   Average-looking Protagonist   Celebrities   Child Abuse   Death of Loved Ones   Depression   Ghosts   Goblins   Kind Love Interests   Male Yandere   Manipulative Characters   Modern Day   Murders   Mystery Solving   Obsessive Love   Persistent Love Interests   R-18   R*pe   Seeing Things Other Humans Can't   Singers   Spirits   Suicides   Thriller   Younger Love Interests   ",
	"rating": "(4.1 / 5.0, 38 votes)",
	"author": "시요   ",
	"year": "\n2016",
	"ranking": "#500   #389   #6211   #6620   #5392   ",
	"reviewcount": "9 Reviews sorted by",
	"description": "Inspired by the rumored house from the urban legends, the goal of the TV show is to find the “true exit” and escape the house in seven days. To film this, eight celebrity guests were gathered in this strange mansion on a deserted island.\r\n\r\nThe rumor was that you could only visit the mansion with 101 doors when you were at death’s doorstep. When I was seven years old, I met “that child” at that huge house. After I made a deal with the kid in my thoughtless sympathy, I was surrounded by death and black-eyed goblins. What was that child’s identity? I finally made a resolution when the one I loved, Yeonseon, died—I needed to meet that kid, and…\r\n\r\nBut perhaps my wishful thinking was wrong. The death of one of the guests, the actress Goyeon Lee, awakened the malice in the mansion and the seeds of doubt sprouted amidst the people seized in fear and horror…\r\n\r\n“I came to pick you up. I made you wait, didn’t I? Open the door for me.”\r\n\r\nA well-made holding pen. There was no escape from this cage.\r\n\r\n“I told you that you wouldn’t be able to forget me.”\r\n>"
}