{
	"url": "https://www.novelupdates.com/series/kumo-desu-ga-nani-ka/",
	"title": "Kumo Desu ga, Nani ka? - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/03/Kumo-Desu-ga-Nani-ka.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Comedy   Drama   Fantasy   Mystery   Seinen   Tragedy   ",
	"tags": "Adapted to Anime   Adapted to Drama CD   Adapted to Manga   Antihero Protagonist   Cannibalism   Carefree Protagonist   Cheats   Clever Protagonist   Cute Protagonist   Demon Lord   Dragons   Dungeons   Elves   Evil Gods   Evolution   Eye Powers   Fantasy World   Female Protagonist   Game Elements   God Protagonist   Gods   Grinding   Heroes   Humanoid Protagonist   Interconnected Storylines   Introverted Protagonist   Level System   Loner Protagonist   Lost Civilizations   Magic   Manipulative Characters   Monsters   Multiple POV   Multiple Reincarnated Individuals   Non-humanoid Protagonist   Non-linear Storytelling   Overpowered Protagonist   Personality Changes   Proactive Protagonist   R-15   Reincarnated as a Monster   Reincarnated in Another World   Reincarnation   Returning from Another World   Schemes And Conspiracies   Seven Deadly Sins   Seven Virtues   Skill Assimilation   Skill Creation   Survival   System Administrator   Transmigration   Unreliable Narrator   Vampires   Wars   Weak to Strong   Yandere   ",
	"rating": "(4.5 / 5.0, 1795 votes)",
	"author": "Baba Okina   ",
	"year": "\n2015\r\n",
	"ranking": "#898   #1208   #51   #246   #7   ",
	"reviewcount": "204 Reviews",
	"description": "The world where the Hero and the Demon King continue to oppose each other. The grand magic from the Hero and the Demon King cross over worlds and exploded in the classroom of a certain high school.\n\nThe students who died in the explosion will be reincarnated in a different world. The protagonist, who had the lowest reputation in the class, was reincarnated into a spider. Nevertheless, she adapted quickly to the present condition with strong willpower.\n\nThis is a story of she who has become a spider trying whatever she can to live.>"
}