{
	"url": "https://www.novelupdates.com/series/underdog-versus-boss/",
	"title": "Underdog Versus Boss - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2016/02/underdog-versus-boss.jpg",
	"noveltype": "(CN)",
	"genre": "Drama   Josei   Romance   Slice of Life   ",
	"tags": "Affair   Betrayal   Cousins   Family Business   Family Conflict   Female Protagonist   Modern Day   Poor Protagonist   Revenge   Sentimental Protagonist   Ugly to Beautiful   Unlucky Protagonist   Wealthy Characters   ",
	"rating": "(4.0 / 5.0, 42 votes)",
	"author": "Xi Meng   夕梦   ",
	"year": "\n2012",
	"ranking": "#6970   #2000   #8158   #8665   #8222   ",
	"reviewcount": "4 Reviews sorted by",
	"description": "Feng Kai Ze and Da Tian Ting are childhood rivals.\r\n\r\nFeng Kai Ze is the love child of a ruthless tycoon. He resents his father for his mother’s death. When his father forces him to leave his mother’s hometown, he steals Da Tian Ting’s diary.\r\n\r\nDa Tian Ting resents her mother for abandoning her and her father to marry her mother’s first love.\r\n\r\nUnbeknownst to Da Tian Ting, her father’s friend betrays him by stealing her father’s invention. She believes her inheritance is from her father’s life savings.\r\n\r\nDa Tian Ting loves her father. She agrees to marry her father’s friend’s son.\r\n\r\nOn the eve of Da Tian Ting’s wedding day, her fiance cheats on her. She cancels the wedding and breaks off the engagement.\r\n\r\nWhen Da Tian Ting hits rock bottom she reunites with Feng Kai Ze. She doesn’t recognise the adult Feng Kai Ze. She thinks he is a handsome pauper and plans to recruit him as her wedding date to her ex-fiance’s wedding.\r\n\r\nFeng Kai Ze recognises his childhood rival Da Tian Ting. Initially Feng Kai Ze wants to use Da Tian Ting to defy his father’s order for him to marry the daughter of a businessman who is blackmailing his father.\r\n\r\nFeng Kai Ze and Da Tian Ting join forces to take revenge on the people who hurt their mother and father respectively. Blind by revenge, Feng Kai Ze and Da Tian Ting can’t see cupid’s arrow targeting their hearts.>"
}