{
	"url": "https://www.novelupdates.com/series/i-trick-even-the-lames-to-stand-up-for-me/",
	"title": "I Trick Even the Lames to Stand Up for Me - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/03/itt.jpg",
	"noveltype": "(CN)",
	"genre": "Adventure   Comedy   Horror   Romance   Shounen Ai   Supernatural   ",
	"tags": "Carefree Protagonist   Celebrities   Clever Protagonist   College/University   Confident Protagonist   Contracts   Crime   Death   Detectives   Divination   Doting Love Interests   Exorcism   Familial Love   Family   Famous Protagonist   Feng Shui   Friendship   Ghosts   Handsome Male Lead   Heartwarming   Love Interest Falls in Love First   Modern Day   Murders   Mystery Solving   Overpowered Protagonist   Overprotective Siblings   Past Plays a Big Role   Power Couple   Previous Life Talent   Protagonist Strong from the Start   Reincarnation   Romantic Subplot   Second Chance   Selfless Protagonist   Shameless Protagonist   Slow Romance   Special Abilities   Spirits   ",
	"rating": "(4.6 / 5.0, 136 votes)",
	"author": "Hēi Māo Nì Nì   黑猫睨睨   ",
	"year": "\n2019",
	"ranking": "#6970   #4074   #2645   #4118   #1697   ",
	"reviewcount": "27 Reviews sorted by",
	"description": "The third young master of the Gu household, Gu Ye, had a wooden personality, a stuttering speech, couldn’t remember an answer after being told ten times, didn’t dare to protest after being bullied, was considered the shame of high society. His father, in a fit of anger, sent him back to the old home in the country for the new year. But unexpectedly, he came back like a new person, in half a year testing into the top university of the capital with the highest score in the whole school. \n\nThe entire high society circle was shocked! \n\nAfter receiving his acceptance letter, the Gu family searched for Gu Ye for three days, and finally found him under an unassuming overpass. The Gu Ye who used to remain silent after being beaten had laid out a stall, stepping on a few hoodlums beneath his foot, and was selling drawings while he called out: “Exorcism Wards! Guanyin safety talismans! Wards against evil for the house! Anti-goblin and demon talismans! ……Supersale on wards and talismans! If you have the right karma, 88 per ward! Don’t pass this by!” \n\nHe looked down beneath his foot, saying with a grin: “I have special Give Up Wickedness Talismans, I think you each need three.”\n\nSassing heaven, earth, and air, if you don’t obey then let’s fight and don’t blather, supernatural arts grandmaster bottom. Polished scoundrel, beast in human clothing, wife-spoiling maniac, black-bellied top.>"
}