{
	"url": "https://www.novelupdates.com/series/city-lady-killer/",
	"title": "City Lady-Killer - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/03/CityLadyKiller12.jpg",
	"noveltype": "(CN)",
	"genre": "Adult   Comedy   Harem   Martial Arts   Psychological   Romance   ",
	"tags": "An*l   Adultery   BDSM   Blackmail   Boss-Subordinate Relationship   Business Management   Calm Protagonist   Carefree Protagonist   Charismatic Protagonist   Childhood Love   Clever Protagonist   Complex Family Relationships   Confident Protagonist   Doctors   Doting Love Interests   Early Romance   Enemies Become Lovers   Flashbacks   F*llatio   Glasses-wearing Love Interests   Handsome Male Lead   Harem-seeking Protagonist   Hidden Abilities   Incest   Kind Love Interests   Love at First Sight   Lovers Reunited   Male Protagonist   M*sturbation   Mature Protagonist   Modern Day   Netori   Obsessive Love   Office Romance   Older Love Interests   Or*y   Paizuri   Perverted Protagonist   Polygamy   Power Struggle   Pregnancy   Priestesses   Proactive Protagonist   Protagonist Falls in Love First   Protagonist Strong from the Start   Psychic Powers   R*pe Victim Becomes Lover   Revenge   R*pe   Ruthless Protagonist   Schemes And Conspiracies   Seduction   Shy Characters   Special Abilities   Student-Teacher Relationship   Threesome   Toys   Younger Love Interests   ",
	"rating": "(3.6 / 5.0, 73 votes)",
	"author": "wtw1974   ",
	"year": "\nN/A",
	"ranking": "#2000   #6382   #5810   #5750   #7402   ",
	"reviewcount": "6 Reviews sorted by",
	"description": "Lin Tianlong, 19 years old, a polytechnic school graduate. With mastery and control over electrical energy, he displays his unparalleled sagely medical skills, accepting the hearts of beauties on the side. Starting by helping his sister-in-law's small clinic which was on the brink of closing down rise from the dead, he then proceeds to bring prosperity to a private hospital previously in a business slump. Socializing among the officials from the sectors of politics, commerce, law, literature, education, and health in Flame City, he's drawn into the power struggle between the officials. Businesswomen, doctors, and nurses, attractive policewomen, teachers, pretty loli girls, charming married women, mature beauties - all of them fall to his clutches as he establishes his business empire and a harem of beautiful women.>"
}