{
	"url": "https://www.novelupdates.com/series/because-there-were-100-goddesses-in-charge-of-reincarnation-i-received-100-cheat-skills/",
	"title": "Because There Were 100 Goddesses in Charge of Reincarnation, I Received 100 Cheat Skills - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2017/09/DKDswekUEAEBt0S.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Comedy   Ecchi   Fantasy   Harem   Romance   Shounen   ",
	"tags": "Adapted to Manga   Aristocracy   Beastkin   Cheats   Demi-Humans   Dragons   Dungeons   Dwarfs   Elves   Fantasy World   Goddesses   Harem-seeking Protagonist   Human-Nonhuman Relationship   Kingdoms   Lack of Common Sense   Level System   Loli   Male Protagonist   Monsters   Overpowered Protagonist   Parody   Perverted Protagonist   Protagonist Strong from the Start   R-15   Reincarnation   Royalty   Special Abilities   Strong to Stronger   Sword And Magic   Tsundere   ",
	"rating": "(3.4 / 5.0, 363 votes)",
	"author": "Kuzu Shichio   九頭七尾   ",
	"year": "\n2016",
	"ranking": "#4617   #4760   #376   #1857   #396   ",
	"reviewcount": "40 Reviews sorted by",
	"description": "Karuna longs to be reincarnated in a different world. After his death in a traffic accident, a goddess in charge of reincarnation has appeared before him.\r\n\r\n「Nice to meet you, Karuna-san. I’m goddess Ashia」\r\n\r\nDifferent world reincarnation has come~!! Karuna dances in joy. I have received a cheat skill and I will now finally reincarnate in the different world I have always dreamed about――\r\n\r\n「You are Karuna, huh? I’m goddess Islina」\r\n\r\n――Is what should have happened, but another goddess has appeared!?\r\n\r\nKaruna received a cheat skill from her with his head tilted to the side, and this time, he will finally――\r\n\r\n「I’m goddess Vermis」\r\n\r\n――Wha, another goddess has……!\r\n\r\n「Haa, haa…… a, another one……!?」\r\n\r\nIn the end, Karuna met a total of 100 goddesses.\r\n\r\nBut, thanks to that, he has obtained 100 cheat skills.\r\n\r\n「With these 100 cheat skills――I will fully enjoy this different world!」>"
}