{
	"url": "https://www.novelupdates.com/series/i-didnt-mean-to-save-the-villain/",
	"title": "I Didn’t Mean to Save The Villain - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/11/I-Didnt-Mean-to-Save-The-Villain.jpg",
	"noveltype": "(KR)",
	"genre": "Fantasy   Romance   ",
	"tags": "Beautiful Female Lead   Curses   European Ambience   Female Protagonist   Glasses-wearing Love Interests   Handsome Male Lead   Love Interest Falls in Love First   Nobles   Obsessive Love   Reincarnated in Another World   Royalty   Wealthy Characters   ",
	"rating": "(3.6 / 5.0, 21 votes)",
	"author": "박깃털   ",
	"year": "\n2021",
	"ranking": "#6970   #2000   #8560   #7991   #6040   ",
	"reviewcount": "1 Review sorted by",
	"description": "‘Great work, reincarnation. Really.’\n\nIs this a reward for not experiencing even a single bit of love in my past life? I have possessed the body of a frail princess in an unrealistic romance-fantasy Korean novel.\n\nWho cares if I have no divine power?\nI was born with a diamond spoon!\nSince it has come to this, it’ll be bad if the original plot gets altered..\n\nTo maintain this peaceful life, I need to secretly help and foster the male and female lead’s slow-paced romance!\n\nWithout divine power I had to use others: I turned to the black knights to deal with the villains, help the male lead grow up without worries, stop the villainess’ destruction that will make the female lead cry, and block the villain’s hideous scheme!\n\nI have been living harmoniously.\n\n“It’s you again, Your Highness.”\n\n“Yeah, it is me again. Must’ve been a shame.”\n\nMy actions have been discovered by the villainous second male lead!\nBut…\n\n“…Are you going to meet with the Duke?”\n\n“Despite your wariness of me, if you keep frowning your beautiful forehead like that… I will be sad.”\n\n“…I thought I would be able to see Your Highness this way.”\n\nThe villain who is supposedly crazy about the female lead is obsessed with me?\nUh, what’s with that look?\nWhy… is your expression like that?>"
}