{
	"url": "https://www.novelupdates.com/series/trpg-player-aims-for-the-strongest-build-in-another-world-mr-henderson-preach-the-gospel/",
	"title": "TRPG Player Aims For The Strongest Build In Another World ~Mr. Henderson Preach the Gospel~ - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/05/TRPG-Player-Aims-For-The-Strongest-Build-In-Another-World-Mr-Henderson-Preach-the-Gospel.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Drama   Fantasy   Harem   Mature   Romance   Shounen   Slice of Life   ",
	"tags": "Accelerated Growth   Age Progression   Androgynous Characters   Beastkin   Beautiful Female Lead   Brother Complex   Charming Protagonist   Childhood Friends   Childhood Love   Cute Protagonist   Demi-Humans   Demons   Devoted Love Interests   Elves   Fairies   Handsome Male Lead   Human-Nonhuman Relationship   Loli   Love Interest Falls in Love First   Magic   Magic Beasts   Male Protagonist   Master-Servant Relationship   Polygamy   Possessive Characters   Reincarnation   Shota   Sword And Magic   Sword Wielder   Time Skip   Weak to Strong   Yandere   Younger Sisters   ",
	"rating": "(4.0 / 5.0, 33 votes)",
	"author": "Schuld   ",
	"year": "\nApril 25, 2020",
	"ranking": "#2000   #4860   #8575   #5506   #7940   ",
	"reviewcount": "2 Reviews sorted by",
	"description": "「Data Munchkin」- Oddballs who would merrily attempt killing god if the data showed it to be possible.\n\nErich, one of these Data Munchkins, a boy with past life, schemes to turn himself into an ideal broken character using his character build authority which he was blessed with on the occasion of being reincarnated into a different world.\n\nWhile hanging out with his aggressively seductive childhood friend and taking care of his brocon younger sister, Erich racks his brain as he analyzes data from head to toe, cleverly managing experience points trying to fumble his way onto a heinous broken combo build.\n\nBut sooner than he thinks the story(Session) begins to unfold as Erich throws himself into the fray fighting(rolls dice) to protect those who he holds dear!?…..\n\nCurtains rise on the adventures of data munchkin of Henderson scale plot derailment!>"
}