{
	"url": "https://www.novelupdates.com/series/invincible/",
	"title": "Invincible - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2017/05/wuditianxia.jpeg",
	"noveltype": "(CN)",
	"genre": "Action   Drama   Harem   Martial Arts   Xuanhuan   ",
	"tags": "Academy   Alchemy   Army Building   Arrogant Characters   Artifacts   Beast Companions   Beastkin   Beasts   Bloodlines   Body Tempering   Bodyguards   Confident Protagonist   Cultivation   Dao Comprehension   Demi-Humans   Demons   Doting Parents   Dragons   Dwarfs   Eidetic Memory   Elves   Familial Love   Family   Fast Cultivation   Fast Learner   First-time Interc**rse   Genius Protagonist   Handsome Male Lead   Heavenly Tribulation   Hiding True Abilities   Hiding True Identity   Hot-blooded Protagonist   Immortals   Inheritance   Insects   Kingdoms   Late Romance   Long Separations   Love Interest Falls in Love First   Loyal Subordinates   Lucky Protagonist   Magic Formations   Magical Space   Male Protagonist   Marriage   Martial Spirits   Master-Disciple Relationship   Master-Servant Relationship   Mind Control   Modern Day   Monster Tamer   Multiple Realms   Mythical Beasts   Older Love Interests   Overpowered Protagonist   Phoenixes   Pill Based Cultivation   Pill Concocting   Polygamy   Poor to Rich   Previous Life Talent   Puppeteers   Reincarnated in Another World   Reincarnation   Royalty   Ruthless Protagonist   Siblings   Sibling's Care   S*aves   Slow Romance   Soul Power   Souls   Strength-based Social Hierarchy   Strong to Stronger   Sudden Wealth   Sword Wielder   Time Skip   Transformation Ability   Underestimated Protagonist   Unique Cultivation Technique   Wealthy Characters   World Travel   Younger Brothers   Younger Love Interests   Younger Sisters   ",
	"rating": "(3.3 / 5.0, 661 votes)",
	"author": "Shen Jian   神见   ",
	"year": "\nN/A",
	"ranking": "#51   #63   #23   #77   #369   ",
	"reviewcount": "106 Reviews sorted by",
	"description": "The strong are lonesome. Overcoming the loneliness pushes you to stand invincible at the top. \n\nPro-disciple of the Shaolin Temple on Earth, Huang Xiaolong was reborn into a Martial Spirit world, carrying Hua Xia’s secret knowledge, the Body Metamorphose Scripture. In a Martial Spirit world, only those with Martial Spirit are able to train in battle qi and become a warrior. \n\nHuang Xiaolong - born with a heaven-defying rare Martial Spirit - was mistakenly taken for common variant Martial Spirit during the awakening ceremony conducted by the tribe and thus sidelined. However, Huang Xiaolong with his common “variant” Martial Spirit again, and again displayed unnatural talent, defeating geniuses, shocking the clan and the entire Martial Spirit World>"
}