{
	"url": "https://www.novelupdates.com/series/summon-survival/",
	"title": "Summon Survival - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/05/007DFXDhgy1g5sh7iverzj30go0ncaik.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Drama   Fantasy   Romance   Supernatural   Yuri   ",
	"tags": "Ability Steal   Aggressive Characters   Anti-social Protagonist   Apathetic Protagonist   Apocalypse   Beautiful Female Lead   Betrayal   Calm Protagonist   Character Growth   Cohabitation   Cold Protagonist   Conditional Power   Contracts   Cunning Protagonist   Devoted Love Interests   Fantasy Creatures   Female Protagonist   Firearms   First Love   Game Elements   Hard-Working Protagonist   Hiding True Abilities   Interdimensional Travel   Kind Love Interests   Level System   Love Interest Falls in Love First   Low-key Protagonist   Mercenaries   Older Love Interests   Persistent Love Interests   Popular Love Interests   Post-apocalyptic   Power Couple   Reincarnation   Revenge   Ruthless Protagonist   Saving the World   Second Chance   Selfish Protagonist   Slow Romance   Strong Love Interests   Summoning Magic   Survival   Underestimated Protagonist   Weak to Strong   Zombies   ",
	"rating": "(4.1 / 5.0, 58 votes)",
	"author": "L泗X汐Y   ",
	"year": "\n2019",
	"ranking": "#2000   #6201   #6043   #6964   #6144   ",
	"reviewcount": "6 Reviews sorted by",
	"description": "What happens to ordinary people when they face the end of the world? With no power, nothing but their good looks?\n\nOf course their fate it’s either life or death.\n\nXu Yang couldn’t remember how many years she had been a zombie. She wandered in the last days, self-conscious but unable to evolve.\n\nBeing a zombie didn’t bring her any change than when she was stil a human.\n\n——What is unfair?\n\nBut the world is never fair.\n\nWhen her head was cut off and the crystal nucleus in her head was removed, Xu Yang’s experience was clearly performed again in her mind, is this the rotating lantern? ——No.\n\nShe was reborn.\n\nShe is going to survive.\n\nXu Yang: Lu Huixue that Mother…\n\nLu Huixue: ??? I’m really not a Mother!>"
}