{
	"url": "https://www.novelupdates.com/series/the-school-bully-wrote-a-fanfiction-about-me-and-him/",
	"title": "The School Bully Wrote A Fanfiction About Me And Him - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/04/The-School-Bully-Wrote-A-Fanfiction-About-Me-And-Him_1651342406.jpg",
	"noveltype": "",
	"genre": "Romance   School Life   Yaoi   ",
	"tags": "Cold Protagonist   Handsome Male Lead   ",
	"rating": "(4.1 / 5.0, 14 votes)",
	"author": "碎碎面   ",
	"year": "\n2021",
	"ranking": "#6970   #6165   #12545   #11527   #11076   ",
	"reviewcount": "No Reviews",
	"description": "Jiang An had never passed any of his writing assignments before. Following his teacher’s advice, he overcame his shyness to borrow an assignment from Jin Sheng to read.\n\nAs an academic, Jin Sheng was very approachable and even lent him a copy of his own work.\n\nAs Jiang An read , he saw his own name inside.\n\nThe two overlapping figures on the floor-to-ceiling window ……\n\nJiang An: He buried his face in his pillow all night, calling out intermittently, “Jin Sheng …… Jin Sheng ……”\n\nJin Sheng’s enthusiasm was probably out of Jiang An’s expectations.\n\nNot only did Jin Sheng lend him his essay, but he also invited Jiang An to write a review. This was followed by a request for Jiang An to let him a look. The reason Jin Sheng cited was that he wanted to help Jiang An improve his writing skills.\n\nJiang An was in a pinch. Reluctantly, he took out a piece of paper. It was incredibly crumpled from all his rubbing and seemed close to tearing. “Does…Does that include this passage as well?”\n\nLater, Jin Sheng became Jiang An’s first friend, and then his first boyfriend.\n\n“Jiang An” became Jin Sheng’s first pen name and the first reader of all his works.\n\nJin Sheng felt that the best thing he’d done in this life was to place his trust in Jiang An and show him his short essays.\n\nIn the future, if someone asked him about this, he would proudly declare: I wooed my wife by writing short essays!\n\nCold on the outside, enthusiastic on the inside writes-fanfic-for-himself gong x straightforward, clingy shou>"
}