{
	"url": "https://www.novelupdates.com/series/after-the-breakup-i-became-the-marshals-wife/",
	"title": "After The Breakup, I Became The Marshal’s Wife - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/02/After-the-breakup-I-became-the-marshals-wife.png",
	"noveltype": "(CN)",
	"genre": "Comedy   Drama   Mecha   Romance   Sci-fi   Shounen Ai   Supernatural   ",
	"tags": "Arrogant Characters   Beast Companions   Bickering Couple   Calm Protagonist   Charming Protagonist   Clever Protagonist   Cold Love Interests   Comedic Undertone   Confident Protagonist   Doting Love Interests   Dragons   Famous Protagonist   Fearless Protagonist   Futuristic Setting   Gamers   Genius Protagonist   Handsome Male Lead   Lazy Protagonist   Love Interest Falls in Love First   Medical Knowledge   Military   Money Grubber   Narcissistic Protagonist   Overpowered Protagonist   Pharmacist   Phoenixes   Popular Love Interests   Power Couple   Protagonist Strong from the Start   Ruthless Protagonist   Schemes And Conspiracies   Sharp-tongued Characters   Slow Romance   Strong Love Interests   Strong to Stronger   Transmigration   Wealthy Characters   ",
	"rating": "(4.1 / 5.0, 106 votes)",
	"author": "竹亦心   ",
	"year": "\n2021",
	"ranking": "#2318   #1748   #3126   #471   #3910   ",
	"reviewcount": "18 Reviews sorted by",
	"description": "\n\n\nLu Bo Ting was facing a mental collapse crisis because of his high mental strength, and only one person's quantum beast could help him. So he spent money to hire them just to prolong his life.\n\nTransmigrating to the scene of a breakup, the little phoenix Shi Nian kicked the scumbag and, without saying a word, turned around and got into Marshal Lu's flying vehicle.\n\nThe two sides soon agreed that the quantum beast was indeed very effective, and Shi Nian was quite professional, although a little arrogant. He dutifully said 'boss,' but he dared to make the boss eat his leftovers.\n\nBy this point, Marshal Lu's heart was moved.\n\nHe looked at the clause on the contract saying the employer must not have feelings for the employee, and wished to travel back in time, to wake himself up at that time.\n\nLooking at what Shi Nian was doing at the time, he just sent the scumbag and the vicious stepmother to prison. He went on Star Network and he opened a vest saying that he was a fan.\n\nBlack fans: You only know how to study hair lengthening and beauty potions all day long. Why not make some potions for social use? Look at your fan. He is obviously also a guide, but he can beat up sentinels.\n\nAt that time, he immediately came out and praised the black powder, and also praised his vest number, as if he was not praising himself at all.\n\nUntil later, the vest fell off, and the black fans were dumbfounded.\n\nFans were happy: What is this? A fan of yourself? Shi Nian is still Shi Nian. He plays too much.\n\n>"
}