{
	"url": "https://www.novelupdates.com/series/im-a-d-rank-adventurer-for-some-reason-i-got-recruited-into-a-hero-party-and-now-the-princess-is-stalking-me/",
	"title": "I’m a D-Rank Adventurer, for Some Reason I Got Recruited Into a Hero Party, and Now the Princess Is Stalking Me - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/11/36l1kdyuce6tl91l1r6c8z5lf43u_1d7h_yf_1ck_155zt.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Comedy   Fantasy   Harem   Martial Arts   Romance   Shounen   ",
	"tags": "Adapted to Manga   Adventurers   Beautiful Female Lead   Demon Lord   Demons   Dense Protagonist   Heroes   Lazy Protagonist   Male Protagonist   Misunderstandings   Obsessive Love   Overpowered Protagonist   Poor Protagonist   Protagonist Strong from the Start   Royalty   Secretive Protagonist   Seven Deadly Sins   Stalkers   Sword And Magic   Yandere   ",
	"rating": "(3.6 / 5.0, 58 votes)",
	"author": "Shiroao Toraneko   白青虎猫   ",
	"year": "\n2019",
	"ranking": "#2002   #1752   #2989   #3253   #3232   ",
	"reviewcount": "4 Reviews sorted by",
	"description": "Jirei, the protagonist, thinks that if he becomes a hero and defeats the Demon King in order to become the king, he can spend his days in laziness.\r\n\r\nTo be chosen as a hero, he trained himself to become a hero, sometimes fighting higher-ranked monsters to the death. All for the sake of his future lazy life, Jirei nearly works himself to death in an effort to make it all happen.\r\n\r\nOne day while he was sitting at a café, he overheard a conversation and learned about the harshness of being a hero and how much money he can make. In addition, he learned that even if he became the king, he couldn’t spend a lazy time with paperwork and other things.\r\n\r\nHearing this, Jirei immediately quit the hard work and decided to build a small hut on the outskirts of the city and spend his time there.\r\n\r\nHe figured that a minimum amount of money was all that was needed, so he worked occasionally as a D-class adventurer despite his SSS-class abilities, and otherwise lived lazily in the hut.\r\n\r\nOne day when he was thinking, 「I wish this kind of life could go on forever,」 a hero girl named Letinore, who was chosen by the Holy Sword, visits Jirei. For some reason, she persistently invites Jirei to join her party. On top of that, the princess of the country also asks him to marry her.\r\n\r\nNaturally, Jirei refuses, but both the hero girl and the princess are unlikely to give up……!\r\n\r\n「I just want to spend my days in laziness.　Just leave me alone!」\r\n\r\nThis is a story about an overly strong protagonist who just wants a lazy life, who defeated the Four Demon Generals and has attracted the attention of the Demon King, after escaping to another country, princess of that country also asked him to marry her and almost made him the king.>"
}