{
	"url": "https://www.novelupdates.com/series/i-turned-into-a-little-white-face-after-i-returned-from-the-apocalypse/",
	"title": "I Turned Into a Little White Face After I Returned From the Apocalypse - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/03/ba79c7a6ly1ga6gsstyosj20u0160hb0.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Fantasy   Shounen Ai   Yaoi   ",
	"tags": "Apocalypse   Calm Protagonist   Carefree Protagonist   Doting Love Interests   Game Elements   Hiding True Abilities   Hiding True Identity   Lazy Protagonist   Love Interest Falls in Love First   Modern Day   Power Couple   Protagonist Strong from the Start   Ruthless Protagonist   Shameless Protagonist   Strong Love Interests   Survival Game   Transmigration   Transported to Another World   Underestimated Protagonist   Unlimited Flow   Virtual Reality   Zombies   ",
	"rating": "(4.0 / 5.0, 53 votes)",
	"author": "某片叶子   ",
	"year": "\nN/A",
	"ranking": "#2000   #2000   #4317   #5350   #3532   ",
	"reviewcount": "12 Reviews sorted by",
	"description": "Su An has been struggling in the last days for more than a decade, and a death as a hero after taking down the Zombie Emperor is quite good, thus Su An intends to close his eyes and rest in peace.\r\n\r\nRest in peace, my ass!\r\n\r\nOpening his eyes again, Su An found himself back before the apocalypse, and turned into a weak, cry baby pretty boy, the type with no skills or whatsoever other than the face.\r\n\r\nSu An just wants to smile!\r\n\r\nIts good to be a pretty boy. Its wonderful to be a pretty boy. Pretty boys can frankly be a salted fish who can only eat and drink!\r\n\r\nAnd then, Su An discovered that the world he found himself in is not strictly pre-apocalyptic, but it was also going through the last days.\r\n\r\n– – all living resources can only be obtained as a drop in a game with an apocalyptic setting.\r\n\r\nSu An looked at the game in front of him that needs mandatory participation of the whole population. With a face full of awe, he entered… and learned that the game has zombies.\r\n\r\n– – It’s you again! [Death Ray.jpg]\r\n\r\nAnd then… – –\r\n\r\n#NewbieReachedTheTopInOneNight#\r\n\r\n#TheManWhoTerrifiesTheDead#>"
}