{
	"url": "https://www.novelupdates.com/series/a-leisurely-trip-to-another-world-of-the-reincarnated-great-saint/",
	"title": "A Leisurely Trip to Another World of the Reincarnated Great Saint - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/11/A-leisurely-trip-to-another-world-of-the-Reincarnated-Great-Saint.jpg",
	"noveltype": "(JP)",
	"genre": "Comedy   Fantasy   Slice of Life   ",
	"tags": "Adapted to Manga   Beautiful Female Lead   Cheats   Child Protagonist   Cute Children   Cute Protagonist   Cute Story   Fantasy World   Female Protagonist   Friendship   Goddesses   Heartwarming   Lack of Common Sense   Lazy Protagonist   Magic   Overpowered Protagonist   Reincarnated in Another World   Reincarnation   Saints   ",
	"rating": "(4.0 / 5.0, 66 votes)",
	"author": "Yotsuba Yuto   四葉夕卜   ",
	"year": "\n2020",
	"ranking": "#3923   #2741   #4095   #2034   #6197   ",
	"reviewcount": "4 Reviews sorted by",
	"description": "Hirune Hanamaki, who works for a black company with almost zero sleep, reincarnated in a different world with the blessing of a goddess because of her pure heart. Thanks to the blessing, her amount of magic power is strangely large, and her holy magic is extremely versatile. Eh, no one uses it like this?\n\n“You have the talent of a saint.”\n\nHirune, who just wants to sleep on a fluffy futon, tries to skip work by making full use of holy magic, but the evaluation of the people around her continues to rise.\n\nThis means I’ll be working as hard as I did in my previous life. This is bad. Very bad. I’m also sleepy. Apparently, it is rumored that if you become a great saint, you’ll get your own church and you can live freely.\n\n“Become a great saint and hang out on a futon all day long.”\n\nShe works hard for a leisurely life and becomes a great saint … Isn’t this pretty busy? I feel like I’m being worshiped a lot … It shouldn’t be like this …\n\nThis is the story of a dozing great saint who became a legend as she enjoyed a slow life at her own pace.>"
}