{
	"url": "https://www.novelupdates.com/series/the-scum-villains-self-saving-system/",
	"title": "The Scum Villain’s Self-Saving System - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2017/05/94fdf170gw1el3m276qjtj205k07st8y.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adult   Comedy   Drama   Mature   Romance   Xuanhuan   Yaoi   ",
	"tags": "Adapted to Anime   Ancient Times   Arrogant Characters   Awkward Protagonist   Betrayal   Blood Manipulation   Bloodlines   Child Abuse   Clingy Lover   Confinement   Cultivation   Curses   Death   Demon Lord   Demons   Dense Protagonist   Devoted Love Interests   Dreams   Famous Protagonist   Fantasy World   First-time Interc**rse   Handsome Male Lead   Hiding True Identity   Interdimensional Travel   Kidnappings   Long Separations   Love Interest Falls in Love First   Magic Beasts   Male Yandere   Manipulative Characters   Marriage   Masochistic Characters   Master-Disciple Relationship   Misunderstandings   Multiple Transported Individuals   Murders   Mysterious Past   Mystery Solving   Obsessive Love   Past Plays a Big Role   Past Trauma   Persistent Love Interests   Popular Love Interests   Possessive Characters   Quirky Characters   Resurrection   Sealed Power   Stoic Characters   Straight Uke   Strong Love Interests   System Administrator   Time Skip   Torture   Transmigration   Transported to Another World   Tsundere   Younger Love Interests   ",
	"rating": "(4.4 / 5.0, 2328 votes)",
	"author": "Mò Xiāng Tóngxiù   墨香铜臭   ",
	"year": "\n2014",
	"ranking": "#936   #592   #267   #587   #21   ",
	"reviewcount": "401 Reviews sorted by",
	"description": "“Can’t I properly read stallion novels anymore!”\n\nShen Yuan transmigrated into someone who’d tormented the young male lead almost to death, the scum villain Shen Qingqiu.\n\nIt must be known, the original Shen Qingqiu ended up being carved alive by his disciple, Luo Binghe, into a human stick, a human stick!\n\nTen thousand “f*ck your moms” rampaged through Shen Qingqiu’s heart:\n\n“It’s not that I don’t want to cling to the male lead’s thighs, but who made him so f*cking black. The type who seeks thousand-fold retribution!”\n\nWhy have all the female lead’s scenes been forcibly given to him.\n\nWhy, as a scum villain, does he need to constantly sacrifice himself, blocking knife and gun for the protagonist!\n\nShen Qingqiu: “…I think I can still save him, one more time.”>"
}