{
	"url": "https://www.novelupdates.com/series/thousand-miles-of-bright-moonlight/",
	"title": "Thousand Miles of Bright Moonlight - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/03/Thousand-Miles-of-Bright-Moonlight.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Drama   Mature   Romance   ",
	"tags": "Ancient China   Arrogant Characters   Beautiful Female Lead   Brother Complex   Buddhism   Calm Protagonist   Caring Protagonist   Charismatic Protagonist   Charming Protagonist   Clever Protagonist   Cold Love Interests   Complex Family Relationships   Couple Growth   Cruel Characters   Determined Protagonist   Devoted Love Interests   Different Social Status   Doting Love Interests   Doting Older Siblings   Famous Protagonist   Female Protagonist   Handsome Male Lead   Kind Love Interests   Late Romance   Love Interest Falls in Love First   Older Love Interests   Overprotective Siblings   Past Plays a Big Role   Politics   Popular Love Interests   Power Couple   Power Struggle   Pragmatic Protagonist   Royalty   Schemes And Conspiracies   Siblings   Sickly Characters   Sister Complex   Smart Couple   Tragic Past   Transmigration   Unconditional Love   Underestimated Protagonist   Wars   ",
	"rating": "(4.7 / 5.0, 185 votes)",
	"author": "罗青梅   ",
	"year": "\n2020",
	"ranking": "#831   #613   #2096   #1476   #2161   ",
	"reviewcount": "57 Reviews sorted by",
	"description": "Yaoying transmigrated into a novel.\n\nIn the chaotic and troubled times, many nations were at war. Her father happened to be the most powerful of those vying for supremacy, her brother turning out to be the male lead that finally dominated the Central Plains.\n\nAs the male lead’s younger sister, Yaoying was ready to accept this benefit that came without her having to lift a finger.\n\nBut it turned out that the male lead hated her to the bone, going as far as to have her marry the sixty-year-old grassland tribal chief in place of the female lead.\n\nYaoying was forced to marry. Wolves in front, tigers in the back and beasts surrounding her, all coveting the lovely-as-a-flower Chinese princess.\n\nAt the moment of crisis, passing through with his troops was the novel’s young and legendary lord who was destined to die young.\n\nShivering, Yaoying pointed at the sickly lord in order to escape from their clutches: This princess fell in love with you at first sight. If you won’t marry, I’ll seek you out with a dowry!\n\nThe lord’s subordinates turned pale with alarm: Princess mustn’t speak so casually! Our king is a monk, a noble-blooded Buddha’s son!\n\nYaoying, with a face full of grievances: This princess doesn’t disdain that you’re a monk. In life, I am your person; in death, I am your ghost!\n\nMonk: ….\n\nFrom then on, the tale of the Buddha’s son and the  Chinese princess began to circulate through the grasslands.\n\nMonk whose reputation couldn’t be cleared even if he plunged into the Yellow River: ….\n\n(Note: The title refers to an expression that for friends, family, and lovers separated far away, moonlit nights would make them miss each other more.)>"
}