{
	"url": "https://www.novelupdates.com/series/a-cruel-beasts-leash/",
	"title": "A Cruel Beast’s Leash - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/11/A-Cruel-Beasts-Leash.jpeg",
	"noveltype": "(KR)",
	"genre": "Adult   Drama   Fantasy   Mystery   Romance   Smut   ",
	"tags": "Absent Parents   Abusive Characters   Beautiful Female Lead   Betrayal   Character Growth   Cold Love Interests   Curses   Death of Loved Ones   Determined Protagonist   Devoted Love Interests   Emotionally Weak Protagonist   European Ambience   Female Protagonist   Handsome Male Lead   Magic   Male Yandere   Mysterious Family Background   Naive Protagonist   Nobles   Obsessive Love   Prison   R-18   Royalty   Secret Identity   Timid Protagonist   Trap   ",
	"rating": "(3.7 / 5.0, 41 votes)",
	"author": "Triple Berry   트리플베리   ",
	"year": "\n2021",
	"ranking": "#877   #1435   #4295   #2892   #3815   ",
	"reviewcount": "7 Reviews sorted by",
	"description": "After being betrayed by a butler and her nanny, whom she’d trusted wholeheartedly, Emma wandered down a forest trail on a stormy night to avoid them and the lurking animals.\n\nShe stumbled upon a magnificent mansion and bravely knocked on the large wooden door of the mysterious, secretive place. After a few minutes, a man opened the door.\n\n“Hello. I am Emma. Emma Herman,” she said shakily and then begged, “Please! Save me, please! I will do anything.” Emma’s life was about to be flipped upside down.\n\n“Hello, Emma. Has something happened to you?” he asked. The man she had thought to be the owner of the mansion, was Irvin Van Wert, the successor of Count Van Wert. “Don’t run away from me without my permission. Because you belong to me now!”\n\n***\n\n“So, you don’t have anything to do with the people I mentioned, right?”\n\n“Right,” Emma nodded rapidly, expecting the misunderstanding and suspicion to be resolved.\n\n“I see. So this isn’t a trap,” the man oddly mumbled as he stared at Emma and slowly bent his body down lower. Then, he put his lips closer to her ear and said, “If so, you’re just coming by perchance then?”\n\nThe low voice, while fascinating, was frightening enough to hurt Emma’s eardrum and she meekly replied, “Yes.”>"
}