{
	"url": "https://www.novelupdates.com/series/summoned-slaughterer/",
	"title": "Summoned Slaughterer - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2017/03/ss_cover_5.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Fantasy   Martial Arts   Mature   Psychological   Romance   Shounen   ",
	"tags": "Adapted to Manga   Aristocracy   Arrogant Characters   Average-looking Protagonist   Beastkin   Beautiful Female Lead   Betrayal   Calm Protagonist   Clever Protagonist   Cunning Protagonist   Dark   Demi-Humans   Demons   Determined Protagonist   Different Social Status   Dwarfs   Elemental Magic   Elves   Enemies Become Allies   Enemies Become Lovers   Evil Protagonist   Fantasy Creatures   Fantasy World   Fearless Protagonist   God-human Relationship   Gods   Kingdom Building   Kingdoms   Knights   Love Interest Falls in Love First   Magic Beasts   Magical Space   Male Protagonist   Marriage   Monsters   Nobles   Obsessive Love   Overpowered Protagonist   Politics   Power Struggle   Protagonist Strong from the Start   R-15   Royalty   Ruthless Protagonist   Samurai   Schemes And Conspiracies   S*aves   Strong Love Interests   Strong to Stronger   Summoning Magic   Sword And Magic   Sword Wielder   Transported to Another World   Underestimated Protagonist   Unique Weapon User   Unique Weapons   Wars   Yandere   ",
	"rating": "(3.5 / 5.0, 610 votes)",
	"author": "Ido Masayoshi   井戸正善   ",
	"year": "\n2014",
	"ranking": "#2000   #2000   #584   #2070   #182   ",
	"reviewcount": "72 Reviews sorted by",
	"description": "Tohno Hifumi was summoned to another world to be a Hero for a kingdom. Unknown to the summoners, he’s a person who had restrained his killer instincts with martial arts. Upon arrival, he slaughtered various knights and the mastermind of the event, the King, for kidnapping him to this world. Afraid of letting more people get killed by Hifumi, the Princess--who is the only one to managed to keep her sanity act rationally--let him go free. Thus started Hifumi's fun life of traveling the world, and unrestrainedly killing any who attempt to get in his way.>"
}