{
	"url": "https://www.novelupdates.com/series/my-husband-is-suffering-from-a-terminal-illness/",
	"title": "My Husband is Suffering from a Terminal Illness - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/10/hti1.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Drama   Romance   Shounen Ai   Supernatural   ",
	"tags": "Acting   Arranged Marriage   Bickering Couple   Business Management   Calm Protagonist   Charismatic Protagonist   Charming Protagonist   Clever Protagonist   Cold Love Interests   Complex Family Relationships   Determined Protagonist   Devoted Love Interests   Doting Love Interests   Enemies Become Allies   Family   Family Conflict   Famous Protagonist   Handsome Male Lead   Hidden Abilities   Marriage   Modern Day   Music   Older Love Interests   Overpowered Protagonist   Possessive Characters   Power Couple   Previous Life Talent   Proactive Protagonist   Protagonist Strong from the Start   Schemes And Conspiracies   Shameless Protagonist   Sharp-tongued Characters   Showbiz   Sickly Characters   Singers   Slow Romance   Smart Couple   Special Abilities   System Administrator   Terminal Illness   Transmigration   Tsundere   Unconditional Love   Wealthy Characters   ",
	"rating": "(4.7 / 5.0, 1157 votes)",
	"author": "Bu Hui Xia Qi   Can’t Play Chess   不会下棋   ",
	"year": "\n2019",
	"ranking": "#261   #202   #316   #93   #159   ",
	"reviewcount": "280 Reviews",
	"description": "Xie Yang struggled in the post-apocalyptic world for many years until he was too tired to go on. Then he transmigrated into a young adult entertainment circle novel where the protagonists have easy, sweet, and satisfying lives.\n\nThe male protagonist of the novel is not just handsome and smart, he's also reborn. The female protagonist of the novel is not only beautiful and works hard towards her dreams, she also has a cheat in her hands. \n\nThere's a lot of male and female supporting roles, each having pretty face, nice figures and someone strong behind them. Get into any one of their bodies, and he could close his eyes and just enjoy life. But he didn't. Instead he transmigrated into a young idol secretly married to the biggest villain of all — the male protagonist's maternal uncle.\n\nHis title is husband but it's more like a nurse. Because this novel's biggest villain is a terminally ill patient who is gloomy and sick in the head (actually sick). Their marriage was to counter the bad luck (illness).\n\nXie Yang: Who cares if you're the male lead, female lead, male supporting, female supporting, villain or protagonist. Get in the way of my comfortable life and you'll die (:\n\nAlso titled: [Daily life of husbands trading blows] - [If you love me, let's divorce] - [Crazy gong: I'll never divorce]>"
}