{
	"url": "https://www.novelupdates.com/series/honey-im-going-on-a-strike/",
	"title": "Honey, I’m Going On a Strike - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/12/Honey-Im-Going-On-a-Strike.jpeg",
	"noveltype": "(KR)",
	"genre": "Fantasy   Romance   Shoujo   ",
	"tags": "Adapted to Manhwa   Aristocracy   Arranged Marriage   Arrogant Characters   Beautiful Female Lead   Calm Protagonist   Caring Protagonist   Character Growth   Charismatic Protagonist   Clever Protagonist   Clingy Lover   Clumsy Love Interests   Cold Love Interests   Couple Growth   Devoted Love Interests   Doting Love Interests   Doting Parents   European Ambience   Famous Protagonist   Female Protagonist   First Love   Handsome Male Lead   Hard-Working Protagonist   Kind Love Interests   Love Interest Falls in Love First   Misunderstandings   Monsters   Nobles   Popular Love Interests   Possessive Characters   Proactive Protagonist   Protagonist Strong from the Start   Reincarnation   Second Chance   Shy Characters   Strong Love Interests   Weak to Strong   Wealthy Characters   ",
	"rating": "(3.9 / 5.0, 12 votes)",
	"author": "Ko Eun Chae   고은채   ",
	"year": "\n2018",
	"ranking": "#2000   #2000   #12619   #11528   #9985   ",
	"reviewcount": "No Reviews",
	"description": "Cassia Ruberno, Countess of the Simone Empire, marries Zester Greze, a commoner war hero, at the order of emperor.\r\n\r\nAfter living for 10 years with no love or money, he dies of incurable disease. No, I only thought that he was dead.\r\nAt the same time as his death, Cassia returns to the first day she met him, 10 years ago.\r\n\r\nHowever, I don’t want to repeat the same life as before, so I declared a “strike.”\r\n\r\nCassia, who was blunt and knew nothing but war, was determined to live on her own without being discouraged.\r\n\r\nStrangely, Zester in this life continues to try to get into Cassia’s heart.\r\n\r\nCassia, who didn’t hate Zester’s efforts and changes at the same time, said, “I think that maybe I can manage change it in this life.”>"
}