{
	"url": "https://www.novelupdates.com/series/after-becoming-a-spare-tire-i-was-targeted-by-the-villain-and-the-male-lead-at-the-same-time/",
	"title": "After Becoming a Spare Tire, I Was Targeted by the Villain and the Male Lead at the Same Time - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/09/After-Becoming-a-Spare-Tire-I-Was-Targeted-by-the-Villain-and-the-Male-Lead-at-the-Same-Time.jpeg",
	"noveltype": "(CN)",
	"genre": "Comedy   Romance   Yaoi   ",
	"tags": "Bickering Couple   Businessmen   Enemies Become Lovers   Farming   Handsome Male Lead   Love Interest Falls in Love First   Male Yandere   Possessive Characters   Slow Romance   System Administrator   Transmigration   Wealthy Characters   ",
	"rating": "(4.1 / 5.0, 89 votes)",
	"author": "易叶子   ",
	"year": "\n2018",
	"ranking": "#857   #384   #3888   #254   #2982   ",
	"reviewcount": "11 Reviews sorted by",
	"description": "Xu Chenghao accidentally transmigrated in a book and became the lifetime spare tire of the Mary Sue female lead.\n\nWhat’s more frustrating, he transmigrated at the time when the spare tire and the villain confronted each other and it’s a fight right away.\n\nWhat’s even more frustrating, according to the plot, after the spare tire saves the female lead from the villain, she’ll throw herself into the arms of the male lead, and wail in the next second.\n\nWhen the time comes, he is abandoned by the female lead, the male is wary of the villain and hates him. He will die very miserably.\n\nXu Chenghao: “… Come, come, come, please take away your female lead!”\n\nFemale lead: “??? Say you love me for the rest of your life and never let me go?”\n\nXu Chenghao: “I’m sorry, I like men.”\n\nFemale lead: “…”\n\nOne month later，\n\nThe villain and the male lead rushed to his field at the same time and asked, “I heard that you like men?”\n\nXu Chenghao: “…”\n\nHe looked at the two men in front of him and said, “I’m sorry, I only have farming in my heart.”\n\nThe two: “…”>"
}