{
	"url": "https://www.novelupdates.com/series/im-the-villainous-guildmaster-of-an-adventurers-guild-i-just-banish-useless-people-to-the-right-places-but-for-some-reason-theyre-really-grateful-to-me-what-you-want-to-come-back-to-the-gu/",
	"title": "I’m the Villainous Guildmaster of an Adventurer’s Guild – I Just Banish Useless People to the Right Places, but for Some Reason They’re Really Grateful to Me “What? You Want To Come Back to the Guild Now? You’re Not Ready Yet, You Can Do Your Best There.” - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/08/Im-the-Villainous-Guildmaster-of-an-Adventurers-Guild-I-Just-Banish-Useless-People-to-the-Right-Places-but-for-Some-Reason-They.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Comedy   Fantasy   ",
	"tags": "Beautiful Female Lead   Eye Powers   Guilds   Male Protagonist   Master-Servant Relationship   Misunderstandings   Protagonist Strong from the Start   ",
	"rating": "(3.2 / 5.0, 27 votes)",
	"author": "Ibarakino   茨木野   ",
	"year": "\n2020",
	"ranking": "#2000   #2000   #7352   #2600   #7409   ",
	"reviewcount": "No Reviews",
	"description": "The protagonist, Act, has a talent for detecting and nurturing the hidden talents of others.\r\n\r\nHowever, he is banished by an ignorant guild master who does not realize this.\r\n\r\nA few years later, Act created his own guild, 'The Gem of Heavenly Gift,' and became the guild master.\r\n\r\nHe banishes the members of the guild one after the other.\r\n\r\nHe expelled one guild member after another, saying, 'Blacksmithing skills are unnecessary in the Adventurer's Guild. Get out. I've prepared a post for you as the deputy head of the Blacksmith's Guild, so you can do your best there.'\r\n\r\n'Thank you very much!　I'll never forget this favor!'\r\n\r\n(I'll never forget this favor?)\r\n\r\n(Why is he thanking me?) [The Gem of Heavenly Gift] was a guild that gathered weak people who had been unreasonably banished without realizing their hidden talents.\r\n\r\nAct had nurtured them and prepared suitable workplaces for them once they were no longer weak, and then banished them.\r\n\r\nHowever, those who had left were still trying to come back, saying that Act's guild was better than their new jobs.\r\n\r\n'You want to come back now?　It's too early to tell. You can still make it there.'\r\n\r\nSometimes Act encourages former guild members, and sometimes he punishes the asshole bosses who interfere with their new lives.\r\n\r\nAct's guild, which helps the weak and provides excellent aftercare, grows even larger.>"
}