{
	"url": "https://www.novelupdates.com/series/a-real-man-isnt-afraid-of-a-little-demon/",
	"title": "A Real Man Isn’t Afraid of a Little Demon - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/11/A-Real-Man-Isnt-Afraid-of-a-Little-Demon.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Comedy   Mystery   Romance   Shounen Ai   ",
	"tags": "Bodyguards   Bullying   Child Abuse   Childcare   Cold Protagonist   Crime   Criminals   Cute Children   Drugs   Guardian Relationship   Heartwarming   Hiding True Identity   Modern Day   Modern Knowledge   Organized Crime   Orphans   Police   Protagonist Strong from the Start   Slow Romance   Strong Love Interests   Tragic Past   Transmigration   Transported to Another World   ",
	"rating": "(4.1 / 5.0, 89 votes)",
	"author": "Little Baldy   秃子小贰   ",
	"year": "\n2021",
	"ranking": "#5262   #6195   #4309   #1948   #5082   ",
	"reviewcount": "24 Reviews sorted by",
	"description": "Yu Chu was a powerful character in a novel who constantly stirred up trouble, but after transmigrating, he turned from a little demon that kept the masses under his spell into a pitiful little thing that everyone bullied.\n\nDrugging, power struggles, fratricidal rivalries… Yu Chu resolved everything one by one. He snickered and prepared to recuperate in this peaceful world. As for those noisy “flies” that disturbed him, they were slapped to death by his hand.\n\nLooking at those foolish “flies”, Yu Chu did not have the slightest ups and downs inside and slowly extended his hand of fate to the “flies” necks…\n\nSlap!\n\nThe hand of fate was heavily slapped away.\n\n“What are you staring at people for? It’s just that you didn’t get the last two custard buns. Do you still want to kill and rob them for the buns?” Xie XingMu, with his serious handsome face, lectured him coldly.\n\nYu Chu was very dissatisfied with this mysterious pseudo-‘former personal bodyguard’.\n\nEven though Xie XingMu was tall, handsome, and rich, and had saved him many times from life and death; even though this man, as a former bodyguard, gave him food, shelter, and money when he, a young man, was living on the street, he was not pleased.\n\nXie XingMu controlled him to death in all aspects, not only checked his whereabouts at any time, but also installed a tracker on his cell phone, and was always buzzing around like an old mother.\n\nYu Chu was living with this oppressive wife and touched the back of his hand, which was slapped red. He was fierce in his heart: Sooner or later, I will kill this biggest “fly” by holding it down.\n\nLater, he was held down, indeed, held down.\n\nHe cried and was pressed beneath Xie XingMu and almost killed.>"
}