{
	"url": "https://www.novelupdates.com/series/lonely-attack-on-the-different-world/",
	"title": "Lonely Attack on the Different World (WN) - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2018/08/Lonely-Attack-on-the-Different-World.jpeg",
	"noveltype": "(JP)",
	"genre": "Action   Adult   Adventure   Comedy   Fantasy   Harem   Romance   Shounen   ",
	"tags": "Adapted to Manga   Adventurers   Average-looking Protagonist   Beastkin   Beautiful Female Lead   Bookworm   Calm Protagonist   Carefree Protagonist   Cheats   Clever Protagonist   Cooking   Demi-Humans   Demon Lord   Demons   Dense Protagonist   Determined Protagonist   Dungeons   Elves   Fantasy World   First-time Interc**rse   Forgetful Protagonist   Friendship   Game Elements   Genius Protagonist   Hard-Working Protagonist   Heroes   Inferiority Complex   Jobless Class   Kind Love Interests   Lack of Common Sense   Level System   Loner Protagonist   Love Interest Falls in Love First   Magic   Magic Beasts   Male Protagonist   Money Grubber   Monster Girls   Multiple POV   Multiple Transported Individuals   Older Love Interests   Overpowered Protagonist   Polygamy   Quirky Characters   R-18   Strong Love Interests   Sword And Magic   Tentacles   Transported to Another World   Unique Weapon User   Unreliable Narrator   Weak to Strong   Younger Love Interests   ",
	"rating": "(3.7 / 5.0, 267 votes)",
	"author": "Goji Shoji   五示正司   ",
	"year": "\n2016",
	"ranking": "#1563   #1518   #537   #2491   #636   ",
	"reviewcount": "33 Reviews sorted by",
	"description": "The strongest doesn’t need cheats.\r\n\r\nHaruka, a high schooler who spends his life as a “loner,” is suddenly summoned to another world with his classmates.\r\n\r\nNoticing the god in front of him, Haruka was going to get cheat abilities by picking what he wanted from the skill list so that he could live in the other world――or so he thought, but the skills were first come, first serve.\r\n\r\nAll the cheat skills were taken by my classmates?!\r\n\r\nAfter not being able to get any amazing skills, Haruka’s “loner” skill made him unable to join any parties. Even in another world, he’ll adventure in solitude.\r\n\r\nHaruka, recognizing the crisis of his classmates, decided to secretly help them out while not relying on cheats. He’ll surpass cheats as he walks the path of the strongest――.\r\n\r\nLet the curtains raise for the tale about the strongest loner’s attack on the different world!>"
}