{
	"url": "https://www.novelupdates.com/series/elf-tensei-kara-no-cheat-kenkoku-ki/",
	"title": "Elf Tensei Kara no Cheat Kenkoku-ki - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2016/09/elf_cover4-1.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Comedy   Drama   Ecchi   Fantasy   Harem   Mature   Romance   Shounen   ",
	"tags": "Adapted to Manga   Age Progression   Beastkin   Beautiful Female Lead   Calm Protagonist   Character Growth   Cheats   Childhood Friends   Childhood Love   Cooking   Crafting   Demon Lord   Depictions of Cruelty   Domestic Affairs   Dragons   Dwarfs   Elves   Fantasy World   First-time Interc**rse   Game Elements   Genius Protagonist   Handsome Male Lead   Healers   Hidden Abilities   Humanoid Protagonist   Kind Love Interests   Kingdom Building   Kingdoms   Male Protagonist   Manipulative Characters   Military   Mysterious Past   Nobles   Nudity   Obsessive Love   Overpowered Protagonist   Past Plays a Big Role   Personality Changes   Polygamy   Reincarnated in Another World   Reincarnation   Ruthless Protagonist   Secret Identity   S*aves   Souls   Special Abilities   Strong Love Interests   Sword And Magic   Technological Gap   Wars   Weak to Strong   ",
	"rating": "(3.7 / 5.0, 304 votes)",
	"author": "Tsukiyo Rui   月夜　涙（るい）   ",
	"year": "\n2008",
	"ranking": "#4265   #4717   #971   #3088   #241   ",
	"reviewcount": "22 Reviews sorted by",
	"description": "A genius magician, to fight against his fate to die a natural death from old age, grasped at the truth of magic to allow himself to reincarnate with a power he created himself. The cycle of reincarnation is repeated multiple times and in his 31st reincarnation, the magician became a boy named Syril who lives in a village of elves. However, that village is ruled by Humans, and the Elves are treated as livestock. After becoming 14 years old, Syril, who regained his past knowledge and experience, stands up to help a girl, who is his childhood friend. The story of the creation of an ideal country begins in that one village, a place where all races can coexist. Elves, Fox-girl, and various other Heroines.>"
}