{
	"url": "https://www.novelupdates.com/series/i-dont-want-to-become-a-villainess-so-i-aim-at-becoming-a-perfect-lady-together-with-the-prince/",
	"title": "I Don’t Want to Become a Villainess, So I Aim at Becoming a Perfect Lady Together with the Prince! - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/03/al-and-lily-cover-1-official.jpg",
	"noveltype": "(JP)",
	"genre": "Comedy   Drama   Fantasy   Romance   Shoujo   Slice of Life   ",
	"tags": "Adapted to Manga   Aristocracy   Arranged Marriage   Beautiful Female Lead   Black Belly   Character Growth   Couple Growth   Cute Story   Dense Protagonist   Determined Protagonist   Devoted Love Interests   Doting Love Interests   Early Romance   Engagement   Episodic   Familial Love   Fantasy World   Female Protagonist   Friendship   Handsome Male Lead   Hard-Working Protagonist   Heartwarming   Honest Protagonist   Love at First Sight   Magic   Master-Servant Relationship   Multiple POV   Nobles   Otome Game   Personality Changes   Possessive Characters   Proactive Protagonist   Quirky Characters   Reincarnation   Royalty   Servants   Siblings   Villainess Noble Girls   ",
	"rating": "(4.0 / 5.0, 215 votes)",
	"author": "Tsukigami Saki   月神サキ   ",
	"year": "\n2018",
	"ranking": "#3923   #3591   #895   #3697   #528   ",
	"reviewcount": "42 Reviews sorted by",
	"description": "I'm a villainess... it seems!? No, no, I'm not such a bad woman-!!\n\nLiz Beltran is an arrogant, selfish young woman, and a villainous one at that.\n\nWhen Liz arrives for her formal marriage meeting with the first prince, Alan, she is shocked to hear his younger brother's voice speaking to him.\n\nWhat do you mean, 'villainess'? I'm not such a lousy woman!\n\nShe is shocked and teary-eyed, but her marriage partner, Alan, tells her: 'I'll be your fiancé and help you out so you don't end up becoming a villainess.'.\n\nShe struggles to understand incomprehensible words such as 'target' and 'game world', but, at the same time, she is thrilled by the too-sweet guidance of the beautiful Prince Alan as she strives to get back at the prince's brother!\n\nWith the help of the prince who is 'apparently' about to break off their engagement, Liz strives to become a perfect lady in this unique romantic comedy about a villainous lady!>"
}