{
	"url": "https://www.novelupdates.com/series/cthulhu-gonfalon/",
	"title": "Cthulhu Gonfalon - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2017/07/Cthulhu-Gonfalon.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Fantasy   Martial Arts   Mature   Supernatural   Xuanhuan   ",
	"tags": "Adapted to Manhua   Adventurers   Artifacts   Cultivation   Curses   Death   Demi-Humans   Demons   Dragons   Dungeons   Dwarfs   Elves   Evil Gods   Evil Religions   Fantasy Creatures   God Protagonist   Goddesses   Godly Powers   Gods   Human-Nonhuman Relationship   Kingdom Building   Knights   Loyal Subordinates   Magic   Male Protagonist   Merchants   Monsters   Mythical Beasts   Non-humanoid Protagonist   Orcs   Overpowered Protagonist   Religions   Spirits   Transformation Ability   Transported to Another World   Wars   Weak to Strong   ",
	"rating": "(3.2 / 5.0, 176 votes)",
	"author": "White   楚白   ",
	"year": "\n2015",
	"ranking": "#2000   #2000   #1828   #11527   #3304   ",
	"reviewcount": "23 Reviews sorted by",
	"description": "Cthulhu Gonfalon is a story about a man who woke up in another world. After a drink over his loss in a game, Sui Xiong ended up in the middle of the sea. Surprisingly, he now found out he no longer existed in a human shape but in a spirit state without any flesh. In order to survive and find a way to return to Earth, he then searched for a body to accommodate his spirit. After several confrontations with some creatures under the sea, he decided to settle for a jellyfish flesh. This Jellyfish was extraordinarily huge. With its tentacles, it caught others’ spirits to nurture its own power. In this world, Sui Xiong wasn’t only matchlessly powerful but he also had an ability to cast magic. With this gifted ability and combined with his knowledge from the civilized world on Earth, he could help a deceased person resurrect, change a person’s look, and do tons of other crazy things that he didn’t know.\r\n\r\nAs his journey to discover this world went on, he encountered many bizarre and mystic creatures along the way, who were Gods, Humans, Devil Beasts, Giant Dragons and lots of other undetermined organisms. Some of them might insanely worship him, while others hated him. Some might become his enemies. Some might end up becoming his teammates in the end. From a gamer on Earth to here, he became a God (even he himself could not verify this yet), had his own religion and even a church with a Holy Land to fight for justice.\r\n\r\nWhat kind of world is this? What kind of existences might live in this world? What kind of secret this world owns? Can Sui Xiong return to Earth?\r\n\r\nKeep on following the story to find out the answers for those questions.\r\n\r\nLittle explanation about Cthulhu: Cthulhu has been described in appearance as resembling an octopus, a dragon and a human caricature, hundreds of meters tall, with webbed human-looking arms and legs and a pair of rudimentary wings on its back. Cthulhu’s head is depicted as similar to the entirety of a gigantic octopus, with an unknown number of tentacles surrounding its supposed mouth.>"
}