{
	"url": "https://www.novelupdates.com/series/im-in-trouble-because-the-darkened-heroes-are-obsessed-with-me/",
	"title": "I’m in Trouble Because The Darkened Heroes Are Obsessed With Me - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/09/Im-in-Trouble-Because-The-Darkened-Heroes-Are-Obsessed-With-Me.jpg",
	"noveltype": "(KR)",
	"genre": "Fantasy   Romance   ",
	"tags": "Fantasy World   Female Protagonist   Protagonist Strong from the Start   Reverse Harem   Transmigration   Transported into a Game World   ",
	"rating": "(4.0 / 5.0, 9 votes)",
	"author": "sandalwood   백단   ",
	"year": "\n2022",
	"ranking": "#1420   #4238   #11713   #4427   #10653   ",
	"reviewcount": "No Reviews",
	"description": "I possessed the guild master ‘Ruel’ in the game.\n\nFostering four heroes, defeating the final boss, and returning to reality out of the game.\n\nThree years later, I was possessed by the same game again.\n\n \n\nThis time, it’s  in the form of aristocratic Lady “Elsez”! \n\nI was going to meet the heroes and tell them all,\n\nThey thought “Ruel” was dead, so they were living in darkness and an arbitrary life.\n\n \n\n‘It’s X.  I didn’t expect it to turn out like this!’\n\n \n\nBesides, when I try to reveal my identity, my mouth closes.\n\nAt this rate, I’m going to be overthrown by my babies!\n\n \n\n* * *\n\n \n\nI decided to avoid the heroes because they might try to kill me if they encounter me.\n\nBy the way…\n\n \n\n“What should I do, so that I don’t lose you?”\n\nThe cruel Duke of Blood obeys me,\n\n \n\n“Why do I have to protect the world? The world without you means nothing to me.”\n\nThe Guild Master, who has lived righteously has fallen,\n\n \n\n“Didn’t you know that I only smile like this in front of you?”\n\nThe Cardinal, who is as warm as the sun, show a cool smile,\n\n \n\n“If I could, I wanted to break your world and have you next to me.”\n\nThe Dark Master of the magic tower looks at me with obsessive eyes.\n\n \n\nGuys, I’m the final boss and you guys are heroes\n\nWhy the hell are you obsessed with me?>"
}