{
	"url": "https://www.novelupdates.com/series/the-unloved-princess-solves-cases/",
	"title": "The Unloved Princess Solves Cases - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/03/amtpsc1_new.jpg",
	"noveltype": "(CN)",
	"genre": "Historical   Josei   Mystery   Romance   ",
	"tags": "Ancient China   Female Protagonist   Transmigration   ",
	"rating": "(3.7 / 5.0, 14 votes)",
	"author": "Thousand Dreams   千梦   ",
	"year": "\nN/A",
	"ranking": "#2000   #2000   #11040   #12558   #9256   ",
	"reviewcount": "No Reviews",
	"description": "Mu Wanqing was a forensic investigator from the 21st century until one day, she was sent back in time to the Jing Hua dynasty and became the appointed consort of a loyal and brave prince.\r\n\r\nUnreasonable, ill-mannered, arrogant and headstrong, the original princess had earned herself a long stay in the cold palace. Avoided by the mass, shunned by the prince, and ignored by the butler and servants, she was left to fend for herself in a hostile environment.\r\n\r\nWhat is this shitty situation? Do you take me for a Hello Kitty because I don’t roar?!\r\n\r\nTherefore, she relied on the skills she gained as a forensic investigator to solve problematic situations inside the prince’s estate, give back the justice for the victims, educate the ignorant servants and establish a great reputation, laying a solid foundation for her status in the prince’s household.\r\n\r\nTo survive, she did her best to worm a place into his life and unbeknownst to her; she ended up falling for the talented and charming prince who sometimes showed to her a rare kind expression.\r\n\r\nUnfortunately, good things don’t last forever. In order to marry the honorable Princess of Qing Yang, he planned a trap for her and framed her for adultery. Then, he stripped her of her princess’ title and kicked her out of the house successfully.\r\n\r\nShe learned the hard way that if men were trustworthy; pigs could climb trees.\r\n\r\nHomeless without a penny, she thought hard on how to survive the new ordeal because as a woman, her four arts sucks, so she can’t sell her talent. It was out of the question to sell her body. Shit! She only had skills for autopsies, but the yamen doesn’t hire women!\r\n\r\nCaught in an impasse, she finally sells her freedom and became a slave girl.\r\n\r\nIn a household torn with disputes, they assigned her to take care of the sick third young master.\r\n\r\nHehehe! This time she will grasp well on this new opportunity to reverse her fate.\r\n\r\nBreaking unsolved cases, answering the plight of people, meeting countless people, step by step a modern girl will forge her way to the peak.>"
}