{
	"url": "https://www.novelupdates.com/series/sss-grade-cafe-in-front-of-the-dungeon/",
	"title": "SSS-Grade Cafe in Front of The Dungeon - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/07/SSSGrade-Cafe-in-Front-of-The-Dungeon.jpg",
	"noveltype": "(KR)",
	"genre": "Comedy   Fantasy   Mystery   Romance   Supernatural   ",
	"tags": "Alternate World   Business Management   Contracts   Cooking   Crafting   Dungeons   Female Protagonist   Game Elements   Glasses-wearing Love Interests   Gods   Guilds   Handsome Male Lead   Heartwarming   Hiding True Abilities   Hiding True Identity   Hunters   Level System   Magical Space   Modern Day   Monsters   Pets   Second Chance   Special Abilities   Store Owner   Unreliable Narrator   Weak Protagonist   World Tree   ",
	"rating": "(4.1 / 5.0, 110 votes)",
	"author": "이우희   ",
	"year": "\n2021",
	"ranking": "#8   #22   #1735   #14   #3056   ",
	"reviewcount": "8 Reviews",
	"description": "I was stuck in a dungeon explosion while working so hard that I actually died.\n\nBut when I opened my eyes, I was back to the time of 3 years ago!\n\nWell, I will live differently in this life. Salary is goodbye to s*ave life. I quit immediately and set up a cafe in the store my grandmother left behind.\n\nThere are no customers because she is right in front of a dungeon, but it doesn’t matter. All I want is to work two days and play five days. But.\n\n[Class: I woke up as the cafe owner (F)]\n[Skill: I have the coffee in my hand (Lv.1)]\n[Mission: Brew 100 cups of mixed coffee (0/100)]\n[Item: Mixed Coffee – Increases recovery speed by 100% faster]\nAfter leaving my life as a wage s*ave, I became a coffee s*ave.\n\nAlso, the attractive regular customer who keeps bothering me is somehow unusual.\n\nIt doesn’t feel good. Isn’t it like the story of the main character of the RPG, who was just trying to run an errand, and ends up fighting the devil after getting caught up in something annoying?\n\nYes, I will not. I can not. I have no intention of playing more than the role of a novice innkeeper.”>"
}