{
	"url": "https://www.novelupdates.com/series/in-the-middle-of-the-night-in-the-dukes-residence/",
	"title": "In the Middle of The Night in the Duke’s Residence - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/12/In-the-Middle-of-The-Night-in-the-Dukes-Residence.jpg",
	"noveltype": "(KR)",
	"genre": "Adult   Drama   Harem   Romance   Smut   ",
	"tags": "An*l   Aristocracy   Artifacts   Beautiful Female Lead   Blackmail   C*nnilingus   Complex Family Relationships   Different Social Status   Doting Love Interests   Doting Older Siblings   Emotionally Weak Protagonist   European Ambience   Female Protagonist   First-time Interc**rse   Handsome Male Lead   Honest Protagonist   Manipulative Characters   Misunderstandings   Naive Protagonist   Nobles   Perverted Protagonist   Polyandry   R-18   Reverse Harem   Royalty   Shy Characters   Siblings   Sibling's Care   Siblings Not Related by Blood   Sister Complex   Sword Wielder   Threesome   ",
	"rating": "(3.2 / 5.0, 112 votes)",
	"author": "정매실   ",
	"year": "\n2021",
	"ranking": "#675   #549   #3359   #1314   #3961   ",
	"reviewcount": "No Reviews",
	"description": "Aristasia was a noble lady of the Verdic family, loved by the Iron-Blooded Duke as well as the Sword Master.\n\nIt all started with a single word from her— she, who had called for a gigolo.\n\nIt had been a long time since she had her debutante, yet she didn’t have a lover.\n\nMeanwhile, in the next room, the sound of her brother mingling with courtesans could be heard day and night.\n\nAt the naked moans that flowed through the thin walls, it aroused her curiosity and her body heated up.\n\nAfter completing the preparations, she avoided her brothers’ eyes and waited for a gigolo. But for some reason, her brother Evan came to visit.\n\n“Have you been curious about what you are going to do with a gigolo?”\n\n“No, that’s . . .”\n\n“Right, Aris was curious about what you were going to do with a gigolo, but I don’t want a gigolo to come. If you’re so interested, shouldn’t this brother teach you?”\n\nHer brother, who was usually friendly, smiled coldly. She bit her lips roughly.\n\nAfter that night, the two brothers’ gaze on Aristasia changed quite a bit.>"
}