{
	"url": "https://www.novelupdates.com/series/concubines-stunning-daughter-ghost-emperor-please-be-lenient/",
	"title": "Concubine’s Stunning Daughter: Ghost Emperor Please Be Lenient! - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2017/10/20170801095931_786.jpg",
	"noveltype": "(CN)",
	"genre": "Drama   Josei   Mature   Romance   Shoujo   Xuanhuan   ",
	"tags": "Ancient China   Beast Companions   Beautiful Female Lead   Black Belly   Clever Protagonist   Complex Family Relationships   Female Protagonist   Friendship   Handsome Male Lead   Love Interest Falls in Love First   Magical Space   Master-Servant Relationship   Misunderstandings   Multiple Realms   Pharmacist   Royalty   Secret Identity   Transmigration   Ugly to Beautiful   Underestimated Protagonist   Weak to Strong   ",
	"rating": "(3.8 / 5.0, 75 votes)",
	"author": "风情万种   ",
	"year": "\n2017",
	"ranking": "#2000   #3422   #3460   #7365   #3413   ",
	"reviewcount": "5 Reviews sorted by",
	"description": "She was originally an assassin. After rebirth, she was reduced to another world’s Di family’s most inferior concubine-born daughter. With an extremely hideous appearance and no way to cultivate, she was the object of everyone’s humiliation and bullying.\r\n\r\nHowever, the timid idiot turned over a new leaf. She took control of her own fate and became a domineering, fierce, and demonically beautiful girl. She became a shocking talent and stunning figure in the world, returning blow for blow, blood for blood. With a kill, she became famous!\r\n\r\nEven for the smallest provocation, she will take revenge. If someone bullied her, she will return it tenfold! Even to the heavens she will not be merciful! Controlling the mythological beasts of the world, she broke through the Ninth Heaven and shook the whole world!\r\n\r\nShe freely opposed the heavens. Provoking numerous evildoers, Di Fuyao could only pretend that she was timid and easily bullied with a low IQ, pleading to be let off!\r\n\r\nWho knew that the man she provoked, the cold and arrogant evil Ghost Emperor, actually brought the whole world to her just to marry her…\r\n>"
}