{
	"url": "https://www.novelupdates.com/series/crazy-leveling-system/",
	"title": "Crazy Leveling System - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/04/Logo.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Harem   Xuanhuan   ",
	"tags": "Absent Parents   Accelerated Growth   Adapted to Manhua   Alchemy   Arrogant Characters   Artifact Crafting   Beast Companions   Beautiful Female Lead   Blacksmith   Bloodlines   Cheats   Clever Protagonist   Crafting   Cultivation   Cunning Protagonist   Demons   Devoted Love Interests   Dragons   Elves   Evil Gods   Fairies   Fast Cultivation   Game Elements   Gods   Handsome Male Lead   Heavenly Tribulation   Hot-blooded Protagonist   Immortals   Kingdom Building   Late Romance   Level System   Lottery   Lucky Protagonist   Magic Formations   Male Protagonist   Marriage   Monster Tamer   Mysterious Family Background   Outer Space   Overpowered Protagonist   Parody   Phoenixes   Pill Concocting   Pregnancy   Romantic Subplot   Ruthless Protagonist   Sect Development   Skill Assimilation   S*aves   Soul Power   Strength-based Social Hierarchy   Sword And Magic   System Administrator   Time Skip   Time Travel   Transformation Ability   Transmigration   Transported to Another World   Underestimated Protagonist   Unique Cultivation Technique   Weak to Strong   ",
	"rating": "(3.1 / 5.0, 180 votes)",
	"author": "Crazy Meng Meng   疯狂的萌萌   ",
	"year": "\n2016",
	"ranking": "#1263   #1242   #473   #2147   #2286   ",
	"reviewcount": "28 Reviews",
	"description": "Your meridians cannot be cultivated? It’s ok! There is the Crazy Leveling System: Do missions, kill monsters, swallow other people’s spiritual power, make pills or forge weapons and participate in big battles. You can gain experience!\n\nEXP is too low? No worries! I have double EXP card, ten times EXP card! EXP bursts and level rises!\n\nWhat genius, big family young master, empire emperor, and talent? In the face of this Crazy Leveling System, they are far behind!\n\n“Huh, did I level up again?” Yi Tianyun woke up and found himself level up again…>"
}