{
	"url": "https://www.novelupdates.com/series/ancient-strengthening-technique/",
	"title": "Ancient Strengthening Technique - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/f49b50c7-9bc1-4f61-9b83-ef1fabe491ae.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Drama   Ecchi   Fantasy   Harem   Martial Arts   Mature   Seinen   Xuanhuan   ",
	"tags": "An*l   Alchemy   Arrogant Characters   Artifacts   Beast Companions   Beautiful Female Lead   Blacksmith   Body Tempering   Cheats   Clan Building   Cooking   Crafting   Cultivation   Cute Children   Death of Loved Ones   Dense Protagonist   Doctors   Dragons   Early Romance   Eidetic Memory   First-time Interc**rse   F*llatio   Game Elements   Handsome Male Lead   Hard-Working Protagonist   Harem-seeking Protagonist   Immortals   Inferiority Complex   Magical Space   Male Protagonist   Medical Knowledge   Multiple Realms   Netori   Older Love Interests   Perverted Protagonist   Phoenixes   Pill Based Cultivation   Pill Concocting   Politics   Polygamy   Pregnancy   R*pe Victim Becomes Lover   Reincarnated in Another World   Revenge   Romantic Subplot   R*pe   Ruthless Protagonist   S*xual Cultivation Technique   Special Abilities   Strong Love Interests   Student-Teacher Relationship   Threesome   Time Manipulation   Time Skip   Underestimated Protagonist   Unique Cultivation Technique   Weak to Strong   ",
	"rating": "(3.2 / 5.0, 1216 votes)",
	"author": "Eu sou supérfluo   我 是 多余 人   ",
	"year": "\n2012",
	"ranking": "#6970   #6230   #29   #160   #222   ",
	"reviewcount": "144 Reviews sorted by",
	"description": "A human warrior cultivating the Ancient Strengthening Technique has transcended dimensions and arrived on Kyushu. Together with twelve ravishing beauties with looks that were unmatched in their generation, will he be able to stand on the summit of this world?\n\nThis novel is about the main character, named Qing Shui, who transcended dimensions and arrived in the Kyushu continent. Storms of blood and wind, resulting in corpses and bones strewn about are extremely common here. The young warrior Qing Shui forged ahead in his path to cultivate, using 10 years to train himself, only to seek vengeance for the one who had forsaken his mother!>"
}