{
	"url": "https://www.novelupdates.com/series/i-raised-a-black-dragon/",
	"title": "I Raised A Black Dragon - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/01/90823842390.jpg",
	"noveltype": "(KR)",
	"genre": "Comedy   Fantasy   Josei   Mystery   Romance   Slice of Life   ",
	"tags": "Adapted to Manhwa   Beautiful Female Lead   Childcare   Cute Children   Detectives   Dragons   Enemies Become Lovers   Fantasy Creatures   Fantasy World   Female Protagonist   Handsome Male Lead   Hiding True Identity   Investigations   Lazy Protagonist   Magic   Mystery Solving   Near-Death Experience   Overpowered Protagonist   Slow Romance   Smart Couple   Spies   Transmigration   Witches   ",
	"rating": "(4.2 / 5.0, 361 votes)",
	"author": "Dalseul   달슬   ",
	"year": "\n2019",
	"ranking": "#3133   #3233   #677   #4023   #210   ",
	"reviewcount": "88 Reviews sorted by",
	"description": "The witch, Eleonora Asil, has fifteen previous convictions.\n\nAnd the transmigrator, Noah Park, had no intentions of being involved in the novel’s original plot of the dragon beheading the villainess. With that thought in mind, she abandoned her titles as The Wicked Witch and sought to live a long and peaceful life.\n\nSo she heads down to the countryside wrought with deep remorse for all her misdeeds. And all should be happy… or she thought.\n\n“Please raise me!”\n\nAnd so it would seem that she stumbled upon the heroine’s pet dragon — the black-haired kid that would turn ballistic and obsessive later on — imprinted the villainess as his mother. And to make matters worse, the male lead suspects her as the prime culprit of stealing the dragon.\n\n“How long should I keep up with you?”\n\nShe thought he’d arrest her right away, but seems like the male lead was slowly becoming the dragon’s butler.\n\n“Can I hug you?”\n\n“No.”\n\n“Then… can you hold me?”\n\nThe villainess believes that the dragon needs a bit of taming.\n\n‘Oh, male lead, won’t you sign a life contract as a real butler?'>"
}