{
	"url": "https://www.novelupdates.com/series/the-only-favourite-ugly-husband/",
	"title": "The Only Favourite Ugly Husband - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/08/The-Only-Favourite-Ugly-Husband.jpg",
	"noveltype": "(CN)",
	"genre": "Adventure   Romance   Slice of Life   Yaoi   ",
	"tags": "Alternate World   Ancient China   Army Building   Average-looking Protagonist   Bullying   Business Management   Businessmen   Child Abuse   Childcare   Clingy Lover   Devoted Love Interests   Family Business   Family Conflict   Handsome Male Lead   Inferiority Complex   Kingdom Building   Manly Gay Couple   Marriage   Merchants   Mpreg   Past Plays a Big Role   Poor to Rich   Power Struggle   Pragmatic Protagonist   Protagonist Falls in Love First   Protagonist Strong from the Start   Seme Protagonist   Time Skip   Transmigration   Wealthy Characters   ",
	"rating": "(4.3 / 5.0, 398 votes)",
	"author": "Jué Jué   决绝   ",
	"year": "\n2017",
	"ranking": "#131   #1231   #548   #454   #491   ",
	"reviewcount": "102 Reviews sorted by",
	"description": "Jiang Zhen crossed into ancient times and became the old bachelor eldest Jiang who was neglected by his whole family in Hexi Village.\n\nHe was born into a good family, but the eldest Jiang was busy all year and couldn’t even eat a full meal. His two younger brothers could marry a wife, but he was starved to death… Jiang Zhen felt it was unbearable.\n\nYou don’t want to feed me? OK, I will kill the chicken myself.\n\nYou don’t even give me a glimpse of food? It doesn’t matter, the door of the granary will be opened as soon as I kick it.\n\nYou want to tell me that I am unfilial? Ok, I will immediately take the knife to the village and slash people, and let the yamen officer catch all of us.\n\nJiang Zhen became a local tyrant in the village. He also saw the “ugly” ger who could not get married in the village.\n\nFuture father-in-law: “Jiang Zhen is always wandering around our house. Is he planning to rob our house?”\n\nThe future mother-in-law: “What to do? Jinge can’t beat him!”\n\nZhao Jinge's face was hot… Dad, the wild rabbit that I brought back today is what he gave…>"
}