{
	"url": "https://www.novelupdates.com/series/changans-first-beauty/",
	"title": "Chang’an’s First Beauty - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/07/116196s.jpg",
	"noveltype": "(CN)",
	"genre": "Drama   Fantasy   Historical   Mature   Romance   ",
	"tags": "Adapted to Drama   Ancient China   Aristocracy   Arrogant Characters   Beautiful Female Lead   Calm Protagonist   Cold Love Interests   Cold Protagonist   Complex Family Relationships   Conflicting Loyalties   Couple Growth   Court Official   Crime   Debts   Destiny   Devoted Love Interests   Different Social Status   Fallen Nobility   Familial Love   Family Conflict   Fated Lovers   Female Protagonist   First-time Interc**rse   Forced into a Relationship   Forced Living Arrangements   Handsome Male Lead   Hiding True Identity   Jealousy   Kind Love Interests   Love Interest Falls in Love First   Male Protagonist   Manipulative Characters   Mismatched Couple   Misunderstandings   Multiple Reincarnated Individuals   Multiple Timelines   Naive Protagonist   Nightmares   Nobles   Non-linear Storytelling   Older Love Interests   Overprotective Siblings   Past Plays a Big Role   Past Trauma   Personality Changes   Politics   Precognition   Pregnancy   Quiet Characters   Reincarnation   Reluctant Protagonist   Schemes And Conspiracies   Secret Relationship   Seduction   Selfless Protagonist   S*xual Abuse   Shy Characters   Siblings   Slow Romance   Timid Protagonist   Weak Protagonist   ",
	"rating": "(4.5 / 5.0, 111 votes)",
	"author": "Well-Developed Lachrymal Glands   发达的泪腺   ",
	"year": "\n2020",
	"ranking": "#4265   #990   #4408   #10066   #3440   ",
	"reviewcount": "27 Reviews sorted by",
	"description": "The Marquis Yunyang was deposed by the Emperor and his family ended up in dire straits overnight. As such, the Third Miss of the Shen Household, her family’s most precious jewel, found herself abandoned by all with a sick brother on her hands. Having no other choice, she set up a cosmetics shop in Chang’an.\n\nBut to the eyes of all, especially her relatives’, she had become nothing but an alluring flower any man could pick at will.\n\nPassing by her Baixiang Pavilion, the heir to the Grand Duchy of Zhen, Lu Yan, witnessed her being harassed by the idle sons of Chang’an’s leading class. Her appearance reminded him of dreams that had been plaguing him lately, revealing to him a past with her and the sultry love affair they had shared in a previous life.\n\nWith shaking fingers, he also remembered the bitter taste of heartbreak when she left him to marry another man.\n\nThus, in this life, he decided to save her once more, lure her into an affair, install her as his mistress and never let her escape his sphere of influence again.\n\nHowever, to keep Shen Zhen by his side, finding her a place to stay and caring for her brother was not enough. Little did Lu Yan know he would be pulled into the darkest corners of Chang’an and take part in games of power that at times implicated the Main Gentleman of the Empire, the Emperor himself. Selling what he held dearest in the process: his integrity as an official.\n\nAll for the sake of Chang’an’s First Beauty.>"
}