{
	"url": "https://www.novelupdates.com/series/the-cub-ive-raised-is-the-crown-prince-of-the-empire/",
	"title": "The Cub I’ve Raised is the Crown Prince of the Empire - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/06/The-Pet-Ive-raised-is-the-Crown-Prince-of-the-Empire.jpeg",
	"noveltype": "(CN)",
	"genre": "Fantasy   Romance   Sci-fi   Yaoi   ",
	"tags": "Age Regression   Animal Characteristics   Black Belly   Childcare   Contracts   Cute Protagonist   Demi-Humans   Doting Older Siblings   Doting Parents   Game Elements   Gate to Another World   Human-Nonhuman Relationship   Jealousy   Loneliness   Love Interest Falls in Love First   Monsters   Naive Protagonist   Possessive Characters   Returning from Another World   Sickly Characters   Strong Love Interests   System Administrator   Transported into a Game World   Transported to Another World   Wealthy Characters   Younger Love Interests   ",
	"rating": "(4.1 / 5.0, 68 votes)",
	"author": "最爱梅子酒   ",
	"year": "\n2020",
	"ranking": "#3567   #3822   #3962   #1727   #3620   ",
	"reviewcount": "12 Reviews sorted by",
	"description": "Yu Xingqiao has suffered from an immune deficiency disease since childhood. Because of this, he has to stay in a sterile room. Fortunately, he is accompanied by various electronic products.\n\nWhen his nurse lady recommended an app for raising cubs, he refused at first, but after accidentally playing it——\n\nHis family’s little Jun Lu was so soft and cute but has nothing, so pitiful.\n\nHave to buy buy buy for him!\n\nWow, my good cub grows up to be so handsome, he must be given krypton!\n\nAs the son of the richest man, Yu Xingqiao has nothing but a lot of money.\n\nThe crown prince of the Empire, Jun Lu, suffered a vicious attack, lost all his power and was forced to change back to his infant form. He had to live incognito and suffer from all kinds of humiliation. One day, he was found by a self-proclaimed system and was asked to sign an agreement with him.\n\nAs long as he can get revenge, he is willing to sacrifice his soul to the devil!\n\nAfter receiving many “god’s gifts”, he finally couldn’t help asking the system, what exactly did the master want?\n\nDoes he want my life, or… to kill someone?\n\nAfter a long time, a line of shy little words appeared in the void: I…I want to see your abdominal muscles.\n\nJun Lu: Huh? ? ?>"
}