{
	"url": "https://www.novelupdates.com/series/he-didnt-want-to-be-the-center-of-attention-hence-after-defeating-the-demon-lord-he-became-guild-master/",
	"title": "He Didn’t Want to Be the Center of Attention, Hence, after Defeating the Demon Lord, He Became Guild Master (WN) - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/04/He-Didnt-Want-to-Be-the-Center-of-Attention-Hence-after-Defeating-the-Demon-Lord-He-Became-Guild-Master-WN_1618523578.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Comedy   Ecchi   Fantasy   Harem   Martial Arts   Romance   Shounen   Supernatural   ",
	"tags": "Adapted to Manga   Calm Protagonist   Clever Protagonist   Confident Protagonist   Demon Lord   Demons   Dense Protagonist   Dragon Slayers   Dragons   Elves   Enemies Become Allies   Genius Protagonist   Godly Powers   Guilds   Handsome Male Lead   Heroes   Hiding True Abilities   Male Protagonist   Monster Tamer   Monsters   Older Love Interests   Overpowered Protagonist   Polygamy   Protagonist Strong from the Start   Royalty   Strong to Stronger   Sword And Magic   Tsundere   Underestimated Protagonist   Younger Love Interests   ",
	"rating": "(3.7 / 5.0, 165 votes)",
	"author": "Akatsuki Touwa   Toowa   とーわ   朱月十話   ",
	"year": "\n2016",
	"ranking": "#4617   #6245   #1124   #8372   #936   ",
	"reviewcount": "12 Reviews sorted by",
	"description": "The Kingdom of Albein was blessed with the appearance of the Miracle children, individuals with the greatest talents ever seen. Despite being around ten years old, with abilities dozens of times stronger than the average adventurer, they managed to reach a strength score that exceeded 100.000 points, granting them the SSS adventurer grade. With a mere party of five people, they defeated the Demon Lord regaining the kingdom’s peace.\n\nAfter that journey, D*ck Silver, the most balanced one between them, racked his brain to not draw the public attention.\n\nIn the end, he decided to become the Guild Master of a suburban guild as a reward, becoming its 12th successor.\n\nAfter five years he reached his aim and then became a regular of its own guild’s cafe.\n\nBut one day, as he was drinking at the bar as always, the daughter of a certain aristocrat came to pay him a visit…>"
}