{
	"url": "https://www.novelupdates.com/series/favored-crazy-consort-ghost-emperor-too-proud/",
	"title": "Favored Crazy Consort: Ghost Emperor too Proud - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/04/587DB71E-96F4-4DB2-9CC1-65D8F41150EB.jpeg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Comedy   Fantasy   Historical   Josei   Romance   ",
	"tags": "Alternate World   Ancient China   Arranged Marriage   Arrogant Characters   Charismatic Protagonist   Clever Protagonist   Cold Love Interests   Confident Protagonist   Cunning Protagonist   Determined Protagonist   Doting Love Interests   Family Conflict   Female Protagonist   Handsome Male Lead   Manipulative Characters   Pragmatic Protagonist   Ruthless Protagonist   Schemes And Conspiracies   Shameless Protagonist   Smart Couple   Stoic Characters   Transmigration   Wealthy Characters   ",
	"rating": "(3.8 / 5.0, 16 votes)",
	"author": "赵四小妞   ",
	"year": "\n2018",
	"ranking": "#2000   #2000   #9056   #11528   #7321   ",
	"reviewcount": "No Reviews",
	"description": "Zhuo Qingyan, a special ops soldier from modern times, code-named Lone Falcon, was blown up and fell off of a cliff during the execution of her mission. When she opened her eyes again, she became the concubine-born fourth miss of the Han empire’s minister, an idiot **\n\nAfter an imperial edict, she was conferred to marry the emperor’s youngest uncle, the Ghost Face Wangye. ** After transmigrating, she became the Emperor’s little aunt.\n\nA waste wangye with a silly wangfei, a fitting pair.\n\nAfter offering himself to become emperor, wifey patted his chest and said, “ if you open the border, I will help you expand the soil; if you recruit, I will help you train; You don’t have a horse? I will help you steal a horse;”\n\n“Wifey, this Benwang does not have a heir….”\n\n“I’ll help you… that can wait a minute. Ha. You’re in the prime of your life. You have a strong body and good kidneys. You will have more than enough qualified successors.”\n\n“…”\n\nHowever, she was unaware of her own secret. The hidden treasure hunt map on her back was fought over by influential forces in all directions. She had also turned into ‘prey’!\n\n“Wang ye, wangfei has killed senior provincial Hou’s eldest grandson in the street”.” If she killed him, she killed him! If you have the ability, come to the royal palace and try to arrest!\n\n“Wangye, Wangfei brought people to dig up the mansion of a governor who oversees a whole region”…… “There’s a bunch of people who wants to be the governor, replace him!”\n\nWangye , Wangfei brought a group of people to beat him up and strung him up naked in the trees in exhibition. –A splendid job! Look at how the Ghost Faced Wangye spoils his Wangfei.The world under the heavens can fight, but only his Beloved Wife was his treasure.>"
}