{
	"url": "https://www.novelupdates.com/series/your-memes-are-better-looking-than-you/",
	"title": "Your Memes Are Better Looking Than You - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/02/Your-Memes-Are-Better-Looking-Than-You.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Romance   Yaoi   ",
	"tags": "Adapted to Drama CD   Adapted to Manhua   Arranged Marriage   Black Belly   Celebrities   Couple Growth   Cute Protagonist   Depression   Devoted Love Interests   Doting Love Interests   e-Sports   Engagement   Familial Love   First-time Interc**rse   Gamers   Handsome Male Lead   Hard-Working Protagonist   Hated Protagonist   Heartwarming   Love Interest Falls in Love First   Misunderstandings   Older Love Interests   Past Trauma   Popular Love Interests   Showbiz   ",
	"rating": "(4.6 / 5.0, 351 votes)",
	"author": "Mao Qiu Qiu   毛球球   ",
	"year": "\n2019",
	"ranking": "#6970   #6200   #1954   #359   #1552   ",
	"reviewcount": "91 Reviews sorted by",
	"description": "Gu Wei, the popular yet controversial lead dancer of boy band T.ATW.\n\nJiang Xun, a god-tier professional esports player.\n\nOne day, after a certain variety show aired, these complete strangers became a trending topic together.\n\nGu Wei's Anti-Fans: Do these two have anything to do with each other? Gu Wei is absolutely shameless. He'll try to leech fame off anything that moves, even esports legends. Ignore him, ignore him!\n\nFans of Jiang Xun's Technique: If our God Xun wanted to, he could buy this whole country. If he's playing around with some nameless celeb, he'll just play until he gets bored and moves on.\n\nBut before long, an unexpectedly heated controversy sparked around the two:\n\nJiang Xun slacks off during a livestream to promote a celebrity!\n\nJiang Xun's little brother Jiang Ying says he's being forced to defend his nemesis Gu Wei against anti-fans!\n\nGu Wei, Jiang Xun… a shocking affair?!\n\nNetizens: ???\n\nThe two do have talks of an engagement brewing between them, but it wasn't Jiang Xun who Gu Wei fell for first… it was Jiang Xun's reaction memes.\n\nWhen Jiang Xun first met Gu Wei, he came away with the impression that Gu Wei was his diehard fan. He never would have imagined Gu Wei was only a fan of his memes.\n\nGu Wei: Ge… I think your reaction memes are better looking than you.\n\nJiang Xun: Little Gu, you're a little rebel, aren't you?\n\nThen, affection gradually began to grow between the two. Gu Wei finally mustered up the courage to confess his feelings to Jiang Xun.\n\nGu Wei: Jiang Xun, I think I've started to ship us.\n\nJiang Xun, fiercely: You're late. I've already become your stan.>"
}