{
	"url": "https://www.novelupdates.com/series/reincarnated-as-a-misogynistic-freak-the-sabotaging-character-that-was-supposed-to-spread-great-misfortune-in-a-bishoujo-game-wants-to-keep-his-distance-from-the-heroines/",
	"title": "Reincarnated as a Misogynistic Freak ~The Sabotaging Character That Was Supposed to Spread Great Misfortune in a Bishoujo Game Wants to Keep His Distance from the Heroines~ - Novel Updates",
	"image": "https://www.novelupdates.com/img/noimagefound.jpg",
	"noveltype": "(JP)",
	"genre": "Comedy   Fantasy   School Life   Shounen   Slice of Life   ",
	"tags": "Academy   Age Progression   Alternate World   Antihero Protagonist   Aristocracy   Arranged Marriage   Arrogant Characters   Artifact Crafting   Average-looking Protagonist   Broken Engagement   Bullying   Character Growth   Demi-Humans   Doting Parents   Dragons   Elemental Magic   Fallen Nobility   Fantasy World   Fat Protagonist   Galge   Game Elements   Goddesses   Gods   Guilds   Identity Crisis   Love Rivals   Loyal Subordinates   Magic   Magical Technology   Maids   Male Protagonist   Merchants   Mob Protagonist   Near-Death Experience   Nobles   Parallel Worlds   Personality Changes   R-15   Reincarnated in a Game World   Royalty   Servants   Sharp-tongued Characters   Siblings Not Related by Blood   S*aves   Time Skip   Transmigration   Wealthy Characters   Younger Sisters   ",
	"rating": "(3.1 / 5.0, 43 votes)",
	"author": "Jin Tsuuriki   じんつーりき   神通力   ",
	"year": "\n2021",
	"ranking": "#2000   #2000   #4871   #6882   #7315   ",
	"reviewcount": "7 Reviews sorted by",
	"description": "“Women are such a pain. It’s easier to hang out with other guys.”\n\nOur protagonist, a misogynistic high schooler, was run over by a middle-aged woman who wasn’t paying attention to the road while he was on his way to school one morning.\n\nWhen he regained consciousness, he finds himself in an unfamiliar world where he has been reincarnated as Hawk Gold, a woman-loving, obese child of a wealthy family with no morals whatsoever perhaps due to his spoiled upbringing.\n\nHe began keeping his distance from the women who flock to him for money and power, including his beautiful maid, younger sister, and fiancée in this second life he was suddenly forced to live.\n\nBeing born in the ’00s, little did he know that the world he lives in is actually part of “Elements Eleven,” a classic bishoujo game released in the ’90s, and his character was supposed to sabotage them.>"
}