{
	"url": "https://www.novelupdates.com/series/the-sleepless-night-of-the-maid/",
	"title": "The Sleepless Night of the Maid - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/12/The-Sleepless-Night-of-the-Maid.jpeg",
	"noveltype": "(KR)",
	"genre": "Drama   Fantasy   Mature   Romance   ",
	"tags": "Abandoned Children   Absent Parents   Adapted to Manhwa   Aristocracy   Cute Protagonist   Empires   European Ambience   Fated Lovers   Female Protagonist   Lovers Reunited   Maids   Nobles   Seduction   Weak to Strong   ",
	"rating": "(3.8 / 5.0, 53 votes)",
	"author": "Hong Se Ra   홍세라   ",
	"year": "\n2020",
	"ranking": "#1874   #2037   #5454   #3736   #4783   ",
	"reviewcount": "2 Reviews sorted by",
	"description": "Eva Massies, once a daughter of a noble family, now lives in a house of acquaintances as a maid. She met him for the first time when her life was at rock bottom. Her handsome, strong, and dazzling former fiancée, Crown Prince Edward.\n\n“Why are you crying, hm?”\n\nEdward asked worriedly as he took her hurt foot.\n\n“…It’s embarrassing. Hic–”\n\nPerhaps it was because of how affectionate his voice was. A voice that had been suppressed all this time brazenly slipped out. To top it off, being soaked wet in water, wearing a pair of worn-out, patched socks, hitting rock bottom, all of these were shameful.\n\n“Are you feeling ashamed because you’re hurt? Your foot is still beautiful even like this.”\n\nHe said those words like it wasn’t something to be concerned about.\n\n“There’s no need to be ashamed. For whatever reason, you did nothing wrong, Eva.”\n\nHe soothed her fear by calling her name. Only when he’d left did she realize. That man who stayed only for a moment, that man who would be deeply engraved in her heart, was her first love.\n\n* * *\n\nOnce again she met Edward after going through a rough time.\n\nAfter defeating numerous nobles’ daughters and becoming a lady-in-waiting.\n\nAfter her heart grew stronger.\n\nAfter she no longer thought about him.\n\n“It’s the lady of the bedchamber’s job to make sure that everything is sufficient and provide anything that Your Highness needs before sleep. That’s why, if you wish to hold hands, do as you wish.”\n\n“Have I ever acted as I pleased in front of a lady even once?”\n\nHis voice was cold, drastically different from before. He held her, his glaring eyes felt very intimidating to her.\n\n“If I knew you’d come to the imperial palace, I wouldn’t have let you go that day.”\n\nEdward, who had his face close to her, warned in a low voice,\n\n“So this time, I was thinking of doing anything however I wished.”>"
}