{
	"url": "https://www.novelupdates.com/series/my-youth-begins-with-loving-you/",
	"title": "My Youth Begins With Loving You - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2017/12/myb.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Drama   Romance   Slice of Life   ",
	"tags": "Chefs   Cooking   Couple Growth   Cute Story   Female Protagonist   First Love   Handsome Male Lead   Heartwarming   Love at First Sight   Military   Modern Day   Naive Protagonist   Older Love Interests   Police   Protagonist Falls in Love First   Restaurant   Second Chance   Stoic Characters   ",
	"rating": "(4.3 / 5.0, 72 votes)",
	"author": "Orange Tree   桔子树   ",
	"year": "\n2009",
	"ranking": "#6970   #3741   #3903   #9889   #3588   ",
	"reviewcount": "14 Reviews sorted by",
	"description": "These days, all of the fine men have either already gotten married or already have a girlfriend.\n\nIf a man reaches thirty-two and he hasn’t married yet and he doesn’t have a girlfriend—nor has he ever even had a boyfriend or a girlfriend—then he definitely has some sort of physical defect.\n\nIf he doesn’t have any physical defects, then he definitely has some sort of psychological defect. If he doesn’t have any defects whatsoever, then only one explanation remains: he’s a Martian.\n\nMiao Yuan never thought that one day, she would fall in love with a Martian!\n\nThis year, the girl who was in her early twenties had countless strange ideas.\n\nThey were mad at each other in one moment and happy with each other in the next. In one moment, they behaved well like kitties, and in the next, they were crying, saying that it was time to break-up.\n\nChen Mo felt that this young girl had to be some kind of alien creature. He never thought that one day, they would live together on Earth.\n\nHe is a sniper. In ‘chen mo,’ he approaches the target. Armed with only a gun, he never fails to see his target’s blood fall—he’s a natural soldier. In the past, his only love was a slender gun.\n\nShe is a pâtissiere. The fragrance of milk and honey wafts off the tips of her fingers. Delicately sweet-tempered and overflowing with laughter—she’s like a budding rose.\n\nWhen the muzzle of the ice-cold gun meets the gentle and beautiful rose.\n\nWhen the sweet cream melts the coarse bloodstains.\n\nLife has a way of making the most unlikely people fall in love.>"
}