{
	"url": "https://www.novelupdates.com/series/holy-right-a-multiverse-occultist/",
	"title": "Holy Right: A Multiverse Occultist - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/01/Holy-Right-A-Multiverse-Occultist.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adult   Adventure   Comedy   Ecchi   Fantasy   Harem   Mystery   Supernatural   ",
	"tags": "Ability Steal   Antihero Protagonist   Based on a Visual Novel   Based on an Anime   Beautiful Female Lead   Cheats   Crossover   Fanfiction   God-human Relationship   God Protagonist   Goddesses   Godly Powers   Gods   Handsome Male Lead   Interdimensional Travel   Male Protagonist   Multiple Realms   Overpowered Protagonist   World Hopping   World Travel   ",
	"rating": "(2.8 / 5.0, 10 votes)",
	"author": "Green Moon   青之月   ",
	"year": "\nN/A",
	"ranking": "#2000   #2000   #11641   #11074   #12687   ",
	"reviewcount": "No Reviews",
	"description": "Occult, “the knowledge of the hidden”, something that falls outside the scope of common thinking, something incomprehensible and indecipherable to the common masses.\n\nEncompassing mysticism, spirituality, and magic.\n\nAnd the beings who embrace these are known as—Occultist.\n\nThis, is the story of the one such occultist, same, but so much different from the rest.\n\nThis is the chronicle of the son of ‘The Most Evil Man in the World’. He who is ‘The Beast Of Perfection’, ‘The Travler Of Mysterious’, ‘The Face Of Countless’.\n\nThe–\n\nThe ‘Godslayer’ of the ‘Campione!’\n\nThe ‘Pope of Original Sin’ of the ‘Re:Zero − Starting Life in Another World.’\n\nThe ‘BEAST’ of the ‘Nasuverse.’\n\nThe ‘God of Magic’ of the ‘A Certain Magical Index.’\n\nThe ‘Last Embryo’ of the ‘Problem Children Are Coming from Another World, Aren’t They?’\n\nTag along with Roy ‘Mrkl’ Crowley, the ’embodiment’ of the St. Michael the Archangel as he grasps the miracles of Occultism, blossoming the multiuniverse with the myths and legends of his own.\n\nFor he is the—\n\n“『BEAST777』, the one who shall cross the evils of mankind!”>"
}