{
	"url": "https://www.novelupdates.com/series/paladin-of-the-end/",
	"title": "Paladin of the End - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2016/03/9784865541045_LL.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Drama   Fantasy   Mature   Mystery   Seinen   Tragedy   ",
	"tags": "Adapted to Anime   Adapted to Manga   Adopted Protagonist   Age Progression   Aristocracy   Caring Protagonist   Character Growth   Clever Protagonist   Death of Loved Ones   Demons   Depression   Determined Protagonist   Dragons   Dwarfs   Elves   Evil Gods   Familial Love   Family   Famous Parents   Fantasy World   Friendship   Ghosts   God-human Relationship   Goddesses   Gods   Hard-Working Protagonist   Healers   Helpful Protagonist   Heroes   Leadership   Magic   Male Protagonist   Mercenaries   Merchants   Monsters   Nobles   Overpowered Protagonist   Past Plays a Big Role   Past Trauma   Polite Protagonist   Politics   Priests   Reincarnated in Another World   Righteous Protagonist   Romantic Subplot   Singers   Spear Wielder   Spirit Users   Strategic Battles   Strong to Stronger   Sword And Magic   Teamwork   Weak to Strong   ",
	"rating": "(4.7 / 5.0, 229 votes)",
	"author": "Yanagino Kanata   ",
	"year": "\n2015",
	"ranking": "#6970   #6161   #4040   #6879   #1418   ",
	"reviewcount": "22 Reviews sorted by",
	"description": "In a city of the dead, long since ruined and far from human civilization, lives a single human child. His name is Will, and he’s being raised by three undead: the hearty skeletal warrior, Blood; the graceful mummified priestess, Mary; and the crotchety spectral sorcerer, Gus. The three pour love into the boy, and teach him all they know.\n\nBut one day, Will starts to wonder: “Who am I?” Will must unravel the mysteries of this faraway dead man’s land, and unearth the secret pasts of the undead. He must learn the love and mercy of the good gods, and the bigotry and madness of the bad. And when he knows it all, the boy will take his first step on the path to becoming a Paladin.\n\n“I promised you. It’s gonna take a while, but I’ll tell you everything. This is the story of the deaths of many heroes. It’s the story of how we died, and it’s the reason you grew up here.”>"
}