{
	"url": "https://www.novelupdates.com/series/despite-being-pursued-as-a-villain-all-the-heroines-on-my-side/",
	"title": "Despite Being Pursued As a Villain, All The Heroines On My Side? - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/01/Despite-Being-Pursued-As-a-Villain-All-The-Heroines-On-My-Side.png",
	"noveltype": "(CN)",
	"genre": "Comedy   Fantasy   Harem   Mature   Romance   Tragedy   ",
	"tags": "Alternate World   Arranged Marriage   Beautiful Female Lead   Business Management   Cultivation   Doting Older Siblings   Early Romance   Enemies Become Lovers   Famous Protagonist   H*ndjob   Love Interest Falls in Love First   Love Rivals   Male Protagonist   Manipulative Characters   Misunderstandings   Modern Day   Multiple POV   Multiple Reincarnated Individuals   Past Plays a Big Role   Popular Love Interests   Previous Life Talent   Schemes And Conspiracies   Shameless Protagonist   Siblings Not Related by Blood   Strong Love Interests   System Administrator   Transmigration   Wealthy Characters   Yandere   ",
	"rating": "(3.9 / 5.0, 163 votes)",
	"author": "One Heart   一颗心   ",
	"year": "\nN/A",
	"ranking": "#134   #1384   #1281   #139   #2273   ",
	"reviewcount": "25 Reviews",
	"description": "Su Mingyuan has become a villain in the world of urban novels. As long as he plays well according to the villain’s setting and completes the plot, he can get villain points, and he can return to earth if he saves enough 100,000.\n\nUnexpectedly, Su Mingyuan, who had saved enough money, unfortunately, encountered a turbulent flow in time and space when he crossed back to Earth, and the time went back to his first day as a villain.\n\nEverything has to start again.\n\n“It’s merely a matter of starting over; the required villain value is less than half what it was the last time, and my acting abilities have improved significantly since the last time. I’m able to deliver stronger performances and am able to acquire a greater number of villain values more quickly…”\n\nSu Mingyuan is optimistic and confident.\n\n“Let see, I will do my best to taunt the male and female protagonists to hate me and then be punched in the face by them!”\n\n“See if I don’t do my best to ridicule, make the male and female protagonists hate me, and then hit me crazily in the face and step on me.”\n\n“When it comes to acting as a villain, I’m a professional!”\n\nTo begin, the first step is to attempt to harass the male protagonist’s sister, so that the two create an intense dislike for me.\n\nHey, what’s wrong with you heroine?\n\nNot only do you not resist, why do you seem to… enjoy it?\n\nCan you be serious!?\n\nI’m a villain!\n\nWait… wait!\n\nWhy, apart from you, the way other female protagonists look at me seems to be wrong?\n\nThey came up one by one as if they were going to… eat me?>"
}