{
	"url": "https://www.novelupdates.com/series/my-amazing-boyfriend/",
	"title": "My Amazing Boyfriend - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/01/My-Amazing-Boyfriend.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Mystery   Romance   Supernatural   ",
	"tags": "Acting   Adapted to Drama   Beautiful Female Lead   Female Protagonist   Hackers   Handsome Male Lead   Human-Nonhuman Relationship   Modern Day   Mysterious Past   ",
	"rating": "(3.3 / 5.0, 14 votes)",
	"author": "Shui Qian Mo   水阡墨   ",
	"year": "\n2016",
	"ranking": "#2000   #2000   #9570   #10839   #9809   ",
	"reviewcount": "1 Review sorted by",
	"description": "Mutant Xue Ling Qiao, who has been asleep for centuries, is awakened by the unlucky actress Tian Jing Zhi in a car accident. He then forces his way into living at her house despite his mysterious past. On the surface, she acts like she’s not bothered by his super powers, but actually, she tries her best to get rid of this “monster.” Unexpectedly, their torment of each other gradually warms their relationship. This not only illuminates their romantic feelings but also reveals a shocking conspiracy that spans centuries.  \n\n---\n\n“You’ve roamed for five centuries, experienced the vicissitudes of history, and finally appeared in front of me. Of all people, you appeared in front of me. ”\n\nTian Jingzhi was at the over-ripe age of twenty eight when she had escaped death from a car accident. Sure enough, nothing was free in life. Her extreme luck had come with a price. She had accidentally provoked a weird ‘thing’. A top of the notch fresh meat. But the truth of the matter was, he’s an immortal, an old monster who had lived for over five hundred years. \n\nHe said that her blood had saved him. That they shared the closest ‘blood’ ties. And even if he was unwilling to do so, he will protect her for her whole life. \n\nWith such a ‘man’ by her side, risking his life for her, misfortunes of all sizes have become trivial matters. \n\nIf bad luck could never be avoided in one’s lifetime. Then Xue Lingqiao will make you believe that any mishaps can become a godsent chance for an unexpected adventure.>"
}