{
	"url": "https://www.novelupdates.com/series/my-darling-sick-beauty/",
	"title": "My Darling Sick Beauty - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/06/My-Darling-Sick-Beauty.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Drama   Romance   Xianxia   Yaoi   ",
	"tags": "Abusive Characters   Ancient Times   Appearance Different from Actual Age   Betrayal   Bloodlines   Calm Protagonist   Cold Protagonist   Cruel Characters   Cultivation   Curses   Death   Death of Loved Ones   Demon Lord   Demons   Depictions of Cruelty   Devoted Love Interests   Doting Love Interests   Fantasy Creatures   Fantasy World   First-time Interc**rse   Handsome Male Lead   Love at First Sight   Love Interest Falls in Love First   Love Rivals   Male Yandere   Mpreg   Multiple POV   Multiple Realms   Obsessive Love   Possessive Characters   Sickly Characters   Sword Wielder   Torture   Unique Cultivation Technique   Unrequited Love   Younger Love Interests   ",
	"rating": "(4.3 / 5.0, 92 votes)",
	"author": "Dao Xuan   道玄   ",
	"year": "\n2020",
	"ranking": "#2917   #2956   #3490   #2208   #2008   ",
	"reviewcount": "9 Reviews sorted by",
	"description": "He was once Head of the Immortal Sects. \n\nJiang Zheliu resisted the world’s destruction, protecting the people single-handedly. After losing all his spiritual energy, his hair turned white overnight. \n\nAll that remained was a millennium passed in vain, and a grave disease. \n\nHe distanced himself from the Cultivation World, went to Zhongnan Mountain to collect herbal medicines and grow flowers, as if to retire. \n\nUntil….. Those little demons he had once saved, his cherished juniors, even those devils that he had suppressed innumerable times, all came knocking at his door, each more excited than the next gripping his hand: \n\n“Qianbei, what type do you like? Can you not be so rigid on your requirements?” \n\nJiang Zheliu: “……？？？” \n\nWenren Ye is newly appointed Devil Lord of the Devil Realm. \n\nHe is cold-hearted, devilishly handsome, and when he was younger he suffered a humiliating defeat at the hands of a certain Head of the Immortal Sects. \n\nStill obsessed with this defeat, Wenren Ye hurried through the night to Zhongnan Mountain, but all he saw was white-haired weak Immortal Sects Leader, with droopy eyes, sick to the bone, with freshly coughed up blood staining his lips. \n\nHis obsession was still alive, but his heart was also thumping.>"
}