{
	"url": "https://www.novelupdates.com/series/the-other-side-of-the-last-boss/",
	"title": "The Other Side of the Last Boss - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2017/02/lastboss.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Comedy   Ecchi   Fantasy   Harem   Mature   Romance   School Life   Shounen   Slice of Life   ",
	"tags": "Adapted to Drama CD   Anti-social Protagonist   Antihero Protagonist   Appearance Different from Actual Age   Average-looking Protagonist   Awkward Protagonist   Beautiful Female Lead   Calm Protagonist   Carefree Protagonist   Clever Protagonist   Demon Lord   Dense Protagonist   Dungeons   Evil Gods   God Protagonist   Godly Powers   Hard-Working Protagonist   Heroes   Hiding True Abilities   Hiding True Identity   Humanoid Protagonist   Kingdoms   Knights   Love Interest Falls in Love First   Loyal Subordinates   Male Protagonist   Misunderstandings   Overpowered Protagonist   Popular Love Interests   R-15   Reincarnated in Another World   Royalty   Ruthless Protagonist   Secretive Protagonist   Servants   Sword And Magic   Underestimated Protagonist   ",
	"rating": "(3.3 / 5.0, 384 votes)",
	"author": "Amane Noir   天音のわる   ",
	"year": "\n2016",
	"ranking": "#2463   #2329   #652   #982   #626   ",
	"reviewcount": "31 Reviews sorted by",
	"description": "The short life of a 16-year old boy, who had a love of observation, ended after an accident, after which God appeared. The boy was a perfect candidate for a certain reincarnation, so he was asked if he wouldn’t mind doing so. The boy gave his consent, then reincarnated into another world. He reincarnated into the Evil God Ashtal. Just like in a game, once someone defeated the Last Boss, the Demon King, they would then be met with a bonus adversary, the overwhelmingly powerful Hidden Boss.\r\n\r\nHe spent 1,000 years observing the world through his magic.\r\n\r\nHey! Why hasn’t anyone made it here yet?! I’m supposed to be the Hidden Boss!\r\n\r\nFinally, Ashtal became bored out of his mind; and after a certain incident, he decided to attend school. Sometimes he has to beat down a demon that gets carried away with itself, and sometimes he has to become a bank president to counterattack a great nation that got carried away with itself. This is that kind of Evil God story.>"
}