{
	"url": "https://www.novelupdates.com/series/the-sweet-little-fulang/",
	"title": "The Sweet Little Fulang - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/09/The-Sweet-Little-Fulang_1664171025.jpg",
	"noveltype": "(CN)",
	"genre": "Slice of Life   Yaoi   ",
	"tags": "Ancient Times   Animal Rearing   Character Growth   Cute Children   Familial Love   Family   Family Business   Handsome Male Lead   Hard-Working Protagonist   Hunters   Mpreg   Pets   Poor Protagonist   Shy Characters   Timid Protagonist   Weak Protagonist   ",
	"rating": "(4.3 / 5.0, 20 votes)",
	"author": "Cha Chacha   茶查查   ",
	"year": "\n2022",
	"ranking": "#836   #599   #7431   #503   #8766   ",
	"reviewcount": "4 Reviews sorted by",
	"description": "Lu Gu got a marriage on behalf of his brother and married the fierce hunter in Qingxi Village. No matter how wronged he was, under the coercion of beatings, he was still put on the sedan chair. \n\nHow could the Shen family gave up on marrying such a ridiculous thing. After a tumultuous fight, Lu Gu was brought back to the Shen family. He was ready to tremble and seek life. \n\nWho knew that the days after marriage were far less difficult than he imagined, and he could even fill his stomach without having to be beaten. Shen Xuanqing also bought him chickens and ducklings, and built a fence in the backyard to raise chickens and ducks for him. Lu Gu squatted in the backyard and touched the chickens and ducks. After the panic, he was full of joy. Shen Xuanqing said that these were all his.\n\nFor the first time, Shen Xuanqing, who was about to go out was stopped by Lu Gu timidly, holding the corner of his clothes. He saw his little fulang showing a short and shy smile, handing over a small bag of fine flour cakes, saying that it was the food for him who was going into the mountains. \n\nShen Xuanqing was nibbling on the cakes expressionlessly in the mountains, but in his heart he was thinking that the little fulang was good and diligent. He looked good when he smiled, but he was too thin.>"
}