{
	"url": "https://www.novelupdates.com/series/a-world-worth-protecting/",
	"title": "A World Worth Protecting - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/04/AWWPv1.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Comedy   Xianxia   ",
	"tags": "Adapted to Manhua   Arrogant Characters   Artifact Crafting   Artifacts   Average-looking Protagonist   Cheats   Clever Protagonist   Confident Protagonist   Cultivation   Cunning Protagonist   Dreams   Fast Cultivation   Fast Learner   Fat Protagonist   Fearless Protagonist   Hard-Working Protagonist   Male Protagonist   Politics   Shameless Protagonist   Weak to Strong   ",
	"rating": "(3.5 / 5.0, 170 votes)",
	"author": "Er Gen   耳根   ",
	"year": "\n2018",
	"ranking": "#6970   #2000   #3109   #9698   #5432   ",
	"reviewcount": "30 Reviews sorted by",
	"description": "By the year 3029 CE, Earth's technology has developed rapidly, borders no longer exist, and Earth has been unified, marking the beginning of the era of the Federation.\r\n\r\nAt that time, a huge sword flew from the heavens, piercing the sun and causing a huge sensation on Earth.\r\n\r\nPerhaps because the scabbard of the sword was already in tatters, countless shards have broken off from it following the collision with the sun and spread across the universe. Many of these shards have landed on various places across Earth.\r\n\r\nWith the arrival of the bronze sword and its shards, a new unlimited energy source has suddenly appeared on Earth. This energy source has since been named Spirit Qi.\r\n\r\nSpirit Qi is like air, thick in some places and thin in others. As the Federation and other factions gather more shards, they discover more information on cultivation, pill refinement, Spirit Stone refinement, and other techniques. The words on the shards have an ancient feel to them, making it a trend for people to use ancient language.\r\n\r\nThe appearance of Spirit Qi rapidly makes the original energy sources obsolete and has completely changed people's lives. Not only has the Spirit Internet been formed, Spirit Qi has also changed the course of Human Civilization, causing the world to enter a civilization of cultivation. This would later come to be known as the Spirit Inception Era. >"
}