{
	"url": "https://www.novelupdates.com/series/expelled-from-a-black-magic-item-craftsman-guild-i-was-picked-up-as-a-royal-magician-but-it-was-too-late-when-i-realized-that-i-was-actually-the-highest-level-magician-in-the-kingdom-starting-a-hap/",
	"title": "Expelled From a Black Magic Item Craftsman Guild, I Was Picked up as a Royal Magician ~but It Was Too Late When I Realized That I Was Actually the Highest-Level Magician in the Kingdom. Starting a Happy Life Anew With Those Who Acknowledged Me in the Royal Court - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/08/Expelled-From-a-Black-Magic-Item-Craftsman-Guild-I-Was-Picked-up-as-a-Royal-Magician-but-It-Was-Too-Late-When-I-Realized-That-I-Was-Actually-the-Hig.jpg",
	"noveltype": "(JP)",
	"genre": "Adventure   Fantasy   Romance   ",
	"tags": "Dense Protagonist   Elemental Magic   Female Protagonist   Hard-Working Protagonist   Magic   Nobles   Protagonist Strong from the Start   Underestimated Protagonist   ",
	"rating": "(3.8 / 5.0, 55 votes)",
	"author": "Hazuki Shuusui   葉月秋水   ",
	"year": "\n2020",
	"ranking": "#92   #68   #3781   #142   #4826   ",
	"reviewcount": "No Reviews",
	"description": "After graduating from the prestigious magic academy, Noelle got a job at her hometown’s magic item craftsman guild to look after her sick okaa-san. Although her okaa-san safely recovered, her treatment at work continued to worsen due to prejudice and harassment of the guild master. In the end, she was called useless and was fired.\r\n\r\nIt was a friend from the academy days who came up and talk to Noelle, who was at her wit’s end looking for a job. Apart from being a royal magician, he was the youngest to have ever been promoted to sacred-gold-ranked magician. Now, that famous person told Noelle, “I want you, the only one whom I haven’t been able to win against in my life so far, to lend me your strength.” Thus, Noelle went to the royal capital and started working as a royal court magician.\r\n\r\nShe, who went towards the sun’s light, became an existence that attracted attention from the whole kingdom before she knew it——>"
}