{
	"url": "https://www.novelupdates.com/series/yingnu/",
	"title": "Yingnu - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/04/5c94e2ff54b8080c04c54b74.jpg",
	"noveltype": "(CN)",
	"genre": "Drama   Fantasy   Martial Arts   Mature   Romance   Yaoi   ",
	"tags": "Amnesia   Ancient China   Bodyguards   Character Growth   Death of Loved Ones   Devoted Love Interests   Different Social Status   Disfigurement   Fated Lovers   Flashbacks   Love Interest Falls in Love First   Lovers Reunited   Master-Servant Relationship   Misunderstandings   Older Love Interests   Past Plays a Big Role   Politics   Reincarnation   Royalty   Schemes And Conspiracies   Second Chance   Sentimental Protagonist   Tragic Past   Unrequited Love   ",
	"rating": "(4.2 / 5.0, 42 votes)",
	"author": "Fei Tian Ye Xiang   非天夜翔   ",
	"year": "\n2011",
	"ranking": "#6970   #2000   #7694   #7587   #4449   ",
	"reviewcount": "1 Review sorted by",
	"description": "Because of some coincidence, the leader of the imperial bodyguards who was supposed to be executed by “the death of a thousand cuts” —— the Yingnu, Xu Lingyun, became the Son of Heaven, Li Xiao’s storyteller, telling him the narrative inside “The Historical Records of Yu.” Alongside Xu Lingyun’s narratives, Emperor Chengzu, Li Qingcheng’s life story gradually appeared inside Li Xiao’s mind: his misfortune on the night of the Mid-Autumn Festival that made him have to leave the capital, the war against Xiongnus outside the Feng Pass, how he conquered the entire Western Plains without costing him a single soldier, the imposing army loyal to the rightful monarch's decisive battle on the capital…\n\nThe written and oral history gradually come to an end, while those secrets buried inside the history reappear one after another. Xu Lingyun’s unexpected real identity, Li Xiao’s confusing experience, Emperor Chengzu’s Yingnu, Zhang Mu and Li Xiao’s hidden connection… everything is quietly unveiled!\n\n————\n\nThe history and narrative intertwine. Xu Lingyun and Li Xiao pursue one another, looking for themselves. In the end, during this turbulent era, amidst the golden spears, armored horses, and numerous fire beacons, who can stay loyal to themselves? Who can stay true to the truth? Who will get to obtain the rivers and mountains? And who will get to open up a new era?>"
}