{
	"url": "https://www.novelupdates.com/series/since-my-engagement-has-been-annulled-im-going-to-live-freely/",
	"title": "Since My Engagement has Been Annulled, I’m Going to Live Freely! - Novel Updates",
	"image": "https://www.novelupdates.com/img/noimagefound.jpg",
	"noveltype": "(JP)",
	"genre": "Comedy   Drama   Fantasy   Romance   Shoujo   Slice of Life   ",
	"tags": "Aristocracy   Beautiful Female Lead   Broken Engagement   Business Management   Businessmen   Calm Protagonist   Cute Story   Dense Protagonist   European Ambience   Female Protagonist   First-time Interc**rse   Handsome Male Lead   Kind Love Interests   Knights   Late Romance   Love at First Sight   Love Interest Falls in Love First   Magic   Marriage   Restaurant   Strong Love Interests   Sword And Magic   ",
	"rating": "(3.8 / 5.0, 31 votes)",
	"author": "Touma Riko   当麻リコ   ",
	"year": "\n2021",
	"ranking": "#2000   #6369   #5278   #7148   #7737   ",
	"reviewcount": "7 Reviews",
	"description": "Flores was suddenly forced to annul her engagement.\n\nShe was just about to marry a duke’s son.\n\nHowever, her fiancé, Ricardo, declared their engagement broken while also saying, “I don’t need you anymore, I already found a new fiancée.” with an arrogant attitude. The man showed no hint of sadness or regret.\n\n“I don’t love you, either.”\n\nNevertheless, Ricardo was stunned by what Flores had to say next.\n\nFlores had a stern look.\n\nAfter all, she was merely pretending to be in love with him, and was even trying to cheat on him.\n\n“Since the annulment of the engagement is established, I want my alimony!”\n\nRicardo, who was demanded such, couldn’t refuse.\n\nFlores, who became free of her obligations, received her alimony and made her dream of running a café come true…\n\n…Then, a year later.\n\nA noble young man visited Flores’ shop.\n\nHe had sharp eyebrows, while his eyes were strict and honest.\n\nHe looked like the hero of a story.\n\n“Flores?” He inquired.\n\nShe didn’t even recall knowing him. But for some reason, he knew about Flores, and was looking for her.>"
}