{
	"url": "https://www.novelupdates.com/series/blooming-flowers-silent-sorrow/",
	"title": "Blooming Flowers, Silent Sorrow - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/09/wKgKm1uXsIvS-J8bAAbsQeE7XUM772.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Comedy   Drama   Yaoi   ",
	"tags": "Adapted to Drama CD   Bisexual Protagonist   Cold Love Interests   Cute Protagonist   Family Business   First-time Interc**rse   F*llatio   Handsome Male Lead   H*ndjob   Love at First Sight   Male Yandere   Mysterious Family Background   Obsessive Love   Possessive Characters   Protagonist Falls in Love First   R*pe   Schemes And Conspiracies   Secret Identity   Secrets   S*xual Abuse   Shameless Protagonist   Wealthy Characters   Younger Love Interests   ",
	"rating": "(4.2 / 5.0, 31 votes)",
	"author": "Shui Qian Cheng   水千丞   ",
	"year": "\n2010",
	"ranking": "#2000   #2000   #7660   #8369   #5288   ",
	"reviewcount": "5 Reviews sorted by",
	"description": "The son of the wealthiest man along the Jiangnan region falls in love with an icy white-clothed “beauty” due to an unexpected meeting, but the true identity of this “beauty” is actually...\n\nHandsome and distinguished with an outstanding temperament: Jin Xiao Bao is not fated to be described as such. But as the Young Master of the great Jin family, who is funny, considerate and generous, he would be a good match even if the other person was the emperor’s daughter!\n\nThe pitiful round and plump Jin Xiao Bao, whose marriage proposals have all failed; just when multiple doors have closed repeatedly for this little fatty, he actually coincidentally picked up a fairy on this very night?! Gazing at those incomparably beautiful features, staring at that imposing, cool as an iceberg manner, – dad~ mom~ your son has found his wife!\n\nBut this future wife, the young lady Huai En, seems to have aroused a lot of enmity. Once again on another dark and windy moonless night, a bloody night, a heavily injured Huai En was tainted by aphrodisiac from the enemy. – Such a good opportunity for the handsome hero to save the beauty! The Young Master of the Jin family who made his glorious debut, was actually valiantly pushed down by the “wife”?!>"
}