{
	"url": "https://www.novelupdates.com/series/the-system-for-mentoring-villain-bosses/",
	"title": "The System for Mentoring Villain Bosses - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/09/Untitled.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Drama   Romance   School Life   Slice of Life   Supernatural   ",
	"tags": "Abusive Characters   Beautiful Female Lead   Child Abuse   Childcare   Cooking   Cute Children   Doting Parents   Female Protagonist   Handsome Male Lead   Love Interest Falls in Love First   Male Yandere   Manipulative Characters   Modern Day   Possessive Characters   Pragmatic Protagonist   System Administrator   Transmigration   ",
	"rating": "(4.1 / 5.0, 113 votes)",
	"author": "Shanhu Shu   珊瑚树   ",
	"year": "\n2018",
	"ranking": "#2566   #1503   #1225   #2778   #1287   ",
	"reviewcount": "16 Reviews sorted by",
	"description": "Ever since Su Tian had transmigrated, she received a “Villain Bosses Mentoring System” that could automatically identify villainous bosses IN THE MAKING.\r\n\r\nAs for her missions, they were a little more complicated. For example:\r\n\r\nStopping the boy in her class from deviating onto the path of becoming a villain;\r\n\r\nTurn the boy who was going to create a global financial crisis into Jack Ma of the new world;\r\n\r\nTalk the strange girl working at the toy shop out of her spending habit, because she will be the cause of hyperinflation!\r\n\r\nAnd the boy from the countryside that she ran into, please give up on developing bioweapons! Why don’t you focus on the Nobel Prize instead?\r\n\r\nJust when Su Tian thought all the little villains were growing straight up into upstanding people under her “education of love”, the small villains brought about a big villain…\r\n\r\nThe young man has slender arms and legs and he cornered her into the restroom. He looked deeply into her eyes said, “I also need …”\r\n\r\nSu Tian shuddered, “What… what do you need?”\r\n\r\n“The education of love,” said the young man meaningfully!\r\n\r\nTen minute later, Su Tian… was educated.\r\n\r\nSystem: This system is only responsible for identifying villains IN THE WORK. Matured villain are outside of its parameters.>"
}