{
	"url": "https://www.novelupdates.com/series/the-legendary-masters-wife/",
	"title": "The Legendary Master’s Wife - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2016/02/2016-02-25-15-09-51-1302440488.jpeg",
	"noveltype": "(CN)",
	"genre": "Action   Adult   Adventure   Comedy   Drama   Fantasy   Mature   Romance   Xuanhuan   Yaoi   ",
	"tags": "Academy   Adapted to Manhua   Alchemy   Ancient Times   Beast Companions   Bickering Couple   Black Belly   Blackmail   Bloodlines   Cultivation   Cute Protagonist   Demons   Devoted Love Interests   Doting Love Interests   Fast Cultivation   First-time Interc**rse   Genius Protagonist   Handsome Male Lead   Hard-Working Protagonist   Heavenly Tribulation   Herbalist   Hidden Abilities   Human-Nonhuman Relationship   Love Interest Falls in Love First   Lucky Protagonist   Magical Space   Money Grubber   Multiple Realms   Naive Protagonist   Older Love Interests   Outdoor Interc**rse   Past Plays a Big Role   Phoenixes   Pill Concocting   Possessive Characters   Power Couple   Secret Identity   Secret Organizations   S*xual Cultivation Technique   Soul Power   Straight Uke   Strong Love Interests   Strong to Stronger   Transmigration   Transported to Another World   Tsundere   Underestimated Protagonist   Weak to Strong   ",
	"rating": "(4.3 / 5.0, 1676 votes)",
	"author": "Yin Ya   尹琊   ",
	"year": "\n2013",
	"ranking": "#331   #180   #83   #105   #56   ",
	"reviewcount": "351 Reviews sorted by",
	"description": "After an explosion, You XiaoMo finds that he is now a probationary disciple of the TianXin sect. However, he is one with dubious potential, so just when he starts to adapt to his new circumstances, he receives a piece of bad news. If he is unable to produce the required result after half a year to become an official disciple of the TianXin sect, he would be driven out of the sect.\n\nWhile You XiaoMo is going all out to make medicines and earn money, he runs into Ling Xiao. To his horror, he later discovers that Ling Xiao is actually someone cloaked in human skin.>"
}