{
	"url": "https://www.novelupdates.com/series/mobile-magical-girl-corporation-lulurun-even-if-ive-become-a-magical-girl-i-will-definitely-start-my-own-business-in-another-world/",
	"title": "Mobile Magical Girl Corporation Lulurun: Even If I’ve Become A Magical Girl, I Will Definitely Start My Own Business In Another World - Novel Updates",
	"image": "https://www.novelupdates.com/img/noimagefound.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Comedy   Fantasy   Gender Bender   Mecha   Shoujo Ai   ",
	"tags": "Discrimination   Enemies Become Allies   Enemies Become Lovers   Fantasy World   Magical Girls   Magical Technology   Reincarnated in Another World   Sword And Magic   Witches   ",
	"rating": "(3.7 / 5.0, 17 votes)",
	"author": "うどん粉   ",
	"year": "\n2021",
	"ranking": "#1645   #4209   #6415   #4538   #9112   ",
	"reviewcount": "1 Review sorted by",
	"description": "The world’s strongest wizard uses his magical power to start a business in his 30’s, but the source of magical power has disappeared from the world and people can no longer use magic!?\r\n\r\nRobbed of their spells, the wizards can do nothing but despair.\r\n\r\nNaturally, Keisuke’ Yokoi’s company which relied on magic went bankrupt …\r\n\r\nAlone, betrayed, and abandoned by both his employees and his partner companies, all that remains is the mascot character Lulurun and the robot he was developing, the 1/60th scale figure that moves with magical power “Mobile Magic Knight Excaliburn.”\r\n\r\nWith emptiness in his heart, Yokoi Keisuke, is alone at the crossroads outside of his empty office. On his way home, he is stabbed by an unexpected person with a knife and is doomed!!\r\n\r\nBetrayed by both people and the world, Yokoi Keisuke hears the voice of the mascot character Lulurun as he is dying for some reason…\r\n\r\n“It’ll be fine, just leave it to Lulurun.”\r\n\r\nHe loses consciousness and when he comes to, he finds himself in a strange world.\r\n\r\nThis was a dreamlike place full of magical power where he could use his spells again.\r\n\r\nIn this new world, Yokoi Keisuke vows to revive his dream now that it’s in reach once more, but he feels a terrible sense of discomfort in his body.\r\n\r\nFor some reason, his body was the company’s mascot character, “Lulurun”!!\r\n\r\nWhile suffering from his changed appearance and problematic employees…\r\n\r\nYokoi Keisuke reboots (or rather starts) a business in another world.\r\n\r\nA Battle Fantasy Romantic Comedy weaved with magical girls, companies, machines, and swords>"
}