{
	"url": "https://www.novelupdates.com/series/the-blackened-male-god-always-wants-to-set-a-routine-for-me/",
	"title": "The Blackened Male God Always Wants To Set A Routine For Me - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/03/setaroutine1a.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Romance   School Life   Sci-fi   Supernatural   Xianxia   ",
	"tags": "Amnesia   Ancient China   Appearance Different from Actual Age   Beast Companions   Beautiful Female Lead   Calm Protagonist   Clingy Lover   Cold Protagonist   Demons   Dense Protagonist   Fantasy World   Fated Lovers   Female Protagonist   Gate to Another World   God Protagonist   Gods   Handsome Male Lead   Hidden Abilities   Lazy Protagonist   Loner Protagonist   Love Interest Falls in Love First   Male Yandere   Misunderstandings   Modern Day   Multiple Realms   Naive Protagonist   Obsessive Love   Past Trauma   Pets   Possessive Characters   Power Struggle   Protagonist Strong from the Start   Royalty   R*pe   Saving the World   Schemes And Conspiracies   Secrets   S*xual Abuse   Strong to Stronger   System Administrator   Transmigration   Unconditional Love   Weak to Strong   World Hopping   ",
	"rating": "(4.2 / 5.0, 136 votes)",
	"author": "秦原   ",
	"year": "\nN/A",
	"ranking": "#3314   #3534   #1418   #885   #1978   ",
	"reviewcount": "32 Reviews sorted by",
	"description": "Her system said that if she wants to get back her godhead, she has to fulfill the male lead’s wish. As a result, she started the long road of attacking the male lead. \n\nThe young boy’s eyes were sad: “You can only like me alone.” \n\nThe sick prince’s eyes were faint: “You said you will stay with me for a lifetime.” \n\nThe evil phantom emperor: “Little Su Yan, come here, my dear.”\n\nSu Yan felt tangled. She just wanted to find her own godhead, how did she get tangled up?\n\nSeeing that the look of the man in front was wrong, she immediately changed her words. “Yes, yes, all for you, I like you the most!” \n\nThe man was covered in blood, and approached step by step, muttering: “You said, you will stay with me, and you will never leave.” \n\nSu Yan coaxed: “Well, I listen to you, let’s wipe this blood first, don’t scare others?”>"
}