{
	"url": "https://www.novelupdates.com/series/on-the-day-i-ascended-the-throne-i-found-out-that-i-was-the-villain/",
	"title": "On the Day I Ascended the Throne, I Found Out That I Was the Villain - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/09/On-the-day-I-ascended-the-throne-I-found-out-that-I-was-the-Villain.jpg",
	"noveltype": "(CN)",
	"genre": "Fantasy   Historical   Shoujo Ai   Yuri   ",
	"tags": "Abandoned Children   Ancient Times   Beautiful Female Lead   Chat Rooms   Empires   Kingdom Building   ",
	"rating": "(4.0 / 5.0, 4 votes)",
	"author": "Xiaomeng Hallucinations   晓梦致幻生   ",
	"year": "\n2022",
	"ranking": "#789   #678   #12433   #7856   #13027   ",
	"reviewcount": "1 Review sorted by",
	"description": "Her Majesty ascended the throne at the age of nine.\n\nThere is only one problem. Occasionally, she will suddenly talk to herself, laugh or lose her temper. The ministers discuss it in private, that this may be a disease in the brain.\n\nBut Her Majesty is a good Majesty, so no one said anything.\n\n*\n\nUntil the Lantern Festival that year, Luo Qionghua, the 12-year-old daughter of the Duke of England, went to the palace for a banquet, and met Her Majesty under the lanterns. She was innocent and blurted out:\n\n“Are you the majesty with a sick mind?”\n\nFu Ping’an: “Do you say it again?”\n\nAt this time, the live broadcast barrage—— [Hahahahahahahahahahahahahahaha; the little emperor should scold her and drag her down quickly.]\n[The upstairs is too cruel, such a delicate beauty, alas.]\n[Can you put it in the harem, little emperor? 】\n\nJust kidding, how could she add such a bearish little girl to her harem.\n\n* \n\nLater, Taifu Yu told her that foreign relatives were involved in politics, the southern barbarians were in turmoil, and the Rong and Di were fierce. In order to stabilize the government and the opposition, it was best to appoint a queen—“The daughter of the British Duke is not bad, I heard that she is a beauty.”\n\nFu Pingan: “…”\n\nOn the wedding night, the hijab was lifted, and the barrage said – [Is this Queen Luo, the book says that it was because of her that the prince regent rebelled. ]\n\nFu Ping’an: I can’t believe it, I was shocked.\n\nAfter a long period of love, Fu Ping’an was always worried, and one day she couldn’t help but ask the Empress -“Prince Regent Yingwu, I’m afraid she’s not as good as me?” \n\nThe Queen smiled sweetly: “Prince Regent is indeed heroic, but this one is a concubine and likes beautiful women.”\n\n*\n\nThis is probably a story about a arrogant little emperor in a novel who has a live broadcast system and is trained by modern people to become an emperor with modern ideas.>"
}