{
	"url": "https://www.novelupdates.com/series/picking-up-stars/",
	"title": "Picking Up Stars - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/09/Picking-Up-Stars.jpg",
	"noveltype": "(CN)",
	"genre": "Romance   School Life   Shounen Ai   Slice of Life   Yaoi   ",
	"tags": "Character Growth   Cold Love Interests   Cold Protagonist   College/University   Complex Family Relationships   Couple Growth   Family Conflict   Friendship   Handsome Male Lead   Heartwarming   Manly Gay Couple   Modern Day   Past Trauma   Slow Romance   ",
	"rating": "(4.1 / 5.0, 16 votes)",
	"author": "Bu Wen San Jiu   Not Asking If It's Three Or Nine   不问三九   ",
	"year": "\n2019",
	"ranking": "#3314   #2562   #10810   #12116   #8252   ",
	"reviewcount": "2 Reviews sorted by",
	"description": "Qin Fang was one of the most handsome guys in C National University. His visuals were impeccable, but, the problem was, he was a great troublemaker, and knew how to fight. \r\n\r\nXing Yan was a stellar student in the Chemistry Institute, but his temperament was cold and introverted, and he communicated little with others. The first time he met Qin Fang, the two forcefully rammed their shoulders into each other. When their four eyes met, both knew that the other was not any good person. \r\n\r\nQin Fang jokingly flirted with Xing Yan, saying, 'I’m Qin Fang, sophomore in Global Commerce. You can come find me any time, your Fang Ge will wait for you.'\r\n\r\nLater, on a quiet evening, Xing Yan was smoking on the balcony. Qin Fang used his legs as a pillow, his expression containing a little embarrassed smile as he pointed to the evening sky and said, 'Actually, Qin Fang was a name I changed myself, my original name was… Jian Xingxing*.'\r\n\r\nFrom then on, I was not afraid of even the darkest nights, since I could just raise my head to see stars. \r\n\r\n*T/n: The novel name, in chinese pinyin, is Jian Xing Xing (捡星星) while the mentioned original name of the character is Jian Xingxing (简星星). However, the '捡(jian)' in the title means to pick up, while this 简 (jian) is a surname. The same two characters that follow are xing (星), meaning star. \r\n>"
}