{
	"url": "https://www.novelupdates.com/series/galaxy-shattering-blade/",
	"title": "Galaxy Shattering Blade - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2016/02/x.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Martial Arts   Mystery   School Life   Sci-fi   Tragedy   Xuanhuan   ",
	"tags": "Aliens   Calm Protagonist   Character Growth   Determined Protagonist   Familial Love   Futuristic Setting   Hidden Abilities   Male Protagonist   Mysterious Illness   Past Plays a Big Role   Siblings Not Related by Blood   Strength-based Social Hierarchy   ",
	"rating": "(3.9 / 5.0, 38 votes)",
	"author": "Zhu Xiao Xiao   猪小小   ",
	"year": "\nN/A",
	"ranking": "#2000   #2000   #9534   #9890   #7585   ",
	"reviewcount": "4 Reviews sorted by",
	"description": "65 million years ago, Earth was ruled by all sorts of dinosaurs—from big to small.\n\nIn the Quaternary Period of the Cenozoic Era, humans became the Earth’s rulers.\n\nUnfortunately, a great deal of humans from their birth to death can only make use of 3-5% of their brain. This is an incredible waste. The human brain has unlimited potential to be unearthed. As the depth of brain region increases, mankind can become smarter, become stronger.\n\nSlowly, mankind began to re-examine themselves, re-examine the brain, and come up with all the ways to unearth their potential…\n\nBut, this all came too late. 2100 BCE, the 6th global extinction arrived.\n\n   ……\n\n“Lin Feng, 17 years old. Depth of brain region: 5.00%, 10th rank.” The examiner’s icy voice resounded.\n\nWarring Era, 101st year. A brand new, future world. An era of science and technology that reexamines the human body’s potential. Lin Feng, who was on the brink of becoming a genetic warrior, experienced an extremely weird “brain region degeneration”. His brain region depth fell from 9.95% back to the starting point.\n\n......\n\nLin Feng used to be a genius, towering above everyone else. However, due to an unfortunate accident, he fell to the very bottom. Yet, he was undeterred and continued to work hard so that one day he could reach his brother, and fulfill the oath they made together.  >"
}