{
	"url": "https://www.novelupdates.com/series/outrageous/",
	"title": "Outrageous - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/06/Outrageous.jpeg",
	"noveltype": "(CN)",
	"genre": "Comedy   Drama   Romance   Yuri   ",
	"tags": "Acting   Beautiful Female Lead   Caring Protagonist   Celebrities   Clingy Lover   Devoted Love Interests   Female Protagonist   Loneliness   Love Interest Falls in Love First   Modern Day   Popular Love Interests   Showbiz   System Administrator   Tragic Past   Transmigration   Wealthy Characters   ",
	"rating": "(4.2 / 5.0, 135 votes)",
	"author": "热到昏厥   ",
	"year": "\n2021",
	"ranking": "#740   #724   #4254   #1164   #8082   ",
	"reviewcount": "13 Reviews sorted by",
	"description": "Lu Zhi Wei is an often overlooked person. Her father didn’t dote on her, and her mother didn’t love her. She lived alone till now. Her sense of existence was so diminished to the point that even if someone had accidentally bumped into her, that person might not even realise they bumped into someone.\r\n\r\nHer life was simply tragic and absurd.\r\n\r\nUntil one day, a “male protagonist halo” crashed onto her head, and her life flipped upside down. Along with it, came something called a system. The system requested for her to immediately become a protagonist, doing everything the male lead should do and making it a perfect world.\r\n\r\nLu Zhi Wei: ?\r\n\r\nLu Zhi Wei: Ridiculous, I’m a woman!\r\n\r\nSystem that refuses to listen: I don’t care. If the mission isn’t completed, I’ll give you an electric shock.\r\n\r\nLu Zhi Wei who’s fearful of pain: Okay bro, no problem bro.\r\n\r\nBut as the missions went on, they discovered something was wrong.\r\n\r\nThe female lead, she——\r\n\r\nCompletely! Didn’t! Follow! The! Script!\r\n\r\nSystem: ?\r\n\r\nOptimistic Lu Zhi Wei: Look on the bright side. I can even become the male lead, so what if the female lead is a bit rebellious?\r\n\r\nSystem: I can’t bloody look on the bright side……\r\n\r\nThis kind of female lead with incredible dodging skills was too ridiculous!!\r\n\r\nIn the end, the rebellious and ridiculous female lead finally followed a plot point. She fell in love with the “male lead”.>"
}