{
	"url": "https://www.novelupdates.com/series/poison-doctor-mother-baby/",
	"title": "Poison Doctor Mother Baby - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/10/Poison-Doctor-Mother-Baby.jpg",
	"noveltype": "",
	"genre": "Fantasy   Romance   Xuanhuan   ",
	"tags": "Artifacts   Childcare   Cultivation   Doctors   Female Protagonist   Magical Space   Modern Knowledge   Poisons   Pregnancy   Transmigration   ",
	"rating": "(3.8 / 5.0, 6 votes)",
	"author": "Su Qing'er   ",
	"year": "\nN/A",
	"ranking": "#2000   #2000   #12610   #12620   #12028   ",
	"reviewcount": "No Reviews",
	"description": "Death Su; The top killer of the top terrorist organization in the world. A meticulously designed accident transmigrates the soul of this legendary character… \r\n\r\nSu Ruoxi is the third daughter of the royal family in The Land of the Dancing Phoenix's Kingdom of the Heavenly Phoenix. She is born a cripple with an ugly face and is a fool. She has been bullied since she was young and is eventually pushed down the cliff by her two sisters… \r\n\r\nWhen she wakes up again, her soul has been swapped. When the soul of the strong enters the body of the weak, the entire Land of the Dancing Phoenix will be in turmoil! \r\n\r\nCultivation? She possesses a heaven-defying physique. She could even absorb Mystique Energy while lying down! \r\n\r\nAlchemy? She can simply circle the forest with a baby in tow and end up contracting a cute beast. After eating the herbs, it shits out elixirs! \r\n\r\nArtifact refinement? On the way, she saves an adorable person who has zero sense of direction who happens to be a genius in artifact refinement. He ends up acknowledging her as his master because she was willing to lead the way for him… \r\n\r\nHe is a devilishly handsome man with unparalleled flirtatiousness! On the surface, he is the cold and cruel prince of the Kingdom of the Heavenly Phoenix, but in reality, he is the master of a mysterious faction… \r\n\r\nWhen they first meet, she pinns him beneath her and treats him as the antidote, but she does not even look at him. She only takes away his money without knowing who he is. \r\n\r\nWhen they meet again, she wins all his money at his casino. By the time he arrives, she has already emptied his vault… \r\n\r\nSix years later \r\n\r\nShe lifts her veil, revealing her ravishing face… \r\n\r\nShe has thrown entire countries into blood baths and blossomed with grace… \r\n\r\nThere is someone who is heartbroken and waits for her until his hair goes snow-white… \r\n\r\nSomeone is protecting her silently and dying for her… \r\n\r\nThe female protagonist is powerful, cold, beautiful, and twisted. She doesn't stir up trouble, not because she is afraid of trouble, but because she hates trouble. If you don't offend me, I won't offend you. If you offend me, I'll uproot you. \r\n\r\nThe male protagonist is scheming, powerful and cold. The ending is one-to-one.>"
}