{
	"url": "https://www.novelupdates.com/series/after-school-at-a-family-restaurant-at-night-with-that-girl-from-my-class/",
	"title": "After School, at a Family Restaurant at Night, With That Girl From My Class - Novel Updates",
	"image": "https://www.novelupdates.com/img/noimagefound.jpg",
	"noveltype": "(JP)",
	"genre": "Drama   Romance   School Life   ",
	"tags": "Beautiful Female Lead   Complex Family Relationships   Male Protagonist   Modern Day   R-15   ",
	"rating": "(4.1 / 5.0, 17 votes)",
	"author": "Hidari Ryuu   左リュウ   ",
	"year": "\n2022",
	"ranking": "#278   #267   #9399   #1515   #10827   ",
	"reviewcount": "2 Reviews sorted by",
	"description": "Narumi Kouta was a second-year high school student. His mother remarried, and along with his new father, he now had a talented step-sister. Unable to adjust to his new life, he took a part-time job to escape from his new family and spent his time at a family restaurant until the last minute on his way home.\r\n\r\nOne day, Kouta noticed that there was another student who was killing time at a certain seat at a certain time, just like him. Her name was Kazemiya Kohaku. She was a celebrity at Hoshimoto Gakuen High School, where Kota attended. She had the same beauty that rivaled that of the popular idol sister, but unlike that sister, she was a cool beauty who kept people away from her.\r\n\r\nAlthough they were both aware of each other's presence, they never came into contact with each other. One day, however, when the restaurant was crowded, Kouta happened to be shown to a seat next to Kohaku. Furthermore, a phone call came in from his family member. When he finished that call, Kohaku started talking to him…\r\n\r\n“...Narumi, are you also having a hard time staying home?”\r\n\r\nTheir relationship began as “just killing time together at a family restaurant at night.” At first, it was supposed to be just that.\r\n\r\n“Hey, we're surprisingly......” “We're very much alike. In more ways than one.”\r\n\r\n–As they spend time together, they gradually begin to be attracted to each other.>"
}