{
	"url": "https://www.novelupdates.com/series/the-villainess-lives-twice/",
	"title": "The Villainess Lives Twice - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/06/The-Villainess-Lives-Twice.jpg",
	"noveltype": "(KR)",
	"genre": "Drama   Fantasy   Romance   ",
	"tags": "Abusive Characters   Adapted to Manhwa   Antihero Protagonist   Aristocracy   Assassins   Beautiful Female Lead   Calm Protagonist   Clever Protagonist   Cold Protagonist   Complex Family Relationships   Cunning Protagonist   Death   Depictions of Cruelty   Depression   Enemies Become Lovers   European Ambience   Female Protagonist   First-time Interc**rse   Handsome Male Lead   Kind Love Interests   Kingdoms   Magic   Maids   Manipulative Characters   Marriage   Marriage of Convenience   Multiple Reincarnated Individuals   Murders   Nobles   Past Plays a Big Role   Past Trauma   Politics   Power Struggle   Pregnancy   Proactive Protagonist   Reincarnation   Religions   Revenge   Royalty   Saints   Schemes And Conspiracies   Second Chance   S*xual Abuse   Slow Romance   Smart Couple   Strong Love Interests   Torture   Tragic Past   Villainess Noble Girls   ",
	"rating": "(4.5 / 5.0, 198 votes)",
	"author": "HAN Mint   ",
	"year": "\n2018",
	"ranking": "#2053   #290   #1038   #1802   #470   ",
	"reviewcount": "43 Reviews sorted by",
	"description": "A genius schemer, creating an emperor!\n\n“Only when your brother is happy can you be happy.”\n\nShe committed all kinds of evil deeds to make him Emperor. However, Artezia’s devotion was repaid with betrayal. It was the Grand Duke Cedric, a righteous enemy, that gave her a hand of salvation at the threshold of death.\n\n“Devise a plan.”\n“…”\n“I can’t think of anyone but you who can reverse this situation. Marquess Rosan.”\n“…”\n“Lend me your strength.”\n\nThere is no plan that can reverse the already declining power and save the fallen empire. However, there is a method. To turn back time before everything went wrong.\n\nWith tears of blood she sacrificed her body to an ancient magic. This time, she will not fall.\n\nArtezia, who returned to the age of 18 before death, resolved to become a villainess for the Grand Duke Cedric.\n\n“Please give me your hand in marriage. I’ll make you emperor.”\n\nIn exchange for kneeling to the devil, the devil shall dirty her hands for you.>"
}