{
	"url": "https://www.novelupdates.com/series/my-crown-princess-comes-from-the-earth/",
	"title": "My Crown Princess Comes from the Earth - Novel Updates",
	"image": "https://www.novelupdates.com/img/noimagefound.jpg",
	"noveltype": "(CN)",
	"genre": "Adventure   Comedy   Mecha   Romance   Sci-fi   Yaoi   ",
	"tags": "Academy   Apocalypse   Arranged Marriage   Carefree Protagonist   Childish Protagonist   Cultivation   Cute Children   Cute Protagonist   Death of Loved Ones   Dense Protagonist   Empires   Enemies Become Allies   Familial Love   Friendship   Genius Protagonist   God Protagonist   Heartwarming   Lack of Common Sense   Living Alone   Loneliness   Love at First Sight   Love Interest Falls in Love First   Military   Misunderstandings   Mpreg   Mysterious Family Background   Mysterious Past   Omegaverse   Overpowered Protagonist   Past Plays a Big Role   Past Trauma   Protagonist Strong from the Start   Rebellion   Reincarnated in Another World   Revenge   Royalty   Saving the World   Soldiers   Strong Love Interests   Teamwork   Tragic Past   Transmigration   Unconditional Love   Wars   World Travel   Zombies   ",
	"rating": "(3.4 / 5.0, 37 votes)",
	"author": "紫色木屋   ",
	"year": "\n2015",
	"ranking": "#5262   #6290   #7141   #10477   #7535   ",
	"reviewcount": "2 Reviews sorted by",
	"description": "The Crown Prince of the Sodir Empire was engaged to a criminal who had been exiled.\n\nShingen Oreste, the Crown Prince of the Sodir Empire, graduated from the military academy with superior grades. He was a true Alpha with mighty superpowers.\n\nIn the gene pool of the Sodir Empire, there was no gene perfect enough to match Shingen’s, except for one exiled prisoner, the son of a fallen nobleman, Lian Nuo.\n\nLian Nuo had no superpowers and was a Beta with a low pregnancy rate. He was abandoned by his ex-lover and was exiled for committing a felony in out of his jealousy.\n\nHowever, all this changed when the last surviving human on Earth transmigrated into Lian Nuo’s body…\n\nThe Noble Crown Prince x The Humble Criminal. How will they bring their love to fruition?>"
}