{
	"url": "https://www.novelupdates.com/series/my-disciple-died-yet-again/",
	"title": "My Disciple Died Yet Again - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2015/10/t7_562994.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Comedy   Drama   Fantasy   Josei   Martial Arts   Romance   Xianxia   ",
	"tags": "Adapted to Drama   Adapted to Manhua   Appearance Changes   Appearance Different from Actual Age   Beast Companions   Beasts   Bloodlines   Calm Protagonist   Cheats   Confident Protagonist   Crafting   Cultivation   Death   Death of Loved Ones   Demonic Cultivation Technique   Demons   Devoted Love Interests   Dragons   Elemental Magic   Fast Cultivation   Female Protagonist   Female to Male   Game Elements   Gods   Handsome Male Lead   Heartwarming   Heavenly Tribulation   Human-Nonhuman Relationship   Interdimensional Travel   Jack of All Trades   Lack of Common Sense   Lost Civilizations   Magic   Magic Beasts   Magic Formations   Male to Female   Male Yandere   Master-Disciple Relationship   Misunderstandings   Modern Knowledge   Multiple Identities   Multiple Realms   Naive Protagonist   Non-humanoid Protagonist   Phoenixes   Proactive Protagonist   Strong Love Interests   Transported to Another World   Unique Weapons   Weak to Strong   ",
	"rating": "(4.6 / 5.0, 1597 votes)",
	"author": "Mrs. Ago   Yóu qián   尤前   ",
	"year": "\n2014",
	"ranking": "#3017   #3131   #340   #275   #54   ",
	"reviewcount": "190 Reviews sorted by",
	"description": "Game designer Zhu Yao accidentally gets transmigrated into a new xianxia VR game that is currently in development. There she becomes the disciple of the most beautiful male immortal Yu Yan who had to wait 16 thousand years before finally getting a disciple of his own. Yu Yan carefully teaches Zhu Yao and cherishes her a lot. But when Zhu Yao finally begins to understand some of his teachings, she suddenly dies. Yu Yan then gets a new disciple, the reborn Zhu Yao, and she dies again. He then gets another disciple, and she dies once again…>"
}