{
	"url": "https://www.novelupdates.com/series/seirei-gensouki-konna-sekai-de-deaeta-kimi-ni/",
	"title": "Seirei Gensouki ~Konna Sekai de Deaeta Kimi ni~ - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/04/seigensou-v1-cvr.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Drama   Fantasy   Harem   Martial Arts   Romance   Shounen   ",
	"tags": "Academy   Adapted to Anime   Adapted to Drama CD   Adapted to Manga   Age Progression   Androgynous Characters   Beautiful Female Lead   Bullying   Calm Protagonist   Childhood Friends   Childhood Love   Childhood Promise   Clever Protagonist   Death of Loved Ones   Demi-Humans   Demons   Discrimination   Dragons   Elves   Fantasy Creatures   Handsome Male Lead   Hard-Working Protagonist   Heroes   Hiding True Identity   Kingdoms   Knights   Loli   Maids   Male Protagonist   Modern Knowledge   Monsters   Multiple Reincarnated Individuals   Multiple Transported Individuals   Nobles   Orphans   Overpowered Protagonist   Politics   Polygamy   Previous Life Talent   R-15   Reincarnated in Another World   Revenge   Royalty   Siblings   S*aves   Spirits   Stoic Characters   Strong to Stronger   Sword And Magic   Tragic Past   Transported to Another World   Underestimated Protagonist   Younger Sisters   ",
	"rating": "(3.3 / 5.0, 652 votes)",
	"author": "Kitayama Yuri   北山結莉   ",
	"year": "\n2014\r\n",
	"ranking": "#4265   #2000   #193   #1094   #169   ",
	"reviewcount": "114 Reviews sorted by",
	"description": "Amakawa Haruto died before he'd the chance to reunite with his childhood friend who disappeared five years ago. Rio, a young boy living in the slums seeks revenge for his mother who was murdered in cold blood in front of him when he was only five years of age.\r\n\r\nThere exists the earth many knows of and there exists an alternate world. Two people, each with their own backgrounds and values. For odd reasons, the memories and personality of Haruto, one who should have died resurrects in Rio's body. As the two are confused over their memories and personality fusing together, Rio (Haruto) decides to live in this new world.\r\n\r\nAlong with Haruto's memories, Rio awakens an unknown but special power. If he's to use it, it looks as if he can live a better life, but before that, Rio encountered a kidnapping which results in involving the two princesses of the Bertam Kingdom.\r\n\r\nAfter saving the princesses, Rio is given a scholarship to attend the Royal Academy, a school for the rich and powerful. His background being a poor orphan who once lived in the slums, the school full of nobles was rather a detestable place to stay at.>"
}