{
	"url": "https://www.novelupdates.com/series/the-little-duchess-home-tutor/",
	"title": "The Little Duchess’ Home Tutor - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/08/The-Little-Duchess-Home-Tutor.jpg",
	"noveltype": "(JP)",
	"genre": "Adventure   Comedy   Fantasy   Harem   Romance   Seinen   ",
	"tags": "Academy   Adapted to Manga   Aristocracy   Beastkin   Brother Complex   Charming Protagonist   Clever Protagonist   Dense Protagonist   Elemental Magic   Elves   Genius Protagonist   Handsome Male Lead   Hard-Working Protagonist   Inferiority Complex   Jack of All Trades   Lack of Common Sense   Loli   Magic   Male Protagonist   Nobles   Orphans   Protagonist Strong from the Start   Royalty   Siblings Not Related by Blood   Strong Love Interests   Strong to Stronger   Student-Teacher Relationship   Sword And Magic   Teachers   Tsundere   Underestimated Protagonist   Yandere   Younger Sisters   ",
	"rating": "(3.3 / 5.0, 62 votes)",
	"author": "Nanano Riku   七野りく   ",
	"year": "\n2017",
	"ranking": "#2000   #2000   #2784   #5005   #4054   ",
	"reviewcount": "9 Reviews sorted by",
	"description": "He was going down a good path in life, until that time came.\n\nAlthough he was a commoner, he still managed to rank second at the Royal Academy due to his own efforts, surpassing even nobility. Later graduating from a University with an excellent record, he was guaranteed a good workplace. If things went smoothly, he would have surely become a Court Magician. An elite amongst elites.\n\nBut, well,due to circumstances I failed the exam—what a shame. And I didn’t even have enough money for the train fare back home either.\n\nIn such a dire situation, my professor introduced me to a job: to become a home tutor for a Duke’s daughter. This job smells fishy….\n\nThis is a story of a man who wants to lead an ordinary life, but unexpectedly gets caught up in a competition between his frenemy from his academy days and his tutoring student —all of this forcing him to climb the ladder of society.\n\n…How did this happen?>"
}