{
	"url": "https://www.novelupdates.com/series/rebirth-of-the-excellent-daughter-of-the-marquis-household/",
	"title": "Rebirth of the Excellent Daughter of the Marquis Household - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/02/Rebirth-of-the-Excellent-Daughter-of-the-Marquis-Household.jpg",
	"noveltype": "(CN)",
	"genre": "Drama   Fantasy   Historical   Romance   Tragedy   ",
	"tags": "Ancient China   Beautiful Female Lead   Childcare   Clever Protagonist   Devoted Love Interests   Female Protagonist   Handsome Male Lead   Imperial Harem   Marriage   Past Trauma   Possessive Characters   Pregnancy   Reincarnation   Royalty   Second Chance   Transmigration   ",
	"rating": "(3.7 / 5.0, 53 votes)",
	"author": "福多多   ",
	"year": "\n2019",
	"ranking": "#5262   #1566   #5073   #8667   #7443   ",
	"reviewcount": "12 Reviews sorted by",
	"description": "Gu Yu Qi, a daughter born to a marquis household. She was beautiful with knowledge in both civil and military, and her kindness broader than the sky. It was love at first sight for her, and she insisted on marrying him and was happy even if she were to become a mistress. She worked hard to help him step by step to become the emperor.\r\n\r\nBut what happened to her in the end?\r\n\r\nFor ten whole years, she was humiliated and abandoned. Disheartened, she drank poison to end her life and set her place on fire, only to find herself back to when she was ten years old. It was the year she followed her mother into the capital. It wasn’t too late to change her fate.\r\n\r\nIf Yun Ke had any regrets in his previous life, then it would be how he always kept thinking about a woman who died decades ago. Because of that, before he died, he secretly had the woman’s ashes pressed beneath his coffin. As the emperor, he had the final say of everything under the sky. So how could he allow that woman to be arrogant in front of him? Even at his deathbed, he would crush her beneath him.\r\n\r\nWho knew he’d be reborn again…\r\n\r\nWhen the transmigrated girl meets the boy who was reborn, Gu Yu Qi simply wanted to yell at the sky. Just what are you playing at!?>"
}