{
	"url": "https://www.novelupdates.com/series/deep-kiss/",
	"title": "Deep Kiss - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/01/Deep-Kiss.jpg",
	"noveltype": "(CN)",
	"genre": "Adult   Romance   ",
	"tags": "Beautiful Female Lead   Female Protagonist   Handsome Male Lead   Modern Day   Multiple POV   Shameless Protagonist   Younger Love Interests   ",
	"rating": "(4.3 / 5.0, 48 votes)",
	"author": "醉时容笑   ",
	"year": "\n2021",
	"ranking": "#6970   #2074   #6397   #6620   #7202   ",
	"reviewcount": "7 Reviews sorted by",
	"description": "At the dinner party, He Shuyu’s Haute Couture evening dress was spilled with red wine. The culprit was a part-time student from Jiang University. He had pale cool-toned skin, a red mole at the end of his eye, and a tie tied around his shirt, both cold and desirable. He bent over with his head down and was scolded by the manager, telling him to apologize, but his fingers were taut and straight as he clasped his tray.\r\n\r\nHe Shuyu stroked her ring slowly and thought to herself – young people nowadays are quite stubborn. He Shuyu helped him up by putting her hands on his shoulders, pushing a business card into his suit pocket and whispered into his ear in full view of everyone.\r\n\r\n“Here’s my contact information.” \r\n\r\nAs she hoped, she saw his lips tighten. He Shuyu smiled lightly and tapped the mole at the end of his eye, whispering, “I’ll wait for you.”\r\n\r\nAll the rich kids in Jiangcheng city were guessing when He Shuyu would dump that poor college student from Jiang University who only had his face going for him. After waiting and waiting, they finally awaited He Shuyu’s fiancé to return to China and for the He family to hold a wedding banquet. Chi Xiuyuan was just a condiment to enliven He Shuyu’s boring rich life. Look, he was dumped.\r\n\r\nOn the day of the wedding, the young man who would rather die than obey orders at the dinner party wore a suit with a corsage, slipped the wedding ring onto He Shuyu’s ring finger, and kissed her deeply.\r\n\r\nThe audience was completely silent. >"
}