{
	"url": "https://www.novelupdates.com/series/let-me-shoulder-this-blame/",
	"title": "Let Me Shoulder This Blame! - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2018/12/Screen-Shot-2018-12-29-at-1.21.16-AM.png",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Comedy   Drama   Romance   Sci-fi   Yaoi   ",
	"tags": "Acting   Ancient Times   Artificial Intelligence   Cultivation   Demonic Cultivation Technique   Devoted Love Interests   Doting Love Interests   Doting Older Siblings   Doting Parents   Episodic   Fantasy World   Handsome Male Lead   Hard-Working Protagonist   Heartwarming   Human-Nonhuman Relationship   Interdimensional Travel   Love Interest Falls in Love First   Misunderstandings   Modern Day   Multiple Personalities   Multiple Realms   Naive Protagonist   Non-humanoid Protagonist   Past Trauma   Power Couple   Programmer   R*pe   Shapeshifters   Showbiz   Sickly Characters   Strong Love Interests   System Administrator   Transmigration   Unconditional Love   Wealthy Characters   World Hopping   World Travel   ",
	"rating": "(4.2 / 5.0, 193 votes)",
	"author": "Three Thousand Big Dreams To Narrate One's Life   三千大梦叙平生   ",
	"year": "\n2018",
	"ranking": "#1837   #648   #885   #1657   #529   ",
	"reviewcount": "49 Reviews sorted by",
	"description": "Su Shi was once a platinum-level host with the highest survival rate. One day, his misdeeds of constantly shifting his blame onto others was found out and reported. Convicted of violating the rules, he was bound to an Automatic Blame Shouldering System and exiled to lower-level worlds.\n\nNow, not only does he have to take the blame from others and shoulder it himself, he must also carry that blame and rush to his death in order to earn enough points to quickly unbind from the system.\n\nSu Shi only wants to get rid of the system by shouldering the blame until death. However, he finds that trying to hold onto the blame is even harder than passing it on, and rushing to his death is even harder than running for his life.\n\nAs Su Shi lies dying in the protagonist’s arms with red-rimmed eyes and a weak and helpless countenance, an uninvited third guest suddenly rushes out to explain the misunderstanding for him.\n\nSu Shi: “I beg you, just let me shoulder this blame, otherwise, it will all be a waste of effort…”>"
}