{
	"url": "https://www.novelupdates.com/series/little-one-tears-the-villains-script/",
	"title": "Little One Tears the Villain’s Script - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/10/155802s.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Drama   Fantasy   Romance   School Life   Slice of Life   ",
	"tags": "Age Progression   Beautiful Female Lead   Business Management   Carefree Protagonist   Charismatic Protagonist   Charming Protagonist   Child Protagonist   Clever Protagonist   Complex Family Relationships   Confident Protagonist   Cute Protagonist   Determined Protagonist   Family Business   Female Protagonist   Handsome Male Lead   Hard-Working Protagonist   Love Interest Falls in Love First   Mob Protagonist   Modern Day   Playful Protagonist   Shameless Protagonist   Slow Growth at Start   Slow Romance   Smart Couple   System Administrator   Villainess Noble Girls   Wealthy Characters   ",
	"rating": "(4.4 / 5.0, 272 votes)",
	"author": "Taozi Wanwan   桃枝丸丸   ",
	"year": "\n2020",
	"ranking": "#87   #109   #685   #193   #638   ",
	"reviewcount": "73 Reviews sorted by",
	"description": "Jiang Xiaoman was bound to a system when she was three years old. The system told her that she was the lost daughter of a wealthy family assigned to play the cannon fodder in this script. The fake daughter that her parents adopted was the heroine of the story. \n\nJiang Xiaoman blinked her eyes and asked, “What is a cannon fodder?” 　 \n\nSystem: “You all live in a book, and everyone is assigned their role. From now on, you should keep on blackening and be a bad child. Do you see that little boy? He has a bigger role than you, in the future, he will become the big bad villain. Why don’t you bully him now, and show him up real good!” \n\nThe naïve Jiang Xiaoman picked a handful of colorful flowers and stuffed them into his hands. “I’m showing you something really good!” \n\nSystem: “…”\n\nDarling, you got it all wrong! Not showing him something good that way!\n\nThe little boy: “I don’t need friends, I don’t need company. I’m just a burden that no one wants. It’s my destiny to be abandoned.” \n\nJiang Xiaoman: “That’s wrong. Everyone’s existences have meaning. System said you are especially important, even more important than me. You’ll be a really really useful person in the future!” \n\nSystem: “…??”\n\nDid it say that?? \n\nLater on, the system stopped giving Jiang Xiaoman any tasks. Jiang Xiaoman was very sorrowful and said, “Mr. System, why won’t you play with me anymore?” \n\nSystem: “… just try to grow up first and learn to understand every word! You’re killing me!!” \n\nJiang Xiaoman worked hard to blacken (not really) under the system’s supervision until she was reunited with her wealthy parents. She scratched her little head and asked, “Mr. System, what about the task? Didn’t you say that we should fight over the family’s wealth?” \n\nSystem: “What kind of wealth do you still want to fight over? You already have more money than your wealthy parents!”>"
}