{
	"url": "https://www.novelupdates.com/series/im-not-even-married-what-divorce-your-majesty/",
	"title": "I’m Not Even Married, What Divorce, Your Majesty? - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/09/Im-Not-Even-Married-What-Divorce-Your-Majesty.jpg",
	"noveltype": "",
	"genre": "Fantasy   Romance   ",
	"tags": "Aristocracy   Beautiful Female Lead   Divorce   European Ambience   Female Protagonist   Nobles   Tomboyish Female Lead   ",
	"rating": "(4.4 / 5.0, 7 votes)",
	"author": "전설의고양이   ",
	"year": "\n2020",
	"ranking": "#1678   #1225   #13025   #8980   #12526   ",
	"reviewcount": "No Reviews",
	"description": "Ten years after the territorial war that infested half of the continent ended.\n\nA document with a pure gold seal flew into the territory of Isaac Mezzerine, the former hero.\n\nThe Imperial’s Divorce Letter sent to his only daughter, Klisha Mezzerine, who is not yet married.\n\nEven just with the unexpected divorce, she’s already going crazy and jumping around, but she’s going to be exiled for 10 years according to the Imperial Rule?\n\n“Are you all out of your mind? I’m not even married yet! What divorce!!!!”\n\nIt can’t be, she’ll go to the capital and get it right!\n\nHowever, contrary to the initial plan, which was confident enough, things kept getting tangled up and tangled up?\n\n***\n\nKlisha, who barely arrived on time, was speechless.\n\nIt wasn’t because the bank was closed or because her black card was blocked.\n\nThat one in front of her, the one with dozens of papers on either side of the main gate of the bank … wanted for the bounty she only heard of?\n\n「★★WANTED★★」\n\n> Name: Klisha Mezzerine (Sasha Lynn). 21 years old.\n\n> Features: Red hair. Almond eyes. Woman. Jailbreaker. (Rune operator, ferocious momentum)\n\n> Bounty: 10,000 Ruel.\n\n※ If you bring the limb intact, there will be an additional 10,000 Ruel.\n\nKlisha’s eyes turned white.\n\n‘What should I do? Far from seeing His Majesty, can I go back home?’>"
}