{
	"url": "https://www.novelupdates.com/series/the-despised-princess-awakened-as-an-archmage/",
	"title": "The Despised Princess Awakened as an Archmage - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/06/The-Despised-Princess-Awakened-as-an-Archmage.jpg",
	"noveltype": "(KR)",
	"genre": "Comedy   Fantasy   Romance   ",
	"tags": "Academy   European Ambience   Female Protagonist   Game Elements   Magic   Overpowered Protagonist   Possession   Transmigration   ",
	"rating": "(4.4 / 5.0, 7 votes)",
	"author": "유은우   ",
	"year": "\n2022",
	"ranking": "#6970   #6349   #12238   #10065   #10577   ",
	"reviewcount": "No Reviews",
	"description": "Always lived as an F-class. It’s sad that, after being killed in a dungeon and reincarnating in a rofan novel, reality is still as shallow as it was.\n\nAlthough she is a princess born in the ducal family, she is a thorn in the side of her family’s eyes and threatened of assassination.\n\nIn addition, she’s bullied by the whole academy.\n\nWhat, do I really have to live like this? Is there anything else?\n\nBy the way…\n\n[Congratulations! You’ve got a chance to reawaken.]\n\n[Chae Ji-Woo (F-Class Warrior) → Kanis Escliff (S-Class Wizard)]\n\n[Mana: SSS (New!)]\n\n[Skill: Archmage (EX)]\n\n“Oh my gosh.”\n\nSuddenly, she became an S-class hunter.\n\nWait, then you don’t have to show off and be accepted by your family, right?\n\n“Perfect. From now on, my life genre is Munchkin Sprite!” (1)\n\nEveryone, let’s try to be treated the same way.\n\n***\n\n“You need a husband to receive the duchy. A husband of a suitable status, without a desire for power, and with good looks.”\n\nThere was only one hole in the plan, which was going smoothly for now, and someone has appeared to fill that void.\n\nThe novel’s second Male Lead, who should have died horribly, survived…\n\n“Sign a contract with me. I will break up with you once you achieve your purpose.”\n\nHe gave me an offer I would’ve never expected.\n\n(1) Munchkin: popular term to describe powerful characters Sprite: term used to express a metaphor of something refreshing that easily resolves the situation.>"
}