{
	"url": "https://www.novelupdates.com/series/medical-master/",
	"title": "Medical Master - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2018/09/1482972103534.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Martial Arts   School Life   Slice of Life   Supernatural   ",
	"tags": "Corruption   Cultivation   Doctors   Hiding True Abilities   Male Protagonist   Modern Day   Music   Protagonist Strong from the Start   ",
	"rating": "(3.4 / 5.0, 46 votes)",
	"author": "Walk The World   步行天下   ",
	"year": "\n2016",
	"ranking": "#6970   #2000   #3877   #11739   #7725   ",
	"reviewcount": "6 Reviews sorted by",
	"description": "He was the youngest guru of martial arts as well as the perfect Mr. McDreamy of the most girls. He had mysterious absolute touch, clear-sighted observation ability and various outstanding talents.\n\nBut now, he was just an ordinary freshman in University of Jiangjing Chinese Medicine, who wanted to learn Chinese Medicine, see patients, and get into a relationship with a girl in a low-key way. However, in a Mid-Autumn Festival party, he was forced to put on a performance, which shocked the whole audience. The shiny and wonderful university life began from then on.\n\nIn the university, he met a beautiful and smart School Beauty Jiang Miaoyu who shook his heart slightly. But the road of love was never smooth, even to a perfect hero.\n\nHe also met a kind and friendly teacher Dr. Shen who discovered his excellent technique and gave him a chance to practice.\n\nBesides, his three lovely and interesting roommates were indispensable in his life, although sometimes they looked a little awkward.\n\nBut this young hero’s life was not always full of happiness without a hitch, some trouble still appeared from time to time. The domineering and imperious President of the Students’ Union Li Qingshi purposely made difficulties for him repeatedly. The stubborn and hardworking martial arts practitioner Chen Cong often challenged him in different ways.\n\nJust because of these extraordinary personalities around him, this young hero’s road of struggle looked so amazing…>"
}