{
	"url": "https://www.novelupdates.com/series/legitimate-daughters-daily-life-entertainment-circle/",
	"title": "Legitimate Daughter’s Daily Life: Entertainment Circle! - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/05/Legitimate-Daughters-Daily-Life-Entertainment-Circle.jpg",
	"noveltype": "(CN)",
	"genre": "Fantasy   Romance   ",
	"tags": "Acting   Calm Protagonist   Celebrities   Female Protagonist   Love Interest Falls in Love First   Modern Day   Showbiz   Sickly Characters   Transmigration   Wealthy Characters   ",
	"rating": "(3.5 / 5.0, 18 votes)",
	"author": "Shi Shang Qingquan   石清泉石   ",
	"year": "\n2020",
	"ranking": "#2000   #2000   #10091   #11077   #10305   ",
	"reviewcount": "3 Reviews sorted by",
	"description": "Meng Zhen transmigrated and became the long-lost legitimate daughter of the Xu group, a stepping stone for the adopted daughter, Xu Xueluo.\r\n\r\nThe parents were gentle and kind to the adopted daughter, a top ten student who had grown up sheltered. On the other side, the little traffic star, Meng Zhen, wasn’t able to finish high school.\r\n\r\n\r\n \r\nThe naïve original character fell into the hands of the adopted sister and was driven out of the house by her parents. Being forced to “dedicate herself to art” with high-priced liquidated damages by her agency, she became a scheming woman who was scolded by everyone.\r\n\r\nUnwilling to accept those outrageous conditions from the agency, the original body, who was in complete despair, swallowed sleeping pills and ended her life.\r\n\r\nAfter learning of the death of the legitimate daughter, the adopted daughter pretended to be sad and cried before she managed her funeral. She then used the music scores created by the original body to win the favor of an influential man.\r\n\r\nNow that Meng Zhen became the original body, upon glancing at the scandals about her on the Internet – Published all thanks to the machinations of the Xu Group’s adopted daughter – then burned all the music scores without hesitation.>"
}