{
	"url": "https://www.novelupdates.com/series/after-transmigrating-into-a-short-lived-white-moonlight-had-a-he-with-the-villain/",
	"title": "After Transmigrating into a Short-lived White Moonlight, had a HE with the Villain - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/06/20200418133307.jpg",
	"noveltype": "(CN)",
	"genre": "Adventure   Comedy   Psychological   Romance   Xuanhuan   ",
	"tags": "Ancient China   Arrogant Characters   Beast Companions   Beautiful Female Lead   Black Belly   Calm Protagonist   Caring Protagonist   Clever Protagonist   Cold Love Interests   Comedic Undertone   Complex Family Relationships   Cruel Characters   Cultivation   Cunning Protagonist   Demons   Depictions of Cruelty   Devoted Love Interests   Divorce   Doting Love Interests   Doting Older Siblings   Doting Parents   Familial Love   Female Protagonist   First Love   Handsome Male Lead   Love Interest Falls in Love First   Male Yandere   Multiple Transported Individuals   Mysterious Past   Past Plays a Big Role   Past Trauma   Politics   Possessive Characters   Power Couple   Pragmatic Protagonist   Royalty   Schemes And Conspiracies   Smart Couple   Strong Love Interests   Sword Wielder   Transmigration   Tsundere   Wars   Weak to Strong   Yandere   ",
	"rating": "(4.5 / 5.0, 507 votes)",
	"author": "青花燃   ",
	"year": "\n2019",
	"ranking": "#637   #1267   #345   #109   #339   ",
	"reviewcount": "95 Reviews sorted by",
	"description": "Sang Yuanyuan transmigrated into a sadistic romance ancient fantasy novel, becoming the male lead’s ill-fated beautiful white moonlight that died early.\n\nThe male lead loves her, the male supporting character loves her too.\n\nThe female lead was injured and broken-hearted because being loved, trampled and abused by all men for she had a face that was similar to hers. The relationship with male lead was full of twists and turns, tortured between life and death, and finally had a Happy Ending.\n\nSang Yuanyuan : “I’m sorry, I 一 first don’t want to die, second don’t want to be abused. So I choose to run away with the villain. Excuse me, goodbye.”\n\nThe villain squinted his long eyes, with a lazy posture and lips smiling like a spring breeze——\n\n“Beside me… is nothing but hell.”\n\nShe contemplated for three seconds.\n\n“Does the hell have land?”\n\n“… There’s a wasteland.”\n\n“Does it have water?”\n\n“… Only blood.”\n\nHe wants to see her panic and lose her head, waits for her to scream and escape, but after blanking for three seconds the woman’s eyes instead shine faintly.\n\n“What a good opportunity to try a new variety!”\n\n“…”\n\nHe who always lingers in the deepest darkness, has never thought that there would be a person who can fill a whole wasteland with flowers and grass...>"
}