{
	"url": "https://www.novelupdates.com/series/the-rebirth-of-the-last-days-and-return-to-fang-hao/",
	"title": "The Rebirth of the Last Days and Return to [Fang] Hao - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/08/The-Rebirth-of-the-Last-Days-and-Return-to-Fang-Hao.jpg",
	"noveltype": "(CN)",
	"genre": "Adult   Fantasy   Mature   Romance   Slice of Life   Yaoi   ",
	"tags": "Antihero Protagonist   Apocalypse   Calm Protagonist   Childhood Friends   Childhood Love   Cooking   Devoted Love Interests   Doting Love Interests   Early Romance   Evolution   Farming   First Love   Handsome Male Lead   Hidden Abilities   Hiding True Abilities   Love Interest Falls in Love First   Magical Space   Male Yandere   Mutated Creatures   Mutations   Pets   Power Couple   Second Chance   Seme Protagonist   Special Abilities   Teamwork   Tragic Past   Weak to Strong   Zombies   ",
	"rating": "(4.2 / 5.0, 188 votes)",
	"author": "Warm Charge   暖荷   ",
	"year": "\n2019",
	"ranking": "#1144   #946   #1523   #827   #2037   ",
	"reviewcount": "50 Reviews sorted by",
	"description": "Before rebirth, He Zizhong was unfortunate. This loyal dog was loyal to the wrong target. In the difficult end times, he was betrayed by his relatives, deceived by his lover to show his space, and was sadly chased by the enemy.\r\n\r\nIt wasn’t until before he died that he learned that Fang Hao, who accompanied him all the way, turned out to be the junior brother who confessed to him in high school. It’s a pity that he died too, in his arms.\r\n\r\nIn He Zizhong’s past life, Fang Hao felt that he was lucky, after six or seven years, in the desperate apocalypse, he found the senior who was his first love again, and he could accompany him for half a year.\r\n\r\nMore importantly, at the end of life, you can still die in the arms of someone you like. Is there anything happier in the world?\r\n\r\nAfter rebirth, He Zizhong reused facts to prove that of course there is something happier in this world than death at the same point.\r\n\r\nWith a space and a lover who he has vowed to protect in this life, hitting zombies, upgrading and creating a better life together, this is He Zizhong’s life goal after rebirth. What do you do when you encounter a lover who has cheated on your feelings in your previous life, a selfishly wants to deceive your own space cousin, or issues a killing order to chase down your love rival?\r\n\r\nSince they can’t get around, step on them in the mud with one foot!>"
}