{
	"url": "https://www.novelupdates.com/series/fff-class-trashero/",
	"title": "FFF-Class Trashero - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/06/FFFClass-Trashero.jpg",
	"noveltype": "(KR)",
	"genre": "Action   Adventure   Comedy   Ecchi   Fantasy   Harem   Mature   School Life   Sci-fi   Shounen   Supernatural   ",
	"tags": "Adapted to Manhwa   Aggressive Characters   Aliens   Androids   Angels   Antihero Protagonist   Arrogant Characters   Betrayal   Brainwashing   Clones   Cold Love Interests   Complex Family Relationships   Confident Protagonist   Cosmic Wars   Discrimination   Divine Protection   Enemies Become Allies   Enemies Become Lovers   Evil Protagonist   Former Hero   Game Elements   Genetic Modifications   God Protagonist   Heroes   Immortals   Jack of All Trades   Late Romance   Legends   Level System   Male Protagonist   Marriage   Multiple Timelines   Multiple Transported Individuals   Mysterious Family Background   Outer Space   Overpowered Protagonist   Parallel Worlds   Past Plays a Big Role   Personality Changes   Philosophical   Polygamy   Pragmatic Protagonist   Pregnancy   Protagonist Strong from the Start   Protagonist with Multiple Bodies   Race Change   Returning from Another World   Romantic Subplot   Ruthless Protagonist   Second Chance   Secret Identity   Secret Organizations   Selfish Protagonist   Sentimental Protagonist   Skill Assimilation   Strong to Stronger   Summoned Hero   Sword And Magic   System Administrator   Time Loop   Transplanted Memories   Transported to Another World   Unreliable Narrator   ",
	"rating": "(4.0 / 5.0, 668 votes)",
	"author": "Farnar   파르나르   ",
	"year": "\n2018",
	"ranking": "#2566   #3486   #406   #989   #408   ",
	"reviewcount": "134 Reviews sorted by",
	"description": "It was a life without regret. My parents were in good health, and I wasn’t home enough for me to combine my studies and part-time jobs.\n\nI like fantasy, martial arts, games, fiction movies, cartoons… I’m a normal high school student who likes these things.\n\nThat was certainly true until ten years ago.\n\nThis is not the earth.\n\nA fantasy world dominated by powerful people. Savage utopia. It is a world where you can take anything with you if you have physical strength.>"
}