{
	"url": "https://www.novelupdates.com/series/a-cure-for-the-dark-heart/",
	"title": "A Cure for the Dark Heart - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/03/curedarkheart1.jpg",
	"noveltype": "(CN)",
	"genre": "Drama   Fantasy   Historical   Romance   Yaoi   ",
	"tags": "Ancient China   Cautious Protagonist   Clever Protagonist   Devoted Love Interests   Doctors   Family Conflict   Forced Marriage   Handsome Male Lead   Medical Knowledge   Modern Knowledge   Politics   Power Couple   Protagonist Falls in Love First   Reincarnation   Royalty   Schemes And Conspiracies   Smart Couple   Strong Love Interests   Tragic Past   Transmigration   ",
	"rating": "(4.0 / 5.0, 76 votes)",
	"author": "Chen Zhou Zui Yue   沉舟醉月   ",
	"year": "\nN/A",
	"ranking": "#5262   #2000   #4805   #3561   #4323   ",
	"reviewcount": "10 Reviews sorted by",
	"description": "Li Hengyuan was an internationally known 'Medical Lunatic'. Having saved countless lives, he was eventually gunned down by someone he trusted the most. \n\nFortunately, Li Hengyuan's soul was reincarnated, and he found himself sitting in a sedan chair on the way to warding off the imminent death of His Highness, Lord Pinghe by marrying him.\n\nWith fair skin, a good figure and long legs, Lord Pinghe had always been known as the most gorgeous man in the capital. However, he was also a vicious beauty. Not only that he had mastered all sorts of fascinating tricks of using poison, but he was also like a glutinous rice ball with sesame filling, looking soft, sickly and harmless to everyone, but under the meek surface there was a dark heart.\n\nDespite that, Li Hengyuan doted on him, and couldn’t have loved him or pampered him more. \n\nUntil one day, the allegedly ailing beautiful Lord pressed Li Hengyuan against his bed.\n\nLi Hengyuan stared at him with astonishment: 'Honey, what are you doing?'\n\nThe gorgeous Lord ripped open Li Hengyuan’s clothes, and responded with actions.  \n\nAfter finishing their intimacy, Li Hengyuan felt like weeping but failed to shed a tear. He had just been deflowered by the flower he had nurtured!!>"
}