{
	"url": "https://www.novelupdates.com/series/after-rebirth-i-am-the-white-moonlight-of-all-the-big-brothers/",
	"title": "After Rebirth, I Am the White Moonlight of All The Big Brothers - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/04/After-Rebirth-I-Am-the-White-Moonlight-of-All-The-Big-Brothers.jpeg",
	"noveltype": "(CN)",
	"genre": "Fantasy   Romance   School Life   ",
	"tags": "Beautiful Female Lead   Calm Protagonist   Charismatic Protagonist   Clever Protagonist   Cold Love Interests   Doting Love Interests   Female Protagonist   Genius Protagonist   Handsome Male Lead   Hiding True Identity   Love Interest Falls in Love First   Modern Day   Multiple Identities   Overpowered Protagonist   Proactive Protagonist   Revenge   Scientists   Second Chance   Time Skip   Transmigration   Twins   ",
	"rating": "(3.9 / 5.0, 8 votes)",
	"author": "渝人   ",
	"year": "\n2020",
	"ranking": "#6970   #2000   #10790   #10659   #10718   ",
	"reviewcount": "1 Review sorted by",
	"description": "In her previous life, Lou Mingyue was a legend in the imperial capital. At the age of 22, she was already a “super boss” standing at the top. Finally, she was eventually killed by her trusted aides and died at the age of twenty-five, becoming an unreachable peak in the hearts of countless people.\n\nWhen she opened her eyes again, rebirth after twenty years, she became a second-year student of Linnan No. 1 Middle School.\n\nThen——the primary school chickens shivered: “Jiang Fuyue, she got a perfect score in the exam again! The physics teacher came to her again for the answers! The math teacher said that she will have her give out the exam questions next month!”\n\nBig Brother No. 1: “Only when she comes back will my world have light.”\n\nBig Brother No. 2: “If she wants the stars, I will pick them, and if she wants the moon, I will go and catch it. I will give everything to her in exchange for a smile.”\n\nBig Brother No. 3: “Sister, can you forgive me? I’ll give you money, the company, and my life.”\n\n….Big Brother No. n: “One day as a younger brother, for life as a younger brother. After this cup of tea, the Lun family is again yours!”\n\nAll the juniors were stunned: my grandfather/second uncle/third uncle/eldest aunt/great grandma/ great grandfather… have gone crazy?\n\nShe is the moon in the sky, the inextinguishable light, the guiding light, the cinnabar, and everyone’s belief.\n\n… Xie family’s Ninth Master has been having a headache recently, and his little nephew was beaten just after transferring to another school. It is said that the other party is a girl who weighs less than 100 pounds.\n\nTwo days later——little nephew: “Uncle, I want to chase her!”\n\nNinth Master: “?” Hello? Is your brain sick? And later –\n\nNinth Master: “I have a disease in my brain.”>"
}