{
	"url": "https://www.novelupdates.com/series/dont-annoy-me-my-ex-husband/",
	"title": "Don’t Annoy Me, My Ex-Husband! - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/10/Don39t-Annoy-Me-My-ExHusband.jpg",
	"noveltype": "(CN)",
	"genre": "Adult   Drama   Josei   Mature   Romance   Tragedy   ",
	"tags": "Abusive Characters   Adultery   Affair   Beautiful Female Lead   Bickering Couple   Death of Loved Ones   Divorce   Domestic Affairs   Emotionally Weak Protagonist   Female Protagonist   Hated Protagonist   Interconnected Storylines   Marriage   Misunderstandings   Multiple POV   Multiple Protagonists   Pregnancy   R*pe Victim Becomes Lover   R*pe   S*xual Abuse   Time Skip   Tragic Past   Weak Protagonist   ",
	"rating": "(1.6 / 5.0, 10 votes)",
	"author": "Li Nannan   ",
	"year": "\nN/A",
	"ranking": "#2000   #6320   #10832   #12558   #12229   ",
	"reviewcount": "3 Reviews sorted by",
	"description": "From love, marriage, heartbreak, pain, to divorce- Mu Chuqing has been through it all in a few years with Sheng Yuchen. After not seeing each other for years, she imagines that they would be like strangers. But why is that man looking at her with anger even when holding his fiancée in his arms? Why can’t they be like strangers? \r\n\r\nWill he forever humiliate and torture her? Why can’t Sheng Yuchen let her go? Just what kind of cruel man is her ex-husband? \r\n\r\n… \r\n\r\nEver since that night three years ago, Sheng Yuchen has not slept peacefully. Every time she cries, her tears fall like acid on his heart. His blood boils when he sees her smiling at other men the way she used to smile at him, and the beast in him might as well destroy everything around. \r\n\r\nHe can’t let her go. He won’t let her go. Even if his heart gets charred with her tears. \r\n\r\n… \r\n\r\nThis isn’t a love-at-first-sight story! \r\n\r\n“Boss! Miss Mu is back!” \r\n\r\n“Got it.” The man responds indifferently. \r\n\r\n“Boss, someone gave Miss Mu a bouquet of roses!” \r\n\r\n“Adulterer! Humph!” The man finally raises his head, narrows his eyes, and snorts. \r\n\r\n“Boss, Miss. Mu and that man watched a movie today, had a candlelight dinner, and…” \r\n\r\n“And what…” \r\n\r\n“They kissed!” \r\n\r\nThe man’s eyes spits fire, and he can’t sit still anymore. He suddenly stands up from the sofa. \r\n\r\n“B-Boss, bad news. Miss. Mu and that man are going to get married in the Netherlands!” \r\n\r\nThe man slams the table. “Which plane? Shoot it down!” \r\n\r\n“Yes!” \r\n\r\n“Wait!” The man suddenly stops him. \r\n\r\n“Boss, do you have any other instructions?” \r\n\r\n“Blast the male adulterer. If she loses even a hair on her, I’m afraid you won’t be able to handle what comes next!” \r\n\r\n“…”>"
}