{
	"url": "https://www.novelupdates.com/series/dawn-sleep/",
	"title": "Dawn Sleep - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/09/Dawn-Sleep.png",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Mecha   Sci-fi   Shounen Ai   Yaoi   ",
	"tags": "Academy   Calm Protagonist   Cosmic Wars   Death of Loved Ones   Determined Protagonist   Engagement   Fearless Protagonist   Futuristic Setting   Long Separations   Manly Gay Couple   Military   Monsters   Mystery Solving   Poor Protagonist   Power Couple   Royalty   Strategic Battles   Strong Love Interests   Weak to Strong   ",
	"rating": "(4.4 / 5.0, 14 votes)",
	"author": "Yue Qianyue   岳千月   ",
	"year": "\n2020",
	"ranking": "#2240   #2441   #9936   #4288   #10406   ",
	"reviewcount": "2 Reviews sorted by",
	"description": "Three years ago, a grievous news came from the distant stars, Crown Prince Ryann died so heroically on the frontier that even his remains couldn’t be found and returned home. \n\nThe Empire has lost its handsome and dazzling prince, as well as one of the strongest new crystal human beings in this century.\n\nIt was said that the prince left a poor widow behind.　　\n\n… At the funeral, the young widow had black hair and white skin. He lowered his head in silence as he held the coffin.\n\nThe royal family and high-level officials of the empire couldn’t help frowning greatly: The person who made His Highness fall in love during his lifetime was actually such a vulgar creature.\n\n******\n\nJiang Jianming worked like a salted fish in the imperial military academy for three years, and he was unremarkable to the extreme.\n\nIn the graduation season, he calmly rolled up his baggage and stepped into the cruel distant star battlefield to collect the body of His Highness.\n\nEveryone knows that disabled humans are weak, and they have no fighting ability at all. How many people either sneered or regretted, just waiting to wrap the corpse of this young man who had exceeded himself?\n\nUntil later, the pale young man scoured the scorched earth covered in blood, and when he raised his hand, the sound of gunfire broke through the long night. The Milky Way was reflected in the bottom of Jianming’s eyes, and the blade of the mecha was bathed in crystal and starlight.\n\nBehind him, countless new human beings were convinced by this ‘proud son of heaven’, and they all called him “commander” in unison.\n\nThe alien creatures were frightened and trembling;\nThe rich and glorious dominion star-lord treat him as a guest;\nThe murderous space pirate love and hate him…\n\nJiang Jianming smiled slightly: “Don’t be so exaggerated, I’m just a weak and sickly disabled human being.”\nImperial people: “?”\n\nSo when the monarch came back from hell to the world, facing the legendary story that his lover had turned the distant star upside down for him, the monarch raised his eyebrows coldly: “Nonsense. The commander is just a weak and sickly disabled human being… Tell me, who encouraged him into a mecha today?”\nImperial people: “???”\n　　\n　—Please light the withered years, go through the remnants of the old civilization and the cold stars, and wake up in my arms before the dawn of mankind.>"
}