{
	"url": "https://www.novelupdates.com/series/the-sickly-beauty-substitute-called-it-quits/",
	"title": "The Sickly Beauty Substitute Called It Quits - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/02/The-sickly-beauty-substitute-called-it-quits.jpg",
	"noveltype": "(CN)",
	"genre": "Fantasy   Historical   Romance   Yaoi   ",
	"tags": "Aggressive Characters   Ancient China   Aristocracy   Calm Protagonist   Charming Protagonist   Clever Protagonist   Cold Love Interests   Complex Family Relationships   Confident Protagonist   Cruel Characters   Cunning Protagonist   Devoted Love Interests   Doting Love Interests   Family Conflict   Handsome Male Lead   Love Interest Falls in Love First   Multiple Reincarnated Individuals   Multiple Transported Individuals   Persistent Love Interests   Possessive Characters   Power Couple   Reincarnation   Royalty   Schemes And Conspiracies   Second Chance   Shameless Protagonist   Sickly Characters   Smart Couple   Strong Love Interests   Transmigration   Wealthy Characters   ",
	"rating": "(4.1 / 5.0, 127 votes)",
	"author": "Yun Chutang   云初棠   ",
	"year": "\n2021",
	"ranking": "#456   #642   #1905   #1178   #1695   ",
	"reviewcount": "23 Reviews sorted by",
	"description": "Shen Yu was sincerely in love. For that person’s sake, Shen Yu ignored his illness-ridden body and plotted to overthrow the tyrant. It was only after Shen Yu died that he learned the truth. He was a character in a book, and the man he loved only viewed him as a stand-in for the protagonist. To pave the way for that couple’s happiness, Shen Yu lost everything.\n\nAfter he was reborn, the sickly Shen Yu was so done with that.\n\nAs for that man, whoever wanted him could have him.\n\nShen Yu took his half-brother’s place and became the male concubine of the tyrant. The tyrant didn’t like men anyway, and Shen Yu didn’t have much time left. Since he was going to die, he might as well go to the palace to sit around and wait for death.\n\nAfter entering the harem of the tyrant everyone feared, Shen Yu ate and drank without a care in the world.\n\nThe tyrant, with long black hair on his shoulders and crimson eyes, didn’t hide his hostility. He grabbed Shen Yu by the neck. “You’re not afraid to die?”\n\nShen “Just get it over with” Yu felt a little excited. “Are you going to kill me now?”\n\nTyrant: “? ? ? ? ?”\n\nShen Yu entered the palace expecting to die, but he waited and waited and waited. In the end, the officials petitioned to make him the empress, and the tyrant cured his deadly illness.\n\nShen Yu: “…”\n\nShou: jumps frantically up and down on the gong’s bottom line but never dies\n\nGong: all he can do with the shou is lower his bottom line again and again>"
}