{
	"url": "https://www.novelupdates.com/series/after-the-actor-made-a-match-for-me-he-died-out-of-jealousy/",
	"title": "After The Actor Made a Match For Me, He Died Out of Jealousy - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/04/After-The-Actor-Made-a-Match-For-Me-He-Died-Out-of-Jealousy.jpg",
	"noveltype": "(CN)",
	"genre": "Romance   Shounen Ai   ",
	"tags": "Acting   Blind Dates   Calm Protagonist   Easy Going Life   Family Business   Handsome Male Lead   Late Romance   Slow Romance   Smart Couple   ",
	"rating": "(4.0 / 5.0, 21 votes)",
	"author": "雁飞行 雁飞行   ",
	"year": "\n2022",
	"ranking": "#1820   #1863   #7545   #3235   #7293   ",
	"reviewcount": "6 Reviews sorted by",
	"description": "After Jiang Liu Cheng’s parents divorced, both of them quickly formed a new family. Both his parents are married to wealthy families, but even so, no one wanted nor supported him. He was simply kicked around between them as neither family wanted him. Thus, Jiang Liu Cheng, who longed for a home his whole life had decided to find a partner of his own.\r\n\r\n\r\n\r\n\r\nHe happened to gather up to three blind dates:\r\n\r\n\r\n\r\n\r\nA famous director in the entertainment industry\r\nA rich second generation from a certain family\r\nA well-known scriptwriter\r\n\r\n\r\n\r\n\r\n……….\r\n\r\n\r\n\r\n\r\nLater, he took his new fiance to the banquet and introduce him to others: “My date.”\r\n\r\nHis remarried parents looking at the face in front of them, which will inherit billions of dollars at any time:? ? ?\r\n\r\n\r\n\r\n\r\nQin Lu is an actor in the entertainment industry and the heir to a wealthy family. He had gotten into a car accident and was later saved by Jiang Lu. In order to repay the favor, he decided to fulfill his wish and introduce him to high-quality blind dates. \r\n\r\n\r\n\r\n\r\nQin Lu: He is a great director, upstarting in the entertainment industry.\r\n\r\nLater: He is a male chauvinist, so I don’t know. \r\n\r\nQin Lu: Ah! This one is my good friend. He is a rich second generation. I know him quite well. It’s all good.\r\n\r\nLater: He is a great guy and all, but he has this first love that he can’t seem to forget.\r\n\r\nQin Lu: What about a well-known scriptwriter? He has written several explosive scripts.\r\n\r\nLater: Although, rumors had been going around, and it was said that he is not that very good in that aspect in real life… If you know what I mean.\r\n\r\n\r\n\r\n\r\nQin Lu then smiles at Jiang Liu as he was trying to hint at something while wriggling his brows: You know, I am not that of a macho man. I don’t belittle women. I also don’t have an unforgettable first love. And while we are on the topic, I always work out. I have six-pack abs. \r\n\r\n\r\n\r\n\r\nThe director, the rich second-generation man, and the screenwriter who was victimized by the wind commentary: “Fuck that man.” >"
}