{
	"url": "https://www.novelupdates.com/series/library-of-heavens-path/",
	"title": "Library of Heaven’s Path - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2017/03/Library-of-Heaven’s-Path.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Comedy   Drama   Fantasy   Harem   Xuanhuan   ",
	"tags": "Academy   Adapted to Manhua   Alchemy   Arrogant Characters   Beast Companions   Beasts   Bloodlines   Body Tempering   Books   Charming Protagonist   Cheats   Clones   Cultivation   Cunning Protagonist   Demons   Dense Protagonist   Doctors   Eidetic Memory   Enlightenment   Eye Powers   Fast Cultivation   Fast Learner   Hiding True Identity   Immortals   Jack of All Trades   Library   Loyal Subordinates   Magic Beasts   Male Protagonist   Manipulative Characters   Master-Disciple Relationship   Master-Servant Relationship   Misunderstandings   Money Grubber   Mysterious Family Background   Overpowered Protagonist   Pill Concocting   Poisons   Possessive Characters   Protagonist with Multiple Bodies   Reincarnated in Another World   Secret Identity   Shameless Protagonist   Shy Characters   Souls   Student-Teacher Relationship   Sudden Strength Gain   Sword Wielder   Teachers   Transmigration   Transported to Another World   Underestimated Protagonist   Unique Cultivation Technique   Weak to Strong   World Travel   ",
	"rating": "(3.7 / 5.0, 1494 votes)",
	"author": "Heng Sao Tian Ya   横扫天涯   ",
	"year": "\n2016",
	"ranking": "#1326   #242   #12   #2157   #92   ",
	"reviewcount": "271 Reviews",
	"description": "Traversing into another world, Zhang Xuan finds himself becoming an honorable teacher.\n\nAlong with his transcension, a mysterious library appears in his mind.\n\nAs long as it is something he has seen, regardless of whether it is a human or an object, a book on its weaknesses will be automatically compiled in the library.\n\nThus, he becomes formidable. \n\n“Emperor Zhuoyang, why do you detest wearing your underwear so much? As an emperor, can’t you pay a little more attention to your image?”\n\n“Fairy Linglong, you can always look for me if you find yourself unable to sleep at night. I am skilled in lullabies!”\n\n“And you, Demon Lord Qiankun! Can you cut down on the garlic? Are you trying to kill me with that stench?” \n\nThis is an incredible story about teachers and students, grooming and guiding the greatest experts in the world!>"
}