{
	"url": "https://www.novelupdates.com/series/celestial-white-rabbit-pregnancy-nursing-guide/",
	"title": "Celestial White Rabbit Pregnancy Nursing Guide - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/08/Celestial-White-Rabbit-Pregnancy-Nursing-Guide.jpg",
	"noveltype": "(CN)",
	"genre": "Adult   Xianxia   Yaoi   ",
	"tags": "Adopted Protagonist   Beast Companions   Black Belly   Childcare   Cultivation   Cute Children   Demonic Cultivation Technique   Demons   First-time Interc**rse   Heavenly Tribulation   Love Interest Falls in Love First   Master-Disciple Relationship   Mpreg   Pets   Protagonist Strong from the Start   Shapeshifters   Smart Couple   Strong Love Interests   Time Travel   Transformation Ability   Transmigration   Younger Love Interests   ",
	"rating": "(4.0 / 5.0, 44 votes)",
	"author": "Chi Ling   池翎   ",
	"year": "\n2019",
	"ranking": "#6970   #3741   #6956   #7585   #4941   ",
	"reviewcount": "3 Reviews sorted by",
	"description": "Bai Tu was pulled into a book, became the bloody subject of the book’s blackened male protagonist, and possessed the character as a leader of the righteous way, Immortal Monarch Zhao Hua, who was stripped off his skin and made into a pair of rabbit fur kneepads.\n\nThe little rabbit tremblingly embraced the male protagonist’s thighs, and willingly helped him obtain the golden finger in every possible way. Who knew that the male protagonist was darkening at an alarming rate?\n\nHowever, he didn’t expect to open his eyes to see that he had gone back in time the moment he first entered the book.\n\nIn this life, Bai Tu changed his strategy and picked up the male lead who was still a fuzzy wolf pup home as his disciple.\n\nWhen the pup grew into an adult demon wolf, Yun Ye cultivated hard and put great respect for his teacher. Only that, his heart contained pent-up inner demons, and he didn’t dare ask or speak.\n\nLater on, Yun Ye’s heart was completely blackened and overthrew his Shizun down.\n\nSince then–\n\nYun Ye: Shizun hug qaq\n\nBai Tu:…\n\nYun Ye:? ? Shizun, don’t leave, Shizun!\n\nYun Ye wondered why his revered master suddenly avoided him wherever he went, but also—why was Shizun’s belly getting bigger and bigger???\n\nAfterward, Yun Ye picked up a shivering snow-white rabbit in his Shizun’s room, which was pregnant.>"
}