{
	"url": "https://www.novelupdates.com/series/after-i-stole-the-male-lead-the-female-lead-cried/",
	"title": "After I Stole The Male Lead, The Female Lead Cried - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/04/After-I-Stole-The-Male-Lead-The-Female-Lead-Cried.jpg",
	"noveltype": "(CN)",
	"genre": "Drama   Fantasy   Romance   ",
	"tags": "Amnesia   Disabilities   Doting Love Interests   Familial Love   Female Protagonist   Inferiority Complex   Parallel Worlds   Protagonist Strong from the Start   Reincarnation   Time Travel   Transmigration   ",
	"rating": "(4.1 / 5.0, 26 votes)",
	"author": "美人无霜   ",
	"year": "\n2021",
	"ranking": "#2000   #2000   #7966   #8984   #8914   ",
	"reviewcount": "6 Reviews sorted by",
	"description": "The female lead has been chasing after the male lead even after being abused and treated as a substitute. But only the male supporting character, who had a disability, stayed by her side and guarded her silently.\n\nThe male supporting character gave everything to the heroine, even died for her, but he couldn’t get the slightest love from her.\n\nQiao Xi transmigrated into the book, and she became a short-lived female supporting character in the book.\n\nShe found that her life was bound to this male supporting character with a disability on both his legs.\n\nSince then, Qiao Xi needs to find ways to approach him every day.\n\nShe would change her ways to placate him and she would caress his ugly legs with her hands. Her beautiful eyes were full of distressed expressions.\n\nThe man’s hand on the armrest of the wheelchair clenched into a fist, and he covered his ugly legs tightly with a quilt because of his low self-esteem.\n\nUntil one day, the male supporting character couldn’t control it. He lowered his head and kissed the girl in front of him and the legs under his body suddenly turned into a half fishtail.\n\nQiao Xi:…\n\nLater, the man opened the quilt and he proudly played with his beautiful golden fishtail.\n\nHe looked at Qiao Xi in front of him with his clear eyes, longing for her touch.>"
}