{
	"url": "https://www.novelupdates.com/series/virtual-world-close-combat-mage/",
	"title": "Virtual World: Close Combat Mage - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2015/08/vccm.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Comedy   Fantasy   Martial Arts   ",
	"tags": "Adapted to Manhua   Arrogant Characters   Calm Protagonist   Carefree Protagonist   Enemies Become Allies   Game Ranking System   Gamers   Grinding   Guilds   Helpful Protagonist   Hidden Abilities   Hiding True Identity   Honest Protagonist   Level System   Male Protagonist   Mercenaries   MMORPG   Modern Day   Naive Protagonist   Overpowered Protagonist   Protagonist Strong from the Start   Quirky Characters   Strength-based Social Hierarchy   Strong to Stronger   Sword And Magic   Sword Wielder   Teamwork   Thieves   Underestimated Protagonist   Virtual Reality   ",
	"rating": "(3.7 / 5.0, 159 votes)",
	"author": "Butterfly Blue   蝴蝶蓝   ",
	"year": "\n2008",
	"ranking": "#2000   #2000   #528   #6884   #1400   ",
	"reviewcount": "30 Reviews sorted by",
	"description": "Due to a mistake on his student’s part, a super Martial Artist had received a wrong class in an online game and had become a mage. He who was used to curbing violence with violence and using strength to subdue strength could only make the best out of his mistake. Taking on a new lease in life, he became a violent close combat mage. When strength and magic came perfectly together, a new gaming path had been opened by him!\n\n______\n\n“Fireball spell? Lightning Chain? Frosted Ice Mirror… etc.”\n\n“Wait, I came here to practice Kung Fu! What has magic got to do with me?”\n\n“I am a mage?”\n\n“Oh, that’s right. I am a Mage!”\n\n“However… do you really firmly believe that I am a mage?”\n\n“Alright then, look at my knives! Look at my sword! Look at my fist! Look at my concealed weapons!”\n\n“What? You’re now saying that I’m not a mage?”\n\n“If you don’t believe me, I will prove it to you: If you believe me, I will show you a performance: No one can get in the way of a mage who knows Kung Fu!”>"
}