{
	"url": "https://www.novelupdates.com/series/the-bad-eater-and-the-mad-duke-ill-eat-that-demon-deliciously/",
	"title": "The Bad Eater And The Mad Duke ~ I’ll Eat That Demon Deliciously! ~ - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/10/The-Bad-Eater-And-The-Mad-Duke-Ill-Eat-That-Demon-Deliciously.jpg",
	"noveltype": "(JP)",
	"genre": "Comedy   Fantasy   Romance   ",
	"tags": "Adapted to Manga   Beasts   Cooking   Demons   European Ambience   Female Protagonist   Magic   Magic Beasts   Nobles   ",
	"rating": "(3.4 / 5.0, 5 votes)",
	"author": "Hoshi Kanata   星彼方   ",
	"year": "\n2019",
	"ranking": "#2000   #2000   #12666   #11314   #10454   ",
	"reviewcount": "No Reviews",
	"description": "It had been three years since her debut in the social circle. Countess Melfiera had been the subject of unpleasant rumours due to her hobby, and was unable to even get engaged.\n\nShe was told by her father’s future wife, who did not think well of her, that if she did not find a fiancé within a year, she would be sent to the monastery.\n\nHearing that, she rushed to attend the autumn party.\n\nThe truth was, she was not really into it, so she found herself alone at the party where she met the others.\n\nIn the midst of this, she was attacked by a demonic beast that had been infected by a demonic poison and had gone mad.\n\nThe man who saved her from the desperate situation was a bloodied man who smiled fearlessly. In fact, this man was the Duke of Galbraith himself, who was also known as ‘the mad Duke.’\n\nDuke Galbraith was intrigued by Melfiera, who was not afraid of demons, let alone his bloodied self.\n\nNot only did he show understanding for her unspoken hobby of tasting demons and mutant plants—but he also offered to satisfy her incessant need for exploration…?!\n\nSuddenly engaged! Marriage? I’m being cheated on?!\n\nA evil eating Lady who eats demons for the sake of her curiosity, and a mad blooded Duke who exterminates demons in his domain.\n\nIt’s a fantasy romance about two people who were swept up in malicious rumours and couldn’t even find proper fiancées, until they found happiness!>"
}