{
	"url": "https://www.novelupdates.com/series/rose-princess-of-hellrage-although-i-got-killed-for-political-reasons-i-got-revived-as-the-strongest-undead/",
	"title": "Rose Princess of Hellrage: Although I got Killed for Political Reasons, I got Revived as the Strongest Undead - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/02/1.jpg",
	"noveltype": "(JP)",
	"genre": "Fantasy   Gender Bender   Mature   Psychological   Seinen   Supernatural   Tragedy   ",
	"tags": "Apathetic Protagonist   Beautiful Female Lead   Child Abuse   Child Protagonist   Dark   Death of Loved Ones   Depictions of Cruelty   Fantasy Creatures   Female Protagonist   Gore   Humanoid Protagonist   Loli   Male to Female   Pragmatic Protagonist   Prophecies   R-15   Reincarnation   Revenge   Sword And Magic   Torture   ",
	"rating": "(4.1 / 5.0, 69 votes)",
	"author": "Kirisaki Suzume   Passeri   パッセリ   霧崎雀   ",
	"year": "\n2018",
	"ranking": "#3923   #6322   #3804   #4464   #3451   ",
	"reviewcount": "6 Reviews sorted by",
	"description": "In the small country of Ciel-Terra, the Royal Prince staged a coup d’etat, killed his own brother, the former King and took control of the throne with the backing of the Four Great Kingdoms.\r\n\r\nOn her 10th birthday, René was apprehended by the knights of the Royal Prince faction for being a cursed child with silver hair and silver eyes and learnt that she was the abandoned Princess of the country. And so, branded as one who ‘was related to the depraved once-king’, she was put through hellish torture before being executed via guillotine.\r\n\r\nAs her head parted from her body, René remembered.\r\n\r\nThat, she once already lived life as a man by the name of Nagajiro Satou on Earth, and, falling victim to this world’s God flattery, was forcibly reincarnated.\r\n\r\nAnd whilst in such a state, a woman who called herself an evil goddess appeared before her.\r\n\r\n“Do you not detest him? The God who only kept half his word and reincarnated you in this form?”\r\n\r\n“Do you not detest them? The people who pushed you to your death for their own convenience?”\r\n\r\n“If you wish for vengeance, I shall bless you with a special Divine Protection.”\r\n\r\nThus René, in the name of revenge, rose as the strongest and most fearsome undead. Named Monster: Rose Princess of Hellrage. And eventually, she will end the world…>"
}