{
	"url": "https://www.novelupdates.com/series/seirei-gensou-ki/",
	"title": "Seirei Gensouki - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/04/seigensou-v10-cvr2.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Drama   Fantasy   Harem   Martial Arts   Romance   Shounen   ",
	"tags": "Academy   Adapted to Anime   Adapted to Drama CD   Adapted to Manga   Age Progression   Androgynous Characters   Bullying   Calm Protagonist   Caring Protagonist   Childhood Friends   Childhood Love   Childhood Promise   Clever Protagonist   Cooking   Demi-Humans   Demons   Determined Protagonist   Dragons   Elves   Fantasy Creatures   Gods   Handsome Male Lead   Hard-Working Protagonist   Heroes   Hiding True Identity   Kingdoms   Knights   Loli   Maids   Male Protagonist   Monsters   Multiple Reincarnated Individuals   Multiple Transported Individuals   Nobles   Older Love Interests   Overpowered Protagonist   Politics   Polygamy   R-15   Reincarnated in Another World   Revenge   Royalty   Ruthless Protagonist   Samurai   Saving the World   Siblings   S*aves   Spirits   Stoic Characters   Strong Love Interests   Strong to Stronger   Student-Teacher Relationship   Sword And Magic   Time Skip   Tragic Past   Transplanted Memories   Transported to Another World   Underestimated Protagonist   Unique Weapon User   Wars   Younger Love Interests   Younger Sisters   ",
	"rating": "(3.7 / 5.0, 142 votes)",
	"author": "Kitayama Yuri   北山結莉   ",
	"year": "\n2015",
	"ranking": "#2000   #2000   #4206   #5193   #2725   ",
	"reviewcount": "16 Reviews sorted by",
	"description": "Meet Rio: a callous orphaned boy living in the slums. At only 7-years-old, he realizes he’s actually the reincarnation of Haruto Amakawa, a Japanese university student with a tragic past. While still reeling from this shocking epiphany, Rio also comes to learn that he possesses extremely potent magical abilities and uses his new powers to solve the kidnapping case of a little girl. His good deed is acknowledged, and he’s rewarded by being enrolled into… a prestigious academy for noble children...?>"
}