{
	"url": "https://www.novelupdates.com/series/i-am-just-an-ordinary-office-worker/",
	"title": "I Am Just an Ordinary Office Worker - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/08/I-Am-Just-an-Ordinary-Office-Worker.jpg",
	"noveltype": "(KR)",
	"genre": "Action   Adventure   Comedy   Fantasy   Slice of Life   ",
	"tags": "Brotherhood   Coma   Hunters   Lack of Common Sense   Lazy Protagonist   Level System   Male Protagonist   Multiple Realms   Sibling's Care   Sword And Magic   Transmigration   Younger Brothers   ",
	"rating": "(4.0 / 5.0, 24 votes)",
	"author": "그린웨일   ",
	"year": "\n2020",
	"ranking": "#2000   #6290   #7340   #10838   #7154   ",
	"reviewcount": "3 Reviews sorted by",
	"description": "Class C player Kim Han-bi stood still and looked at the big monster in front of her.\r\n\r\nTo be exact, she was looking at the wreckage of the shattered monster.\r\n\r\n“This… what the hell…”\r\n\r\nNo way.\r\n\r\nIn Korea. No, in the whole world.\r\n\r\nShe have never seen a player who can break a big monster into pieces with just a fist.\r\n\r\nIf one or two of such players existed, the monster’s population would be half of the current existing ones.\r\n\r\nKim Han-bi turned her head toward the man who created this mess.\r\n\r\nThe man, wearing a black plastic bag over his head, was riding on a bicycle while brushing off the blood from his suit.\r\n\r\n“Oh, I am so bloody. This blood doesn’t come off easily.”\r\n\r\n“Hey…”\r\n\r\nThe man on the bicycle turned his head towards the voice calling him.\r\n\r\nOf course, what Kim Han-bi faced was not a face with eyes, nose, and mouth, but a black plastic bag.\r\n\r\n‘How did you get rid of the monsters? Did you know the monster would show up? Is the one you just used a skill? Why are you wearing a plastic bag?’\r\n\r\nAll kinds of questions lingered in her head, but there was only one question that came out from her mouth.\r\n\r\n“Who are you?”\r\n\r\nThe man in the plastic bag answered Kim Han-bi’s question in a very refreshing way.\r\n\r\n“I’m an office worker.”\r\n\r\n“What?”\r\n\r\n“I’m just an ordinary office worker.”>"
}