{
	"url": "https://www.novelupdates.com/series/mahou-gakuen-no-taizai-majutsushi/",
	"title": "Mahou Gakuen no Taizai Majutsushi - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/07/Mahou-Gakuen-no-Taizai-Majutsushi_1627623713.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Comedy   Fantasy   Harem   Romance   School Life   Supernatural   Tragedy   ",
	"tags": "Academy   Adapted to Manga   Aristocracy   Battle Academy   Beautiful Female Lead   Bullying   Conditional Power   Dense Protagonist   Elemental Magic   Elves   Evil Organizations   Fantasy World   Forced Living Arrangements   Hidden Abilities   Kind Love Interests   Love Interest Falls in Love First   Magic   Male Protagonist   Misunderstandings   Overpowered Protagonist   Perverted Protagonist   Polygamy   Popular Love Interests   Priestesses   Protagonist Strong from the Start   Royalty   Saints   Seven Deadly Sins   Spatial Manipulation   Special Abilities   Sword And Magic   Underestimated Protagonist   ",
	"rating": "(3.5 / 5.0, 73 votes)",
	"author": "Kaedehara Kouta   楓原こうた   ",
	"year": "\n2020",
	"ranking": "#3133   #1133   #3897   #1831   #4553   ",
	"reviewcount": "1 Review",
	"description": "“Say, Lady Saintess? When will you go home?”\n“Fuee~? I won’t go home as long as Julis is here, you know?”\n\nIn this world, magic has pervaded the world.\nHowever, there was a boy who couldn’t use magic and lived a normal life.\n\nHis name is Julis Anderberg.\nHe is the only son of a frontier lord, and will soon inherit the domain.\nAlthough he has no magical talent, he nevertheless lived a life that was not ashamed of being an aristocrat.\n\n…… Still, for a boy who cannot use magic, this world is stifling.\nSo, he thought.\n\n“If I can’t use magic, why not just use something else?”\n\nThen, he devised a plan.\nUnlike magic, which uses the magic power inside the body to interfere with the world, he uses the magic power in the air to interfere with────sorcery.\n\nFurthermore, he was able to master the magic related to the names of the seven deadly sins: pride, greed, envy, lust, wrath, gluttony, and sloth.\n\nHowever, that was in his childhood.\n\nNowadays────\n\n“Julis, please wake up! It’s morning, it’s morning already!”\n“……Let me sleep for four more hours.”\n“Four hours is too much sleep!”\n\nThus, he began to lead a normal life.\nHowever, it is far from normal. He’s a nobleman, but there is something wrong with this routine.\n\n“Cecilia……, you’re a saintess, why are you allowed to be here?”\n“It’s okay! I want to be with Julis!”\n\nA goddess who brings peace and blessings to the world.\nAnd she’s one of the highest priestesses of the church that serves her.\n\nIf there is one of her in the country, it is said to be a safe existence, but for some reason, she is in this remote region.\nFrom an outsider’s point of view, it’s a bizarre sight. The surrounding aristocrats won’t stay quiet.\n\nOne day, Julis and Cecilia were told by their father, the lord of the frontier,\n\n“You two are going to attend the magic academy.”\n“……I, can’t use magic, though?”\n\nThis is the story of Julis, who can’t use magic but is enrolled in the magic academy, and Cecilia a Saintess, who is the highest priestess, who are involved in various events at the academy!\n\n“Magic is strong?…… Isn’t that overly full of pride?”>"
}