{
	"url": "https://www.novelupdates.com/series/i-can-do-it/",
	"title": "I Can Do It - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/08/20200713151425.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Romance   Shounen Ai   Slice of Life   Sports   Yaoi   ",
	"tags": "Adapted to Drama CD   Adapted to Manhua   Co-Workers   Cold Love Interests   Doting Love Interests   e-Sports   First-time Interc**rse   Gamers   Handsome Male Lead   Hard-Working Protagonist   Love Interest Falls in Love First   Modern Day   Older Love Interests   Orphans   Popular Love Interests   Power Couple   Protagonist Strong from the Start   Sharp-tongued Characters   Slow Romance   Strategic Battles   Strong Love Interests   Teamwork   ",
	"rating": "(4.7 / 5.0, 660 votes)",
	"author": "Jiàng Zi Bèi   酱子贝   ",
	"year": "\n2020",
	"ranking": "#883   #1465   #773   #1240   #566   ",
	"reviewcount": "140 Reviews",
	"description": "For a certain LoL competition, a certain online streamer famous for pissing people off was currently explaining and broadcasting it at the same time.\n\nStreamer: This support, so tr*sh.\n\nStreamer: If that jungler was my teammate, I would already be idling at the fountain and playing piano for him by now.\n\nStreamer: I recommend that this player go back and properly practice how to last hit.\n\nAudience: What bullshit! If you’re any better, then you do it!\n\nStreamer: I, your dad, really can do it.\n\nAudience: Okokok. If you can do it then I’ll chop off my head so you can kick it.\n\nA few months later, the LPL’s veteran pro team TTC announced a new mid laner. A boy with flashy blue hair appeared in front of the audience and played Zed to utter perfection, killing everyone he saw, causing all the female fans to begin toeing the line of infidelity.\n\nDuring the MVP interview after the match, everyone held their breath and eagerly watched this newcomer.\n\nOnly to see the boy accept the microphone, smile and ask, “That water friend with the StarTV user ID ‘Suburb King 101,’ my team’s address is on the official website, when will you be mailing your head over?”\n\n…\n\nAfter a certain regular season match finished, the staff member went backstage to urge the team members to go onstage and conduct their interviews, only to see TTC’s new mid laner and jungler standing in the corner.\n\nTTC’s number one ace · jungler daddy Road pressed their team’s new mid laner Soft against the wall. He lowered his eyes and asked slowly, “In the interview later, do you know what to do?”\n\nThat quick-tempered mid laner, who had solidified his image as a troll in the audience’s eyes the very first time he went on stage, was currently blushing completely red. “I know. I won’t curse at anyone… I definitely won’t curse at anyone.”>"
}