{
	"url": "https://www.novelupdates.com/series/i-see-the-galaxy/",
	"title": "I See The Galaxy - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/08/I-See-The-Galaxy.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Romance   School Life   Slice of Life   ",
	"tags": "Academy   Beautiful Female Lead   Female Protagonist   Handsome Male Lead   Love Interest Falls in Love First   Modern Day   Senpai-Kouhai Relationship   Strong Love Interests   Unlucky Protagonist   Wealthy Characters   ",
	"rating": "(3.9 / 5.0, 8 votes)",
	"author": "云拿月   ",
	"year": "\n2019",
	"ranking": "#2000   #2000   #10946   #8803   #12011   ",
	"reviewcount": "3 Reviews sorted by",
	"description": "The rich and famous people in Lintian Private Highschool always rallied together, and Yu Xing, who had always been careful, was miserably tricked.\n\nA group of her rich classmates wrote a love letter to Sheng Yi in her name. \n\nRumor had it that said senior was surly and frivolous, that he was a mountain biker, a fierce fighter, and the most ruthless person. He was also unpredictable; he would smile with a pair of peach blossom eyes, but whoever messed with him suffered greatly.\n\nFrom then on, she had to stay cautious.\n\nThen one day, Yu Xing was in trouble and had to hide out in someone else’s courtyard, and she ran into a strange boy.\n\nHe crouched in front of her, staring at the corner of her mouth, and told her, “If you give me a kiss, I’ll help you find your way back home. How about it?”\n\nYu Xing gave a dry, perfunctory smile. “I’m sorry, I already have someone I like.”\n\nAfraid that he wouldn’t believe her, she said emotionally, “Do you know who the best student in Lintian is? My senior Sheng Yi is both handsome and elegant, and I would live and die for him, I would do anything for him!”\n\nThe words fell carelessly out of her mouth.\n\nThe handsome teenager licked his lips and smiled–\n\n“Is that so?” The pair of peach blossom eyes were very attractive. “What a coincidence. I am Sheng Yi.”\n\n—–\n\nI see the Milky Way, vast and boundless for a hundred thousand miles, but you are my only star.>"
}