{
	"url": "https://www.novelupdates.com/series/but-i-fell-in-love-with-you/",
	"title": "But I Fell in Love With You - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/05/But-I-fell-in-love-with-you.jpg",
	"noveltype": "(CN)",
	"genre": "Adult   Mature   School Life   Smut   ",
	"tags": "Abusive Characters   C*nnilingus   Female Protagonist   First-time Interc**rse   Male Yandere   Manipulative Characters   Masochistic Characters   Modern Day   R*pe Victim Becomes Lover   R*pe   S*x Friends   S*xual Abuse   Stockholm Syndrome   ",
	"rating": "(3.9 / 5.0, 28 votes)",
	"author": "山口玛利亚   ",
	"year": "\n2021",
	"ranking": "#1060   #1162   #6376   #1126   #7433   ",
	"reviewcount": "3 Reviews sorted by",
	"description": "Yang Nainai has been having sex dreams lately. In the dream, someone does whatever he wants to her, causing her to have strong orgasms and wake up with wet underwear. She always thought that it was because she secretly photographed handsome guys too much, and she was thinking about it day and night, until one day when she was blocked in the alley by a man who almost stripped off her clothes and make her pay.   \r\n\r\n'I heard that you secretly took my nude photos and sold them for a lot of money?' \r\n\r\nHuo Yixuan blew out a smoke ring and looked at Yang Nainai with a half smile. Yang Nainai gulped down nervously while she unconsciously took a step back. \r\n\r\n'No... You've misunderstood...'  \r\n\r\n'Huh?'  \r\n\r\n'Yes...I did it, I was wrong. I'm still young and ignorant, Big brother Huo, you are such a forgiving person, right? Please let me go, and I will give you all the money.' \r\n\r\nAs long as he didn't hit her, everything else was fine. If she lost some money so be it. She would definitely earn it back sooner or later.  \r\n\r\nHuo Yixuan stared at Yang Nainai's trembling chest as his throat went dry. \r\n\r\n'What do I need your money for?'  \r\n\r\nYang Nainai froze for a moment, \r\n\r\n'Then what do you want?'  \r\n\r\nHuo Yixuan stared at Yang Nainai with a devilish twinkle in his black orbs as his voice rasped in her ears, \r\n\r\n'Pay me with flesh.'\r\n>"
}