{
	"url": "https://www.novelupdates.com/series/higher-level-wife/",
	"title": "Higher Level Wife - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/10/Higher-Level-Wife.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Drama   Fantasy   Harem   Historical   Slice of Life   ",
	"tags": "Abandoned Children   Ancient China   Childcare   Cooking   Farming   Female Protagonist   Handsome Male Lead   Love Interest Falls in Love First   Naive Protagonist   Tragic Past   Transmigration   Twins   ",
	"rating": "(3.0 / 5.0, 43 votes)",
	"author": "Rika Shiro   梨花白   ",
	"year": "\n2017",
	"ranking": "#708   #2056   #4029   #2943   #7635   ",
	"reviewcount": "19 Reviews sorted by",
	"description": "For an ordinary working woman to transmigrate into the body of an official wife of a nobleman, described by the emperor as ‘peerless talent', life should be good, right?\r\n\r\nToo bad the official wife was an eyesore to this handsome 'peerless talent' husband. Hated as a political chess piece that prevented the dear husband from taking his true sweetheart as the official wife, she was universally despised by the entire family and was tossed into a corner of the inner court to fend for herself.\r\n\r\nIf that’s not enough, this scum man also tossed a pair of unloved children born of some lowbred woman he had accidentally xxx with into her miserably poor courtyard.\r\n\r\nThus, she was set on a course of self-destruction…\r\n\r\nOr so everyone thought.\r\n\r\nInstead of self-destruction, this is the time to hone one’s self-sustaining skills!\r\n\r\nWe are far away from the inner court battles and our face is an eyesore to everyone. So, let’s just spend our leisurely days shut away from the world! Our transmigrator is very satisfied with the lifestyle of an abandoned wife.\r\n\r\nOnly…\r\n\r\nFather of these children, why are you here?\r\n\r\nPoking your nose into our private paradise after five years, just what do you think you’re doing!?\r\n\r\nHumph!\r\n\r\nChildren, it’s time to defend our corner of paradise! >"
}