{
	"url": "https://www.novelupdates.com/series/daddy-fantasy-world-restaurant/",
	"title": "Daddy Fantasy World Restaurant - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2018/02/9165s.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Comedy   Fantasy   Romance   Slice of Life   Supernatural   ",
	"tags": "Arrogant Characters   Beautiful Female Lead   Charismatic Protagonist   Chefs   Childcare   Comedic Undertone   Cooking   Cute Children   Doting Parents   Dragon Slayers   Dwarfs   Elves   Fantasy World   Game Elements   Handsome Male Lead   Heartwarming   Late Romance   Long-distance Relationship   Male Protagonist   Multiple POV   Orcs   Restaurant   Romantic Subplot   Schemes And Conspiracies   Single Parent   Slow Growth at Start   Slow Romance   Store Owner   Sword And Magic   Sword Wielder   System Administrator   Transmigration   Transported to Another World   War Records   Wars   Weak to Strong   ",
	"rating": "(3.9 / 5.0, 205 votes)",
	"author": "Qing Yu Jiang Hu   Whispering Jianghu   轻语江湖   ",
	"year": "\n2017",
	"ranking": "#4265   #6245   #854   #9503   #2230   ",
	"reviewcount": "39 Reviews sorted by",
	"description": "There is a very strange restaurant in the City of Sin.\n\nElves and dwarves must share a table, orcs are strangely well behaved, dragons are only welcomed on the small square in front of the restaurant, and the demons must bring their own stool.\n\nThis strange restaurant with their strange rules continuous to attract a long line of customers.\n\n“This place serves the best food! The chef of this restaurant is a genius!” Some of the guests in the restaurant left glowing reviews. But these guests have a word of warning for other guests, “No matter what you do, never, never attempt to kidnap the boss or try to ‘eat and run’. You will die.”\n\nA cute little girl stood near the door, and demanded in her tiny voice, “You have eaten the food, now pay up, or I will beat you to death.” The five-meter tall dragon suddenly felt a chill running up its spine.>"
}