{
	"url": "https://www.novelupdates.com/series/ill-wrench-the-neck-of-sweet-son-of-a-bitch/",
	"title": "I’ll Wrench the Neck of Sweet Son of a B*tch - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/12/Ill-Wrench-the-Neck-of-Sweet-Son-of-a-Btch.jpg",
	"noveltype": "(KR)",
	"genre": "Fantasy   Mature   Psychological   Romance   Tragedy   ",
	"tags": "Adapted to Manhwa   Beautiful Female Lead   Betrayal   Brainwashing   Character Growth   Clingy Lover   Death   Depression   Empires   European Ambience   Fated Lovers   Female Protagonist   Kind Love Interests   Love at First Sight   Love Interest Falls in Love First   Love Rivals   Love Triangles   Manipulative Characters   Marriage   Mind Break   Multiple POV   Nobles   Past Trauma   Possessive Characters   Psychopaths   R-15   Reincarnation   Religions   Revenge   Saints   Second Chance   Secret Identity   Secrets   Shy Characters   Strong Love Interests   Suicides   Tragic Past   Trap   Unconditional Love   Unrequited Love   Weak to Strong   ",
	"rating": "(3.3 / 5.0, 46 votes)",
	"author": "Honey   꿀끼   ",
	"year": "\n2019",
	"ranking": "#4265   #2000   #7350   #6706   #6051   ",
	"reviewcount": "3 Reviews sorted by",
	"description": "Chloe Garnet, who sacrificed everything for the man she loves, died a tragic death.  Foolish Chloe realized too late.  She was the bait that the man would throw at the Emperor, and he was the most beautiful son of a bitch disguised with affection\n\n***\n\n“I like you uncle.” \n\nAt the age of seventeen, I was so young and immature that I couldn’t hide my growing heart. \n\n“I’ve been in love with you for a long time.” \n\nMy body shrunk at the sight of him slowly holding my chin and looking through my body, but I took courage and took a step closer to him. \n\n“Love. So you have already reached that age.” \n\nHis fingertips swept down my face. Despite the unexpected confession, he was overly relaxed and skillful. \n\n“I like you too, Chloe. I love you. How can I not be happy with you, who will bring me my brother’s neck in the future?” \n\nThe man whom I loved, was so sweet that he was even more cruel.\n\n“Have the emperor’s child.”\n\n*** \n\nWhen I opened my eyes again, he looked down at me with a pale face. \n\nHe was the man who trampled on my love and broke me.>"
}