{
	"url": "https://www.novelupdates.com/series/film-emperors-adorable-wife-from-ancient-times/",
	"title": "Film Emperor’s Adorable Wife From Ancient Times - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2018/03/FEW.jpg",
	"noveltype": "(CN)",
	"genre": "Adult   Martial Arts   Mature   Romance   Slice of Life   Supernatural   Yaoi   ",
	"tags": "Acting   Ancient Times   Appearance Different from Actual Age   Bodyguards   Celebrities   Clever Protagonist   Fated Lovers   Generals   Ghosts   Handsome Male Lead   Love Interest Falls in Love First   Marriage   Modern Day   Multiple Reincarnated Individuals   Pets   Popular Love Interests   Power Couple   Previous Life Talent   Reincarnation   Showbiz   Siblings   Transmigration   Transported to Another World   Tsundere   Unconditional Love   ",
	"rating": "(4.1 / 5.0, 349 votes)",
	"author": "精分柚子茶   ",
	"year": "\n2016",
	"ranking": "#479   #3800   #1071   #392   #632   ",
	"reviewcount": "85 Reviews sorted by",
	"description": "Yang Anyu, he is the general’s personal bodyguard. In the end, his soul transmigrated into a second-generation young master from the modern world, and after that, he once again encountered his “General” Yi Chenyan.\n\nThe great general he especially respected and revered, actually became an actor? (And is in fact, the popular Film Emperor)\n\nWhat made Yang Anyu more shocked——he was already “married” to Yi Chenyan.\n\nSeveral years later——\n\nFan A: Our Little Yu’s face-quality is high, acting ability is good, can sing and dance, when filming action scenes he is even more handsome, handsome to the point of collapse! Completely is a capitalized Su word!\n\nFan B: If I cannot sleep with Yang Anyu in this life is there still any meaning to it?\n\nFan C: But I heard he’s already married, his wife must have saved the whole world in her last life ah!\n\nYi Chenyan: ……\n\nBig Film Emperor Yi looked at a certain Yang Someone under his body, recently he’s been becoming more and more possessive towards him, what to do?>"
}