{
	"url": "https://www.novelupdates.com/series/back-to-the-sixties-farm-get-wealthy-raise-the-cubs/",
	"title": "Back to the Sixties: Farm, Get Wealthy & Raise the Cubs - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/02/Back-to-the-Sixties-Farm-Get-Wealthy-amp-Raise-the-Cubs_1614377702.jpg",
	"noveltype": "(CN)",
	"genre": "Adult   Comedy   Mature   Romance   Slice of Life   Supernatural   ",
	"tags": "Age Progression   Beautiful Female Lead   Business Management   Calm Protagonist   Caring Protagonist   Cheats   Childcare   Clingy Lover   College/University   Complex Family Relationships   Cooking   Cute Children   Economics   Family   Family Business   Family Conflict   Farming   Fast Learner   Female Protagonist   Handsome Male Lead   Heartwarming   Love Interest Falls in Love First   Magical Space   Management   Marriage   Military   Modern Knowledge   Money Grubber   Nationalism   Older Love Interests   Poor to Rich   Pragmatic Protagonist   Pregnancy   Proactive Protagonist   Siblings   Teachers   Time Skip   Time Travel   Transmigration   ",
	"rating": "(4.5 / 5.0, 507 votes)",
	"author": "NanFangLiZhi   Southern Lychee   南方荔枝   ",
	"year": "\nN/A",
	"ranking": "#1714   #1804   #159   #101   #678   ",
	"reviewcount": "160 Reviews sorted by",
	"description": "Lin Qing He transmigrated into a novel and became one of its cannon fodders. The novel’s background is non-viable 1960s, a time of want to eat but nothing to eat and want to wear but nothing to wear. \n\nAlthough there is a lack of supplies and life was monotonous, this wasn’t what she was concerned about because she got a small personal interspatial space, which was stuffed with supplies, so temporarily there were no worries about her basic needs.\n\nWhat she’s worried about is that if she remembers correctly, her three so-called sons will become big villains in the future, and their upright and cold dad will end up with an undeniable end.\n\nLin Qing He looked at the three future villain sons, the eldest who was only five years old, the second child was only three years old, and the third child was only one year old, and decided to give them half of a big white bun first…>"
}