{
	"url": "https://www.novelupdates.com/series/the-sick-and-gloomy-bamboo-horse-was-stunned-by-my-kiss/",
	"title": "The Sick and Gloomy Bamboo Horse Was Stunned by My Kiss - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/09/The-Sick-and-Gloomy-Bamboo-Horse-Was-Stunned-by-My-Kiss.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Drama   Fantasy   Romance   School Life   ",
	"tags": "Arrogant Characters   Beautiful Female Lead   Businessmen   Caring Protagonist   Cautious Protagonist   Character Growth   Charismatic Protagonist   Charming Protagonist   Childhood Friends   Childhood Promise   Clever Protagonist   Cold Love Interests   Coming of Age   Complex Family Relationships   Couple Growth   Cute Protagonist   Death   Determined Protagonist   Devoted Love Interests   Disabilities   Doting Love Interests   Familial Love   Family   Family Conflict   Female Protagonist   Friendship   Handsome Male Lead   Heartwarming   Inferiority Complex   Jealousy   Love Interest Falls in Love First   Lovers Reunited   Male Yandere   Marriage   Obsessive Love   Past Trauma   Personality Changes   Possessive Characters   Power Couple   Pragmatic Protagonist   Proactive Protagonist   Reincarnation   Second Chance   Siblings   Time Travel   Tsundere   Younger Brothers   ",
	"rating": "(3.7 / 5.0, 34 votes)",
	"author": "Ming Gui Zai Jiu   明桂载酒   ",
	"year": "\n2021",
	"ranking": "#4617   #4064   #7779   #7988   #6866   ",
	"reviewcount": "9 Reviews sorted by",
	"description": "Xu Mingyi is good everywhere, bright and dazzling, just like the scorching sun in the sky.\n\nThe only bad thing is that there is a white moonlight in his heart, and he doesn’t like Jiang Ning at all.\n\nThis point, Jiang Ning didn’t understand –  until he abandoned his fiancée, Jiang Ning, in the car accident and chose to rush to protect his Bai Yueguang.\n\n——\n\nYan Yixie is always isolated from the world, cold and eccentric, and only to Jiang Ning will the ice and snow melt.\n\nHe has protected her through an unknown number of dark and narrow paths.\n\nHe has created a business empire, transferred all his assets to her name, and was determined enough to commit murder for her after her death.\n\nBut he still could only watch her avoid him like a beast in silence.\n\n——\n\nOnce she opened her eyes, she had returned to her childhood.\n\nJiang Ning freely turned over a new leaf and offered a glass of wine to the past – just take those years she liked Xu Mingyi as being fed to the dogs.\n\nIn addition to using her rebirth to save her sick relatives and study hard,heading towards a career in the world,she firmly walked step by step towards Yan Yixie, who saved her life in the car accident.>"
}