{
	"url": "https://www.novelupdates.com/series/noble-wife-wants-no-love/",
	"title": "Noble Wife Wants No Love - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/01/novel2-pic.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Josei   Romance   Supernatural   ",
	"tags": "Acting   Arranged Marriage   Beautiful Female Lead   Businessmen   Calm Protagonist   Carefree Protagonist   Clever Protagonist   Cold Love Interests   Doting Parents   Family   Female Protagonist   Handsome Male Lead   Hidden Abilities   Love Interest Falls in Love First   Marriage   Misunderstandings   Modern Day   Pregnancy   Showbiz   Slow Romance   System Administrator   Transmigration   Wealthy Characters   ",
	"rating": "(4.2 / 5.0, 541 votes)",
	"author": "gōngzǐ wén zhēng   公子闻筝   ",
	"year": "\n2019",
	"ranking": "#867   #880   #761   #1351   #743   ",
	"reviewcount": "176 Reviews sorted by",
	"description": "Xu Xinyi woke up and had obtained a system, the system told her that she was a second female lead who would have a miserable end and that she has 2 choices, to endure all grievances and change for the better, or to walk the same road as the original and become a vicious woman.\n\nShe chose the second option.\n\nOne day Yi Yang couldn’t tolerate it anymore and, at the end of his patience, he demanded a divorce.\n\nXu Xinyi’s heart felt ecstatic when he put the divorce agreement in front of her but she looked at her husband with a sorrowful, heartbroken look on her face, then she waited for her husband to sign.\n\n—“Hurry up! Sign quickly! I can finally leave this hellhole!”\n\nBut Yi Yang, who could suddenly hear Xu Xinyi’s thoughts, threw away the pen and said, “Not signing.”\n\n***\n\nEver since Yi Yang discovered that he could hear Xu Xingyi’s thoughts, he found that while his wife kept kissing up to him and saying she loved him on the outside, in her heart she would laugh at that and think the complete opposite.\n\nShe only loved him on the surface.\n\n“Husband, you are so nice, I love you so much ah~!”\n\n—“I won’t have to be with this arrogant man forever, will I? I am really the most pitiful woman in the whole world!”\n\nYi Yang “Xu Xinyi !!!!!”>"
}