{
	"url": "https://www.novelupdates.com/series/magika-no-kenshi-to-shoukan-maou/",
	"title": "Magika no Kenshi to Shoukan Maou - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2015/07/magikanokenshi.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adult   Adventure   Comedy   Drama   Fantasy   Harem   Romance   School Life   Seinen   Supernatural   ",
	"tags": "Adapted to Manga   Adopted Protagonist   Battle Academy   Battle Competition   Beautiful Female Lead   Brother Complex   Calm Protagonist   Character Growth   Childhood Friends   Clever Protagonist   Cohabitation   Cooking   Couple Growth   Demons   Determined Protagonist   Elves   First-time Interc**rse   F*llatio   Goddesses   Gods   Handsome Male Lead   Hard-Working Protagonist   Harem-seeking Protagonist   H*ndjob   Incest   Loli   Maids   Male Protagonist   Mythology   Or*y   Past Plays a Big Role   Past Trauma   Polygamy   Pregnancy   Protagonist Strong from the Start   R-18   Siblings Not Related by Blood   Skill Assimilation   Spirit Advisor   Strong Love Interests   Strong to Stronger   Sword And Magic   Sword Wielder   Teamwork   Threesome   Twins   Underestimated Protagonist   Wars   ",
	"rating": "(4.1 / 5.0, 390 votes)",
	"author": "Mihara Mitsuki   ",
	"year": "\n2013\n",
	"ranking": "#4080   #6221   #1725   #949   #177   ",
	"reviewcount": "35 Reviews",
	"description": "15 years ago the world discovered magic as well as mythical beings (basically beings from various legends) in another dimension. Humankind learned to summon these dangerous mythical beings and use their power to great effect. Seven countries formed contracts with these “mythical beings” and gained their allegiance as a result. The mythical beings will choose their summoners on their 14th birthday and give them a stigma. Schools have been set up to train summoners and magical swordsman (basically bodyguards that give the summoners time to cast their spell) as a result.\n\n15 years later after the finding of magic Kazuki Hayashizaki is chosen as a summoner and given a stigma to indicate that. This is surprising since males aren’t chosen as summoners due to their low amount of mana compared to females. As the first male to be a summoner Kazuki is under a lot of scrutiny by almost everyone.\n\nTo complicate matters his sister (who’s a magical swordsman) is against him going into summoner school to train there as a summoner. Because summoners and magical swordsman have a cat mouse thing going on where summoners look down on magical swordsman as inferior so his sister naturally is against him going there. She’ll stop him even if it means going to war.\n\nKazuki however is determined to thrive in summoner school and has already determined to give it his all. Even if he’s the lowest ranked student (ranked E) and his fellow students intend to demean him he’ll prove himself as the strongest summoner.>"
}