{
	"url": "https://www.novelupdates.com/series/dragon-talisman/",
	"title": "Dragon Talisman - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2017/07/longfu-225x300.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Drama   Harem   Supernatural   Xuanhuan   ",
	"tags": "Adapted to Manhua   Army Building   Bullying   Clever Protagonist   Confident Protagonist   Cultivation   Dragons   Kingdom Building   Loyal Subordinates   Lucky Protagonist   Male Protagonist   Multiple Realms   Polygamy   Poor to Rich   Royalty   Schemes And Conspiracies   Underestimated Protagonist   Wars   Weak to Strong   ",
	"rating": "(3.7 / 5.0, 38 votes)",
	"author": "Divine Dreamwalker   Ecstatic Dream Machine   Meng Ru Shen Ji   梦入神机   ",
	"year": "\n2015",
	"ranking": "#2000   #6266   #6530   #10657   #6097   ",
	"reviewcount": "6 Reviews sorted by",
	"description": "Skyseal Emperor Gu Taxian is perhaps the greatest Emperor in all of history.  He crushed the Hundred Empires and brought them to heel, built the vast Great Stone Wall to keep out the deadly wilders, relocated mountains and rivers to promote commerce, set up roads and highways, and even promoted free academies of learning for the common man in an attempt to uplift them.  But the Skyseal Emperor's ambitions involve more than just this - he is preparing to launch a great campaign to stamp out all pagan religions, wishing to allow all men to become like gods instead of merely worshiping them.  Deities, demons, and immortals alike tremble and rage at the Skyseal Emperor's ambitions.\n\nGu Chensha is the nineteenth son of the Skyseal Emperor.  His mother had been of the royal Chen clan of the Xian Dynasty, one of the Hundred Empires, which had betrothed her to the Skyseal Emperor in an effort to strengthen ties between them.  When they refused to submit once the Skyseal Emperor began his grand campaign, he crushed them along with the rest of the Hundred Empires.  Chensha's mother then committed suicide, leaving him alone and friendless at court.\n\nFor years, Chensha played the part of a fool to avoid being targeted by the other princes... but by accident or design, he one day discovers the long-lost scroll containing the ancient technique only meant for the Sons of Heaven, the 'Son of Heaven's Consecration'.  This technique supposedly gave the ancient Sons of Heaven the power to make mortals into gods... or strip the gods of their godhood.\n\nFinally, Chensha had the power to change his destiny, but he still needed to be careful - his imperial siblings have spent years building up their powerbases, and neither they nor the maternal clans supporting them will take kindly to Chensha pushing his way into their ranks.  Moreover, if anyone discovered that he held onto the Rites of Celestial Sacrifice instead of offering them to his imperial father, the punishment would undoubtedly be death!  Only time will tell if he can make use of this opportunity to rise up to become a dragon amongst men, or just become a footnote to the grand history of the Aeternal Imperium.>"
}