{
	"url": "https://www.novelupdates.com/series/first-love-never-dies/",
	"title": "First Love Never Dies - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/12/First-Love-Never-Dies.jpg",
	"noveltype": "(KR)",
	"genre": "Fantasy   Romance   ",
	"tags": "Aristocracy   Arrogant Characters   Beautiful Female Lead   Charismatic Protagonist   Confident Protagonist   Conflicting Loyalties   Dead Protagonist   Different Social Status   Divorce   Family Conflict   Female Protagonist   First Love   Forced Marriage   Hated Protagonist   Marriage   Misunderstandings   Nobles   Royalty   Second Chance   Shy Characters   Transmigration   Weak to Strong   ",
	"rating": "(3.9 / 5.0, 44 votes)",
	"author": "Oh Yeon   오연   ",
	"year": "\n2019",
	"ranking": "#6970   #2000   #6003   #11907   #4118   ",
	"reviewcount": "1 Review sorted by",
	"description": "My husband is going to love another woman. Because it is the destiny of a male protagonist to love a female protagonist.\n\nAnd I became the ex-wife of my husband who had to die before that. It was the first love that hurt his heart, but in the end, I was just an extra that would become a forgotten memory.\n\nIt would be terrible to die according to the original story.\n\nI hate married life and the thought of being thrown out by my husband in the future.\n\nThen the only answer is a quick divorce…\n\n“An application for divorce without a cause is not permitted.”\n\nThe problem is that it doesn’t work my way!\n\nA marriage arranged by the emperor, so divorce requires justification?\n\nSo maybe I can make a reason?\n\n*\n\n“I don’t know why you keep talking about divorce. Was it so lonely?” Rashid hugged me naturally, like water flowing down my waist. I was held in his arms.\n\nRashid’s body temperature gently passed through the thin chemise dress. The warmth from his body spread quickly.\n\n“Now what…”\n\nThe moment I tried to speak...\n\nRashid turned his head and tried to meet my lips. His face drew closer. They got closer as if they would touch each other very soon.\n\n“No!”\n\nI quickly raised my hands and blocked his lips.>"
}