{
	"url": "https://www.novelupdates.com/series/the-mercenary-group-of-the-demon-lord-armys-former-dragon-knight/",
	"title": "The Mercenary Group of the Demon Lord Army’s Former Dragon Knight - Novel Updates",
	"image": "https://www.novelupdates.com/img/noimagefound.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Comedy   Ecchi   Fantasy   Harem   Martial Arts   ",
	"tags": "Beautiful Female Lead   Death of Loved Ones   Demi-Humans   Discrimination   Dragon Riders   Dragons   Elves   Eye Powers   Heterochromia   Male Protagonist   Mercenaries   Past Plays a Big Role   Personality Changes   Protagonist Strong from the Start   R-15   Revenge   Romantic Subplot   Royalty   Ruthless Protagonist   Sharp-tongued Characters   Sword And Magic   Sword Wielder   Tsundere   Wars   ",
	"rating": "(4.0 / 5.0, 74 votes)",
	"author": "よしふみ   ",
	"year": "\n2018",
	"ranking": "#2000   #2000   #3773   #4081   #4071   ",
	"reviewcount": "4 Reviews sorted by",
	"description": "“The last thing that remained was the promise with the dragon…” \r\n\r\nIn this continent where humans and demi-humans exist, it is in an era where both sides were clashing heavily…\r\n\r\nIn that kind of era, there was a man that had managed to make a variety of demi-humans coexist, and due to this, the human force ridiculed him by calling him Demon Lord. \r\n\r\nThe strong spirited king of Garuna, Verius.\r\n\r\nHe was one of the human kings that favoured the demi-humans.\r\n\r\nAnd then, there’s the family of Dragon Knights that served the king of Garuna -the Strauss. These foolhardy devilish swordsmen deftly drove flying dragons and protected the kingdom.\r\n\r\nHowever, this kingdom that loves bravery would be falling as well…\r\n\r\nBefore the overwhelming numbers of the enemy, the father and brothers in the dragon knight family were killed.\r\n\r\nThe fourth son of the Strauss family, Solje, charged into the enemy lines together with the last remaining dragon of their family, Ares.\r\n\r\n—Fighting in the battlefield and dying as a dragon knight, and then becoming a song, is an honor for them, but…Solje, who was supposed to have died in the battlefield, was brought back to life by the ancient dragon Ares with his mana. \r\n\r\nThe phantom of Ares speaks: “The Demon Lord has been killed due to the betrayal of our allied country”. \r\n\r\n“Kill these traitors”, the ancient dragon Ares requests of Solje.\r\n\r\nHugging the bones of his beloved little sister, he pledges revenge. \r\n\r\nYears passed after that…and his bitter enemy, the Faris Kingdom, continued increasing in power, and had become a giant empire.\r\n\r\nWith the cross of several battlefields, Solje was picked up by a mercenary called the White Lion.\r\n\r\nThe Banjar Mercenary Group; a mercenary group composed of a few demi-human elites fighting against the oppression of the Empire.\r\n\r\nThe Bow Princess Elf, the Giant Warrior, the Beastkin Girl, the Poet Man.\r\n\r\nHaving obtained reliable comrades, the fate of once again meeting a dragon began to move for Solje Strauss.\r\n\r\n…This is the epic sung about the 13 war beasts and one black dragon>"
}