{
	"url": "https://www.novelupdates.com/series/the-mysterious-heiress-researcher-in-disguise/",
	"title": "The Mysterious Heiress: Researcher In Disguise - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/01/The-Mysterious-Heiress-Researcher-In-Disguise.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Drama   Fantasy   Josei   School Life   ",
	"tags": "Adopted Children   Beautiful Female Lead   Black Belly   Bloodlines   Calm Protagonist   Celebrities   Death of Loved Ones   Dense Protagonist   Doctors   Doting Love Interests   Doting Older Siblings   Doting Parents   Familial Love   Famous Protagonist   Fast Learner   Female Protagonist   Genius Protagonist   Hackers   Handsome Male Lead   Heartwarming   Hidden Abilities   Hiding True Identity   Lack of Common Sense   Love Interest Falls in Love First   Medical Knowledge   Modern Day   Money Grubber   Multiple Identities   Multiple POV   Mysterious Family Background   Nationalism   Overpowered Protagonist   Parody   Possessive Characters   Power Couple   Protagonist Strong from the Start   Romantic Subplot   Secret Identity   Sharp-tongued Characters   Siblings   Sister Complex   Time Loop   Time Manipulation   Time Travel   Unconditional Love   Underestimated Protagonist   Wealthy Characters   ",
	"rating": "(2.8 / 5.0, 12 votes)",
	"author": "Unfinished Circle   ",
	"year": "\nN/A",
	"ranking": "#1473   #2000   #9309   #13805   #10671   ",
	"reviewcount": "4 Reviews sorted by",
	"description": "At long last, Fu Zhi, the mysterious heiress who had developed countless technologies was given two guardians by the country! Initially, the Lu Brothers shut her out when she joined the Lu Family. However, after spending some time with her, they began to warm up to her and took turns showing their brotherly love for her by throwing money at her. \r\n\r\nLu Yumo would say, “My sister just came from the countryside, so don’t scare her.” \r\n\r\nLu Yushen would say, “My sister is fragile, so don’t bully her.” \r\n\r\nLu Yubai would say, “My sister is not good at studying, so don’t laugh at her.” \r\n\r\nNevertheless, it soon became clear to them that the little girl from the countryside was not what they had imagined. \r\n\r\nOne day, a reporter took a photo of a professor carrying her purse and having a meal with her. \r\n\r\nThe professor said, “She is my teacher, and I’m her student.” \r\n\r\nThe crowd was surprised. “What?” \r\n\r\nAnother day, a different reporter snapped a photo of a business magnate serving her tea. \r\n\r\nThe business magnate said, “She is my boss, and I’m her employee.” \r\n\r\nThe crowd was shocked. “What?” \r\n\r\nOn a different day, a group of reporters spotted the biggest esports bigwig stepping down from his throne and helping her get rid of a scumbag. \r\n\r\nThe bigwig said, “Stop all this harassment and the rumors. She’s my sponsor.” \r\n\r\nThe netizens asked, “Just how many supporters do you have? \r\n\r\n \r\n\r\nThe country’s official portal responded, “We’re her strongest supporter.”>"
}