{
	"url": "https://www.novelupdates.com/series/i-have-medicine/",
	"title": "I Have Medicine - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/10/I-Have-Medicine.png",
	"noveltype": "(CN)",
	"genre": "Action   Adult   Adventure   Romance   Shounen Ai   Xianxia   ",
	"tags": "Adopted Children   Adopted Protagonist   Alchemy   Ancient Times   Battle Competition   Character Growth   Cohabitation   Contracts   Couple Growth   Cultivation   Cute Protagonist   Dense Protagonist   Doting Love Interests   Fast Cultivation   First Love   Handsome Male Lead   Hard-Working Protagonist   Healers   Heavenly Tribulation   Herbalist   Hiding True Abilities   Honest Protagonist   Immortals   Inheritance   Kind Love Interests   Low-key Protagonist   Lucky Protagonist   Magical Space   Manly Gay Couple   Modern Knowledge   Mysterious Family Background   Older Love Interests   Overpowered Protagonist   Pharmacist   Pill Based Cultivation   Pill Concocting   Psychic Powers   Saving the World   S*xual Cultivation Technique   Shy Characters   Sickly Characters   Skill Creation   S*aves   Slow Romance   Strength-based Social Hierarchy   Strong Love Interests   System Administrator   Transported to Another World   Twins   Unconditional Love   Unique Cultivation Technique   Weak to Strong   ",
	"rating": "(4.3 / 5.0, 338 votes)",
	"author": "Fallen Clothing Becomes Fire   衣落成火   ",
	"year": "\n2016",
	"ranking": "#4080   #838   #422   #1523   #648   ",
	"reviewcount": "75 Reviews sorted by",
	"description": "Gu Zuo: Are you sick?\n\nGongyi Tianheng: You have medicine?\n\nGu Zuo: You’re sick!\n\nGongyi Tianheng: If I say I’m sick, can you cure me?\n\nGu Zuo: If I say I have medicine, would you want it?\n\nGongyi Tianheng: However much you have is how much I want.\n\nGu Zuo: However much you want is how much I have.\n\nGongyi Tianheng: Then bring it all out.\n\nGu Zuo: …\n\nSimply speaking, a scaredy-cat shou transmigrated and had to think of a way to survive. He had a golden finger called Medicine Refining System, but unfortunately, he didn’t have the ingredients needed to refine medicine and level up.\n\nA great young master to an empire’s preeminent clan had a super high IQ, but his potential for cultivation was low. Unfortunately, pill refiners were too hard to develop, and weren’t restricted to his personal service. But he could acquire plenty of ingredients.\n\nTwo people, one was sick and one had medicine. Therefore, the one who was sick kept the one who had medicine, and everyone was happy.>"
}