{
	"url": "https://www.novelupdates.com/series/black-bellied-dad/",
	"title": "Black-Bellied Dad - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2017/01/1435227126-873802181.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Drama   Josei   Romance   Supernatural   ",
	"tags": "Black Belly   Boss-Subordinate Relationship   Childcare   Cold Protagonist   Dense Protagonist   Doting Love Interests   Female Protagonist   Ghosts   Hard-Working Protagonist   Hot-blooded Protagonist   Love Interest Falls in Love First   Manipulative Characters   Marriage   Modern Day   Office Romance   Pregnancy   Younger Love Interests   ",
	"rating": "(4.5 / 5.0, 403 votes)",
	"author": "Yin Su   罂粟   ",
	"year": "\nN/A",
	"ranking": "#5262   #4812   #2443   #1782   #1413   ",
	"reviewcount": "35 Reviews sorted by",
	"description": "She, Huang Shang Rong, is a demoness who runs her office with an iron fist.\n\nHe, Xu He Jun, is her miracle cure, no, personal assistant, who got the job because his ancestors have done a lot of good deeds and blessed him with a strong Yang aura. Just by touching him or drinking his coffee is enough to chase away her blues and curb her bad temper. But why did he apply for long leave suddenly?\n\nTurns out that he has a baby on the sly, and the mother abandoned his baby at his door, causing an upheaval to his life and nipping his budding romance with his current girlfriend. Ay, so poor thing. This young man is already dirt poor, how could he afford to take care of a baby? As his boss, she decided to step in and help him manage his time, manage his finances, set up an infant care at the office, and even volunteered to be the baby’s God mother.\n\nLooking at his second-hand furniture, she even helped to buy a Simmons and ended up testing the new mattress with him. When he brought her back to meet his parents, she got a shock to find that they were staying at Di Bao (a high-class residential zone). So he is actually a rich man pretending to be poor? Why did he deceive everyone?>"
}