{
	"url": "https://www.novelupdates.com/series/noble-lady-or-whatever-im-going-home/",
	"title": "Noble Lady or Whatever, I’m Going Home - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/07/Noble-Lady-or-Whatever-Im-Going-Home_1627190273.jpg",
	"noveltype": "(KR)",
	"genre": "Fantasy   Romance   Shoujo   ",
	"tags": "Aristocracy   Doting Older Siblings   European Ambience   Familial Love   Family   Female Protagonist   Nobles   Reincarnated in Another World   Transmigration   ",
	"rating": "(3.7 / 5.0, 15 votes)",
	"author": "단디   ",
	"year": "\n2021",
	"ranking": "#2000   #2000   #10869   #11742   #8204   ",
	"reviewcount": "1 Review sorted by",
	"description": "After confirming that I had won the lottery, I tried to quit the company, but instead, I transmigrated into the body of a princess in a strange fantasy world.\r\n\r\nThe period to receive the lottery winnings is one year, by any means, until then, I must go home. However, the only way is in a diary imbued with magic. Writing down, ‘Returning safely to the original world with a 1.7 billion won winning paper.’\r\n\r\nBut, why does it look like a p*rnographic novel in the eyes of others? I’m not a weird person—\r\n\r\nHowever, the more time I spend here, the more the warmth slowly seeps into my heart, which used to be broken and empty.\r\n\r\n“I love you.”\r\n\r\nMy loving father, Diego.\r\n\r\n“My little sister, our youngest. I’ll hold you because you might get hurt.”\r\n\r\nDid that mean he’d lift me up? Contrary to his wild appearance, my eldest brother, Theon, has a kind heart.\r\n\r\n“If you mess with my sister one more time, I will get rid of you without mice or birds knowing it.” Heyman, the second brother who is rather weird but handsome.\r\n\r\n“Don’t be sick.”\r\n\r\nGray, the third brother who is cute but also harsh, truly made of real sibling material.\r\n…Is this what family is?\r\nSolea, the owner of this body, must have lived a good life.\r\n\r\nNo, no. Wake up!\r\n1.7 billion won is waiting for me in Korea! 1.7 billion, I’ll be there soon!>"
}