{
	"url": "https://www.novelupdates.com/series/your-eternal-lies/",
	"title": "Your Eternal Lies - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/05/Your-Eternal-Lies.jpg",
	"noveltype": "(KR)",
	"genre": "Fantasy   Romance   ",
	"tags": "Acting   Adapted to Manhwa   Aristocracy   Arrogant Characters   Character Growth   Clever Protagonist   Cold Love Interests   Confident Protagonist   Confinement   Cruel Characters   Cunning Protagonist   Enemies Become Lovers   European Ambience   Female Protagonist   First Love   Friends Become Enemies   Generals   Gunfighters   Handsome Male Lead   Hard-Working Protagonist   Hiding True Identity   Jack of All Trades   Love Interest Falls in Love First   Misunderstandings   Mysterious Past   Nightmares   Past Trauma   Personality Changes   Politics   Popular Love Interests   Possessive Characters   Prison   Proactive Protagonist   Schemes And Conspiracies   Secret Identity   Strong Love Interests   Suicides   Twisted Personality   Wars   Wealthy Characters   Witches   ",
	"rating": "(4.4 / 5.0, 47 votes)",
	"author": "전후치   ",
	"year": "\n2020",
	"ranking": "#4617   #3465   #7495   #10271   #7023   ",
	"reviewcount": "5 Reviews sorted by",
	"description": "Rosén Walker was jailed for murdering her husband at the age of 17.\n\nHaving crushed the pride of the Imperial Army with two jailbreaks, she is captured again a year later and is sentenced to life imprisonment.\n\nOn a boat going to Monte Island, where only the vilest prisoners were gathered, another jailbreak is planned…\n\n“What is your crime?”\n\n“… I’m innocent.”\n\n“Only a handful of prisoners would honestly admit that they have committed a crime.”\n\nIan Connor, a blunt and upright ideologist, who is in charge of her deportation, doesn’t give any leeway.\n\n“Don’t say anything useless, just answer what you are asked.”\n\nRosén, the Empire’s best jailbreaker,\n\nand Ian Connor, a young war hero who is loved by the entire empire.\n\nTheir story unfolds on the ship heading to the worst prison on earth!\n\nNow, you shall be the judge. Is Rosén Walker a liar? Or is she not?>"
}