{
	"url": "https://www.novelupdates.com/series/correct-treatment-plan-for-straight-a-cancer/",
	"title": "Correct Treatment Plan for Straight-A Cancer - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/02/Correct-Treatment-Plan-for-StraightA-Cancer.jpg",
	"noveltype": "(CN)",
	"genre": "Adult   Romance   Yaoi   ",
	"tags": "Businessmen   Celebrities   Cute Children   Devoted Love Interests   Family Business   Family Conflict   First-time Interc**rse   Love Interest Falls in Love First   Love Rivals   Marriage   Misunderstandings   Mpreg   Omegaverse   Shameless Protagonist   Showbiz   Tsundere   Wealthy Characters   ",
	"rating": "(3.4 / 5.0, 28 votes)",
	"author": "Han Shu   寒菽   ",
	"year": "\n2020",
	"ranking": "#2000   #2000   #7455   #3871   #6351   ",
	"reviewcount": "5 Reviews sorted by",
	"description": "Pei Xiao is a third-rate star in the entertainment industry, a well-known social flower omega, and has nothing except his beautiful face. He thought, anyway, the male omega who has no backing will be submerged sooner or later, so it is better to choose the young and handsome Alpha boss to sleep with.\n\nUnexpectedly, he lost his footing and ran into his own destiny alpha. He didn’t hold on to it as he had a fling. Pei Xiao had no choice but to run away, and two years later he returned to China, and changed his career as an agent.\n\nBut he was caught by a cancerous cub and threw a marriage application to force him to get married:  ” Didn’t you secretly give birth to a child because you want to take the ball to the top and marry into a rich family? Despicable! My son cannot be an illegitimate child. Sign for me! ” \n\nHis former golden master came to the door with the old contract: “Xiaoxiao, do you remember that we have one and a half years left in our contract?”\n\nThe current movie star ex-boyfriend said, “Marry me and you will have everything you need.”\n\nHis childhood sweetheart who wants to relive his old dream with him: “Come with me, this time I will protect you.”\n\nEven the boy in the idol group that he brought under him secretly confessed to him: “Brother, I wrote a love song for you, is it good?”\n\nPei Xiao: “……”>"
}