{
	"url": "https://www.novelupdates.com/series/president-shen-always-top-up-money/",
	"title": "President Shen always Top Up Money - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/06/President-Shen.png",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Fantasy   Mystery   Sci-fi   Shounen Ai   ",
	"tags": "Artificial Intelligence   Black Belly   Calm Protagonist   Clever Protagonist   Futuristic Setting   Game Elements   Gamers   Handsome Male Lead   Hard-Working Protagonist   Lucky Protagonist   Magic   Mystery Solving   Programmer   Slow Romance   Strong Love Interests   Survival Game   Teamwork   Virtual Reality   ",
	"rating": "(4.4 / 5.0, 19 votes)",
	"author": "Da Yuan Zi   大圆子   ",
	"year": "\n2018",
	"ranking": "#2000   #2000   #9204   #11074   #7305   ",
	"reviewcount": "4 Reviews sorted by",
	"description": "2 vs 2 in the Red Desert arena,\n\nYuan San Pang shouted at his teammate next to him, “Wu Fei, we both will die if you still don’t let your husband out!”\n\nWu Fei shouted back in a panic, ”Don’t talk nonsense, okay? Besides, it’s not me who won’t let him out but it’s him who won’t come out!”\n\nWith a loud bang sound from the burst of fire, the three thousand year old turtle in front of them was seriously injured and forced to withdraw.\n\nThe planner on the other side has aimed his skill towards both of them.\n\nWu Fei already prepared to close his eyes and wait for death.\n\nThe huge sound of flapping wings came closer and he heard a short cry from San Pang next to him.\n\nWu Fei opened his eyes and a pure black feather fell on his hand —\n\nThe tall and handsome fallen angel covered him as he stood in the sky against the light.\n\nSan Pang almost cried out, “Shen Xing you have finally come out, as long as this San Pang doesn’t die tonight I will definitely offer Wu Fei with both hands!”\n\n****\n\nYoung game designer Wu Fei was in a car accident and went into coma for three years in the hospital. Three years later, he woke up and found out that his family has a huge debt of ten millions, and the whole earth undergoing big changes, turning his life upside down.\n\nIn order to repay his debt, Wu Fei took part in the “Final Plan”, the only remnant handed down by the legendary level 5 planet civilization.\n\nIt turned out … the legendary “Final Plan” is simply a large scale card drawing game!\n\n******\n\nGuess what I’ll draw out this time?>"
}