{
	"url": "https://www.novelupdates.com/series/green-light/",
	"title": "Green Light - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2015/08/greenlight.jpg",
	"noveltype": "(JP)",
	"genre": "Romance   School Life   Yaoi   ",
	"tags": "Popular Love Interests   Tsundere   ",
	"rating": "(3.3 / 5.0, 24 votes)",
	"author": "Tamaki Yura   ",
	"year": "\n2007\n",
	"ranking": "#2000   #2000   #11589   #13807   #10799   ",
	"reviewcount": "No Reviews",
	"description": "High school freshman Shotaro Izumi has a problem. That problem is his childhood best friend, Makoto Natsuki. Natsuki lives the life of a prince. Ever since elementary school, his perfect looks and sweet disposition have won the hearts of everyone around him and attracted a gaggle of fans. But Natsuki's burst into fame has plunged Izumi into hell. Five years ago Izumi's offhanded criticism of his friend earned him the hatred of all the girls (and boys) in school, and it's only gotten worse since. His friendship with Natsuki was destroyed over the incident, and the ostracism has seriously warped his personality. The more Natsuki becomes a star, the more Izumi becomes a bitter social outcast. So when Natsuki asks Izumi one day what he can do to make up for everything, Izumi flippantly says 'Go out with me' just to get a rise out of him. But to his shock, Natsuki takes him up on the offer—and seems to take it very seriously...\r\n\r\n-----------\r\n\r\nShotaro Izumi hates Makoto Natsuki. He always has. Well...maybe not always. In elementary school, they were inseparable. But a misunderstanding turned the entire class against Izumi, and Natsuki rocketed into popularity. Now, they're fifteen, and Izumi is the most warped kid in school. A loner, sarcastic, and always spoiling for a fight with Natsuki's friends, his 'entourage.' Until one day, after school, Izumi issues a challenge to humiliate the Prince Charming of their class.\r\n\r\n'<i>Then go out with me.</i>'\r\n'<i>...Out where?</i>'\r\nThe classic dumb response. '<i>I'm saying let's enter a 'chaste, platonic courtship.</i>''\r\n\r\nBut what starts out as a joke, turns into something else when Natsuki takes Izumi seriously. Old friendship and habits are reawakened, but has something else developed in their years apart? Warped and anti-social Izumi has no idea what to do when the class star only has eyes for him.>"
}