{
	"url": "https://www.novelupdates.com/series/deadly-sins-of-evil/",
	"title": "Deadly Sins of Evil - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2015/10/LunacyCover.png",
	"noveltype": "(JP)",
	"genre": "Fantasy   ",
	"tags": "Adapted to Manga   Based on a Song   European Ambience   Nobles   Seven Deadly Sins   Vocaloid   ",
	"rating": "(3.4 / 5.0, 17 votes)",
	"author": "Akuno-P   mothy_悪ノP   ",
	"year": "\n2012",
	"ranking": "#2000   #2000   #12012   #12557   #10522   ",
	"reviewcount": "No Reviews",
	"description": "Deadly Sins of Evil is a light novel series based upon the Seven Deadly Sins song series by Akuno-P. Each novel tells a different story set in the same world.\n\nv1. The Lunacy of Duke Venomania\n\n“Now, let’s dance in this harem.”\n\nThe song was posted on Nico Nico Douga in July, 2010. Using Camui Gackpo as the main vocals, other VOCALOIDs were tailored throughout the musical. The song with the theme of “Lust” in the Seven Deadly Sins series, staged in a world with medieval European style, it depicts the life of the Duke that was drowning in the lunacy of his contract with a demon. \n\nv2. Evil Food Eater Conchita\n\n“Praise and worship our great Conchita!”\n\nPosted on Nico Nico Douga in March 2009 by mothy, it used the VOCALOIDs MEIKO and Kagamine Rin and Len for the vocals. The song with the theme of “Gluttony” in the Seven Deadly Sins series, it depicts the life of “Banica Conchita”, filled with the gastronomy of the world. Within this clip, notice the Menu of the Day, such as “toadstool consommé”, for Lord Banica. \n\nv3. Gift from the Princess who Brought Sleep\n\n“For the sake of your happiness.”\n\nThe song was posted by mothy on Nico Nico Douga in May, 2011. It used the VOCALOID Hatsune Miku for the vocals. The song with the theme of “Sloth” in the Seven Deadly Sins Series, it tells the story of Margarita Blankenheim: a girl who created a peaceful Gift for the troubled people. Familiar characters from the Evil novel series also appear at the end of the video. \n\nv4. Fifth Pierrot\n\n“And turns black to red”\n\nThe song was posted by mothy on Nico Nico Douga in June, 2011. It used the VOCALOID Kagamine Len for the vocals. A song related to the Seven Deadly Sins Series, it tells the story of Lemy: an orphan boy taken up as the adopted son of the wealthy woman, Julia. It depicts the figure of Lemy living as the killer known as “Fifth Pierrot”.>"
}