{
	"url": "https://www.novelupdates.com/series/the-general-only-fears-the-maidens-escape/",
	"title": "The General Only Fears the Maiden’s Escape - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2015/08/generalmaiden.jpg",
	"noveltype": "(CN)",
	"genre": "Drama   Josei   Romance   ",
	"tags": "Ancient China   Arranged Marriage   Beautiful Female Lead   Broken Engagement   Female Protagonist   Handsome Male Lead   Pregnancy   Short Story   ",
	"rating": "(3.6 / 5.0, 95 votes)",
	"author": "Ye Shuang   葉雙   ",
	"year": "\n2013",
	"ranking": "#4080   #1847   #4597   #6188   #3911   ",
	"reviewcount": "15 Reviews sorted by",
	"description": "Everyone says that General Chai’s personality is cruel and tyrannical, having beaten to death servants and that he prefers men. Even if rumors cannot be completely believed, she doesn’t want to go along with her stepmother’s social ladder climbing intentions. Although she knows that it is improper, she decides to give him a show of severity to prevent him from coming to propose marriage. But before receiving his consent, her stepmother had already made her move. Not only did she order a servant to bring muddle-headed her to the brothel, she colluded with the brothel owner to make plans for her, to let the two of them reach the stage where there’s no going back, and force her to marry.\n\nLuckily, he knew from the start and took advantage of this to play along and help her escape from this trouble. She discovered then that he actually conducts himself in an upright and honest manner, not at all cruel and ruthless like rumors said.\n\nWho knew that her stepmother would put her under house arrest for money, wanting to sell her to someone as a concubine. He worried about her situation, and did not hesitate at all to look after her in the nights, and even making his liking towards her known, making her realize that she had long carved the imposing and handsome him into her heart.\n\nHowever, with the day of her wedding approaching, the her without freedom did not dare to hope for any results with him. Who knew that in spite of his status of a general, that in spite of criticisms, he would come to steal the bride!>"
}