{
	"url": "https://www.novelupdates.com/series/after-transmigrating-into-a-villain-cannon-fodder-male-zerg/",
	"title": "After Transmigrating Into a Villain Cannon Fodder Male Zerg - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/10/After-Transmigrating-Into-a-Villain-Cannon-Fodder-Male-Zerg.jpeg",
	"noveltype": "(CN)",
	"genre": "Comedy   Fantasy   Romance   Sci-fi   Yaoi   ",
	"tags": "Aliens   Cute Protagonist   Futuristic Setting   Gods   Humanoid Protagonist   Insects   Male Yandere   Marriage   Military   Misunderstandings   Mpreg   Multiple Transported Individuals   Obsessive Love   Possessive Characters   Seme Protagonist   Strong Love Interests   System Administrator   Transmigration   Tsundere   ",
	"rating": "(4.6 / 5.0, 155 votes)",
	"author": "牧粮人   ",
	"year": "\n2021",
	"ranking": "#1944   #1600   #3433   #2905   #2875   ",
	"reviewcount": "22 Reviews",
	"description": "After Lu Mo transmigrated into a Zerg novel, he was asked to play a cannon fodder male zerg and to never act OOC.\n\nThe original owner was ruthless, had a low IQ, and was very lazy!\n\nLu Mo executed each request ruthlessly, and after looking at the female’s increasingly numb face, his heart was full of guilt and pain.\n\nI’m really sorry that you met a scum like me!!!\n\nPreviously, he had thought the female zerg already had a broken heart and had woken up from his dream; that from then on, he would give up his illusions, face reality, and become a calm and rational zerg. Although Lu Mo’s heart ached, he was still very dedicated to his work and would never be soft hearted.\n\nBut when the female zerg rolled around the room while holding a quilt and calling for him, red-faced—Lu Mo couldn’t help but feel a thud in his heart.\n\nWhat the hell! How could this be!\n\n__\n\nLing had never seen such a strange male zerg. \n\nThe male said that he hated him, but gave him an egg. \n\nThe male cursed him for being weak and useless, but gave him freedom. \n\nThe male never said that he loved him, but he never glanced at other females.\n\nLing was confused and at loss.\n\nHis friend slammed the table: Wasn’t this just being tsundere?!\n\nLing had a sudden realization!\n\nThat’s it!\n\nThe male master was indeed a very good zerg.\n\nThree years later.\n\nLu Mo looked at Ling with a despairing expression : “Whatever. Just destroy it, hurry up. ”\n\nSo weird! How did his scum setting collapse!!!\n\nGong who is mistaken for a tsundere X Shou who is really a yandere but doesn’t know it.>"
}