{
	"url": "https://www.novelupdates.com/series/the-interstellars-expert-plant-tamer/",
	"title": "The Interstellar’s Expert Plant Tamer - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/01/The-Interstellars-Expert-Plant-Tamer.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Comedy   Mystery   Romance   Sci-fi   Slice of Life   Supernatural   Yaoi   ",
	"tags": "Aggressive Characters   Beast Companions   Beastkin   Beasts   Calm Protagonist   Clever Protagonist   Clingy Lover   Cold Love Interests   Cooking   Cruel Characters   Cute Children   Devoted Love Interests   Doting Love Interests   Family Conflict   Futuristic Setting   Handsome Male Lead   Heartwarming   Magic Beasts   Manipulative Characters   Mpreg   Pets   Poor to Rich   Possessive Characters   Pregnancy   Special Abilities   Straight Uke   Strong Love Interests   System Administrator   Teamwork   Transmigration   Younger Love Interests   ",
	"rating": "(4.2 / 5.0, 183 votes)",
	"author": "Humble Servant Girl   寒门丫头   ",
	"year": "\n2019",
	"ranking": "#843   #727   #2078   #801   #2466   ",
	"reviewcount": "52 Reviews sorted by",
	"description": "In the post-apocalyptic world, Xie Sen was bitten to death by a zombie and woke up again as Xie Sen, the famous wastrel of Beast Star City – a child abandoned by the Beast God. After his 18th birthday, the contract beast did not awaken. This world did not have zombies, the air quality was also good, Xie Sen was very satisfied. As for the vegetables and plants, they were few and expensive. But he did not care, he had a plant system, so what was he afraid of?\n\nThe only thing is, the system had insufficient energy, and if Xie Sen wanted to plant, he needed to provide energy.\n\nSystem: Another strategy is to let people appreciate you. When the gratitude energy reaches a certain amount, you can unseal a plant.\n\nXie Sen was willing to put himself out there to get points. But his strategy stalled when he met a handsome man named Maine Cox. Wasn't this the man who was the ultimate villain boss and almost destroyed the Beast Planet in the book he read before he died?\n\n(Note: Plant tamers are loved by all beasts.)>"
}