{
	"url": "https://www.novelupdates.com/series/tenkomori-the-homecoming-club-conquers-another-world/",
	"title": "Tenkomori: The Homecoming Club Conquers Another World - Novel Updates",
	"image": "https://www.novelupdates.com/img/noimagefound.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Comedy   Drama   Fantasy   School Life   Seinen   Tragedy   ",
	"tags": "Academy   Accelerated Growth   Age Progression   Alchemy   Appearance Changes   Aristocracy   Assassins   Beast Companions   Betrayal   Blacksmith   Calm Protagonist   Caring Protagonist   Character Growth   Clever Protagonist   Death of Loved Ones   Determined Protagonist   Dwarfs   Elemental Magic   Elves   Empires   Fantasy World   Fast Learner   Game Elements   Hard-Working Protagonist   Hiding True Abilities   Hunters   Jack of All Trades   Kingdoms   Knights   Level System   Magic   Male Protagonist   Near-Death Experience   Nobles   R-15   Race Change   Reincarnated in Another World   Reincarnation   S*aves   Strong to Stronger   Sword And Magic   Sword Wielder   Transmigration   Wars   Weak to Strong   ",
	"rating": "(3.8 / 5.0, 31 votes)",
	"author": "Podos   ",
	"year": "\n2020",
	"ranking": "#1957   #1299   #5969   #2129   #8640   ",
	"reviewcount": "3 Reviews sorted by",
	"description": "“I have a home to go back to.”\n\nMori Tenko is the self-proclaimed ace of the going-home club. He tries to set a new record on his usual route home from school, but gets hit by a truck when he tries to save a strange puppy.\n\nHe is picked up by a fat old man who calls himself a god, and is sent to a different world called Veriathes, where swords, magic, and skills rule the world, and where he is told to live out his life cheerfully and happily.\n\nAs soon as he arrives there, Norimi is subjected to a harsh baptism. Realizing that the world is not easy, he throws himself into battle, training himself to survive and protect his place in the world.\n\nThis is the story of a young man who later became known as the Lord of the Deep Temple and shook the world.>"
}