{
	"url": "https://www.novelupdates.com/series/transmigrating-into-the-heartthrobs-cannon-fodder-childhood-friend/",
	"title": "Transmigrating Into The Heartthrob’s Cannon Fodder Childhood Friend - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/07/Transmigrating-Into-The-Heartthrobs-Cannon-Fodder-Childhood-Friend.jpeg",
	"noveltype": "(CN)",
	"genre": "Comedy   Romance   School Life   Slice of Life   Yaoi   ",
	"tags": "Caring Protagonist   Charming Protagonist   Childhood Friends   Cold Love Interests   Complex Family Relationships   Cruel Characters   Cute Protagonist   Dense Protagonist   Devoted Love Interests   Doting Love Interests   Doting Older Siblings   Doting Parents   Dreams   Family Conflict   Fated Lovers   Fearless Protagonist   Handsome Male Lead   Love Interest Falls in Love First   Lovers Reunited   Male Yandere   Modern Day   Multiple POV   Multiple Reincarnated Individuals   Past Trauma   Popular Love Interests   Power Couple   Pragmatic Protagonist   Protagonist Strong from the Start   Schemes And Conspiracies   Shameless Protagonist   Sharp-tongued Characters   Slow Romance   Straight Uke   Strong Love Interests   System Administrator   Transmigration   Underestimated Protagonist   Wealthy Characters   ",
	"rating": "(4.6 / 5.0, 610 votes)",
	"author": "This Concubine Is In Shanyang   妾在山阳   ",
	"year": "\n2019",
	"ranking": "#639   #795   #513   #1330   #167   ",
	"reviewcount": "124 Reviews sorted by",
	"description": "[Gentle Control] was an urban danmei novel that was tagged with ‘sadistic love’ and ‘coercion’.\n\nThe protagonist shou, Xie Sui, was a proud son of heaven. He had an illustrious family background, was cold and removed from desire, and attracted many (psychopathic) admirers. From the gentle senior to the paranoid president, to the haughty and proud arch-enemy, these big guys were all top leaders of their respective fields, yet they were all crazy about him.\n\nAfter pushing him down a series of mentally and physically abusive paths, the three of them decided to join hands to destroy the Xie Family, imprison Xie Sui, crush his pride, and turn him into a pet that could only rely on them.\n\nWhile the crowd of readers howled “Wuwuwu the feels~”.\n\nSong Yu was already so angry he was going crazy. Not wanting to read any more of this eye-searingly bad novel, he cursed, “Idiots.” and hurried offline.\n\nAs a result, when he woke up, he’d transmigrated.\n\nHe’d transmigrated to become the Third Young Master of the Song Family in the novel, who had only been briefly mentioned in passing, would die of a terminal illness, and was Xie Sui’s childhood friend.\n\nSong Yu was terribly upset. At the same time, he’d already come to a decision in his heart––those three idiots, had better not think about wanting to get close to his little childhood friend!\n\n*\n\nXie Sui was born cold-hearted. In two lifetimes, he’d never tasted the sweetness of love, nor had he ever experienced the feeling of being protected.\n\nAfter destroying three big families and personally killing his enemies, he was reborn back to when he was 15 years old. He had to hide the violence and coldness in his heart and pretend to be the youth with a gentle and clean appearance that he’d been in the past.\n\nEverything was the same as before, except that the little childhood friend who was nothing but a vague memory in his previous life was exceptionally different this time.\n\nLike the spring breeze that thawed the frozen soil, someone reached into the abyss and grabbed his blood-stained hand.\n\n* \n\nSong Yu tore apart a love confession letter like he was venting and fumed, “Don’t pay attention to those people, don’t believe in their sweet words. They’re all scum, and their love is worthless. Don’t like them, okay?”\n\nXie Sui gazed at him for a long time, then laughed, “Alright, I don’t like them.”\n\nI only like you.>"
}