{
	"url": "https://www.novelupdates.com/series/i-became-the-mother-of-the-male-lead-who-lives-with-an-adulterous-man/",
	"title": "I Became The Mother Of the Male Lead Who Lives With An Ad**terous Man - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/05/I-Became-The-Mother-Of-the-Male-Lead-Who-Lives-With-An-Adulterous-Man.jpeg",
	"noveltype": "(KR)",
	"genre": "Drama   Fantasy   Romance   ",
	"tags": "Arranged Marriage   Beautiful Female Lead   Betrayal   Complex Family Relationships   Cute Children   Divorce   European Ambience   Female Protagonist   Handsome Male Lead   Love Triangles   Revenge   Transmigration   Transported to Another World   ",
	"rating": "(4.2 / 5.0, 17 votes)",
	"author": "문다해   ",
	"year": "\n2021",
	"ranking": "#2642   #1825   #7347   #4676   #6946   ",
	"reviewcount": "5 Reviews sorted by",
	"description": "​I became the mother of the male lead, who traumatized him by hanging herself because of her cheating husband.\r\n\r\nThere's no way I wouldn't give that cheating bastard a taste of his own medicine. So I slowly collected evidence and threw the divorce papers in his face. \r\n\r\n“You're nothing more than trash.”\r\n\r\nDon't worry, son. Even if I got divorced, I'll make sure you end up with the female lead. \r\n\r\nI had the male and female lead meet just as they did in the story, however, they don't want to be together and choose to cling onto me instead. \r\n\r\n“Mom, I don't need anyone else. Can't we just live together happily?”\r\n\r\n“I've always wanted to have a mother like you, for at least a day, Countess.”\r\n\r\nMy ex-husband, who had no interest in me in the original story, keeps following me around. \r\n\r\n“Can't you come back to me? I was wrong.” \r\n\r\n“What's broken can't be fixed.” \r\n\r\n“Please, I beg you.” \r\n\r\nThe father of the female lead has also become obsessed with me. \r\n\r\n“I won't let you go back to that bastard. I'll make sure to keep you by my side no matter what.” \r\n\r\nI have no intentions of ending up with a cheater…?>"
}