{
	"url": "https://www.novelupdates.com/series/i-didnt-tame-the-beastly-duke/",
	"title": "I Didn’t Tame The Beastly Duke! - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/06/I-Didnt-Tame-The-Beastly-Duke.jpg",
	"noveltype": "(KR)",
	"genre": "Adult   Fantasy   Mature   Romance   Smut   ",
	"tags": "Aristocracy   Arranged Marriage   Beautiful Female Lead   Carefree Protagonist   Caring Protagonist   Charismatic Protagonist   Charming Protagonist   Comedic Undertone   Curious Protagonist   Curses   European Ambience   Family Conflict   Female Protagonist   First-time Interc**rse   Forced Marriage   Handsome Male Lead   Love Interest Falls in Love First   Loyal Subordinates   Mob Protagonist   Nobles   Obsessive Love   Persistent Love Interests   Possessive Characters   R-18   Schemes And Conspiracies   Transmigration   Transported to Another World   Younger Sisters   ",
	"rating": "(4.1 / 5.0, 61 votes)",
	"author": "금귀   ",
	"year": "\n2021",
	"ranking": "#1444   #2477   #3903   #1292   #3620   ",
	"reviewcount": "2 Reviews sorted by",
	"description": "“Is it my wedding…. today?”\r\n\r\nA meaningless death, and when I opened my eyes…. I possessed a character?\r\n\r\nI couldn’t believe I was stuck in a rated 19 novel.\r\n\r\nMy soon to be husband comes from a cursed family. A curse that was taken on behalf of the Imperial Family. Duke Leonis Cardian.\r\n\r\n‘……Celia Montague has a clue how to solve the curse.’\r\n\r\n‘I think we have enough time for now, so let’s think about it next time.’\r\n\r\nThe two had no idea what the other’s thoughts were, and so Celia’s relationship with the male lead began.\r\n\r\nI had a wedding ceremony, and I thought we had a lot of skinship between us.\r\n\r\nHowever, I couldn’t bring myself to complete the joining with a night of intimacy.\r\n\r\n‘No, you don’t need to touch me! You keep coming to me!”\r\n\r\n‘You won’t see me? What about the curse?!’\r\n\r\nI’m feel sorry for Leonis, but I have to hang on! Yet what can I do, the worries have to go first.\r\n\r\n“You have to see if you can handle it or not.”\r\n\r\n“There’s no use crying and begging later. I won’t let you out of the bedroom.”>"
}