{
	"url": "https://www.novelupdates.com/series/fake-villain-turned-into-cannon-fodder/",
	"title": "Fake Villain Turned Into Cannon Fodder - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/06/20200212014157072.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Drama   Romance   Slice of Life   Supernatural   ",
	"tags": "Beautiful Female Lead   Cheats   Cute Protagonist   Devoted Love Interests   Doting Parents   Female Protagonist   First Love   Handsome Male Lead   Kind Love Interests   Love Interest Falls in Love First   Lovers Reunited   Lucky Protagonist   Modern Day   Multiple Transported Individuals   Poor to Rich   Pregnancy   Rich to Poor   Sickly Characters   Slow Romance   System Administrator   Transmigration   Ugly to Beautiful   Wealthy Characters   ",
	"rating": "(3.4 / 5.0, 125 votes)",
	"author": "富十二   ",
	"year": "\n2020",
	"ranking": "#2261   #6291   #1371   #1807   #2363   ",
	"reviewcount": "33 Reviews sorted by",
	"description": "An Ran transmigrated as the first love of the male lead who was destined to die early. Her courage was weak. She was a pitiful beauty who was carefully nurtured and raised by her family. She was the pearl of the Sheng family. It was a pity that she made a lot of mistakes. After the return of the true female lead who had dreamed of her future, her life would be miserable.\n\nShe was a fake villain turned into cannon fodder.\n\nAn Ran (⊙o⊙) … So I transmigrated into a novel! I should study hard and become beautiful every day! I have no time to take care of the female lead!\n\nEveryone felt that An Ran, who had been accustomed to being delicate, would return to that slum-like biological family and be miserable. She would have to spend a lifetime in the mud. Who would have thought that her parents who were money-sucking vampires were so violent!\n\n [Her main task was to enter the best college in the country with the title of the top student in the college entrance examination to survive and more importantly gain beauty rewards!] The most loved beauty, An Ran said that her face was her lifeblood. Her scum attributes could be rescued!>"
}