{
	"url": "https://www.novelupdates.com/series/__trashed-512/",
	"title": "I Became the Disabled Tyrant of the Future - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/10/I-Became-the-Disabled-Tyrant-of-the-Future.jpg",
	"noveltype": "(CN)",
	"genre": "Drama   Fantasy   Romance   ",
	"tags": "Ancient China   Cold Love Interests   Complex Family Relationships   Disabilities   Dreams   Female Protagonist   Handsome Male Lead   Love Interest Falls in Love First   Male Yandere   Possessive Characters   Precognition   Schemes And Conspiracies   Slow Romance   Tragic Past   ",
	"rating": "(3.6 / 5.0, 19 votes)",
	"author": "Fox raccoon   ",
	"year": "\n2020",
	"ranking": "#3633   #3474   #8394   #8666   #8067   ",
	"reviewcount": "5 Reviews sorted by",
	"description": "Born in the prestigious Jiang family, with charming eyes, Jiang Lao was born with wealth, beauty, and backing.\n\nThe Ninth Prince had disabled legs, had been sick for many years, with a distorted temperament, and was a vicious and sentimental monster in the eyes of everyone. After the successful seizure, he cleaned up all the people who had offended him before, with ruthless means – including Jiang Lao.\n\nKnowing the funeral in her dream, Jiang Lao was so afraid, she just wanted to stay away from that absurd and tyrannical man. Unexpectedly, in the cold winter, she still met him on a narrow road.\n\nIn the future, the cold-blooded, high-powered man was now just a weak young man who had yet to grow up. His clothes were thin and he fell into the heavy snow, looking pitiful and well-behaved. Jiang Lao stared at him for a long time, hesitating between leaving and staying.\n\nAfter thinking about it a thousand times, finally, after hearing the pale-faced young man endure a sigh of pain, she turned her head and stretched out her hand towards him.\n\nRong Ming was born and lost his mother. Since childhood, he has had no protection. At the age of thirteen, he was conspired to be seriously injured, and was abandoned to the country, where he fought for himself.\n\nJust as he was lingering and panting and was about to starve to death in the snowy weather, a pair of small hands trembled in front of him. Five fingers stop evenly, slender and white.\n\nIn the endless loneliness and darkness, there was a person who pulled him out. Since then, she had become a hot brand on his heart, a deep obsession, wanting to grasp, want to entangle. Since then, he was willing to die for her and live for her.>"
}