{
	"url": "https://www.novelupdates.com/series/the-zombies-are-coming-but-im-laying-down-at-home/",
	"title": "The Zombies Are Coming But I’m Laying Down At Home - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/08/The-Zombies-Are-Coming-But-Im-Laying-Down-At-Home.jpg",
	"noveltype": "(CN)",
	"genre": "Horror   Romance   Slice of Life   Supernatural   ",
	"tags": "Apocalypse   Beautiful Female Lead   Doting Love Interests   Farming   Female Protagonist   Handsome Male Lead   Military   Power Couple   Special Abilities   Weak to Strong   Younger Love Interests   Zombies   ",
	"rating": "(3.9 / 5.0, 15 votes)",
	"author": "孤独的兔子舞   ",
	"year": "\n2022",
	"ranking": "#2686   #3631   #10484   #6619   #9996   ",
	"reviewcount": "1 Review sorted by",
	"description": "While reading a novel, Fu Erdie thought more than once that if she arrived in an apocalyptic world, she could only wait for death.\n\nThe cars could not be driven, roads could not be recognized, they could not even cook food.\n\nThere was also physical strength involved…there was no need for her to encounter a zombie because with just a sudden drop of temperature, she could get a cold and fever and die from it.\n\nAs a useless person of the new century, she sincerely hoped that the whole world would be prosperous and free of disease and calamity. At the same time, she could just draw at home and earn living expenses while muddling through.\n\nAs a result, God played a joke on her.\n\nAfter a shower of rain, the world changed. There were zombies and dead plants everywhere.\n\nShe looked down from a window on the 10th floor and saw the crowd panicking. The cars rammed and blocked the road, and the small noodle shop she often went to was now stained with blood… Everything pulled back Fu Erdie from her fantasy.\n\nThe world had truly changed.\n\nFu Erdie decided to go out to find her relatives, and she would bet on whether she would become a zombie or an alien. She gathered her courage and opened the door, then stepped back and closed it. The zombie neighbors in the corridor were horrible! It is impossible to fight zombies, you can only wait to die in a wretched manner. And any chance, there was a lot of stored food at home that she could eat for a month.\n\nBut her ending was probably one of the two choices she had in her mind, to die now or die in a month. And she chose to lay down and continue her everyday normal life. She would just wait to meet the upcoming water and electricity cuts.\n\nOn the first day, everything was the same. The next day, everything was the same. The next day after, everything was still the same. The next…\n\nA month later, it was time to pay the utility bill. The internet got disconnected and she did not pay the bill. The rest of the building was pitch black.\n\nBut her room was still bright.\n\nThe flush toilet could be used as usual. The natural gas could be used for her luxurious bathing. The small kumquats, small peppers, and shallots planted and grown on the balcony even thrived at a rate that did not conform to the laws of nature.\n\nFu Erdie suddenly found out that she had not mutated, but her own house had mutated?!>"
}