{
	"url": "https://www.novelupdates.com/series/i-the-sacrifice-somehow-killed-the-evil-god/",
	"title": "I, the Sacrifice, Somehow Killed the Evil God (WN) - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/06/I-the-sacrifice-somehow-killed-the-evil-god.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Fantasy   Harem   Romance   Shounen   ",
	"tags": "Adapted to Manga   Charming Protagonist   Childhood Friends   Dense Protagonist   Depictions of Cruelty   Different Social Status   Dragons   Elves   Evil Gods   Eye Powers   Fantasy Creatures   Fantasy World   Fast Learner   Game Elements   Gods   Hard-Working Protagonist   Hated Protagonist   Healers   Kind Love Interests   Lack of Common Sense   Level System   Love Interest Falls in Love First   Lucky Protagonist   Magic   Magic Formations   Male Protagonist   Monsters   Multiple POV   Nobles   Overpowered Protagonist   Polygamy   Popular Love Interests   R-15   Royalty   Spirit Users   Spirits   Strong Love Interests   Strong to Stronger   Sudden Strength Gain   Sword And Magic   Sword Wielder   Underestimated Protagonist   Unique Weapon User   Unique Weapons   Weak to Strong   ",
	"rating": "(3.2 / 5.0, 48 votes)",
	"author": "Marusei   まるせい   ",
	"year": "\n2020",
	"ranking": "#4265   #3694   #2159   #2717   #4316   ",
	"reviewcount": "6 Reviews sorted by",
	"description": "When Elt learns that his childhood friend has been chosen as a sacrifice to the evil god, he heads to the evil god to take her place.\n\nThen he comes face to face with the evil god, but he activates his “Inventory” skill and survives the evil god’s attack. \n\nElt then destroyed the evil god with a counter attack. He grabbed the treasure that the evil god had stored up, the [Divine Sword Borumunk] and tried to return to the city, but the magic circle he has used to come here couldn’t teleport him back.\n\nHe has no choice but to escape from the evil god’s home and return to the village, but he finds out that the evil god’s home is quite far away from the village.\n\nWill he be able to return to the village and meet his childhood friend?>"
}