{
	"url": "https://www.novelupdates.com/series/fake-saint-of-the-year/",
	"title": "Fake Saint Of The Year - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/08/Fake-Saint-Of-The-Year.jpg",
	"noveltype": "(JP)",
	"genre": "Adventure   Comedy   Fantasy   Gender Bender   Mystery   School Life   ",
	"tags": "Academy   Adapted to Manga   Beasts   Beautiful Female Lead   Character Growth   Charismatic Protagonist   Charming Protagonist   Demons   Depression   Famous Protagonist   Fanaticism   Fantasy World   Female Protagonist   Galge   Limited Lifespan   Loyal Subordinates   Magic   Male to Female   Misunderstandings   Multiple Personalities   Multiple POV   Multiple Realms   Protagonist Strong from the Start   R-15   Reincarnated in a Game World   Reincarnated in Another World   Saints   Saving the World   Selfish Protagonist   Selfless Protagonist   Stoic Characters   Strong to Stronger   Sword And Magic   Sword Wielder   Time Paradox   Unreliable Narrator   Villainess Noble Girls   Wars   Witches   ",
	"rating": "(4.7 / 5.0, 441 votes)",
	"author": "Kabedondaikou   Wakaranai Man   わからないマン   壁首領大公   ",
	"year": "\n2020",
	"ranking": "#356   #1368   #1347   #3592   #1847   ",
	"reviewcount": "66 Reviews sorted by",
	"description": "[The Eternal Scattering Flowers: Fiore Caduto Eterna] is a game ill-suited of being known as a galge, as the main heroine would - regardless of the chosen route - meet her demise.\n\nFudou Niito, a resident of Japan, went to bed dissatisfied with the ending of the game. When he next awoke, he found himself in the body of the game’s hated fake saint, Elrise.\n\nConfused, but with an understanding that Elrise’s actions would spell disaster for many lives in the future, he took advantage of the situation and acted to change the course of history. \n\nAs a result, despite her rotten personality, Elrise was adored by those around her as a perfect saint. Furthermore, the game itself was intrinsically linked to his original world and changed accordingly to suit Elrise’s actions. Without any knowledge of what the hell was going on, the fake saint Elrise continued to alter her fate.\n\nA saint on the outside, but a man on the inside. \n\nThe transmigrator was a piece of sh*t and the person he transmigrated into was also a piece of shit. A combination of sh*t and sh*t would cause an accident – to create the greatest fake saint sh*tshow of the year!>"
}