{
	"url": "https://www.novelupdates.com/series/overlimit-skill-holder/",
	"title": "Overlimit Skill Holder - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/10/FB_IMG_1604108999180.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Drama   Fantasy   Romance   Shounen   ",
	"tags": "Adapted to Manga   Adventurers   Age Progression   Aristocracy   Beastkin   Bodyguards   Caring Protagonist   Child Abuse   Child Protagonist   Death of Loved Ones   Dense Protagonist   Discrimination   Dragons   Elemental Magic   Hidden Abilities   Hiding True Abilities   Jack of All Trades   Magic   Male Protagonist   Monsters   Overpowered Protagonist   R-15   Reincarnated in Another World   Romantic Subplot   Sentimental Protagonist   Skill Assimilation   Skill Creation   S*ave Protagonist   S*aves   Sudden Strength Gain   Sword And Magic   Time Skip   Weak to Strong   ",
	"rating": "(3.8 / 5.0, 226 votes)",
	"author": "Yasuaki Mikami   三上康明   ",
	"year": "\n2020",
	"ranking": "#388   #166   #264   #161   #548   ",
	"reviewcount": "33 Reviews sorted by",
	"description": "“Every person has an equal amount of 8 skill holder slots. There are normal skills such as【Physical Strength】which takes up 1 slot, but there are also rare skills which take up 4 to 5 slots, or even rarer ones which take up all 8 slots.”\n\nIs what old man Hinga taught me at the Orb Mine, where skill orbs are unearthed. But we “s*aves” could not acquire skills due to Contract Magic, thus s*aves had no future.\n\nOn one fateful day, the noble who owned the mine, that is, our “Master”, came to visit the Orb Mine. Due to a sudden earthquake, the ceiling collapsed, rocks fell directly on the noble’s head, and he died. At that moment, our contract magic disappeared. \n\nThe clever s*aves ran straight to the warehouse where the skill orbs were stored. They absorbed rare skill orbs, and used their newfound abilities and magic to defeat the guards and escape from the mine. It was a riot. I was too late to pick up a skill orb.\n\n“–It’s over. I will be forced back into being a s*ave,” I despaired.\n\nBut just then, I saw a skill orb that shouldn’t exist. An orb which used 10 skill holder slots -【All Things In Creation 《World Ruler》】. A non-standard skill orb that would be of no interest to anyone but researchers because no soul in the world could use it. However, I was able to absorb【World Ruler】\n\nWhy? That’s because I was a “reincarnated person”. I had 8 more skill holder slots than an average person, for a total of 16 slots. The mine is besieged and there is only one exit. A mysterious skill【World Ruler】in my hand.\n\nWhat do I do now?>"
}