{
	"url": "https://www.novelupdates.com/series/transmigrated-as-the-big-bosss-mobile-system/",
	"title": "Transmigrated As The Big Boss’s Mobile System - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/10/Transmigrated-As-The-Big-Boss’s-Mobile-System.jpg",
	"noveltype": "(CN)",
	"genre": "Fantasy   Romance   Shounen Ai   Slice of Life   ",
	"tags": "Artificial Intelligence   Cold Love Interests   Coma   Cute Protagonist   Cute Story   Game Elements   Handsome Male Lead   Human-Nonhuman Relationship   Love Interest Falls in Love First   Non-humanoid Protagonist   Programmer   Reincarnated as an Object   System Administrator   Timid Protagonist   Transmigration   ",
	"rating": "(4.3 / 5.0, 66 votes)",
	"author": "西西fer   ",
	"year": "\nN/A",
	"ranking": "#3710   #4123   #2920   #7465   #2440   ",
	"reviewcount": "11 Reviews sorted by",
	"description": "Software engineer Wen Fan accidentally found himself transmigrated as the floating ball system in a mobile phone. He is as tall as the height of a thumb with a ram capacity of hundreds of billion gigabyte.\n\nHe slept while hugging ‘QQ Penguin’, rode on the kangaroo of “Meituan Takeaway”, poked the voice bubble of “WeChat” and lived in the mansion of “The Sims”. He could also see through all network data, decipher all account passwords, and even dig out all lottery accounts.\n\nAside from the fact that he could only live on the phone screen, Wen Fan had indeed reached the peak of his life.\n\nThe only bad thing about this was that owner of the mobile phone likes to touch him visually. And he even likes to dress him up.\n\n‘Little Dragonman’, vampires, European-style nobles, ancient Hanfu; he changed his appearance every day.\n\nWen Fan: “…Big brother, spare me.”\n\nLou Wei who was deeply addicted to the game of raising a sim said, “Call me hubby.”\n\n————\n\nLou Wei, the founder of LouV Technology, the number one gaming company in Z country, has recently begun to research software every day to come up with a new game.\n\nAs soon as the news came out, people all over the country wanted to squeeze into the research and development room in order to be the first to experience the game.\n\nAfter all, Lou Wei is the number one holographic game designer in the world. He can simply design any game and it would be popular around the world.\n\nCountless LouV fans waited anxiously for the new game to be released. They waited and waited and finally,  the big boss started the live broadcast——\n\nThe big boss sat in front of the camera with a serious face: “We are currently looking for good looking erot*c fashion designs for my sim.” \n\nWen Fan: “???”\n\nFan: “Wow!!”>"
}