{
	"url": "https://www.novelupdates.com/series/sword-of-coming/",
	"title": "Sword of Coming - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/04/1496234539057.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Comedy   Drama   Fantasy   Martial Arts   Romance   Seinen   Xianxia   ",
	"tags": "Absent Parents   Adapted to Anime   Adventurers   Age Progression   Alchemy   Ancient Times   Arrogant Characters   Beautiful Female Lead   Brotherhood   Buddhism   Calm Protagonist   Character Growth   Coming of Age   Cultivation   Daoism   Determined Protagonist   Fairies   Fantasy World   Gods   Immortals   Male Protagonist   Multiple POV   Naive Protagonist   Weak to Strong   ",
	"rating": "(4.9 / 5.0, 172 votes)",
	"author": "Beacon Drama Prince   Feng Huo Xi Zhu Hou   烽火戏诸侯   ",
	"year": "\n2017",
	"ranking": "#2000   #3104   #6142   #11528   #8137   ",
	"reviewcount": "5 Reviews sorted by",
	"description": "The boundless universe was filled with all sorts of wonders.\n\nI, Chen *Ping An, only have one sword, to move mountains, turn the seas upside down, suppress demons, deal with gods, pluck stars, break rivers, destroy cities, and open the heavenly abode!\n\nMy name is Chen Ping An, Ping An* of Peace, and I am a swordsman.\n\nThe Midland world was full of wonders.\n\nIn the center of the world, there was a scholar who had once used a sword to slash out a waterfall of the Milky Way. This was the person he was the most proud of.\n\nAt the edge of the East Sea’s cliffs, there was a nameless Daoist who was unwilling to ascend to the peak of a mountain. He only wished for a cool breeze to brush against his face.\n\nIn the Western Pure Land, there was an old monk who liked to treat people to chicken soup and tell stories.\n\nIn the southern border of the Wilderness, there was a blind painter who controlled golden-armored puppets that were as tall as mountains to move the hundred thousand mountains, creating an embroidered picture.\n\nAn impoverished youth who grew up in the north. One day, he saw tens of thousands of Sword Kinesis Immortals above him, like a swarm of locusts crossing the border.\n\nHe wanted to see for himself the scholar that the storyteller had mentioned, the surging tides of the East Sea, the vast swamps of sand in the west, and the majestic mountains of the Southern Wasteland.\n\nThus, one day, the youth picked up the wooden sword and began to descend south.\n\nNotes:\n* Ping An means peace\n** The four directions here are just the four sides of the map of China and the earth. As for the World of Righteousness, it was only one of the four “World”.>"
}