{
	"url": "https://www.novelupdates.com/series/black-irons-glory/",
	"title": "Black Iron’s Glory - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/04/big_600x800.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Drama   Fantasy   Harem   School Life   Shounen   Slice of Life   Tragedy   ",
	"tags": "Age Progression   Alchemy   Ancient Times   Aristocracy   Army   Artifacts   Books   Bookworm   Calm Protagonist   Clever Protagonist   Cultivation   Death of Loved Ones   Fantasy World   Farming   Firearms   Industrialization   Kingdom Building   Kingdoms   Magic   Magic Beasts   Male Protagonist   Medieval   Military   Modern Knowledge   Nobles   Politics   Polygamy   Proactive Protagonist   Romantic Subplot   Schemes And Conspiracies   Seeing Things Other Humans Can't   Siblings   Transmigration   Wars   Wizards   ",
	"rating": "(3.5 / 5.0, 305 votes)",
	"author": "Smoke Is A Path   烟本是道   ",
	"year": "\n2018",
	"ranking": "#2000   #4701   #327   #602   #2331   ",
	"reviewcount": "63 Reviews sorted by",
	"description": "Welcome to Freia. A continent perpetually torn by war. Hundreds of years ago it was ruled by Magi, people capable of magic who viewed themselves as superior to those who could not. For thousands of years they ruled over common people… but times change.\n\nMagic is a finite resource, and with its steady depletion, the magi grew weak. Eventually they were overthrown in a great war that saw them made all but extinct. Magic fell with them, becoming taboo in every way, the object of villainy in the novels of romance and heroism.\n\nWar is a human condition, however, and it has continued to wage unerringly between the successor kingdoms and empires as the common man fights to become master of the world left behind by the magi.\n\nMagic has gone, but power remains, now wielded in the form of firearms and manpower. Muskets echo on the fields and cannons thunder on the ocean, even more so now that the greatest kingdoms on the continent have pushed out to colonise the far-away land known as Nubissia.\n\nBorn into this world of chaos is a young man, reincarnated from a salaryman in 21st century China. Lacking the prejudice against magic, and possessing a hobbyist’s knowledge of firearms and tactics, our young protagonist forges his path in a world where magic and musket war.>"
}