{
	"url": "https://www.novelupdates.com/series/beauty-of-lies/",
	"title": "Beauty of Lies - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/04/Beauty-of-Lies.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Drama   Fantasy   ",
	"tags": "Charming Protagonist   Cruel Characters   Cunning Protagonist   Female Protagonist   Futuristic Setting   Manipulative Characters   Reverse Harem   Ruthless Protagonist   System Administrator   World Hopping   ",
	"rating": "(4.3 / 5.0, 16 votes)",
	"author": "Lamb Who Loves Meat   爱吃肉的羊崽   ",
	"year": "\nN/A",
	"ranking": "#2836   #2874   #8838   #9150   #9984   ",
	"reviewcount": "4 Reviews sorted by",
	"description": "Don’t believe in beautiful women. The more beautiful women are, the more deceitful they are.\r\n\r\nTong Ling, an interstellar SSS-class wanted criminal who treats lying as her food, cheats and fools others all the time.\r\n\r\nIn an accident, she was bound to a female cannon fodder acting system numbered M577 and was sent to various small worlds to become a female cannon fodder who was about to be abused.\r\n\r\nHowever, there seems to be something wrong with the abused script——\r\n\r\n1.She is obviously a stand-in, but becomes the white moonlight who is even more authentic than the real white moonlight.\r\n\r\n2. A rich second-generation boyfriend who pretends to be poor, meets a poor girlfriend who pretends to be rich.\r\n\r\n3. The fragile dodder flower that was dismissed in Survival in the wilderness collapsed the entire team.\r\n\r\n4. After the male protagonist had the ability to read his mind, he was heavenly deceived.\r\n\r\n5. After the Gu girl who was called to kill was killed, dogs were everywhere in the rivers and lakes.\r\n\r\n6. The cannon fodder in the Infinite dungeon eventually became a heartthrob big Boss.\r\n\r\n……………………………..\r\n\r\nSeeing that the plots of the small worlds collapsed, the hand of the M577 holding the cigarette lighter, who could not replace the host, trembled: Big…big boss, when can you stop? ?\r\n\r\nTong Ling quietly breathed out a smoke ring: What should we stop? I just help those who have dreams realize their dreams.\r\n\r\nPeople who were deceived:…..>"
}