{
	"url": "https://www.novelupdates.com/series/the-reincarnated-villain-makes-the-heroines-tearfully-beg-for-forgiveness/",
	"title": "The Reincarnated Villain Makes The Heroines Tearfully Beg for Forgiveness - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/02/The-Reincarnated-Villain-Makes-The-Heroines-Tearfully-Beg-for-Forgiveness.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Drama   Harem   Mature   Romance   Xuanhuan   ",
	"tags": "Acting   Alternate World   Betrayal   Bloodlines   Calm Protagonist   Caring Protagonist   Charming Protagonist   Cheats   Clever Protagonist   Cold Love Interests   Cold Protagonist   Confident Protagonist   Cunning Protagonist   Demon Lord   Doting Older Siblings   Enemies Become Lovers   Engagement   Fast Cultivation   Genius Protagonist   Handsome Male Lead   Harem-seeking Protagonist   Male Protagonist   Manipulative Characters   Misunderstandings   Multiple Identities   Multiple POV   Mysterious Past   Overpowered Protagonist   Overprotective Siblings   Past Plays a Big Role   Polygamy   Reincarnation   Revenge   Second Chance   Siblings Not Related by Blood   System Administrator   Tragic Past   Transmigration   ",
	"rating": "(4.5 / 5.0, 132 votes)",
	"author": "天榜小南瓜   ",
	"year": "\n2020",
	"ranking": "#19   #12   #1437   #20   #3002   ",
	"reviewcount": "20 Reviews sorted by",
	"description": "Lin Yan had transmigrated into the world of Immortals and had become a Heavenly Emperor who was already defeated by the Male Lead along with the ten Female Leads at the beginning of the plot.\n\nBut as Lin Yan was about to die, he awakened a power that he could use to rewrite his past doings.\n\nSo, Lin Yan has begun to rewrite his past.\n\nWhen Lin Yan was still a child, he struggled to feed Xiao Yanran, one of the female leads, who was then younger than him. He had to strip his Supreme Bone and give it to her, protect her from the obstacles. He made a vow, “As long as I am here, no one will be allowed to bully you.”\n\nLater when Lin Yan’s cultivation rose, he had run into Xiao Mei, yet another heroine and the two of them spent time together and eventually got married. When the Devils were about to invade their world, Lin Yan said staring right into his wife’s eyes, “I will protect you with my life…”\n\nAnd soon he rose to become the Heavenly Emperor.\n\nEverything he did was to shelter his loved ones and protect the world.\n\nHowever, his actions were misunderstood by the world.\n\n…\n\nLet’s see what all Lin Yan had done in the past…>"
}