{
	"url": "https://www.novelupdates.com/series/the-attack-of-little-red-riding-hood/",
	"title": "The Attack of Little Red Riding Hood - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/07/The-Attack-of-Little-Red-Riding-Hood.png",
	"noveltype": "(CN)",
	"genre": "Comedy   Fantasy   Romance   Slice of Life   ",
	"tags": "Cold Love Interests   Depression   Determined Protagonist   Female Protagonist   First Love   Handsome Male Lead   Hospital   Limited Lifespan   Manipulative Characters   Sickly Characters   Suicides   Terminal Illness   Wealthy Characters   ",
	"rating": "(3.4 / 5.0, 5 votes)",
	"author": "Grumpy Crab   暴躁的螃蟹   ",
	"year": "\nN/A",
	"ranking": "#3633   #2804   #11404   #7365   #11942   ",
	"reviewcount": "1 Review sorted by",
	"description": "Little Red Riding Hood is ill and has only one more month to live, so she decides to live in a hospice. The attitude of the staff here is very unsatisfactory.\n\n“What kind of service attitude do you have here?” Little Red Riding Hood was angry.\n\n“You’re a dying person, do you still need to care about our attitude?” The Dean.\n\n“What happened to serving the dying people? I spent the money, and I demand the best service from you.” Little Red Riding Hood was angry.\n\n“You’re a dying person, do you still need to care about the serving?” The Dean.\n\n“Can you stop repeating about me dying here and there? Believe it or not, I will complain about you.” Little Red Riding Hood was furious.\n\n“You are a dying person with such a narrow mind.” The Dean.\n\nLittle Red Riding Hood cried in anger~~~~\n\n“Congratulations, you have been accepted into our company.” The Dean\n\nUnderworld Group’s The Honoring Life branch welcomes you.\n\nWhat Fortune 500, our headquarters is the underworld…\n\n-\n\nThe heroine is sick, she is dying, and is admitted to a hospice.\n\nThe dean of the hospice handed the heroine a contract and said, 'Come on, sign this and this man is yours.' \n\n\nThe heroine signed it. Anyway, I'm dying, so I don't care about doing anything.\n\nThe male protagonist is also sick, and due to the sickness always wants to commit suicide.\n\nMale protagonist: Why every time I commit suicide, there is always a woman to seduce me.>"
}