{
	"url": "https://www.novelupdates.com/series/i-became-the-despised-granddaughter-of-the-powerful-martial-arts-family/",
	"title": "I Became the Despised Granddaughter of the Powerful Martial Arts Family - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/12/I-Became-the-Despised-Granddaughter-of-the-Powerful-Martial-Arts-Family.jpg",
	"noveltype": "(KR)",
	"genre": "Drama   Fantasy   Romance   ",
	"tags": "Child Protagonist   Couple Growth   Doting Parents   Fantasy World   Female Protagonist   Reincarnated in Another World   Reincarnation   Second Chance   Time Travel   Transported to Another World   Villainess Noble Girls   ",
	"rating": "(4.1 / 5.0, 13 votes)",
	"author": "홍마루   ",
	"year": "\n2020",
	"ranking": "#6970   #2000   #11780   #5449   #7871   ",
	"reviewcount": "No Reviews",
	"description": "Here, inside this martial arts novel, there is a true teacher who teaches the arrogant male lead and awakens him through death.\n\nHandsome, good-natured, righteous, strong, and…\n\nAnyway, there was one big flaw in the male lead’s damn fine teacher. It was his foolish only daughter who was filled with greed. A tenacious villainess extra, who always comes back to haunt the male lead in every way, but cannot be abandoned because she is his teacher’s daughter.\n\nThroughout reading the novel, I cursed at that daughter. Saying that if it was me, I wouldn’t live like that.\n‘But that didn’t mean that I wanted to be her!’\n\nWhat was worse, Father has already died, and my reputation is the worst. \n\nInevitably, I ran away, but… I died. However, when I opened my eyes, Father was alive!?\n‘If so, in this life, I will definitely save Father!’\n\nHowever…\n“To think they’re aiming at my granddaughter!? I’ll kill them all!”\n\nWhy do I see Grandfather, who doesn’t even appear many times throughout the novel, so often like this?\n\n“Marriage? No. Yeonie said that she would live by my side for the rest of her life.”\nEven Father, somehow became weird.\n\nMoreover,\n“Why do you keep avoiding me? Is this also my mistake?”\nIsn’t the main character suddenly becoming obsessed with me?\n\n“Originally, I was destined to die. Until you came here.”\nI saved the time-limited bastard, but isn’t it that no good deed goes unpunished?\n\n“At least when I’m in front of you… I don’t think I’m tr*sh.”\nThe villain who blew off my neck is suddenly trying to repent.\n\nIs it really okay if it’s like this?>"
}