{
	"url": "https://www.novelupdates.com/series/upgrade-specialist-in-another-world/",
	"title": "Upgrade Specialist in Another World - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2016/11/usaw-cover.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Fantasy   Martial Arts   Shounen   Xuanhuan   ",
	"tags": "Arrogant Characters   Artifact Crafting   Artifacts   Average-looking Protagonist   Beast Companions   Body Tempering   Caring Protagonist   Cheats   Crafting   Cultivation   Fast Cultivation   Friendship   Game Elements   Hard-Working Protagonist   Hidden Abilities   Immortals   Kidnappings   Late Romance   Magic   Male Protagonist   Misunderstandings   Modern Knowledge   Naive Protagonist   Nobles   Orphans   Poor Protagonist   Poor to Rich   Revenge   Romantic Subplot   Royalty   Soul Power   Spear Wielder   Transplanted Memories   Unique Weapons   Unlucky Protagonist   Weak to Strong   ",
	"rating": "(3.5 / 5.0, 743 votes)",
	"author": "Endless Sea Of Clouds   茫茫云海   ",
	"year": "\n2011",
	"ranking": "#6970   #2000   #40   #1641   #201   ",
	"reviewcount": "75 Reviews sorted by",
	"description": "Just as a gamer found an overpowered skill book called ‘Item Upgrade’ in the hottest virtual reality role-playing game on Earth, something happened to the game’s system, causing his soul to leave his body and go to another dimension. Common sense dictates that he would be born anew then become the greatest overlord of this world by making use of his advanced knowledge. Not in this case! He was already dead. Only some fragments of his soul and that skill book managed to get into that dimension and merge with an ordinary common youngster called Bai Yunfei.\r\n\r\nThis was the enormous Tianhun continent, where humans could be said to have no limits. There was a group of humans here who could cultivate the power of their own souls then control their bodies, the natural elements and even other people’s souls with that power! These special beings were called — soul cultivators. Come witness how the several fragments of the dead inter-dimensional traveler’s soul and that skill book, which was not governed by the laws of this plane, were going to help Bai Yunfei become a legendary soul cultivator and craftsman!>"
}