{
	"url": "https://www.novelupdates.com/series/the-escape-of-layla/",
	"title": "The Escape of Layla - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/07/The-Escape-of-Layla.jpg",
	"noveltype": "(JP)",
	"genre": "Drama   Fantasy   Romance   Shoujo   ",
	"tags": "Adapted to Manga   Beautiful Female Lead   Broken Engagement   Caring Protagonist   Coma   Curses   Fated Lovers   Female Protagonist   Flashbacks   Handsome Male Lead   Hard-Working Protagonist   Love Triangles   Magic   Maids   Male Yandere   Marriage   Multiple POV   Near-Death Experience   Nobles   Possessive Characters   Royalty   Schemes And Conspiracies   Wizards   ",
	"rating": "(3.6 / 5.0, 17 votes)",
	"author": "Somei Yoshino   染井由乃   ",
	"year": "\n2019",
	"ranking": "#2000   #2000   #7375   #7725   #5681   ",
	"reviewcount": "4 Reviews sorted by",
	"description": "Layla Ashbury, the Duke’s daughter, has been sleeping for two years. When she woke up, the first thing she learned was that her fiancé, the crown prince, was about to marry her younger sister, Rose. Her parents excused themselves, saying that the Royal Family insisted on marrying into their family, and in the end, it was her younger sister Rose who won. Although it was only a political marriage, Layla truly loved the crown prince; but now her only option was to marry someone else and see her little sister be happy with him.\n\nAt the end of her rehabilitation treatment, Layla was able to walk around her house and it was at this point that she decided to enter a monastery on the outskirts of the Imperial Capital, which was famous for “denying access to anyone who wishes to enter”. One day, without telling her parents or the servants themselves about her whereabouts, Layla escapes from her home. But on her way, Layla is caught in the middle of the road by the heavy rain. And at that moment a young wizard appeared, whom she recognized as a famous person, and extended a hand to help her when he saw her deplorable state.\n\nA dreamy love story, which begins with the escape of the Duke’s daughter after a heartbreak.\n>"
}