{
	"url": "https://www.novelupdates.com/series/the-court-magician-who-had-her-achievements-dismissed-and-was-a-hobbyist-puppeteer-becomes-extremely-strong-even-if-shes-told-to-come-back-because-her-workplace-is-struggling-its-more-fun-to-ex/",
	"title": "The Court Magician Who Had Her Achievements Dismissed and Was a Hobbyist Puppeteer Becomes Extremely Strong – Even if She’s Told to Come Back Because Her Workplace is Struggling, It’s More Fun to Expand an Undeveloped Land with Her Childhood Friends… - Novel Updates",
	"image": "https://www.novelupdates.com/img/noimagefound.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Fantasy   Horror   Mecha   Romance   Shoujo Ai   Yuri   ",
	"tags": "Adventurers   Childhood Friends   Discrimination   Dolls/Puppets   Dungeons   Female Protagonist   Gore   Hard-Working Protagonist   Monsters   Nobles   Overpowered Protagonist   Polygamy   Post-apocalyptic   Protagonist Strong from the Start   Puppeteers   R-15   Shoujo-Ai Subplot   Strong to Stronger   Sword And Magic   Tragic Past   Underestimated Protagonist   Unique Weapon User   Unique Weapons   ",
	"rating": "(3.6 / 5.0, 57 votes)",
	"author": "kiki   ",
	"year": "\n2020",
	"ranking": "#2000   #1807   #3199   #3740   #5135   ",
	"reviewcount": "4 Reviews sorted by",
	"description": "'You're fired! Peria Alecto, we don't need you in this laboratory if you can't obey orders!'\n\nPeria, a commoner who was working as a court magician, was fired by the order of her arrogant boss, Lord Vayn. Moreover, her former boss goes so far as to trash the golem she was building as a hobby while she's also kicked out of the royal capital.\n\nOn one hand, since Peria was doing a huge amount of the laboratory's work, leaving the rest struggling to keep up—\n\n... But on the other hand, Peria reunites with her childhood friends who became top-ranked Adventurers and managed to regain her Golem. With them, she'll keep on working to realize her dream:\n\nDefeat the giant 'Monsters' that rule most of the world, that even the best magicians can't hope to match. Then, in this world divided by magical barriers, she would expand the land where humans could live and eventually return to her hometown someday.\n\nPeria's reputation for saving people with her golem eventually reaches Lord Vayn, who ridiculed her puppet magic. As the people around him ask, 'Where is your excellent subordinate?', he hurriedly demands of her, 'Please come back because we can't work without you.' and 'I want you to take credit for your achievements.' to try to get Peria back.\n\nOf course, Peria refuses with, 'I completely refuse because I'm having so much fun right now!'\n\nIt seems that her dreams are finally coming true, and she's got no time to settle for her ex-boss. And with her childhood friends and Golem, she embarks on a journey to open up the world and work to a brighter future.>"
}