{
	"url": "https://www.novelupdates.com/series/transmigrating-into-the-villains-white-rabbit-master/",
	"title": "Transmigrating into the Villain’s White Rabbit Master - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/09/20200618140535.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Romance   Slice of Life   Xianxia   Yaoi   ",
	"tags": "Caring Protagonist   Cultivation   Cute Story   Demonic Cultivation Technique   Doting Love Interests   Heartwarming   Lazy Protagonist   Love Interest Falls in Love First   Manipulative Characters   Master-Disciple Relationship   Multiple POV   Naive Protagonist   Poor Protagonist   Reincarnation   Strong Love Interests   Transmigration   Transported to Another World   Younger Love Interests   ",
	"rating": "(4.3 / 5.0, 82 votes)",
	"author": "White Sugar Syrup   白糖酱   ",
	"year": "\n2020",
	"ranking": "#2836   #3105   #3114   #4831   #2525   ",
	"reviewcount": "19 Reviews sorted by",
	"description": "Also known as [How do I bend the Villain Roommate], a master-disciple relationship on the surface.\n\nIt’s one thing to transmigrate into a book, but what’s that about transmigrating into a rabbit spirit that has cultivated a human form?\n\nAlthough Bai Yuming was the sect’s highly respected and prestigious Yuede Immortal Master, a celebrated rabbit spirit elder, but the only role he had in the book was that he was turned into a rabbit fur scarf by the protagonist.\n\nThe little rabbit wasn’t willing to part with his soft and white fur, packing his little bundle, he was ready to escape at any time.\n\nHowever the opportunity never came, and the little rabbit came across the little villain with crippled spiritual roots.\n\nAlas, seeing that they would both be slaughtered by the protagonist in the future, he would just let him stay to have a meal.\n\n“Master, this is the carrot that I grew.”\n\nRefreshing and crunchy, delicious!\n\n“Master, I made a new den for you.”\n\nDry and comfortable, good to use!\n\n“Master…”\n\nHow could his cute little disciple be so good, he would definitely save the little villain.\n\nBut no matter how the little rabbit tried to live as a recluse, the little villain still entered the Demonic path and was chased out from the sect, enduring the whole cultivation world’s rejection.\n\nHe too walked along the original body’s destiny and was imprisoned.\n\nJust as he thought he was going to become a rabbit fur scarf, the boisterous marriage procession appeared at the bottom of the sect’s mountain.\n\n“Requesting the Yuede Celestial Master to marry the Demonic Master in the interest of peace for the common people.”\n\n“Ji?!” The little rabbit was frightened to the point that the carrot in his mouth was no longer fragrant.\n\nThe handsome villain slowly walked out, “Master, marrying yourself to me can achieve peace for the three realms, and there are also carrots to eat everyday oh.”>"
}