{
	"url": "https://www.novelupdates.com/series/grasping-evil/",
	"title": "Grasping Evil - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2017/01/91.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Ecchi   Fantasy   Harem   Mature   Xianxia   ",
	"tags": "An*l   Absent Parents   Accelerated Growth   Adopted Protagonist   Age Progression   Alchemy   Animal Characteristics   Antihero Protagonist   Appearance Changes   Appearance Different from Actual Age   Army   Army Building   Artifact Crafting   Artifacts   Battle Competition   Beast Companions   Beasts   Beautiful Female Lead   Bickering Couple   Blood Manipulation   Bloodlines   Body Tempering   Buddhism   Calm Protagonist   Caring Protagonist   Clones   Comedic Undertone   Confident Protagonist   Cosmic Wars   Crafting   Cultivation   Cunning Protagonist   Dao Comprehension   Death of Loved Ones   Demonic Cultivation Technique   Demons   Destiny   Determined Protagonist   Dragons   Dreams   Early Romance   Elemental Magic   Enemies Become Allies   Enemies Become Lovers   Enlightenment   Famous Protagonist   Fantasy World   Fast Cultivation   First Love   F*llatio   Genius Protagonist   Ghosts   Gods   Handsome Male Lead   Hard-Working Protagonist   Harsh Training   Heavenly Tribulation   Hiding True Identity   H*ndjob   Human-Nonhuman Relationship   Immortals   Inheritance   Inscriptions   Kuudere   Long Separations   Loyal Subordinates   Lucky Protagonist   Magic Formations   Magical Space   Male Protagonist   Master-Disciple Relationship   Master-Servant Relationship   Mature Protagonist   Misunderstandings   Monsters   Multiple Identities   Multiple Realms   Mysterious Past   Older Love Interests   Outer Space   Past Plays a Big Role   Pill Concocting   Polygamy   Popular Love Interests   Proactive Protagonist   Prophecies   Protagonist with Multiple Bodies   Reincarnation   Revenge   Reverse R*pe   Romantic Subplot   R*pe   Sadistic Characters   Schemes And Conspiracies   Sentient Objects   Servants   S*xual Cultivation Technique   Sharp-tongued Characters   Skill Assimilation   Skill Creation   S*aves   Soul Power   Spatial Manipulation   Spirit Advisor   Spirits   Stoic Characters   Strength-based Social Hierarchy   Strong Love Interests   Sword Wielder   Threesome   Time Manipulation   Tragic Past   Tsundere   Unconditional Love   Wars   Weak to Strong   World Travel   Younger Love Interests   ",
	"rating": "(4.3 / 5.0, 600 votes)",
	"author": "I'm Ink   我是墨水   ",
	"year": "\n2013",
	"ranking": "#6970   #4717   #377   #1756   #654   ",
	"reviewcount": "65 Reviews sorted by",
	"description": "Master said, the woman I held in my hands, I must protect for the rest of my life\n\nMaster said, it’s hard to cultivate as a Demon, and once you enter the Demon Dao, you should never look back.\n\nMaster said, Heaven is a Circle and the Earth is a Square; that Circle represents (is) consummate perfection, and that Square represents (is) the edges and corners of one’s Heart, it’s a rebellion against Fate, a Disobedience to Heaven.\n\nMy master is named Ning Fan, he’s not a person, he’s merely a Butterfly who has entered Demonhood. He was searching for someone. No one knew who he was searching for. No one knew how long he would search for…>"
}