{
	"url": "https://www.novelupdates.com/series/tears-in-heaven/",
	"title": "Tears in Heaven - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/08/Tears-in-Heaven.jpg",
	"noveltype": "(CN)",
	"genre": "Drama   Josei   Romance   Slice of Life   ",
	"tags": "Adapted to Drama   Beautiful Female Lead   Brother Complex   Businessmen   Cold Protagonist   Comedic Undertone   Doctors   Female Protagonist   Friendship   Handsome Male Lead   Kind Love Interests   Love at First Sight   Love Interest Falls in Love First   Love Triangles   Marriage   Persistent Love Interests   Pregnancy   Unconditional Love   Unrequited Love   ",
	"rating": "(4.1 / 5.0, 21 votes)",
	"author": "Fei Wo Si Cun   匪我思存   ",
	"year": "\nN/A",
	"ranking": "#2000   #2680   #8734   #10840   #9300   ",
	"reviewcount": "2 Reviews sorted by",
	"description": "Everyone bears a love like a tattoo, leaving a permanent mark that cannot be obliterated. Zhenrong is Xiaosu’s tattoo. Xiaosu is Yuzheng’s tattoo. In this lifetime, nobody can replace the tattoo engraved upon one’s heart.\r\n\r\nIn order to seize headlines, willful entertainment reporter Du Xiaosu disguises herself as a nurse to slip into a hospital, where she fatefully encounters neurosurgeon Shao Zhenrong. When she meets Doctor Shao, the epitome of a true gentleman, she embarks on a relentless pursuit of his heart before finally winning his love.\r\n\r\nAlas, happiness is as volatile as fireworks. It is impossible to fully grasp the feeling with your fingers before it slips away again. Just as they manage to receive everyone’s blessing, the appearance of Shao Zhenrong’s second brother Lei Yuzheng shatters all of Du Xiaosu’s hopes and dreams.\r\n\r\n“I met her first.” The moment he speaks these words, Lei Yuzheng knows that he has truly fallen in love with Du Xiaosu. Only, they met at the wrong place at the wrong time. Due to the pain of a betrayal in her youth, Du Xiaosu allowed a singular moment of sorrow to get the better of her. Their first encounter was a mistake, as they were both intoxicated. Nevertheless, the sentiment of love has no concept of beginning, running endlessly deep. That senseless moment of passion rendered itself an eternal memory for Lei Yuzheng. \r\n\r\nAs for Du Xiaosu, the only one in her heart is the perfect and tender Shao Zhenrong. Little did she know that a mere moment of indulgence would plunge her into an emotional struggle between two worthy loves. In the end, Du Xiaosu must come to terms with the fallout. After all, you can deceive the world, but you cannot deceive your own heart.\r\n\r\nUltimately, this is a story about waiting. Du Xiaosu resolutely waits for Shao Zhenrong. Indeed, she may wait forever without turning back. Therefore, she may never know that behind her is someone who is waiting just as persistently for the moment she finally turns around.\r\n\r\nThe graceful descent of snowflakes silently vanishing against the surface of the sea: these ostensibly myriad flowers are nothing more than passing dreams, just like their love.>"
}