{
	"url": "https://www.novelupdates.com/series/after-i-turned-from-o-to-a-i-became-the-national-male-god/",
	"title": "After I Turned From O to A I Became the National Male God - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/06/After-I-Turned-From-O-to-A-I-Became-the-National-Male-God.jpg",
	"noveltype": "(CN)",
	"genre": "Fantasy   Romance   School Life   Sci-fi   Shounen Ai   ",
	"tags": "Calm Protagonist   Childhood Friends   Childhood Love   Clever Protagonist   Dense Protagonist   Friendship   Futuristic Setting   Hiding True Identity   Manly Gay Couple   Military   Omegaverse   Seme Protagonist   Time Skip   Tsundere   Unrequited Love   ",
	"rating": "(4.6 / 5.0, 49 votes)",
	"author": "一人路过   ",
	"year": "\n2020",
	"ranking": "#5262   #2000   #5909   #7039   #4343   ",
	"reviewcount": "12 Reviews sorted by",
	"description": "As an Omega, Bai Yue is not only the dream Omega in every Alpha’s eyes but also the thorn in the eyes of other Omegas.  However, one day, he received a medical examination notice and found that he had been differentiated for the second time. This time, he became an Alpha with Genetics of the grade S +, the kind with only double digits in the world.  \n\nBai Yue: Pupils are shaking. jpg. He is worried that because of this, he would be abandoned by his boyfriend who is also Alpha.  Therefore, he was determined to conceal this new secondary gender and genetic level, and never give the other party a chance to break up! When his pheromones of the S+ grade woke up, Alphas that had originally wanted to make a move on him, all ended up lying on the floor, oppressed by his pheromones.  Omegas, who originally regarded him as a thorn in their eyes, would have their legs go soft under the influence of his pheromones. Even the military, upon hearing such news, declared: Within 1 minute, I want all the information on this Alpha!\n\nFinally, he was unable to continue hiding his identity. Bai Yue became dumb.  Looking back at his childhood sweetheart, this formerly domineering Alpha unexpectedly turned red at the ears. “Idiot, I knew it a long time ago.”\n\nSince I’ve become an Alpha, then I might as well be the most Alpha of them all>"
}