{
	"url": "https://www.novelupdates.com/series/redo-of-the-hated-prince%ef%bd%9eby-intentionally-mastering-the-hated-dark-magic-i-somehow-ended-up-becoming-the-strongest%ef%bd%9e/",
	"title": "Redo of the Hated Prince～By Intentionally Mastering the Hated Dark Magic, I Somehow Ended up Becoming the Strongest～ - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/10/Redo-of-the-Hated-PrinceBy-Intentionally-Mastering-the-Hated-Dark-Magic-I-Somehow-Ended-up-Becoming-the-Strongest.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Fantasy   Harem   ",
	"tags": "Adventurers   Artifact Crafting   Child Protagonist   Empires   Fantasy World   Hated Protagonist   Magic   Male Protagonist   Monster Tamer   Monsters   Nobles   Overpowered Protagonist   Religions   Royalty   Second Chance   Wizards   ",
	"rating": "(3.5 / 5.0, 32 votes)",
	"author": "Naehara Hajime   苗原一   ",
	"year": "\n2021",
	"ranking": "#2000   #3185   #4153   #3328   #6504   ",
	"reviewcount": "2 Reviews sorted by",
	"description": "A world where someone’s magic and affinities are determined by their Crest. In that world, everyone had high hopes for Alec, the 6th Prince of the Holy Luxia Empire, due to his large mana capacity.\r\n\r\nHowever, after he receives the Dark Crest best suited for using Dark Magic at seven years old, their attitudes do a complete flip.\r\nUsers of Dark Magic all turn into demons sooner or later, so Alec having a Dark Crest best suited for using that comes to be called cursed and gets spurned by everyone.\r\n\r\nBecoming closed off from people, he stays in the palace until he turns twenty, when a revolt sparks in the empire.\r\nLeft behind in the palace, he drinks poison before trying out his Dark Magic once, but....\r\n\r\nAlec was able to use Dark Magic without turning into a demon.\r\n\r\nAs Alec’s consciousness gets swallowed by darkness, he regrets not being able to master Dark Magic, so he makes a wish────To redo everything.\r\n\r\nThis is a story of a man with a cursed Crest starting his life over again.>"
}