{
	"url": "https://www.novelupdates.com/series/the-paranoid-tyrants-illness-got-worse-today/",
	"title": "The Paranoid Tyrant’s Illness Got Worse Today - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/01/The-Paranoid-Tyrants-Illness-Got-Worse-Today.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Fantasy   Romance   Shoujo   Supernatural   Tragedy   Xuanhuan   ",
	"tags": "Beautiful Female Lead   Devoted Love Interests   Female Protagonist   Handsome Male Lead   Immortals   Lovers Reunited   Male Yandere   Mysterious Past   Reincarnation   Strong Love Interests   Tragic Past   Twisted Personality   Weak Protagonist   ",
	"rating": "(3.8 / 5.0, 9 votes)",
	"author": "青花燃   ",
	"year": "\nN/A",
	"ranking": "#2000   #2000   #11336   #9693   #11220   ",
	"reviewcount": "1 Review sorted by",
	"description": "The most fearsome female devil in the four continents of the Immortal Realm had finally died.\r\n\r\n　　Mei Xueyi felt that she would surely be sent to the bottom of the eighteen layers of hell after her death.\r\n\r\n　　Unexpectedly, when her eyes opened, there was an extremely ill but beautiful man in front of her.\r\n\r\n　　He stared at her fiercely, his gaze was wildly affectionate, paranoid and morbid.\r\n\r\n　　He regarded her as his beloved wife, building her a golden house and a jade palace, setting up a tower and a pond, and building a star-picking platform.\r\n\r\n　　He waged war at the drop of a hat.\r\n\r\n　　The human tyrant is so terrifying that the female devil sighed to herself.\r\n\r\n　　Mei Xueyi: “In fact, I am nicknamed ‘Bloody Devil’, not your little wife.”\r\n\r\n　　Wei Jinzhao: “Xueyi was stained with blood because of me.”\r\n\r\n　　Mei Xueyi: “You and I have different paths. I have to return to the immortal realm one day.”\r\n\r\n　　Wei Jinzhao: “I will destroy the immortal realm, see where you can escape.”\r\n\r\n　　Mei Xueyi: QAQ\r\n\r\n　　She always thought he was an arrogant maniac with a problem in his head.\r\n\r\n　　It was only when the smoke of gunpowder rose, the clouds and winds changed and the immortals descended to destroy the country that she discovered that he could really cover the sky with one hand and pick the stars and the moon with the other.>"
}