{
	"url": "https://www.novelupdates.com/series/i-sought-out-the-tragedys-scheming-mastermind/",
	"title": "I Sought Out the Tragedy’s Scheming Mastermind - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/06/I-Sought-Out-the-Tragedys-Scheming-Mastermind.jpg",
	"noveltype": "(KR)",
	"genre": "Fantasy   Romance   ",
	"tags": "Adapted to Manhwa   Angels   Aristocracy   Arrogant Characters   Assassins   Beautiful Female Lead   Betrayal   Bickering Couple   Brainwashing   Cautious Protagonist   Child Abuse   Clever Protagonist   Cold Love Interests   Contracts   Cruel Characters   Curses   Demons   Different Social Status   Disabilities   Discrimination   Elemental Magic   Empires   Evil Gods   Evil Religions   Fallen Angels   Fallen Nobility   Family Conflict   Fantasy World   Female Protagonist   Flashbacks   Gods   Handsome Male Lead   Hard-Working Protagonist   Hidden Abilities   Hiding True Abilities   Hiding True Identity   Honest Protagonist   Knights   Love Interest Falls in Love First   Magic   Maids   Manipulative Characters   Mind Control   Multiple POV   Mythology   Nobles   Obsessive Love   Older Love Interests   Past Trauma   Personality Changes   Possession   Possessive Characters   Priests   Revenge   Royalty   Saints   Secrets   Smart Couple   Special Abilities   Thriller   Transmigration   Transported to Another World   Underestimated Protagonist   Wizards   ",
	"rating": "(4.0 / 5.0, 50 votes)",
	"author": "Senri   센리   ",
	"year": "\n2020",
	"ranking": "#616   #1198   #5865   #2563   #4882   ",
	"reviewcount": "2 Reviews sorted by",
	"description": "I reincarnated as the villainess, Eliana Mussieux, who was killed by the scheming Emperor.\r\n\r\nRather than do nothing and die according to the novel, I planned a path to survival by seeking him out.\r\n\r\nBut . . . something’s not right?\r\n\r\nI haven’t done anything yet, but the Emperor started to cling onto me first.\r\n\r\n* * *\r\n\r\n“Don’t go.”\r\n\r\nVerkley grabbed Eliana’s collar. His gaze was entirely focused on her. Then, he whispered imploringly once more.\r\n\r\n“You tamed me, Lili. You have to take responsibility.”\r\n\r\nHe bound her hands so she wouldn’t move. Before she knew it, Verkley’s lips touched Eliana’s fingertips.\r\n\r\nFrom her fingertips to the back of her hand, his lips trailed kisses as if he were leaving a trace.\r\n\r\nHis eyes were fixed on Eliana the entire time.\r\n\r\nWith an unreadable expression, he pulled Eliana’s arm.\r\n\r\nAnd closed the distance between them.\r\n\r\nThen growled low with an insidious smile.\r\n\r\n“If you go, I’ll kill that bastard.”>"
}