{
	"url": "https://www.novelupdates.com/series/the-female-leads-daughter-after-the-bad-ending/",
	"title": "The Female Lead’s Daughter after the Bad Ending - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/03/The-Female-Leads-Daughter-after-the-Bad-Ending.jpg",
	"noveltype": "(KR)",
	"genre": "Fantasy   Romance   ",
	"tags": "Child Protagonist   Cute Children   European Ambience   Female Protagonist   Magic   Otome Game   Reincarnated in a Game World   Time Manipulation   Time Travel   ",
	"rating": "(3.9 / 5.0, 15 votes)",
	"author": "Geolgeom   걸검   ",
	"year": "\n2022",
	"ranking": "#6970   #6154   #10878   #9319   #8957   ",
	"reviewcount": "No Reviews",
	"description": "When I was five years old and while I was suffering from a fever, I realized a shocking fact.\n\nThe world I was in was a game, and I was living in the timeline after the bad ending! My mother, the female lead of the game, had already been imprisoned by the villain! It’s clear that if this continues, both my mother and I would live unfortunate lives until the day we die. So, I tried to run away along with my mother in order to live…\n\nThree years later, I eventually faced a life-threatening crisis because of the villain, and I lost my life. And at that moment—!\n\n“Rien, I’m sorry that this Mom of yours was the one who gave birth to you…”\nMy mother revived me by using a spell to trade lives. But… The magic spell got tangled, and I somehow travelled back into the past.\n\nTwelve years before I was born.\n\nThen, I can change the ending!\n\n‘Mom! Don’t get involved with that tr*sh! And don’t give birth to me, either!’\n\nSo that I could prevent my mother’s bad ending, I need to amass an enormous amount of wealth and an overwhelming power. That’s why I signed a contract with a male lead candidate in the game, who was one of the continent’s most prominent, most talented heavyweights.\n\nThe one I signed a contract with was the lord of the magic tower, and I became his disciple. But, uh, did I adjust too well to the magic tower?\n\n“So cute! I thought I was going to die trying not to poke your cheeks. This is dangerous!”\nI don’t know what to do with these mages who think I’m pretty.\n\n“…Remilienne, you must want to come into my arms for a hug. Right?”\nEven the lord of the magic tower, who seems to be focusing on the wrong thing…\n\n…No, I’m just your contractual student. I’m here only because want to gain more power to save my mom!>"
}