{
	"url": "https://www.novelupdates.com/series/im-ready-for-divorce/",
	"title": "I’m Ready for Divorce! - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/01/Im-Ready-for-Divorce_1609570560.jpeg",
	"noveltype": "(KR)",
	"genre": "Drama   Fantasy   Josei   Romance   ",
	"tags": "Absent Parents   Age Progression   Aristocracy   Beautiful Female Lead   Butlers   Caring Protagonist   Child Abuse   Child Protagonist   Childcare   Childhood Love   Dense Protagonist   Divorce   European Ambience   Female Protagonist   First Love   Handsome Male Lead   Kingdom Building   Knights   Love Interest Falls in Love First   Magic   Maids   Male Yandere   Marriage   Medical Knowledge   Military   Misunderstandings   Multiple POV   Nobles   Possessive Characters   Priests   Reincarnated in Another World   Reincarnation   Royalty   Sword And Magic   Villainess Noble Girls   Wars   Younger Love Interests   ",
	"rating": "(3.4 / 5.0, 240 votes)",
	"author": "Yang Gwaram   양과람   ",
	"year": "\n2020",
	"ranking": "#4617   #6237   #873   #1165   #547   ",
	"reviewcount": "62 Reviews sorted by",
	"description": "In the original story, the male lead accused his ex-wife of abusing him when he was younger. But unlike the original story, I raised my young husband as if he was my brother.\n\nWhen my husband went to war, I started preparing for a divorce. Because if the original story is true, the male lead will fall in love with the princess of the ruined country and bring her back!\n\nThat’s why, instead of following the road that leads to defeat, I intended to get a decent divorce.\n\nWhile preparing for that, I took some money and earned quite a fortune. I also developed a cure because I didn’t want to die of an incurable disease like the original villainess. All that’s left is getting divorced!\n\n***\n\nMy cute little husband came home and grew up to be such a fine man! But don’t worry, I’m all set to divorce you! Oddly enough, the reaction of my husband is a little strange.\n\n“While I was fighting on the battlefield, you were preparing to run away.”\n\nHe smiled dangerously, whilst wrapping his big hands around my waist.\n\n“Are you having an affair?”\n\nUnlike the pretty smile on his mouth, his eyes were burning hot.\n\nNo….. you know, I’m ready to get divorced…..>"
}