{
	"url": "https://www.novelupdates.com/series/singing-spring-melody/",
	"title": "Singing Spring Melody - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2015/08/ssm.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Drama   Josei   Romance   ",
	"tags": "Ancient China   Female Protagonist   Handsome Male Lead   Short Story   ",
	"rating": "(3.9 / 5.0, 67 votes)",
	"author": "Jue Ming   决明   ",
	"year": "\nN/A",
	"ranking": "#2000   #2000   #6528   #13810   #5940   ",
	"reviewcount": "12 Reviews sorted by",
	"description": "<p class='p1'><span class='s1'>Hahaha, this little girl is just too amusing!</span></p>\r\n<p class='p1'><span class='s1'>When other people come to beg the Godly Doctor for help they kneel outside anxiously for three days. But she’s actually enjoying it! She even hunted a pigeon and spit roasted it over the fire.</span></p>\r\n<p class='p1'><span class='s1'>When other people see the Godly Doctor they bow down low with their heads on the ground, plea, cry, beg, and do everything they can.</span></p>\r\n<p class='p1'><span class='s1'>She on the other hand,<span class='Apple-converted-space'>  </span>overwhelmed by the charm and pheromones, started to drool when she saw him!</span></p>\r\n<p class='p1'><span class='s1'>Although he always hated these excessively kind and selfless idiots, this little beauty’s “lustful” and ditzy ways are just too hilarious!</span></p>\r\n<p class='p1'><span class='s1'>A little peck on the mouth from time to time, a touch of her hands, an arm around her waist, makes him very happy ….</span></p>\r\n<p class='p1'><span class='s1'>UNTIL, he found out that he’s getting charged for all of that!?</span></p>\r\n<p class='p1'><span class='s1'>According to her profiteering ways of calculation he’s going to go bankrupt before the wedding night!</span></p>\r\n<p class='p1'><span class='s1'>Heh heh heh, since his future sister-in-law is going to play dirty and play the badger game with him then he’s not holding back anymore. He’s going to use his invincible honey trap to make sure they lose oh so completely ….</span></p>>"
}