{
	"url": "https://www.novelupdates.com/series/who-moved-my-mountain/",
	"title": "Who Moved My Mountain - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/06/Who-moved.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Comedy   Fantasy   Romance   Supernatural   Xuanhuan   ",
	"tags": "Beautiful Female Lead   Boss-Subordinate Relationship   Cold Love Interests   Curses   Cute Story   Daoism   Demons   Divination   Doting Love Interests   Doting Parents   Fated Lovers   Female Protagonist   Ghosts   God Protagonist   Gods   Handsome Male Lead   Heavenly Tribulation   Love Interest Falls in Love First   Modern Day   Money Grubber   Mythical Beasts   Naive Protagonist   Past Plays a Big Role   Protagonist Strong from the Start   Reincarnation   Tragic Past   ",
	"rating": "(4.1 / 5.0, 141 votes)",
	"author": "姑娘有喜   ",
	"year": "\n2019",
	"ranking": "#4617   #4775   #1958   #3354   #2399   ",
	"reviewcount": "18 Reviews sorted by",
	"description": "Yun Rong, the mountain demon, had slept for 3,000 years. She could only be awakened by the offering and prayers from the common people. However, one day she was rudely awakened by a weird machine called excavator.\n\nYun Rong was really angry. Which wicked person dares to move my mountain! She decided to show herself to the person in charge to resolve the situation.\n\nYun Rong: “Who permitted you to move my mountain?”\n\nDevelopment Manager: “Our company’s General Manager.”\n\nYun Rong: “Outrageous! Take me to see him!”\n\nThe Development Manager disdainfully said: “Do you think just because you want to see our General Manager you could meet him?”\n\nYun Rong modestly asked: “Then how could I meet him?”\n\nDevelopment Manager: “Minimum you have to be worth 100 million!”\n\nFrom then on, Yun Rong went down the mountain to raise her worth to at least 100 million only to discover that the world had changed a lot after 3,000 years. Apart from blessing the common people with good weather for crops and abundant harvest, she couldn’t do anything else. She realized then it would be quite difficult to raise her worth to 100 million.\n\nLu He Nian said pamperingly: “Not difficult at all. What’s mine is yours.”\n\nYun Rong said innocently: “Wishing your family luck and prosperity!”\n\n( mountain demon is also known as mountain god )>"
}