{
	"url": "https://www.novelupdates.com/series/all-round-mid-laner/",
	"title": "All-Round Mid Laner - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/10/Mid-Lane-AllRounder.jpeg",
	"noveltype": "(CN)",
	"genre": "Comedy   Fantasy   Romance   Shounen Ai   Sports   ",
	"tags": "Calm Protagonist   Carefree Protagonist   Clever Protagonist   Clubs   Cohabitation   Confident Protagonist   Dense Protagonist   Determined Protagonist   Doting Love Interests   e-Sports   Gamers   Handsome Male Lead   Hard-Working Protagonist   Kind Love Interests   Love Interest Falls in Love First   Modern Day   Omegaverse   Popular Love Interests   Power Couple   Previous Life Talent   Protagonist Strong from the Start   Quirky Characters   Roommates   Shy Characters   Slow Romance   Strategist   Strong Love Interests   Teamwork   Transmigration   Underestimated Protagonist   ",
	"rating": "(4.7 / 5.0, 377 votes)",
	"author": "Die Zhiling   蝶之灵   ",
	"year": "\n2021",
	"ranking": "#1722   #1589   #848   #320   #1285   ",
	"reviewcount": "86 Reviews sorted by",
	"description": "After waking from a car accident, professional esports player Ye Shaoyang found himself transmigrated into a mystifying A/B/O world where he was living as a noobish streamer.\n\nIn order to support himself in this new life, Ye Shaoyang decided to return to his old job and climb the ranks in the esports world. With his outstanding talent, he quickly secured a contract with a prestigious club.\n\nBut on his very first day with his new team, he unexpectedly presented as an omega right in front of the team’s captain Chi Shuo.\n\nChi Shuo took his new teammate to the hospital for an examination. Afterwards, the boy looked up at him with a sheen of moisture in his eyes. The corners of his eyes were red, and his voice was hoarse as he rasped, “Captain, the doctor says I’m allergic to suppressants. Can you help me?”\n\n“…help you how?” Chi Shuo asked.\n\nYe Shaoyang simply turned his back to Chi Shuo. “Just give me a temporary mark. Bite me here, thanks.”\n\nChi Shuo’s expression gradually crumbled.\n\nWhat was with this omega?! Was a mark something you could hand out so freely?!\n\nNetizens:\n\n[I heard Team Tianhuan’s new teammate is an omega!]\n[Is he going to play support? Everyone, please be sure to take care of your sweet, delicate, adorable new omega support!]\nThat was the buzz, right up until Ye Shaoyang demonstrated his explosive prowess by single-handedly taking five kills in a competitive match.\n\nTheir opponents:\n\n[Sweet? Delicate? This is a demon lord, isn’t it?]\n[He killed me enough to break my brain. I want to uninstall the game!]\n[Even if we lose the battle, Ye Shaoyang must die!]\n[Target that omega! Show no mercy!]\nIt’s time to get to know an omega with flashy and extraordinary skills.\n\nWho says an omega has to be sweet, delicate, and adorable? This omega has the power to blow up the whole league.>"
}