{
	"url": "https://www.novelupdates.com/series/private-wife/",
	"title": "Private Wife - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/09/Private-Wife.jpg",
	"noveltype": "(CN)",
	"genre": "Fantasy   Romance   Shoujo   ",
	"tags": "Ancient China   Female Protagonist   Modern Knowledge   Transmigration   ",
	"rating": "(3.5 / 5.0, 4 votes)",
	"author": "千寻   ",
	"year": "\n2015",
	"ranking": "#2000   #2000   #13086   #11074   #12385   ",
	"reviewcount": "No Reviews",
	"description": "I heard in the town north’s prince mansion’s three young master Shēn Jǐngrán possessed an innate talent and intelligence, repeatedly established meritorious deeds, actually is the Emperor at one’s side favorite courtier…\r\n\r\nI heard that the devil incarnate Shēn Jǐngrán by chance was poisoned by a woman and temporary became a handicapped person and was captured as a pawn.\r\n\r\nSexy body, beautiful and alluring appearance, proud of one’s career, she Hán Xīfān is among the successful people.\r\n\r\neven if in love always encounters people who are hardly warm and virtuous, she’s still living a very happy life.\r\n\r\nIt’s just that she didn’t think God would be so fierce, she went to her ex-boyfriend’s wedding reception, intoxicated later awaken, however she crossed!\r\n\r\nThe big chest turned into a flat chest, long beautiful legs transformed into a thin matchstick and at one side is a paralyzed man who it is said to be his husband.\r\n\r\nPlease! her one’s lifetime is just be a leading role, never at once to run past a costume of minor characters in opera, OK.\r\n\r\nIn order to be able to live into the ancient times, she drew a blueprint for a wheelchair and a rocking chair. She sold it to a shop to earn money.\r\n\r\nEven displayed her good cooking skills, almost fattening up the six-block muscle.\r\n\r\nShe thought he was a pauper and didn’t expect that the jade pendant she took out can buy the whole street of the gold storefront,\r\n\r\nThe more she gets along with him, the more she felt attached to him. His tenderness made her not want to act as a strong woman, she just wants to lean on him.\r\n\r\nThe smooth days permit her to feel happiness, who would have thought that the neighbor who introduced the miracle doctor unexpectedly diagnosed him with no disability.\r\n\r\nnot only his martial arts is exceptional, but also his identity is respectable, the emperor dote on and trust him and bestowed him a princess to marry.\r\n\r\nIt is not enough to be bullied by love in the 21st century and run to ancient times to be cheated by a man…\r\n\r\nShēn Jǐng Rán then cries out his grievances: “Niángzǐ you just listen to half of your words and run away. You didn’t hear what I was saying back there, resisting imperial decree, withdrawing from marriage.”\r\n\r\n>"
}