{
	"url": "https://www.novelupdates.com/series/transmigrated-as-the-villains-wife/",
	"title": "Transmigrated as the Villain’s Wife - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/09/Transmigrated-as-the-Villains-Wife.jpg",
	"noveltype": "(CN)",
	"genre": "Fantasy   Romance   ",
	"tags": "Beautiful Female Lead   Business Management   Childcare   Cute Children   Female Protagonist   Genius Protagonist   Marriage   Poor to Rich   Pregnancy   Transmigration   ",
	"rating": "(4.0 / 5.0, 8 votes)",
	"author": "松鼠醉鱼   ",
	"year": "\n2021",
	"ranking": "#337   #320   #10712   #4154   #11138   ",
	"reviewcount": "3 Reviews sorted by",
	"description": "Su Xiaoman was a fake daughter of a wealthy family. She is not loved by her biological parents. She was also rejected by her adoptive parents.\n\nWhen she woke up again, she found herself in a book and became the village flower Su Xiaoman in the 1970s.\n\nSu Xiaoman is the wife of a villain male supporting role.\n\nThe original Su Xiaoman, who disliked poverty and loves the rich, is devoted to climbing high branches, and is obsessed with Jiang Yantang, the educated youth male protagonist who just went to the countryside.\n\nSu Xiaoman was unwilling to marry Xie Mingtu because of his poverty, and is still obsessed with the male protagonist Jiang Yantang. Who knows that not long after, the second brother of the male protagonist Jiang Yantang went to the countryside to visit relatives, and found that the poor boy Xie Mingtu was the real child of the Jiang family, and the male protagonist Jiang Yan Tang was held wrong.\n\nXie Mingtu returned to Jiang’s house in the courtyard, but he was ridiculed because he was gloomy and vulgar, and he couldn’t compare to the fake boy Jiang Yantang, and his wife was also even more obsessed with Jiang Yantang…\n\nIn this way, Xie Mingtu had completely blackened, mad and ruthless, and became the biggest villain in the book, and ended up tragically.\n\nWhen Su Xiaoman opened her eyes, Xie Mingtu, the biggest villain in the book, was about to feed her rice soup. His clothes were tattered and his bones were visible. When he saw her wake up, his tone was humble and cautious:\n\n“Manman?”\n\nWhen Xie Mingtu thought that the woman would not give him any response, a pair of slender and tender hands grabbed his thin wrist.>"
}