{
	"url": "https://www.novelupdates.com/series/it-is-said-that-i-attacked-the-great-demon-king/",
	"title": "It Is Said That I Attacked the Great Demon King - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/01/It-Is-Said-That-I-Attacked-the-Great-Demon-King.jpg",
	"noveltype": "(CN)",
	"genre": "Adventure   Fantasy   Shounen Ai   ",
	"tags": "Accelerated Growth   Artificial Intelligence   Cold Love Interests   Futuristic Setting   Gamers   Hard-Working Protagonist   Protagonist Falls in Love First   Protagonist Strong from the Start   Strong Love Interests   Strong to Stronger   Transmigration   ",
	"rating": "(3.9 / 5.0, 31 votes)",
	"author": "柏瑭   ",
	"year": "\n2020",
	"ranking": "#4080   #6316   #8436   #6342   #7241   ",
	"reviewcount": "1 Review sorted by",
	"description": "Xiao Zhi has been addicted to games recently. His hobby is robbing the boss. He is living in Hessian with his gentle, shy and prosperous and beautiful little brother, giving gifts to each other, going for a walk on a date, and having a good time. After he woke up, he logged in to the game, but the game is no longer the same version.\n\nIt is said that the ruthless and gloomy Lord of Hessian once had a lover who cheated him for money and deceived him for s**, and then evaporated, making him wait for hundreds of years. And the wanted notice is still valid till now.\n\nXiao Zhi looked at the unobtainable items that were shining with gold in his game backpack:…You’re not talking about me, are you?\n\nFor the sake of his life, he had to embark on the road of self-improvement by punching the boss and stepping on the player, and became the creator of many legends on the mainland.\n\nAt the top auction, legendary treasures shocked the people.\n\nThe ancient city that has been lost for a thousand years has actually reappeared in the world.\n\nXiao Zhi: Yes, I did all these.\n\nThen he was accidentally listed as a popular candidate for crusade against the lord of Hessian.\n\nEmperor: Brave man, the future of mankind is on you!\n\nPope: Destroy evil on behalf of the light!\n\nPlayer: There are top bosses participating in this battle, it’s finished.\n\nXiao Zhi: You guys wait…\n\nLord Hessian: You can have my life anytime you want, as long as you are willing to keep my corpse by your side.\n\nXiao Zhi: What happened in the past few hundred years? And, where is my gentle and shy little brother!?>"
}