{
	"url": "https://www.novelupdates.com/series/why-cant-you-eat/",
	"title": "Why, Can’t You Eat? - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/06/Why-Cant-You-Eat.jpg",
	"noveltype": "(KR)",
	"genre": "Adult   Fantasy   Harem   Romance   Smut   Supernatural   ",
	"tags": "Aristocracy   Beautiful Female Lead   Demons   European Ambience   Female Protagonist   Maids   Multiple Identities   Multiple Personalities   Nobles   R-18   Reverse Harem   Reverse R*pe   R*pe   S*x Friends   Succubus   Threesome   ",
	"rating": "(3.9 / 5.0, 63 votes)",
	"author": "Yuchae   유채   ",
	"year": "\n2019",
	"ranking": "#3802   #3587   #4561   #5455   #4321   ",
	"reviewcount": "5 Reviews sorted by",
	"description": "The woman who would seduce and pounce on men every single night—Lilith Sera.\r\n\r\nAnd when the day comes…\r\n\r\n“AAAAAAAAAHHHHHHHHHHHHHHH!!!!!!”\r\n\r\nShe would be left with shameful memories from last night.\r\n\r\n—\r\n\r\n“Lily, do you happen to know about the succubus?”\r\n“…I read about it in a book. They’re demons… that tempt people and do bad things…”\r\n\r\nDuring the spring of her sixteenth year, that was when she first saw the sign. It was a strange pattern underneath her navel that told her… she’s a succubus.\r\n\r\nShe had a clunky ring that was supposed to suppress her instincts. It was a relic that her grandmother left for her.\r\n\r\nBut on the day the kingdom fell into ruin, she lost her ring.\r\n\r\n“My ring. It’s very important to me, but that person took it.”\r\n“I’m sure I put it in my pocket. It should be right he— it’s… gone.”\r\n\r\nWithout that ring, Lilith would be conquered by the instincts of a succubus.\r\n\r\n“Then, shouldn’t you take responsibility?”\r\n\r\n—\r\n\r\n“I’m already looking for it as hard as I can. I said I’d take responsibility, but if I’d known this is what that meant…”\r\n“If you don’t want me to come here every night, then find it quickly. My treasure.”\r\n\r\nAfter she lost her ring, every night, she looked for men who would become her prey.\r\n\r\nOdil was just one of them.\r\n\r\n“You came here yesterday, too! Please, just do it in moderation and leave.”\r\n“Every time you say such mean things, I want to make you even cuter.”\r\n\r\nStop, just give up.\r\n\r\nThis instinct, once awoken, constantly craved for prey every night, and it was nice to see Odil’s flushed face whenever he’d see her after she came looking for him again.\r\n\r\n“Odil, it’s far from being over. I won’t let you go until morning.”\r\n\r\nThis is a story about Lilith, who transforms into a succubus once night falls, and her five men.\r\n>"
}