{
	"url": "https://www.novelupdates.com/series/professional-body-double/",
	"title": "Professional Body Double - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/10/Professional-Body-Double.jpg",
	"noveltype": "(CN)",
	"genre": "Adult   Drama   Mature   Romance   Smut   Supernatural   Yaoi   ",
	"tags": "Acting   Adapted to Drama CD   Arrogant Characters   Betrayal   Body-double   Body Swap   Celebrities   Cohabitation   Complex Family Relationships   Confinement   Conflicting Loyalties   Dark   Death   Death of Loved Ones   Debts   Depictions of Cruelty   Depression   Different Social Status   Emotionally Weak Protagonist   Familial Love   Handsome Male Lead   Indecisive Protagonist   Long Separations   Love at First Sight   Lovers Reunited   Manipulative Characters   Misunderstandings   Modern Day   Obsessive Love   Past Plays a Big Role   Persistent Love Interests   Personality Changes   Possessive Characters   Previous Life Talent   Protagonist Falls in Love First   R*pe   Secret Identity   Secret Relationship   Secrets   S*x Friends   S*xual Abuse   Showbiz   Time Skip   Tragic Past   Transmigration   Unlucky Protagonist   Unrequited Love   Wealthy Characters   Younger Love Interests   ",
	"rating": "(4.1 / 5.0, 294 votes)",
	"author": "Shui Qian Cheng   水千丞   ",
	"year": "\n2012",
	"ranking": "#3133   #4127   #1560   #577   #1649   ",
	"reviewcount": "91 Reviews sorted by",
	"description": "ZhouXiang didn’t know if God was giving him a second chance to live because he wanted to give him extra loving care or was it because he hasn’t messed with him enough.\n\nOtherwise, how could it be that both in and out of his entertainment career, whether it was in his past life or his current life, YanMingXiu would consider him as the substitute for the same person.\n\nHe also didn’t know, between him and Young Master Yan, who was actually more pitiful; the one who could only be treated as a substitute or the one could only find a substitute.\n\nIn his past life, ZhouXiang was the stuntman for the big star WangYudong.\n\nBut not just as his martial art stuntman…..\n\nEven within his deeply ill-fated relationship with YanMingXiu, he was also undeniably a complete substitute.\n\nDisheartened, ZhouXiang went with a group of documentary film crew into the deep valleys of the treacherous mountains. Unexpectedly, he lost his footing and fell off a cliff .\n\nWhen he awakened again, it was already two years later. Nevertheless, he awakened in another person’s body.\n\nWhat is even more tragic is that he still couldn’t escape the fate of being a substitute…\n\nT/N: 替身: Tishen is a person who replaces another; a substitute, in filming the tishen is a stuntman/body-double.>"
}