{
	"url": "https://www.novelupdates.com/series/heroes-of-marvel/",
	"title": "Heroes of Marvel - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2018/07/Heroes-of-Marvel.jpeg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Fantasy   Martial Arts   School Life   ",
	"tags": "Accelerated Growth   Aggressive Characters   Alternate World   Arrogant Characters   Artificial Intelligence   Based on a Movie   Calm Protagonist   Carefree Protagonist   Character Growth   Charismatic Protagonist   Cheats   Comedic Undertone   Crime   Criminals   Determined Protagonist   Eidetic Memory   Familial Love   Fanfiction   Fantasy World   Fast Learner   Game Elements   Gods   Handsome Male Lead   Hiding True Abilities   Hiding True Identity   Loyal Subordinates   Magical Technology   Male Protagonist   Modern Day   Reincarnated in Another World   System Administrator   Wealthy Characters   ",
	"rating": "(3.6 / 5.0, 129 votes)",
	"author": "Li Qun Xi   离群戏 著   ",
	"year": "\n2017",
	"ranking": "#2158   #2209   #1612   #4831   #3472   ",
	"reviewcount": "14 Reviews sorted by",
	"description": "After an accidental electric shock, Jackson traversed into a parallel world filled with supreme beings—beings whose might and strength could hold the skies on their shoulder.\n\nAt first, Jackson preconceived the idea that he’d only traversed on the other side of the world, the United States, until that is various peculiarities popped up.\n\nWhile watching the news channel, Jackson wondered whose the big green guy jumping up and down the buildings of New York without care.\n\nWho is that bodybuilder statue donned in a red-blue uniform standing tall and proud in the Memorial Hall?\n\nAnd who is that man flying the skies with a big hammer calling himself a God?\n\nJackson wondered if he should advise his parents to move away from New York.\n\nBut after a moment of thought, Jackson pulled out his mobile phone and dialed a number. “Mr. Stark, for the safety of mankind, I think it’s necessary to discuss the developments of technology and advanced armors with you.”\n\nThis is the story of a young man living in the world of Marvel who only wished to live a quiet and stable life but as fate would have it, fate had other plans for him.>"
}