{
	"url": "https://www.novelupdates.com/series/im-not-a-regressor/",
	"title": "I’m Not a Regressor - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/12/Im-not-a-Regressor_1640678559.jpg",
	"noveltype": "(KR)",
	"genre": "Action   Adventure   Fantasy   Harem   Shounen   Supernatural   ",
	"tags": "Abandoned Children   Ability Steal   Alternate World   Assassins   Beautiful Female Lead   Calm Protagonist   Cheats   Childhood Friends   Childhood Love   Clever Protagonist   Cold Protagonist   Comedic Undertone   Cunning Protagonist   Demons   Depictions of Cruelty   Dishonest Protagonist   Distrustful Protagonist   Divine Protection   Dungeons   Emotionally Weak Protagonist   Evil Organizations   First-time Interc**rse   Game Elements   God-human Relationship   Goddesses   Godly Powers   Guilds   Handsome Male Lead   Hard-Working Protagonist   Harsh Training   Hidden Abilities   Hiding True Abilities   Hiding True Identity   Hot-blooded Protagonist   Kind Love Interests   Level System   Love Rivals   Male Protagonist   Manipulative Characters   Mind Control   Misunderstandings   Modern Day   Money Grubber   Monsters   Murders   Older Love Interests   Orphans   Overpowered Protagonist   Poor to Rich   Romantic Subplot   Schemes And Conspiracies   Secret Identity   Secret Organizations   Secretive Protagonist   Secrets   Skill Assimilation   Spear Wielder   Strong Love Interests   Time Manipulation   Torture   Tsundere   Vampires   Weak to Strong   Yandere   ",
	"rating": "(4.2 / 5.0, 189 votes)",
	"author": "Butterfly Valley   나비 계곡   ",
	"year": "\n2021",
	"ranking": "#748   #1626   #1024   #220   #2017   ",
	"reviewcount": "25 Reviews sorted by",
	"description": "One day, in front of my eyes appeared a silver-haired Goddess.\n\n[Heaven-defying Star. The existence that goes against destiny. The one and only savior of a world that was destined to meet its end—]\n\nWhat kind of bullsh*t is this woman spouting?\n\n[You must be a regressor.]\n\n“…What?”\n\nNo, I’m not.>"
}