{
	"url": "https://www.novelupdates.com/series/let-go-of-my-little-brother-and-come-at-me/",
	"title": "Let Go Of My Little Brother And Come At Me - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/04/Let-Go-Of-My-Little-Brother-And-Come-At-Me.jpeg",
	"noveltype": "(CN)",
	"genre": "Comedy   Romance   Yaoi   ",
	"tags": "Amnesia   Brother Complex   Charismatic Protagonist   Handsome Male Lead   Love Interest Falls in Love First   Misunderstandings   Modern Day   Omegaverse   Pretend Lovers   Strong Love Interests   ",
	"rating": "(3.3 / 5.0, 32 votes)",
	"author": "快递小咕   ",
	"year": "\n2021",
	"ranking": "#2425   #2931   #7693   #3878   #7742   ",
	"reviewcount": "4 Reviews sorted by",
	"description": "Chu Suiyun, who had been rated as the “No. 1 Ideal Alpha of the Academy” for three consecutive years, is a little bro-con. His younger brother is obedient and well-behaved, a cute little Omega.\r\n\r\nBut recently, he found out with a heartache that his younger brother was in love, and what broke him even more was that his younger brother was in love with a scumbag named Qin Miao.\r\n\r\n\r\n \r\nIn order to save his younger brother, Chu Suiyun decided to interfere and break up the two of them.\r\n\r\n\r\n \r\nThe quickest way was to let his younger brother realize Qin Miao’s true face.\r\n\r\nGood brother Chu Suiyun decided to sacrifice himself, seduce him by pretending to be an Omega, and uncover the deceit and trash under Qin Miao’s golden outer appearance.\r\n\r\nHis younger brother was on a date with Qin Miao at a restaurant. Chu Suiyun sprayed Omega-scented perfume, pretended to be dizzy while his younger brother was not there, and fell into Qin Miao’s arms.\r\n\r\nChu Suiyun: Ah, sorry, I feel dizzy.\r\n\r\nQin Miao smiled: I will take you to a room to rest.\r\n\r\nQin Miao was hooked, but he still hadn’t separated from his younger brother. Chu Suiyun was angry and confronted him——\r\n\r\n\r\n \r\nChu Suiyun: Why don’t you break up, do you think my skills are not good? Scumbag!\r\n\r\n\r\n \r\nQin Miao smiled with great interest: I have never seen an Omega like you.\r\n\r\nChu Suiyun unleashed his trump card.\r\n\r\nHe acted delicate and wept: QAQ, you have to break up, be responsible to me, you bit my neck.\r\n\r\nQin Miao: Then let’s get married.\r\n\r\nChu Suiyun: …?\r\n\r\nNot giving birth to a baby, not changing into an Omega, it’s a strong fierce Alpha!>"
}