{
	"url": "https://www.novelupdates.com/series/a-very-popular-idol-classmate-has-taken-a-liking-to-me-a-person-who-doesnt-want-to-work-for-whole-life/",
	"title": "A Very Popular Idol Classmate Has Taken a Liking to Me, A Person Who Doesn’t Want to Work for Whole Life - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/02/A-Very-Popular-Idol-Classmate-Has-Taken-a-Liking-to-Me-A-Person-Who-Doesnt-Want-to-Work-for-Whole-Life.jpg",
	"noveltype": "(JP)",
	"genre": "Romance   School Life   ",
	"tags": "Beautiful Female Lead   Childhood Love   Complex Family Relationships   Cooking   Cute Story   Family Conflict   Living Alone   Love Interest Falls in Love First   Male Protagonist   Modern Day   Multiple POV   Part-Time Job   Past Plays a Big Role   Popular Love Interests   Showbiz   ",
	"rating": "(3.9 / 5.0, 85 votes)",
	"author": "Kishimoto Kazuha   岸本 和葉   ",
	"year": "\n2020",
	"ranking": "#1508   #579   #3394   #2404   #4641   ",
	"reviewcount": "5 Reviews",
	"description": "Shidou Rintaro, a high school student who aspires to be a full-time househusband, is in the same class as Otosaki Rei, a member of the popular idol group “Millefeuille Stars”. Rintaro, who has no deep interest in idols, accepts this as a fact and lives his life without any particular involvement. One day, a turning point came to him. Rintaro unintentionally helps Otosaki Rei, who collapses unexpectedly at the nearest station, and discovers that she is too hungry to move due to the rigorous lessons. Rintaro has no choice but to serve her a home-cooked meal and tell her that this is the end of their relationship――. “I’ll pay 300,000 yen a month, and I’ll also pay for food for the two of us. So, please provide me with food every day.” Rintaro is wary of such a tempting offer, but as he gets to know her unclouded heart, the bond between them gradually deepens. As Rintaro is favored by other members of the Millefeuille Stars besides Otosaki, and saves them from their predicament, they become irreplaceable to each other. ――This is the story of a man and a woman who live in different worlds, but who eventually unite.>"
}