{
	"url": "https://www.novelupdates.com/series/when-the-male-lead-is-obsessed-with-the-youngest-daughter-of-the-villain-family/",
	"title": "When the Male Lead is Obsessed with the Youngest Daughter of the Villain Family - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/03/When-the-Male-Lead-is-Obsessed-with-the-Youngest-Daughter-of-the-Villain-Family.jpeg",
	"noveltype": "(KR)",
	"genre": "Comedy   Fantasy   Romance   ",
	"tags": "Aristocracy   Assassins   Beautiful Female Lead   Comedic Undertone   Death   Demons   Determined Protagonist   Doting Older Siblings   Doting Parents   Empires   European Ambience   Evil Organizations   Familial Love   Family Business   Female Protagonist   Handsome Male Lead   Heartwarming   Kingdoms   Love Interest Falls in Love First   Magic   Magic Beasts   Male Yandere   Murders   Nobles   Obsessive Love   Proactive Protagonist   Reincarnated in Another World   Reincarnation   Royalty   Sister Complex   Strong Love Interests   Sword And Magic   Tomboyish Female Lead   Underestimated Protagonist   Villainess Noble Girls   Wars   ",
	"rating": "(4.2 / 5.0, 65 votes)",
	"author": "어흥   ",
	"year": "\n2020",
	"ranking": "#1401   #1408   #3243   #2251   #1797   ",
	"reviewcount": "7 Reviews sorted by",
	"description": "She became the youngest beloved daughter of the powerful villain family in a hardcore R-19 novel.\n\nHowever, I who was part of the villain’s family, I wasn’t good at producing poison, making bombs, in addition to shooting arrows.\n\n“Brother will protect you. Our Estiya doesn’t have to do this.”\n\n“No, she has her older sister! Estiya, don’t worry. We’re gonna get rid of all the bad guys.”\n\nBrother, sisters, we’re the bad guys.\n\nI didn’t want to kill people. So I tried to conceal my capabilities and hide however…\n\nThe male lead is worrying me.\n\n*\n\nI married the male lead before he blacked out for the peace of both my family and the empire.\n\n“If you marry anyone else, I will remove you and your family from the continent.”\n\n“You’re marrying me, aren’t you? I said I’d give you the Empire.”\n\n“The end of this marriage will happen when either you or I die.”\n\nMy family, the crown prince, and the Male lead began to obsess over me.\n\nIs it impossible to live happily ever after?>"
}