{
	"url": "https://www.novelupdates.com/series/when-i-stopped-being-your-shadow/",
	"title": "When I Stopped Being Your Shadow - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/03/When-I-Stopped-Being-Your-Shadow.jpeg",
	"noveltype": "(KR)",
	"genre": "Drama   Fantasy   Romance   ",
	"tags": "Adultery   Affair   Aristocracy   Artists   Beautiful Female Lead   Betrayal   Comedic Undertone   European Ambience   Female Protagonist   Handsome Male Lead   Nobles   Popular Love Interests   Reporters   Revenge   Slow Romance   ",
	"rating": "(3.9 / 5.0, 29 votes)",
	"author": "Rana   ",
	"year": "\n2022",
	"ranking": "#5262   #4229   #5340   #3196   #6544   ",
	"reviewcount": "5 Reviews sorted by",
	"description": "He was the hand of God, the painter of the century. My husband became the best artist in the empire. \r\n\r\n And I was his shadow. \r\n\r\n Even when my work went viral under my husband’s name, even when people spoke ill of me behind my back. \r\n\r\n It was still good. Because I loved my husband. \r\n\r\n But on our wedding anniversary. \r\n\r\n “You are the only person I truly love.”\r\n\r\n I witnessed my husband whispering his love to my best friend. \r\n\r\nAt the very moment when my husband saw me discovering his infidelity, his face contorted viciously and pushed me away. \r\n\r\n“Where are you raising your voice to your husband?!”\r\n\r\nI realized. \r\n\r\nI realized that that man had never loved me. \r\n\r\n So I decided to become the evil wife they spoke of.\r\n\r\n* \r\n\r\n “I have a special story for you.” \r\n\r\n Ines suggested in a strained voice. \r\n\r\nA man as beautiful as God turned his eyes gently to her. \r\n\r\n “It’s a special story, our newspaper won’t print the case if it’s not good enough……..” \r\n\r\n “It’s the fall of the painter known as the Hand of God…”\r\n\r\nInes continued in a tense voice.\r\n\r\n“Isn’t this good enough a scandal to be published in Elton, the greatest daily newspaper in the empire?” \r\n\r\n“Then what does Countess Brighton gain from the scandal?” \r\n\r\n“My life.”\r\n\r\nInes’ answer brought a different expression to the man’s eyes for the first time.>"
}