{
	"url": "https://www.novelupdates.com/series/environment-protection-after-rebirth/",
	"title": "Environment Protection After Rebirth - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/02/23407s-1.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Drama   Josei   Romance   Supernatural   ",
	"tags": "Beautiful Female Lead   Bullying   Celebrities   Cold Protagonist   Cultivation   Enemies Become Allies   Fat to Fit   Female Protagonist   Game Elements   Ghosts   Handsome Male Lead   Love Interest Falls in Love First   Modern Day   Multiple Reincarnated Individuals   Power Couple   Reincarnation   Revenge   Second Chance   Slow Romance   Souls   Spirits   Strong to Stronger   Unique Cultivation Technique   Wealthy Characters   ",
	"rating": "(3.8 / 5.0, 111 votes)",
	"author": "Xuāncǎo Yāohuā   萱草妖花   ",
	"year": "\n2019",
	"ranking": "#1010   #2792   #2797   #2596   #3043   ",
	"reviewcount": "24 Reviews sorted by",
	"description": "Wei Ying’s body was invaded by a wild ghost, and her soul floated like a lone ghost in the mass graveyard. This was planned by her stepmother and stepsister, which led to the loss of her family property, her reputation, and even the forced dissolution of her marriage with her boyfriend, Tang Yu. \n\nShe was reborn back to the age of 17, weighing 150 pounds. Her classmates laughed at her as a “fat and ugly monster.” But she relied on the “environmental protection” ability and lost weight and became more and more beautiful. Not only that, but she also relied on “environmental protection” to improve her skills and strength. She could easily punch eight strong men flying one meter away.. \n\nIn order to continue to become more beautiful and stronger, Wei Ying was forced to engage in environmental protection. Later, netizens discovered that the rich girl who participated in “The Youth’s Evolution” actually led the second generation of the wealthy kids to pick up garbage in the show.\n\n——–\n\nIn his last life, Tang Yu, a fierce rich gangster, lost his fiancée Wei Ying. He killed Wei Ying’s enemies with his own hands. For him, in the world without Wei Ying, even billions of wealth were mere dust. At the age of 18, after rebirth, Tang Yu found that the person in his heart secretly picked up garbage in the school. \n\nTang Yu: “………” The ruthless gangster held a littering classmate by its collar: “If you f*cking dare to litter, I will kill you!” The classmate silently stuffed the garbage into the schoolbag, shivering in horror.>"
}