{
	"url": "https://www.novelupdates.com/series/im-the-vicious-cannon-fodder-in-the-book/",
	"title": "I’m The Vicious Cannon Fodder In The Book - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/09/Im-The-Vicious-Cannon-Fodder-In-The-Book.jpg",
	"noveltype": "(CN)",
	"genre": "Adult   Drama   Fantasy   Historical   Mature   Yaoi   ",
	"tags": "Alternate World   Ancient China   Arranged Marriage   Clever Protagonist   Confident Protagonist   Doting Love Interests   Handsome Male Lead   Love at First Sight   Marriage   Mpreg   Multiple Transported Individuals   Politics   Reincarnation   Revenge   Royalty   Schemes And Conspiracies   Second Chance   Shameless Protagonist   System Administrator   Transmigration   ",
	"rating": "(4.3 / 5.0, 109 votes)",
	"author": "廿乱   ",
	"year": "\n2020",
	"ranking": "#702   #1182   #2080   #955   #1934   ",
	"reviewcount": "24 Reviews",
	"description": "Luo Shuyu was pointed out by the emperor’s imperial decree to the third prince Li Mingjin, who had a sinister and paranoid personality. The two had been married for three years. Li Mingjin always treated him with no words and coldly. \n\nIn an accident, the two rounded up the room, and Luo Shuyu became pregnant by accident. After he gave birth to a son, Li Mingjin was imprisoned for collaborating with the enemy and sentenced to beheading. His one-month-old son was dying and he also received a glass of poisoned wine. \n\nUnexpectedly, Li Mingjin escaped from prison, desperately sent him and his son out of the city, and died after blocking arrows for them. No one in the family survived. \n\nLuo Shuyu only realized after his death that he was a supporting role in the novel “After Transmigrating Into a Book Four Big Brothers Are Fighting Into Marry Me “. The cousin from the countryside was the protagonist in the book. He was from the future world and he carried with him the goldfinger so he could hook up with the so-called big men in the book all the way to a high position, and finally got together with the fourth prince he supported and became Wu’s first male queen. \n\nHe and Li Mingjin were the villains in the early stage, and they were the obstacles in the way of the male protagonist’s ascent. If they wanted them to died, they would die.\n\nLuo Shuyu woke up and returned to the day when the decree that he and Li Mingjin would married came. Three days later, the man who lived and died with him appeared in front of him and saw that he was still alive, young and handsome. He cried at Li Mingjin. The 18-year-old boy Li Mingjin raised his sleeves to wipe his tears, and said gloomily, “Don’t cry.” Although a bit fierce, his movements were extremely gentle.>"
}