{
	"url": "https://www.novelupdates.com/series/ive-led-the-villain-astray-how-do-i-fix-it/",
	"title": "I’ve Led the Villain Astray, How Do I Fix It? - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2017/09/68747470733a2f2f73332e616d617a6f6e6177732e636f6d2f776174747061642d6d656469612d736572766963652f53746f7279496d6167652f4167566c5348746538613.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Comedy   Romance   Shounen Ai   Xuanhuan   ",
	"tags": "Age Progression   Ancient China   Arrogant Characters   Betrayal   Black Belly   Brother Complex   Calm Protagonist   Caring Protagonist   Clever Protagonist   Clingy Lover   Cold Love Interests   Confident Protagonist   Cultivation   Demon Lord   Demonic Cultivation Technique   Dense Protagonist   Devoted Love Interests   Discrimination   Famous Protagonist   Handsome Male Lead   Love Interest Falls in Love First   Magic Beasts   Magic Formations   Magical Space   Male Yandere   Manipulative Characters   Manly Gay Couple   Mature Protagonist   Misunderstandings   Multiple Transported Individuals   Obsessive Love   Possessive Characters   Proactive Protagonist   Protagonist Strong from the Start   Reincarnation   Siblings Not Related by Blood   Slow Romance   Strength-based Social Hierarchy   Strong Love Interests   Strong to Stronger   Sword And Magic   Time Skip   Transmigration   Transported to Another World   Wealthy Characters   Younger Love Interests   ",
	"rating": "(4.4 / 5.0, 499 votes)",
	"author": "Yan Ye   湮叶   ",
	"year": "\n2014",
	"ranking": "#1740   #287   #536   #1196   #247   ",
	"reviewcount": "62 Reviews sorted by",
	"description": "Xu ZiYan has a little brother, and that little brother is gay. As an older brother, he has always felt a bit regretful.\n\nOne day he transmigrated into the inside of a novel and found himself with another chance to raise a younger brother.\n\nImmediately rolling his sleeves up to prepare for battle, he planned to raise this little brother into an exceptionally good man! And a perfectly straight one!\n\nTaking a lesson from his past experiences, he continuously perfected his training plans.\n\nClearly, he strangled any opportunities to turn his little brother bent in the cradle, yet why was it that the little brother he had used all his heart and blood to raise — was still a gay guy!!!\n\nAnd he was a gay guy who made him his target!!!\n\nYour father ain’t playing around anymore!\n\nA body you can save, however a warped soul……how do you want him to save it?! What a godly problem!!!>"
}