{
	"url": "https://www.novelupdates.com/series/gaining-a-husband-after-a-memory-loss/",
	"title": "Gaining A Husband After a Memory Loss - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/01/Gaining-A-Husband-After-a-Memory-Loss.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Romance   Shounen Ai   ",
	"tags": "Amnesia   Celebrities   Cute Protagonist   Misunderstandings   Modern Day   Naive Protagonist   Older Love Interests   Online Romance   Popular Love Interests   ",
	"rating": "(3.6 / 5.0, 61 votes)",
	"author": "Xiao Wen Dan   小文旦   ",
	"year": "\n2021",
	"ranking": "#3633   #6282   #4419   #4969   #4662   ",
	"reviewcount": "13 Reviews sorted by",
	"description": "After losing his memory to a car accident, Shang Jing stared at the only contact saved in his phone, ‘Hubby’, and fell into deep thoughts.\n\nAccording to the memo diaries, he was undoubtedly a simp who had submitted to a life of cleaning the house and working part-time to make ends meet after secretly marrying the man of his dreams. To make things worse, not only did this hubby criticize his cooking skills, he was surrounded by scandals and treated him coldly.\n\nShang Jing: I’ll never simp for him again!\n\nHowever, when he was handed the hospital bills, he was left with no choice but to once again whip out the phone…\n\n【Hubby (●′ω`●), I’m at the hospital. Come get me.】\n\nHeh. Before we get a divorce, I will make sure to return the pain I’ve been through by a hundredfold!\n\nThe award-winning actor, He Jiang, was in the midst of filming when he received a selfie taken in the hospital. The other party had not only addressed him as hubby but had also requested for him to fetch him.\n\nWhat tricks is he up to?\nLooking at the face he had not seen in years, he replied, “Ok.”\n\nAfter losing his memories, Shang Jing acted as he pleased and wreaked havoc for He Jiang. It was payback time for all the pain he had previously suffered.\n\nHe Jiang took it all in with grace and was becoming more and more like a model husband.\n\nBut with a cold sneer, Shang Jing continued his preparations for their divorce and asset divisions. Until he received an SMS from a foreign number…\n\n“Can you return my phone to me?”\nTurns out, he had mistakenly picked up the phone of a starchaser at the scene of the car accident. The other party was an obsessive fan of He Jiang and what was written in the memo diaries were mere fantasies of hers.\n\nOut of awkwardness, Shang Jing fled the city overnight.\n'I’ll never want to see He Jiang ever again in my life!'\n\nHe Jiang said with a smile, “Trying to escape after provoking me?”\nFat hope.>"
}