{
	"url": "https://www.novelupdates.com/series/rebirth-of-the-great-favor/",
	"title": "Rebirth of the Great Favor - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/01/favor-of-rebirth.jpg",
	"noveltype": "(CN)",
	"genre": "Adult   Drama   Fantasy   Mature   Romance   Smut   ",
	"tags": "Ancient China   Bodyguards   Calm Protagonist   Childhood Love   C*nnilingus   Cold Protagonist   Cruel Characters   Doting Parents   Familial Love   Female Protagonist   First-time Interc**rse   Flashbacks   F*llatio   Forced into a Relationship   Handsome Male Lead   Love Interest Falls in Love First   Misunderstandings   Multiple Reincarnated Individuals   Obsessive Love   Past Trauma   Possessive Characters   Pregnancy   R*pe Victim Becomes Lover   Reincarnation   Royalty   R*pe   Second Chance   Secrets   Strong Love Interests   Tragic Past   Unrequited Love   Weak Protagonist   Wealthy Characters   ",
	"rating": "(3.0 / 5.0, 103 votes)",
	"author": "Zhi Jiu   栀九   ",
	"year": "\n2017",
	"ranking": "#2018   #1572   #2296   #3093   #3082   ",
	"reviewcount": "22 Reviews sorted by",
	"description": "Shen Qi is an assassin. A person that dies for Prince Xuan, Shen Zhonghua. Prince Xuan’s weapon and also Prince Xuan’s woman.\n\nBut not the woman he loves and cares for.\n\nIn her previous life, the man she loved let her replace the marriage of the woman he loved, favored, cherished, protected and married to the Crown Prince of the Northern Country who is famous for sexual abuse and cruelty. Even bestowed upon her a poisonous wine and killed the child in her belly which was hers and his…\n\nHeartbroken, Shen Qi slit her own throat in front of Shen Zhonghua, who was already the most respected of the Ninth-Five.\n\nShe clearly hoped not to meet him again in her next life and yet she never expected this to happen…\n\nBecause even after her rebirth, she was still in Prince Xuan's palace. Shen Zhonghua was here and so was Su Lianxue, the woman whom he loves and protects.\n\nShen Qi didn’t want to repeat the same mistake. She just wanted to escape but didn’t expect that the frosty Prince Xuan, who not only used to be as cold as ice to her, but also allowed Su Lianxue to bully her and only vented his beastly desires on her, to actually have a change of character?\n\nIs this a turning point?!>"
}