{
	"url": "https://www.novelupdates.com/series/kochugunshikan-boukensha-ni-naru/",
	"title": "Kochugunshikan Boukensha ni Naru - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2018/11/DsG1ZJ0UcAAYdI5.jpg",
	"noveltype": "(JP)",
	"genre": "Adventure   Drama   Fantasy   Harem   Romance   Sci-fi   Shounen   Slice of Life   ",
	"tags": "Adapted to Manga   Adventurers   Aliens   Artificial Intelligence   Beautiful Female Lead   Carefree Protagonist   Cheats   Clones   Cooking   Dense Protagonist   Dragons   Fantasy Creatures   Fantasy World   Guilds   Hiding True Identity   Kind Love Interests   Kingdom Building   Language Barrier   Love Interest Falls in Love First   Magic   Magic Beasts   Male Protagonist   Misunderstandings   Multiple POV   Near-Death Experience   Nobles   Overpowered Protagonist   Polygamy   Protagonist Strong from the Start   R-15   Royalty   Schemes And Conspiracies   Survival   Sword And Magic   Sword Wielder   Technological Gap   Younger Love Interests   ",
	"rating": "(3.7 / 5.0, 227 votes)",
	"author": "Itou Atsuhiko   伊藤暖彦   ",
	"year": "\n2017",
	"ranking": "#3567   #6316   #419   #151   #878   ",
	"reviewcount": "47 Reviews sorted by",
	"description": "Imperial Galactic Army Officer Alan Corinth's ship is seriously damaged after being ambushed by an unknown foe in hyperspace.\r\n\r\nEven though it was through sheer coincidence, he became the sole survivor.\r\n\r\nThe stricken ship fell to the planet below.\r\n\r\nAlan alone managed to get to an escape pod.\r\n\r\nAlan the Imperial Army Officer wagers his survival in this savage world on the symbiotic nanomachines (nanom) in his body.\r\n\r\nThe world he landed on was home to a prosperous human civilization, which seemed to have a strangely similar genetic pedigree to himself.\r\n\r\nIn this puzzling fantasy world of swords and sorcery, Alan will live to the fullest alongside his comrades.\r\n\r\nWhat will Alan achieve in this strange world?\r\n\r\nA Science Fiction Fantasy in a Middle Ages setting starts here.>"
}