{
	"url": "https://www.novelupdates.com/series/heavenly-divine-doctor-abandoned-concubine/",
	"title": "Heavenly Divine Doctor: Abandoned Concubine - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/12/HeavenlyDivineDoctor2.jpg",
	"noveltype": "(CN)",
	"genre": "Adult   Drama   Fantasy   Harem   Mature   Psychological   Romance   Slice of Life   ",
	"tags": "Academy   Adopted Protagonist   Age Regression   Ancient China   Aristocracy   Arranged Marriage   Beautiful Female Lead   Betrayal   Bickering Couple   Black Belly   Bloodlines   Boss-Subordinate Relationship   Calm Protagonist   Character Growth   Clever Protagonist   Cold Love Interests   Cold Protagonist   Complex Family Relationships   Couple Growth   Cunning Protagonist   Depictions of Cruelty   Determined Protagonist   Devoted Love Interests   Doctors   Dragons   Early Romance   Famous Protagonist   Fearless Protagonist   Female Protagonist   First-time Interc**rse   Handsome Male Lead   Hiding True Identity   Long Separations   Love Triangles   Magic   Male Yandere   Marriage   Medical Knowledge   Misunderstandings   Naive Protagonist   Phoenixes   Power Couple   Reincarnation   Revenge   Reverse Harem   Royalty   Schemes And Conspiracies   Second Chance   Siblings   Slow Romance   Special Abilities   Strength-based Social Hierarchy   Tragic Past   Transmigration   Twins   Unrequited Love   ",
	"rating": "(3.8 / 5.0, 177 votes)",
	"author": "Yu Fang   予方   ",
	"year": "\n2015",
	"ranking": "#3802   #1655   #1274   #4682   #1599   ",
	"reviewcount": "33 Reviews",
	"description": "He was the cold-blooded prince of the Jin country. Decisive and smart, he had looked down on the world with apathy and disdain.\n\nShe was his Wang Fei, a person who had saved him in the past, but he wouldn’t even look at her.\n\nWhen the fire raged and death claimed her, it was only then that she realized her existence was nothing but a joke from the beginning.\n\nShe opened her eyes once more after spending two years as a roaming, vengeful ghost. In this lifetime, Ye Zhen promises that she will be a different person. With a slight smile, she will ruthlessly trample on those who had schemed against her and lied until her demise!\n\nMost importantly, she would let him experience the pain of an unrequited love; the bitterness of seeking something you cannot obtain!>"
}