{
	"url": "https://www.novelupdates.com/series/i-thought-i-was-the-main-character/",
	"title": "I Thought I Was The Main Character - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/12/I-Thought-I-Was-The-Main-Character.jpg",
	"noveltype": "(KR)",
	"genre": "Drama   Fantasy   Romance   ",
	"tags": "Aristocracy   Beautiful Female Lead   Carefree Protagonist   European Ambience   Female Protagonist   Friendship   Misunderstandings   Mob Protagonist   Nobles   Royalty   Transmigration   Wealthy Characters   ",
	"rating": "(4.4 / 5.0, 55 votes)",
	"author": "서가린   ",
	"year": "\n2021",
	"ranking": "#3017   #6295   #5112   #8107   #5044   ",
	"reviewcount": "5 Reviews sorted by",
	"description": "I was possessed by a romance fantasy novel.\n\nAs an extra whose name doesn’t even appear.\n\nThis is the Extra Possession!\n\n‘I have become the main character in the novel!’\n\nAfter a quick realization, I enjoyed the life of the main character and became close to the Male Lead, Sub-Male Lead, and the Mastermind in the novel.\n\nEveryone seems to like me, but I wasn’t sure who was going to be my male lead.\n\nSo I asked outright.\n\n“Luci, do you like me?”\n\n“Why did you make such a mistake?”\n\nLuci asked, seeming to find it absurd.\n\nThe Male Lead in the novel seems to be not my male lead.\n\n“Harrison, do you like me?”\n\n“I don’t mean to say things like that.”\n\nHarrison said sternly.\n\n…It seems that the Sub-Male Lead in the novel is also not my male lead.\n\n“Damian, do you like me?”\n\n“Do you want me to like you? Would you like it?”\n\nDamian asked, raising one corner of his mouth.\n\nShe didn’t know that she would even be ridiculed. \n\nEven the Mastermind in the novel was not my man… I was really an extra. Why did I realize it now?\n\nIt was futile, but I was glad that I came to my senses even though it was late. Now I have to find my husband to fit my fraction.\n\n“I want to go back and find my husband.”\n\nI told my three friends who didn’t like me that I was leaving.\n\n“What, are you looking for a bridegroom?”\n\n“This is really unexpected.”\n\n“What….”\n\nAnyone who sees it would know that all three of them liked me. But now I know is not like that.\n\n‘Hey, who knows who else will be fooled?’\n\nI will no longer be mistaken for their actions.\n\n“I’m busy, bye!”>"
}