{
	"url": "https://www.novelupdates.com/series/after-online-dating-with-unlimited-streaming-boss/",
	"title": "After Online Dating with Unlimited Streaming BOSS - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/09/After-Online-Dating-with-Unlimited-Streaming-BOSS.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Fantasy   Romance   Sci-fi   ",
	"tags": "Calm Protagonist   Clingy Lover   Cold Protagonist   Doting Love Interests   Female Protagonist   Handsome Male Lead   Smart Couple   Strong Love Interests   Survival Game   Unique Weapons   Unlimited Flow   ",
	"rating": "(3.7 / 5.0, 3 votes)",
	"author": "Organic Peach   有机桃   ",
	"year": "\n2021",
	"ranking": "#1082   #787   #12645   #10838   #12563   ",
	"reviewcount": "No Reviews",
	"description": "Rong Yi has an online dating boyfriend who is shy, infatuated, cute and reliable, and replies to her in seconds. The only thing that causes dissatisfaction is that, he always refuses to meet.\n\nLittle Boyfriend: [Little Rabbit covers face.jpg] I, well, I look ugly, and my workplace is also not very good, so I’m afraid to be seen in light…\n\nLater, Rong Yi was dragged into an infinite thriller game and her life was hanging by a thread.\n\nUnexpectedly, her little boyfriend hacked into the game system and helped her within seconds!\n\nLittle Boyfriend: [Big White Hugs.jpg] Don’t be afraid, Don’t be afraid. Let me tell you quietly, these bosses are actually very fragile, I strongly recommend that you focus on their hearts.\n\nSo as soon as Other players enter the game: Develop unnoticeably in the early stages and never run into a BOSS.\n\nAs soon as Rong Yi enters the game: Where is the boss, let’s talk about ten dollars!\n\nShe had a long talk with Mr. Ogre and actively solved his troubles about the work meals;\n\nShe had a drink with a high-risk mental patient, and fights against workplace bullying;\n\nShe opened the heart of the PUA(pickup artist) demon, abused the scumbag, and helped the victim return to the happy life of terrorizing the player.\n…\nThe bosses were grateful and said, “We have identified our sister-in-law!”\n\nThe young urban beauty Rong Yi: Where does this sister-in-law come from? !\n\nLittle Boyfriend: [Little Penguin blushes and scratches his head.jpg] Ah, that, this is my workplace. They called me big brother.\n\n────────────\n\nRong Yi always thought that her online dating partner was a sweet, innocent and poor little cutie.\n\nAfter all kinds of hardships, the two of them finally met.\n\nThe big guy with his tall, long legs, and a handsome face still stained with blood, raised her chin with the hand that had just killed a monster, his clear eyes filled with the murderous aura that had not yet dissipated, and he called her in a low voice: ' Rong Rong.'\n\nRong Yi, the rich woman who had been fantasising that she could raise her little cutie, rolled her eyes and passed out.>"
}