{
	"url": "https://www.novelupdates.com/series/coming-of-the-villain-boss/",
	"title": "Coming of the Villain Boss! - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/02/Coming-of-the-Villain-Boss.jpg",
	"noveltype": "(CN)",
	"genre": "Adventure   Comedy   Fantasy   Josei   Mystery   Romance   Sci-fi   Supernatural   ",
	"tags": "Adapted to Manhua   Ancient Times   Arrogant Characters   Artificial Intelligence   Assassins   Beastkin   Beautiful Female Lead   Calm Protagonist   Celebrities   Confinement   Cultivation   Episodic   Fairies   Female Protagonist   Ghosts   Gods   Handsome Male Lead   Hated Protagonist   Interdimensional Travel   Love Interest Falls in Love First   Male Yandere   Matriarchy   MMORPG   Mob Protagonist   Modern Day   Multiple Realms   Online Romance   Organized Crime   Overpowered Protagonist   Persistent Love Interests   Pets   Protagonist Strong from the Start   Quirky Characters   Royalty   Schemes And Conspiracies   Selfish Protagonist   Shameless Protagonist   Showbiz   Siblings Not Related by Blood   Slow Romance   Spirits   System Administrator   Transmigration   Tsundere   Vampires   Villainess Noble Girls   Wealthy Characters   World Hopping   World Travel   Zombies   ",
	"rating": "(4.0 / 5.0, 128 votes)",
	"author": "Mo Ling   墨泠   ",
	"year": "\n2017",
	"ranking": "#1288   #4689   #3292   #9146   #3323   ",
	"reviewcount": "34 Reviews sorted by",
	"description": "Imagine having the opportunity to be able to enter different worlds created by numerous novels and stories. Which kind of role would you like to play?\n\n \n\nDo you want to be the illustrious protagonist, either good or evil, or just be a supporting role standing behind the protagonists?\n\n \n\nOur villainess boss, Ming Shu, would choose none of the above. Claiming missions from the Harmony System and driven by her endless passion for snacks, the world traveler, Ming Shu, embarks on the path to make the mission target hate her as much as possible by gaining Hatred Points. But it turns out she is not alone on her journey…>"
}