{
	"url": "https://www.novelupdates.com/series/the-villainous-mastermind-gets-lucky-in-his-later-years/",
	"title": "The Villainous Mastermind Gets Lucky in His Later Years - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/02/The-Villainous-Mastermind-Gets-Lucky-in-His-Later-Years_1645419905.jpg",
	"noveltype": "(KR)",
	"genre": "Fantasy   Romance   Supernatural   ",
	"tags": "Adopted Children   Adopted Protagonist   Age Progression   Aristocracy   Beautiful Female Lead   Calm Protagonist   Child Protagonist   Childhood Friends   Complex Family Relationships   European Ambience   Female Protagonist   Handsome Male Lead   Mature Protagonist   Nobles   Previous Life Talent   Psychic Powers   Reincarnated in Another World   Royalty   Villainess Noble Girls   ",
	"rating": "(3.7 / 5.0, 38 votes)",
	"author": "설이수   ",
	"year": "\n2021",
	"ranking": "#2000   #6345   #6305   #10271   #5766   ",
	"reviewcount": "3 Reviews sorted by",
	"description": "I reincarnated as the Grand Duke’s fake daughter.\r\n\r\n“Live as though you’re a dead rat. If you dare tarnish the family name, I’ll tear you apart.”\r\n\r\nIn place of the real daughter, the fake that had been adopted turned out to be a troublemaker.\r\nThough even if I use my own hands to ruin the family’s reputation, it was already a mess in the first place.\r\n\r\nLet’s not worry about it. It’s a household that would fall to ruin in eight years anyway, so I plan to just save up a whole lot for my escape fund. But then…\r\n\r\n“You’re the bad one, but why do I keep feeling like this?”\r\n“Do not tarnish the family name, that’s what I said. But who told you to be so disgracefully hurt like this?”\r\n“The owner of the name Ophelia—it’s you. Without a doubt.”\r\n\r\nWhy are you all doing this to me when it’s time for me to leave?\r\nBesides that, wasn’t it with the real daughter that you all wanted to grow old with for like a hundred years?\r\n\r\n‘Why… Is the luck that I have in my later years so terrible?’\r\n\r\n* * *\r\n\r\n“My eyes, they’re unpleasant. Because they’re black…”\r\n\r\nWith a blank expression, I looked down at the villainous mastermind, who was still young at this moment.\r\n\r\n“Unpleasant?”\r\n\r\nThose dark eyes, with a radiant brilliance,\r\nLike a flowing river,\r\nSo far ahead and so invigorating that they could feed the entire nation.\r\nNo matter how ragged he looked and regardless of how much of a beggar he seemed, they could not be hidden.\r\n\r\n‘The eyes of an emperor.’\r\n\r\nAnd more than that… It's no joke how amazing his luck will be in his later years.\r\nTo the extent that I wouldn’t mind betting my entire life on him.\r\n\r\n>"
}