{
	"url": "https://www.novelupdates.com/series/this-ninja-is-obviously-not-strong-but-really-hard-to-kill/",
	"title": "This Ninja Is Obviously Not Strong but Really Hard to Kill - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/02/This-Ninja-Is-Obviously-Not-Strong-but-Really-Hard-to-Kill.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Fantasy   Martial Arts   Supernatural   ",
	"tags": "Academy   Average-looking Protagonist   Calm Protagonist   Cheats   Eye Powers   Fanfiction   Game Elements   Hard-Working Protagonist   Hiding True Abilities   Hiding True Identity   Level System   Male Protagonist   Misunderstandings   Ninjas   Overpowered Protagonist   Poor Protagonist   Puppeteers   Reincarnated in Another World   Reluctant Protagonist   Schemes And Conspiracies   Secret Organizations   Skill Creation   Soul Power   Spies   Sword Wielder   System Administrator   Unlucky Protagonist   Wars   Weak Protagonist   Weak to Strong   ",
	"rating": "(3.3 / 5.0, 23 votes)",
	"author": "Wu Mian Qi Liang   无面凄凉   ",
	"year": "\nN/A",
	"ranking": "#3633   #6269   #6661   #7359   #10530   ",
	"reviewcount": "3 Reviews sorted by",
	"description": "Ding! The system activated the mission!\n\n[Look at this sick old man in front of you. Let us pull out his oxygen tube and send him off. Let’s give him a peaceful mercy teehee~] \n\nShinomiya Aoba was stunned.\n\nThe old man mentioned by the dog system seemed to be a little strong…\n\nLooking at the Gedo Mado Pipe inserted in the back of ‘old age Madara’, he was silent and even wanted to laugh.\n\nWhat do you mean his ‘oxygen tube’?\n\nYou want me to die?!\n\nIn addition… The super suicide missions have been released: \n\n[Personally experiencing the ultimate meaning of the Eight Inner Gates! —Take a hard kick of ‘Night Guy’ and shout out, ‘I would not call you the strongest!’]\n[Give Otsutsuki Kaguya a Thousand-Year Kill! —And record this beautiful moment!] \n\n[Art is Explosion… and SpongeBob Squarepants! —-To accompany Deidara to self-destruct!] \n\n[Inviting Terumi Mei to host the wedding —No less than a hundred words of congratulations!] \n\nIn addition, there were many other kinds of death-seeking missions waiting to be opened. And when the main character looked back many years later, everyone was holding back a sentence of “Damn it, he’s crazy!” \n\n“This Ninja clearly didn’t look very strong, so why did he not die even after doing this?”\n\nThis was probably a poor child who had been dragged onto a path of death by a shitty system that’s on seeking death.>"
}