{
	"url": "https://www.novelupdates.com/series/bank-of-the-universe/",
	"title": "Bank of The Universe - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/06/universeb4nk.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Comedy   Xuanhuan   ",
	"tags": "Ancient China   Arrogant Characters   Business Management   Cultivation   Eidetic Memory   Fast Cultivation   Gods   Hard-Working Protagonist   Immortals   Loyal Subordinates   Magical Space   Male Protagonist   Money Grubber   Multiple Realms   Mythical Beasts   Mythology   Naive Protagonist   Poor to Rich   Romantic Subplot   Servants   Spirit Advisor   Store Owner   Strength-based Social Hierarchy   Sudden Strength Gain   Sword Wielder   Underestimated Protagonist   Weak to Strong   ",
	"rating": "(3.2 / 5.0, 40 votes)",
	"author": "Girl Wears Short Skirt   女孩穿短裙   ",
	"year": "\nN/A",
	"ranking": "#2000   #2000   #6636   #7464   #9844   ",
	"reviewcount": "15 Reviews sorted by",
	"description": "Li Xiandao obtained the ancient Bank of the Universe but now the bank was totally empty and had no treasures at all. The only thing it had were a bunch of debts.\r\n- The Eternal Celestial King, borrowed a supreme celestial artifact and will pay back two pieces after 3,000 years. He will pay an additional piece for every 1,000 years after the expiry date!\r\n- Moon Celestial, loaned a high-quality face, returned after 10,000 years. If overdue, she will pay with her life!\r\n-Time Immemorial Sage loaned 10,000 years in life from the Bank of the Universe in order to break through. After he breaks through, he will pay back 10,000 years. If late, he must pay back ten times the amount!\r\n\r\nLi Xiandao looked at these debts and at the empty Bank of the Universe. He made his mind up to become a true expert, to find all these supreme beings to get back the overdue debts one by one!\r\n\r\nA powerless mortal had became the biggest creditor in the Nine Heavens and Ten Lands and even the entire Celestial World! >"
}