{
	"url": "https://www.novelupdates.com/series/my-omega-fiance-a-bursts/",
	"title": "My Omega Fiancé a Bursts - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/07/My-Omega-Fianc-A-bursts.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Drama   Romance   School Life   Yaoi   ",
	"tags": "Cold Love Interests   Engagement   Manly Gay Couple   Modern Day   Omegaverse   Protagonist Falls in Love First   Protagonist Strong from the Start   Smart Couple   ",
	"rating": "(4.2 / 5.0, 15 votes)",
	"author": "不吃姜的胖子   ",
	"year": "\n2020",
	"ranking": "#2917   #2000   #8754   #7856   #6093   ",
	"reviewcount": "6 Reviews sorted by",
	"description": "Jiang Heng is a rare occurrence. As an Omega, he cannot smell any Alpha’s pheromone, and also, there is his susceptibility period. His pheromone during his susceptibility period is very grumpy and makes him aggressive and his glands leak the sweet smell of his pheromones during estrus. The doctor told him that only Shen Huaizhi, who was 100% compatible with his own pheromone, could help him.\n\nAs an Omega who carries others’ burdens on his shoulders, fights, and beats many people, Shen Huaizhi wouldn’t mark him.\n\nLater, Jiang Heng, who was sent to his fiance’s school by his parents for his “physical health”, couldn’t open the cap of his water bottle and couldn’t climb three floors of a building. When he felt a little discomfort, he bent his head and revealed the back of his neck: “Bite me, brother.”\n\nShen Huaizhi is an excellent Alpha in all aspects.\n\nAfter being forced to accept his parents’ arrangement of his fiance who is in his class, he always upholds a belief in life: Stay away from Omegas, especially from Jiang Heng. Even He is looking for him when he opens a water bottle cap! Look at him out of breath when climbing only three floors! Expose the glands in front of him without any scruples! What strange creatures are Omegas!\n\nLater, Jiang Heng entered a susceptible period, and the sweet pheromone smell enveloped the entire classroom. Shen Huaizhi’s hand clasped his head against his own chest: “Call me out in a nice voice, and I will help you.”\n\nJiang Heng, who was soothed by his pheromones, said: “Brother…please, mark me… …”>"
}