{
	"url": "https://www.novelupdates.com/series/how-to-die-as-heavy-as-mount-tai/",
	"title": "How To Die As Heavy As Mount Tai - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2018/07/78026d37gy1fl7jvjey4oj205k07s40j.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Comedy   Mature   Romance   Sci-fi   Shounen Ai   Supernatural   Tragedy   Xuanhuan   ",
	"tags": "Amnesia   Beasts   Cultivation   Demons   Devoted Love Interests   Dragons   Dwarfs   Elves   Emotionally Weak Protagonist   Episodic   Goblins   Gods   Interdimensional Travel   Mob Protagonist   Multiple Realms   Naive Protagonist   Omegaverse   Possessive Characters   Priests   Reincarnation   Revenge   Saving the World   System Administrator   Time Travel   Tragic Past   Transmigration   Weak Protagonist   World Hopping   ",
	"rating": "(4.4 / 5.0, 292 votes)",
	"author": "猫八先生   ",
	"year": "\n2017",
	"ranking": "#3923   #2828   #744   #3230   #486   ",
	"reviewcount": "53 Reviews sorted by",
	"description": "When a person dies, they either die light as a feather (aka unimportant) or heavy as Mt. Tai (aka very important).\n\nTheir nature is certainly not ordinary. So when these kind of people do not die as extraordinary people, their hearts will have some lingering wishes.\n\nSouls with lingerings wishes in their hearts, just one bowl of soup from Meng Po isn’t enough to let them forget past events. Souls that aren’t pure enough can’t go through reincarnation.\n\nTherefore, they need –\n\nHello, this the underworld’s department of purifying souls, serial number 666 Lu Heng (MC) is at your disposal. Our service objective is: fulfilling your wish to die importantly without being OoC!\n\nLu Heng: Left the name in the annals, this evaluation grade will for sure be S+!\n\nSection Chief: Lu Heng, why did you break apart the CP again!! I am deducting your salary! Deducting, deducting, deducting!!!!\n\nLu Heng: Leader, this is really not my fault!!! QAQ\n\nMysterious Person: *rubs Lu Heng’s head*>"
}