{
	"url": "https://www.novelupdates.com/series/legend-of-the-mythological-genes/",
	"title": "Legend of the Mythological Genes - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/05/Every-myth-and-legend-is-a-path-to-Godhood.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Martial Arts   Supernatural   Xuanhuan   ",
	"tags": "Bloodlines   Cultivation   Evolution   Futuristic Setting   Game Elements   Genetic Modifications   Hidden Abilities   Male Protagonist   Mythology   Parody   Racism   Selfish Protagonist   Special Abilities   Transmigration   Unique Cultivation Technique   Unique Weapon User   Weak to Strong   ",
	"rating": "(2.3 / 5.0, 100 votes)",
	"author": "Fish Leaping to the Peak   ",
	"year": "\n2019",
	"ranking": "#2000   #2000   #3057   #6614   #6870   ",
	"reviewcount": "19 Reviews sorted by",
	"description": "Every myth and legend is a path to Godhood!\n\nWhen humans enter the interstellar era, ancient cultivation techniques shone with new life. Your genes exist with you! A single sentence showing the true meaning of cultivation. Myths and legends are not a fantasy, there are ancient mythological genes in the bodies of everyone.\n\nThe Hou Yi Gene allows you to shoot a hundred miles, using a single arrow to break down the dome of heaven.\n\nThe Kuafu Gene allows you to run with flying speed, chasing after the sun and moon.\n\nThe Divine Dragon Gene allows you to soar among the clouds, roaming around the starry space.\n\n….\n\nAlmost ten thousand years have passed. Feng Lin came from the 21st century to this majestic era that surged forth with great momentum. Based on his understanding on the myths and legends of the ancient earth era, he embarked upon a unique genetic cultivation path.\n\nMonkey Gene + Stonebirth Gene = Stone Monkey Gene\n\nStone Monkey Gene + ??? = Spiritual Stone Monkey Gene\n\nSpiritual Stone Monkey Gene + ??? = Handsome Monkey King Gene\n\nHandsome Monkey King Gene + ??? = Sun Wukong Gene\n\nSun Wukong Gene + ??? = Great Sage Equal to Heavens Gene>"
}