{
	"url": "https://www.novelupdates.com/series/the-female-lead-is-raised-by-bosses/",
	"title": "The Female Lead is Raised by Bosses - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/07/8E000299-77AE-4DCD-99CF-9B1D51038A54.jpeg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Comedy   Fantasy   Mecha   Slice of Life   ",
	"tags": "Abandoned Children   Absent Parents   Adopted Protagonist   Apocalypse   Artificial Intelligence   Beautiful Female Lead   Child Protagonist   Childcare   Cute Children   Cute Protagonist   Female Protagonist   Interconnected Storylines   Multiple POV   Multiple Realms   Outer Space   System Administrator   Weak to Strong   Zombies   ",
	"rating": "(4.5 / 5.0, 100 votes)",
	"author": "ball of candy   tang wan wan   糖丸丸   ",
	"year": "\n2020",
	"ranking": "#3017   #3030   #3563   #4781   #2431   ",
	"reviewcount": "18 Reviews sorted by",
	"description": "There were a few big bosses with different identities, all playing the same child raising apocalyptic game and raising the same daughter.\n\n———they didn’t know about each other’s existence\n\nThe bosses would try all sorts of way to splurge on her every day, their only wish for their daughter to have the highest quality life possible during the apocalypse.\n\n•\n\nBian Bian was given birth during the apocalypse and adopted by an elderly man. When she was five years old, grandpa got infected by the virus and turned into a zombie. And so, she became an orphan, living miserably every day.\n\nOne day, an ability user found that on a rooftop balcony was a little girl dressed in a beautiful princess dress, happily eating hot pot!\n\nWhile behind her stood two zombies, each holding a bowl of ice to help her keep cool.\n\nAbility user: “……?”\n\nLater on, Bian Bian’s birth parents came to find her.\n\nGold bashing daddies: “???”\n\nWant to snatch my darling daughter away? No way!\n\nNot long after, the skies changed, dark clouds covered the world and true dragons swam in the skies.\n\nThe survivors were all trembling, only Bian Bian happily said, “My fathers are here to fetch me~”\n\nEverybody: “???”\n\nWhy is father plural!?>"
}