{
	"url": "https://www.novelupdates.com/series/the-white-eyed-wolves-i-personally-raised-are-all-coveting-my-legacy/",
	"title": "The White-eyed Wolves I Personally Raised Are All Coveting My Legacy - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/07/The-White-eyed-Wolves-I-Personally-Raised-Are-All-Coveting-My-Legacy.jpg",
	"noveltype": "(CN)",
	"genre": "Adult   Drama   Psychological   Romance   Tragedy   Yaoi   ",
	"tags": "Acting   Business Management   Charismatic Protagonist   Cold Protagonist   Comedic Undertone   Cruel Characters   Cunning Protagonist   Death   Death of Loved Ones   Devoted Love Interests   Drugs   Episodic   Family Conflict   Futuristic Setting   Love Interest Falls in Love First   Loyal Subordinates   Manipulative Characters   Misunderstandings   Modern Day   Obsessive Love   Omegaverse   Phobias   R*pe Victim Becomes Lover   Revenge   R*pe   Ruthless Protagonist   Schemes And Conspiracies   Secrets   Seduction   Showbiz   Sickly Characters   System Administrator   Voyeurism   Wealthy Characters   World Hopping   ",
	"rating": "(4.3 / 5.0, 38 votes)",
	"author": "Kittens Do Not Like To Call   小猫不爱叫   ",
	"year": "\nN/A",
	"ranking": "#2000   #6382   #6616   #7728   #5221   ",
	"reviewcount": "14 Reviews sorted by",
	"description": "In an accident, Si Yang was bound to a quick transmigration system. His mission was to transmigrate through various movies fulfilling the original owner’s wishes, overthrowing the villains, and saving the protagonists.\r\n\r\nHowever, Si Yang had always been extremely arrogant, to the point where he believed that he was a god. In his eyes, the word “save” had also changed its meaning.\r\n\r\nOverthrow what villains? He is this world’s greatest “villain”!\r\n\r\nThe sweet, naïve, little young master was brought up to be a ruthless, blackened bigshot. The sunshine, positive energy idol was trained to be a scheming and calculating entertainment company president. The poor little Cuscuta (Parasitic plant that sucks the life out of its host) Alpha developed a deadly life-threatening toxin…\r\n\r\nBut they all had one goal in common: To kill Si Yang!>"
}