{
	"url": "https://www.novelupdates.com/series/im-really-not-the-demon-gods-lackey/",
	"title": "I’m Really Not The Demon God’s Lackey - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/06/Im-Really-Not-The-Demon-Gods-Lackey.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Comedy   Fantasy   Horror   Mystery   Psychological   Supernatural   ",
	"tags": "Adapted to Manhua   Appearance Changes   Artifacts   Books   Bookworm   Business Management   Calm Protagonist   Childcare   Comedic Undertone   Cunning Protagonist   Dark   Demons   Depictions of Cruelty   Dreams   Elves   Evil Gods   Evil Organizations   Evil Religions   Fantasy World   Friendship   Godly Powers   Gore   Helpful Protagonist   Hunters   Interdimensional Travel   Lack of Common Sense   Low-key Protagonist   Loyal Subordinates   Lucky Protagonist   Magic   Male Protagonist   Manipulative Characters   Mind Break   Mind Control   Misunderstandings   Money Grubber   Monsters   Multiple POV   Multiple Realms   Murders   Mutations   Mystery Solving   Overpowered Protagonist   Personality Changes   Priests   Psychopaths   Schemes And Conspiracies   Secret Organizations   Selfless Protagonist   Special Abilities   Store Owner   Sword And Magic   Torture   Transported to Another World   Unique Cultivation Technique   Weak to Strong   Werebeasts   Witches   ",
	"rating": "(4.5 / 5.0, 509 votes)",
	"author": "万劫火   等到夜深   ",
	"year": "\n2020",
	"ranking": "#5   #6   #186   #9   #373   ",
	"reviewcount": "89 Reviews sorted by",
	"description": "Lin Jie is the owner of a bookstore in another world.\n\nHe’s kind and warm-hearted, often recommending healing books to customers who are going through a tough time. From time to time, he secretly promotes his own work too. \n\nOver time, these customers begin to respect him greatly, some even frequently bringing local specialties to repay his favor. They often seek his professional opinion when it comes to selecting books, and share their experiences with this ordinary bookstore owner to people around them.\n\nThey respectfully and intimately refer to him using names such as the “Demon God’s Lackey”, “Propagator of the Flesh and Blood Gospel”, “ ‘Corpse Devouring Sect’s Rites and Customs’ Author” and “Shepherd of the Stars”.\n\n“???”>"
}