{
	"url": "https://www.novelupdates.com/series/the-stepmother-was-overturned/",
	"title": "The Stepmother was Overturned - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/11/The-Stepmother-was-Overturned.jpg",
	"noveltype": "(CN)",
	"genre": "Adult   Adventure   Drama   Fantasy   Horror   Josei   Romance   Tragedy   ",
	"tags": "Abusive Characters   Acting   Ancient Times   Appearance Changes   Beastkin   Beautiful Female Lead   Broken Engagement   Businessmen   Calm Protagonist   Cheats   Confident Protagonist   Confinement   Cultivation   Demon Lord   Demonic Cultivation Technique   Demons   Determined Protagonist   Devoted Love Interests   Disfigurement   Eunuch   Female Protagonist   Handsome Male Lead   Hated Protagonist   Imperial Harem   Inferiority Complex   Magical Space   Male Yandere   Master-Disciple Relationship   Misunderstandings   Modern Day   Orcs   Overpowered Protagonist   Possessive Characters   R*pe Victim Becomes Lover   Reverse Harem   Reverse R*pe   Royalty   R*pe   Ruthless Protagonist   Schemes And Conspiracies   Selfish Protagonist   Shameless Protagonist   Slow Romance   System Administrator   Tragic Past   Transmigration   Tsundere   Wealthy Characters   World Hopping   Writers   Yandere   Zombies   ",
	"rating": "(3.5 / 5.0, 17 votes)",
	"author": "三日成晶   ",
	"year": "\n2019",
	"ranking": "#2000   #2000   #10310   #6261   #9435   ",
	"reviewcount": "2 Reviews sorted by",
	"description": "Shi Jiaojiao was a novelist who specialized in abusive stories. She was unintentionally electrocuted one night while staying up late to write more dog-blood. She was ens*aved by the reader’s complaint system. To survive, she had to travel in all of her books and perform assignments.\n\nIn the first book: Shi Jiaojiao transmigrated to a vicious white lotus that caused the second male lead to go blind. \n\nShi Jiaojiao: Damn, did I write this story!  What’s going on!\n\nThe second book: She was transmigrated as a young vicious wife who took away the male lead’s sole remaining properties after he was gravely injured and went bankrupt, causing him to postpone treatment and end up spending the rest of his life in a wheelchair. \n\nShi Jiaojiao: What is the title of this book?! This is impossible!\n\nThe third book: She was transmigrated as a scumbag woman who abandoned her son and family. She was greedy for wealth and coveted the position of a concubine. From the depths of hell, the spirit of the husband who perished on the battlefield crawled back.\n\nShi Jiaojiao: This must not have been written by me! Woo woo. I want to go home.>"
}