{
	"url": "https://www.novelupdates.com/series/embers-ad-infinitum/",
	"title": "Embers Ad Infinitum - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/01/Embers-Ad-Infinitum.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Comedy   Fantasy   Horror   Mystery   Psychological   Sci-fi   Supernatural   Tragedy   ",
	"tags": "Beautiful Female Lead   Charismatic Protagonist   Childhood Friends   Dark   Determined Protagonist   Discrimination   Dystopia   Fast Learner   Firearms   Futuristic Setting   Genetic Modifications   Goddesses   Gods   Handsome Male Lead   Human Experimentation   Lost Civilizations   Male Protagonist   Mind Control   Multiple Personalities   Mutated Creatures   Mutations   Orphans   Post-apocalyptic   Proactive Protagonist   Psychic Powers   Religions   Romantic Subplot   Special Abilities   Terminal Illness   World Travel   ",
	"rating": "(4.4 / 5.0, 121 votes)",
	"author": "Cuttlefish That Loves Diving   爱潜水的乌贼   ",
	"year": "\n2020",
	"ranking": "#306   #423   #4074   #10477   #5567   ",
	"reviewcount": "39 Reviews sorted by",
	"description": "In this latest work by Lord of the Mysteries author, Cuttlefish That Loves Diving, be prepared for a well-thought out and detailed apocalyptic, cyberpunk world with a setting superseding Lord of the Mysteries! \r\n\r\nOur protagonist, Shang Jianyao, is crazy—literally crazy, at least that's what the doctors said. Living in a huge, underground building of Pangu Biology, one of the few remaining factions in this apocalyptic wasteland known as the Ashlands, he acts in unfathomable ways that's head-scratching, comical, and shrewd. So is he really crazy? Probably. \r\n\r\nHe has a grand dream: to save all of humanity. \r\n\r\nIntricately tied to this dream is something everyone in the Ashlands believes in: Deep in a particular ruin buried away by danger and famine, a path leading to a new world awaits. To step into the new world, one only needs to find a special key and open that certain door. \r\n\r\nThere, the land is bountiful, as if milk and honey flows freely. \r\n\r\nThe sunlight is dazzling, as if all coldness and darkness are washed away. \r\n\r\nThe people will no longer have to face desolation, monsters, infections, mutations, and all kinds of dangers. \r\n\r\nThere, children are joyous, adults are happy, everything is fine as they are supposed to be. \r\n\r\nEvery Antiquarian, Ruin Hunter, and Historian roaming the Ashlands knows: That's the New World.>"
}