{
	"url": "https://www.novelupdates.com/series/saijaku-hakugai-made-sareta-kedo-chou-nankan-meikyuu-de-10-mannen-shuugyoushita-kekka-tsuyoku-nari-sugite-teki-ga-inakunattabocchi-seikatsu-nagai-tame-saikyou-dearu-koto-no-jikakunaku-musouitashim/",
	"title": "Saijaku Hakugai Made Sareta Kedo, Chou Nankan Meikyuu de 10 Mannen Shuugyoushita Kekka, Tsuyoku nari Sugite teki ga inakunatta~Bocchi Seikatsu Nagai Tame, Saikyou Dearu Koto no Jikakunaku Musouitashimasu - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/01/Saijaku-Hakugai-Made-Sareta-Kedo-Chou-Nankan-Meikyuu-de-Mannen-Shuugyoushita-Kekka-Tsuyoku-nari-Sugite-teki-ga-inakunattaBocchi-Seikatsu-Nagai-Tame-Saikyou-Dearu-Koto-no-Jikakunaku-Musouitashimasu.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Comedy   Fantasy   Harem   Shounen   ",
	"tags": "Accelerated Growth   Adapted to Manga   Appearance Changes   Appearance Different from Actual Age   Award-winning Work   Betrayal   Broken Engagement   Bullying   Childhood Friends   Dragons   Dungeons   God Protagonist   Godly Powers   Gods   Harsh Training   Lack of Common Sense   Loyal Subordinates   Male Protagonist   Misunderstandings   Nobles   Overpowered Protagonist   Personality Changes   R-15   Revenge   Special Abilities   Sudden Wealth   Sword And Magic   Weak to Strong   ",
	"rating": "(3.3 / 5.0, 93 votes)",
	"author": "Rikisui   力水   ",
	"year": "\n2020~",
	"ranking": "#91   #110   #1218   #164   #3100   ",
	"reviewcount": "16 Reviews sorted by",
	"description": "【The Most Incompetent In This World】―it was the gift Kai Heineman received from the Divine Oracle when he was thirteen years old.\n\nDue to that gift, his physical abilities plummeted. His growth rate became the lowest in the world. Yes, the gift was supposed to make him a target of everyone’s mockery and pity. However, this gift had something that no other gift had, limitless growth.\n\nMoreover, by chains of unfortunate coincidence, Kai Heineman ended up being trapped in the worst, nightmarish dungeon. The dungeon disconnected him from the passage of time in the outside world. This allowed him to train for a really long time while just a moment passed in the outside world, without ageing even a single day.\n\nThis chain of misfortunate events led to the birth of the most powerful supreme being in the world.\n\nThis is the tale of the loner, whose common sense got so distorted after he spent too much time talking with his own sword that he brought out the subordinates he had subjugated in the dungeon to wreak havoc in the outside world.>"
}