{
	"url": "https://www.novelupdates.com/series/transmigrating-into-the-reborn-male-leads-ex-boyfriend/",
	"title": "Transmigrating into the Reborn Male Lead’s Ex-Boyfriend - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/01/rmeb.jpg",
	"noveltype": "(CN)",
	"genre": "Drama   Romance   Yaoi   ",
	"tags": "Business Management   Businessmen   Calm Protagonist   Charismatic Protagonist   Clever Protagonist   Clingy Lover   Cold Love Interests   Comedic Undertone   Doting Love Interests   Family Business   Friendship   Handsome Male Lead   Love Interest Falls in Love First   Manly Gay Couple   Misunderstandings   Modern Day   Possessive Characters   Power Couple   Reincarnation   Schemes And Conspiracies   Second Chance   Selfish Protagonist   Slow Romance   Smart Couple   Tragic Past   Transmigration   Wealthy Characters   ",
	"rating": "(4.3 / 5.0, 490 votes)",
	"author": "温瑜宽   ",
	"year": "\n2018",
	"ranking": "#2283   #489   #472   #1305   #299   ",
	"reviewcount": "107 Reviews sorted by",
	"description": "Song Xuanhe transmigrated into a book called “The President’s Seven Boyfriends”. He became the President’s cannon fodder ex-boyfriend, Song Xuanhe.\n\nThe Song Xuanhe in the book: 180 cm tall, so attractive he would trump over even the hottest celebrities, three generations of family in business–a very appropriate rich third generation.\n\nIt wasn’t a loss to transmigrate into this kind of person. It was just that this was a rebirth story.\n\nThe Song Xuanhe in the book abused the male lead 800 times and had even indirectly caused the male lead’s death. Faced with the reborn blackened male lead, his fate was obvious–not only did he reach rock bottom, he even died without an intact corpse.\n\nRight now, he had become the cannon fodder ex-boyfriend that was foreordained to die without an intact corpse.\n\n-----\n\nSystem: Don’t you think that the male lead has been a bit strange recently? It’s like he’s plotting something in the dark.\n\nSong Xuanhe: Plotting how to kill me?\n\nSystem: No, plotting how to eat you.\n\n-----\n\nSong Xuanhe, who was lying on the bed with an aching waist, pained back and legs suffering from cramps, cursed the System 800 times–what happened to the male lead being a shou?!\n\nEmphasis: Xiao Yuanmu is the gong! Xiao Yuanmu is the gong! Xiao Yuanmu is the gong! Moreover, the big shot has always been a gong! Spoilers only up to here!>"
}