{
	"url": "https://www.novelupdates.com/series/unable-to-divorce-after-signing-the-marriage-contract/",
	"title": "Unable to Divorce After Signing the Marriage Contract - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/10/Unable-to-Divorce-After-Signing-the-Marriage-Contract.jpg",
	"noveltype": "(CN)",
	"genre": "Psychological   Romance   Shounen Ai   Slice of Life   ",
	"tags": "Arranged Marriage   Cold Protagonist   Contracts   Devoted Love Interests   Doting Love Interests   Handsome Male Lead   Heartwarming   Love Interest Falls in Love First   Marriage   Marriage of Convenience   Modern Day   Older Love Interests   Possessive Characters   Pretend Lovers   ",
	"rating": "(4.1 / 5.0, 51 votes)",
	"author": "Bai Hu Qian Deng   百户千灯   ",
	"year": "\n2019",
	"ranking": "#1171   #1180   #4361   #1693   #3643   ",
	"reviewcount": "9 Reviews sorted by",
	"description": "Lin You He excelled in everything –  his looks and accomplishments were all top notch, but he was very dense in the emotional department that made people feel frustrated.\n\nEven if a marriage contract fell from the sky, he would not feel anything. All he knew was to remember his identity and fulfill the contract.\n\nOn the day of the wedding, he was still apologizing for his friends’ teasing.\n\n“I’m sorry Mr. Lu, they don’t know the situation, so I hope you don’t mind……”\n\nThe other party lowered his eyes to look at him, “I don’t mind.”\n\nLin Yu He felt relieved, as he thought that the rumors were wrong and that the other party was not as insensitive as he was rumored to be.\n\nUntil that night, he did not manage to get any sleep.\n\nThe next day, Lin Yu He braced his sore legs and asked in a voice that was hoarse from crying, “Let me confirm again, we will divorce after the contract is over, right? The kind of mission last night only needs to be done once, right?”\n\nThe man who was about to reach out to help him massage his waist narrowed his eyes, his voice was low and his words curt: “No divorce, no stopping it.”\n\nLin Yu He: “……”\n\nHe looked at the man whose gaze was obscure, and finally had a change from his usual dullness, keenly perceiving the looming danger: “How about we talk about the divorce first……”\n\nThe next second, he was pinched at the back of his neck.\n\n“Ning Ning.”\n\nThe man called him by his nickname, and his breath invading all his senses.\n\n“You didn’t even look at me that seriously when we got married.”\n\n“Also, last night wasn’t a mission.”>"
}