{
	"url": "https://www.novelupdates.com/series/the-big-landlord/",
	"title": "The Big Landlord - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2017/06/264345_243.jpg",
	"noveltype": "(CN)",
	"genre": "Adult   Mature   Romance   Smut   Yaoi   ",
	"tags": "Ancient China   Arranged Marriage   Black Belly   Business Management   Calm Protagonist   Charismatic Protagonist   Clever Protagonist   Devoted Love Interests   Doting Love Interests   Family Business   Family Conflict   Fat to Fit   Handsome Male Lead   Hard-Working Protagonist   Leadership   Love Interest Falls in Love First   Modern Knowledge   Power Couple   Pragmatic Protagonist   Previous Life Talent   Proactive Protagonist   Royalty   Schemes And Conspiracies   Smart Couple   Strong Love Interests   Transmigration   Transported to Another World   Wealthy Characters   ",
	"rating": "(4.3 / 5.0, 294 votes)",
	"author": "Yin Ya   尹琊   ",
	"year": "\n2014",
	"ranking": "#2240   #296   #505   #1430   #401   ",
	"reviewcount": "45 Reviews sorted by",
	"description": "The MC entered the body of the An family eldest son, An Ziran, an arrogant 16 years old boy who weighed 78 kg (~171-172 lbs), who only knew how to eat, play and sleep. Seeing his current body, An Ziran decided his first priority was to LOSE WEIGHT!\n\nThree days later after he became An Ziran, An Ziran’s father and his biological mother died, which meant as the eldest son he had to take over the family business.\n\nBeside his legitimate first wife, An Ziran’s father also married 3 others women, who all wanted to take over the An family fortune but only the eldest son could be able to touch it, therefore they have to depend on An Ziran in order to live a comfortable life.\n\nAn Ziran’s father also had an older brother who is always planning to steal the An family fortune. The elder brother of An Ziran’s father and the woman he married had powerful connections. In order to save the An family fortune, An Ziran has to find a golden thigh to cling on. The butler told An Ziran that there is an engagement between the An family and an influential family. Therefore he takes his sister to that family house to make a connection.\n\nHowever, during their journey, An Ziran’s younger sister overheard that the son of that family is UGLY, so as a beautiful and spoiled young lady coming from a rich household, she didn’t want to marry him and decided to run away. Without any other choice, An Ziran had to take his sister’s​ place and marry that man, who told him that he would let him go soon, but lied.>"
}