{
	"url": "https://www.novelupdates.com/series/every-night-i-come-to-his-bedroom/",
	"title": "Every Night, I Come To His Bedroom - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/02/Every-Night-I-Come-To-His-Bedroom.jpeg",
	"noveltype": "(KR)",
	"genre": "Fantasy   Romance   ",
	"tags": "Aristocracy   Beautiful Female Lead   Calm Protagonist   Caring Protagonist   Charismatic Protagonist   Charming Protagonist   Doting Love Interests   Empires   European Ambience   Fairies   Fated Lovers   Female Protagonist   First Love   Handsome Male Lead   Hard-Working Protagonist   Honest Protagonist   Kind Love Interests   Kingdoms   Magic   Mysterious Past   Past Plays a Big Role   Popular Love Interests   R-15   Royalty   Secret Crush   Slow Romance   Underestimated Protagonist   Unrequited Love   ",
	"rating": "(3.7 / 5.0, 20 votes)",
	"author": "Sea Sky Star   바다하늘별   ",
	"year": "\n2021",
	"ranking": "#3802   #3407   #9054   #6706   #8306   ",
	"reviewcount": "No Reviews",
	"description": "Something magical happened to Ellie. While everyone else is asleep, she wakes up in the appearance of a fairy in the bedroom of Raymond, her longtime crush. But……\n\n“I think it’s a curse rather than a magic.”\n\nAt his straightforward words, Ellie hid behind the fairy appearance and confessed her sincere feelings to him, and tried to sort her feelings out.\n\n“I know you feel very uncomfortable. I will sort my feelings out quickly.”\n\n“Then, what if you don’t come here anymore?”\n\n“Perhaps my longtime crush is over.”\n\n“I hope you can sort your feelings up quickly.”\n\nBut he was so cold. From that moment on, he looked down at her with intense eyes, as if he was about to swallow her.\n\n“You have a crush on me, so you come every night. But now you’re going to marry someone else?”\n\n“Excuse me, Duke. You don’t even know who I am……”\n\n“……I’m curious who you are.”\n\nAt his unexpected words, Ellie woke up and never came to his bedroom again.\n\nShe doesn’t even know he is waiting eagerly for her……\n\n“Please come back. Now I will love you more.”>"
}