{
	"url": "https://www.novelupdates.com/series/maria-sama-ga-miteru/",
	"title": "Maria-sama ga Miteru - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2015/07/miteru.png",
	"noveltype": "(JP)",
	"genre": "Comedy   Drama   School Life   Slice of Life   Yuri   ",
	"tags": "Adapted to Anime   Adapted to Manga   All-Girls School   Senpai-Kouhai Relationship   ",
	"rating": "(3.6 / 5.0, 32 votes)",
	"author": "Konno Oyuki   ",
	"year": "\n1998\n",
	"ranking": "#2000   #2000   #9245   #11527   #8351   ",
	"reviewcount": "2 Reviews sorted by",
	"description": "Maria-sama ga Miteru’s story revolves around the students of the Lillian Catholic school for girls, and can be considered character-driven, focusing on interactions between the characters rather than any sort of ongoing plot or goal to attain. At Lillian Girls’ School, there is a tradition known as the sœur system (sœur being French for “sister” ) , in which a second, or third-year student, the grande sœur (“big sister” ) , will give her rosary to a junior student, the petite sœur (“little sister” ) , and promise to look after them and guide them.\n\nWhen the story begins, Yumi Fukuzawa, a new first-year student admitted to Lillian, is praying in front of the Virgin Mary statue near the school entrance when she is suddenly approached by a cold second-year student named Sachiko Ogasawara who straightens Yumi’s uniform ribbon. This seemingly simple act of kindness stays with Yumi the rest of the day, and she speaks of her meeting with Sachiko to her friends during class and lunch. After school is over, Yumi’s classmate Tsutako Takeshima meets with Yumi to show her that she took a photograph of Yumi’s meeting with Sachiko earlier that morning. Yumi asks if she can have the photo, but Tsutako says she will give her the snapshot under two conditions: one being that Tsutako can display it at the upcoming school festival, and two being that Yumi get Sachiko’s permission to do so as well. Yumi agrees to this, which sets in motion a series of events involving the entire Yamayurikai — the student council of the school. A few weeks after first meeting Sachiko, Yumi accepts Sachiko’s rosary and therefore agrees to become her petite sœur.\n\nThis officially inducts Yumi into the Yamayurikai where she assists them in school matters at the same level as the other two petite sœurs — Yoshino Shimazu, and Shimako Toudou — who are the petite sœurs of Rei Hasekura, and Sei Satou respectively. Through her activities in the Yamayurikai, Yumi becomes closer to the other members and generally finds her experiences with the group to be enjoyable.\n\nThis was the original novel that the Manga and Anime are based on.>"
}