{
	"url": "https://www.novelupdates.com/series/heroic-death-system/",
	"title": "Heroic Death System - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2017/12/HDS.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Comedy   Fantasy   Historical   Mystery   Romance   Sci-fi   Tragedy   Yaoi   ",
	"tags": "Adapted to Drama CD   Amnesia   Ancient Times   Autism   Beastkin   Blackmail   Caring Protagonist   Charming Protagonist   Child Abuse   Cooking   Cultivation   Death of Loved Ones   Doting Love Interests   Elves   Emotionally Weak Protagonist   Episodic   Fated Lovers   Forced into a Relationship   Ghosts   Gods   Hackers   Handsome Male Lead   Hard-Working Protagonist   Human-Nonhuman Relationship   Immortals   Interdimensional Travel   Jealousy   Love Interest Falls in Love First   Lovers Reunited   Male Yandere   Military   Mpreg   Multiple Realms   Music   Mute Character   Non-humanoid Protagonist   Obsessive Love   Omegaverse   Possessive Characters   Power Couple   Reincarnation   R*pe   Second Chance   S*xual Cultivation Technique   Sibling Rivalry   Skill Assimilation   Strong Love Interests   System Administrator   Torture   Weak to Strong   World Hopping   Yandere   Zombies   ",
	"rating": "(4.3 / 5.0, 935 votes)",
	"author": "Xue Yuan Specter   雪原幽灵   ",
	"year": "\n2016",
	"ranking": "#322   #313   #606   #1159   #168   ",
	"reviewcount": "260 Reviews sorted by",
	"description": "“I curse you to never die in peace!”\n\nThus, Shang Ke started a never-ending cycle of constantly throwing away his miserable life.\n\nHe would always show himself as a martyr while letting others cry over his death.\n\nIt was because of a woman’s curse that Shang Ke was hit by a car and turned into a human vegetable. This led to him becoming bound by an unlucky system in which he was cursed to die. The most unfortunate part was that he never cheated on anyone’s feelings. The reason for why he was cursed by a woman was because of a guy named Qi Chen. Qi Chen was a ladies man, and he would always use Shang Ke as an excuse to break up with any woman that he was with. As a result, Shang Ke was always blamed for the breakups. Since then, the main character could only be forced to cross into different worlds. He would thus experience for himself, the hero’s “thrill”.>"
}