{
	"url": "https://www.novelupdates.com/series/they-regretted-it-after-their-hearts-turned-to-ashes/",
	"title": "They Regretted it After Their Hearts Turned to Ashes - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/09/They-Regretted-it-After-Their-Hearts-Turned-to-Ashes.jpg",
	"noveltype": "(CN)",
	"genre": "Drama   Psychological   Shounen Ai   Slice of Life   ",
	"tags": "Abandoned Children   Abusive Characters   Amnesia   Bullying   Celebrities   Character Growth   Coma   Complex Family Relationships   Cruel Characters   Death   Death of Loved Ones   Delusions   Depictions of Cruelty   Depression   Devoted Love Interests   Disabilities   Family   Family Conflict   Flashbacks   Friends Become Enemies   Handsome Male Lead   Hard-Working Protagonist   Hated Protagonist   Hospital   Inheritance   Kidnappings   Loneliness   Love Interest Falls in Love First   Mind Break   Misunderstandings   Modern Day   Multiple POV   Music   Near-Death Experience   Nightmares   Outcasts   Past Plays a Big Role   Past Trauma   Possessive Characters   Revenge   Second Chance   Secrets   Showbiz   Siblings   Siblings Not Related by Blood   Sickly Characters   Smart Couple   Strong Love Interests   Tragic Past   Twisted Personality   Wealthy Characters   Wishes   ",
	"rating": "(4.6 / 5.0, 17 votes)",
	"author": "Alohomora   ",
	"year": "\n2022",
	"ranking": "#79   #154   #8408   #2313   #9780   ",
	"reviewcount": "6 Reviews sorted by",
	"description": "From childhood to adulthood, Luo Zhi didn’t seem to have done anything right.\n\nHis biological parents didn’t like him. They only saw an excellent eldest brother, a caring sister, and a sensible stepson in their eyes. The sister whom is well-behaved towards everyone else, only treats him as air. The childhood friend that he grew up with would accept his gifts on the surface, only to turn around and throw it to the stray dogs on the roadside.\n\nWhen he debuted as a singer, it was not gifts that he received, but countless of threatening letters scolding him for using his family background to oppress others and threatening him to quit the circle. He started his own film and television company, and spent money to hire an eighteenth-tier star to say “Happy Birthday” to him. When the little star unexpectedly exploded into the top stream, it was regarded as a robbery by fans, and it was picked up and scolded all the way to the hot search. The family accidentally fell overboard, and Luo Zhi was immersed in the bone-chilling ice cold water. He could only watch as his always indifferent eldest brother eagerly stretch out his hand to save his adopted brother.\n\nWhen he was completely engulfed by the darkness, Luo Zhi finally felt that the world was really dull. If there was someone who can love him, let them appear. He wasn’t able to find them anyways.\n\nAfter waking up in the hospital, he leaned back against the bed. He didn’t care current state of health nor did he care about the treatment. He was no longer interested in anything. But this time, everything was different.\n\nHis parents kept going to top hospitals and begged countless doctors just to save his life. The eldest brother’s eyes were red while he took care of him. His sister cried to the point of fainting by his bedside.\n\nWith scarlet eyes and fierce methods, he frantically took revenge on the eighteenth-tier star who slandered him at the beginning. He was inexplicably on the hot search once again, but this time the entry became #The whole world is waiting for Luo Zhi to come back#.\n\nLater, the whole world did not wait for Luo Zhi.\n\nHowever, someone familiar with the matter revealed that the Ming family, who built an entire maritime business empire and sank a top-level luxury cruise ship worth hundreds of billions of yuan, not only has another young master, but also the youngest captain who sails the world.>"
}