{
	"url": "https://www.novelupdates.com/series/what-to-do-if-youre-the-villain-and-the-heroine-likes-you/",
	"title": "What To Do if You’re the Villain and the Heroine Likes You - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/06/What-To-Do-if-Youre-the-Villain-and-the-Heroine-Likes-You.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Comedy   Fantasy   Harem   Martial Arts   Romance   ",
	"tags": "Accelerated Growth   Acting   Ancient Times   Beautiful Female Lead   Black Belly   Charming Protagonist   Cold Love Interests   Cultivation   Cunning Protagonist   Devoted Love Interests   Doting Love Interests   Engagement   Generals   Handsome Male Lead   Harem-seeking Protagonist   Limited Lifespan   Love Rivals   Male Protagonist   Manipulative Characters   Master-Servant Relationship   Misunderstandings   Multiple Personalities   Nobles   Obsessive Love   Persistent Love Interests   Playboys   Playful Protagonist   Politics   Popular Love Interests   Possessive Characters   Reincarnated in Another World   Revenge   Royalty   Schemes And Conspiracies   Shameless Protagonist   Strength-based Social Hierarchy   Strong Love Interests   System Administrator   Transmigration   Tsundere   Twisted Personality   Unconditional Love   Wealthy Characters   Yandere   ",
	"rating": "(3.7 / 5.0, 67 votes)",
	"author": "峡谷悠哉河蟹   ",
	"year": "\n2021",
	"ranking": "#306   #257   #3029   #295   #5741   ",
	"reviewcount": "5 Reviews",
	"description": "‘Girl, I Just Want to Cultivate’ is a famous novel with multiple female protagonists, but the author guarantees that this book is a single female protagonist. But Readers (including me) have expressed their doubts, and then I was transmigrated into a book and become a handsome villain.\r\n\r\nAnd I know that the original protagonist’s sister is a hidden BOSS and martial arts (The best in the world). The world’s first possessive sick girl! Now that I’m caught by her, how can I make the heroine like the villain (Me)?>"
}