{
	"url": "https://www.novelupdates.com/series/rising-ten-thousand-years/",
	"title": "Rising: Ten Thousand Years - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2017/09/quatkhoinhatvannienhT62yFPkah.jpg",
	"noveltype": "(CN)",
	"genre": "Adventure   Fantasy   Romance   Sci-fi   Seinen   ",
	"tags": "Abandoned Children   Absent Parents   Academy   Age Progression   Ancient Times   Beautiful Female Lead   Books   Bookworm   Calm Protagonist   Clever Protagonist   Eidetic Memory   Enlightenment   Futuristic Setting   Hard-Working Protagonist   Lost Civilizations   Male Protagonist   Modern Knowledge   Philosophical   Poor Protagonist   Post-apocalyptic   Sharp-tongued Characters   ",
	"rating": "(3.6 / 5.0, 17 votes)",
	"author": "宝巨   ",
	"year": "\n2017",
	"ranking": "#2000   #2000   #10378   #11313   #9787   ",
	"reviewcount": "No Reviews",
	"description": "“I know not with what weapons World War III will be fought, but World War IV will be fought with sticks and stones.” — Albert Einstein.\r\n\r\nThe First World War, rifles and machine guns were the most commonly used tactical weapons used in the height of the first global war, an effective weapon changing the traditional arts of war and military tactics completely.\r\n\r\nThe Second World War, military warfare would be brought over to the air and seas, an average of 27,000 people would lose their life each day.\r\n\r\nThe Third World War… not much is recorded on the ancient compendium.\r\n\r\nThe Fourth World War took place on a newly formed calendar on the 26th year. The main weapons used were spears and stones.\r\n\r\nTen thousand years later, when civilization is lost, fallen between the annals of history, when technology is lost in ruins, awaiting to be discovered, when the world dreamed of reviving the time of the ancient past, Li Zhen met a woman originating from the 21st century.\r\n\r\nShe taught Li Zhen mathematics, physics, chemistry, and the likes at a time when man was the most proud, the most glorious, when science reigned the earth, and when technology was at its prime.\r\n\r\nLi Zhen: “She is my wife.”\r\n\r\nWatch as Li Zhen reigns the world with brains!>"
}