{
	"url": "https://www.novelupdates.com/series/my-dangerous-childhood-friend/",
	"title": "My Dangerous Childhood Friend - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/04/My-Dangerous-Childhood-Friend.jpeg",
	"noveltype": "(KR)",
	"genre": "Adult   Fantasy   Mature   Romance   Smut   ",
	"tags": "Absent Parents   Aristocracy   Beautiful Female Lead   Charming Protagonist   Childhood Friends   Childhood Love   Childhood Promise   C*nnilingus   Contracts   Death of Loved Ones   Devoted Love Interests   Doting Love Interests   European Ambience   Family   Female Protagonist   First Love   First-time Interc**rse   F*llatio   Handsome Male Lead   Love Interest Falls in Love First   Marriage   Marriage of Convenience   Misunderstandings   Nobles   Poor Protagonist   Pragmatic Protagonist   R-18   Special Abilities   Strong Love Interests   ",
	"rating": "(3.9 / 5.0, 95 votes)",
	"author": "Yeonseoli   연서리   ",
	"year": "\n2020",
	"ranking": "#1125   #487   #2731   #1503   #1594   ",
	"reviewcount": "22 Reviews sorted by",
	"description": "“Let’s make a promise: We’ll take care of each other when we are both over twenty and still single.”\r\n\r\nOne day, a childhood friend returned and offered Siana a marriage proposal. It was under the excuse of a silly promise of a marriage they had made when they were kids. Even if he was a great guy, he was still her childhood friend!\r\n\r\nIn a fit of anger, Siana uttered another reason for rejecting him instead of the original one she had planned…\r\n\r\n“I… hate rabbits.”\r\n“And how do you know?”\r\n“Know what?”\r\n“That I’m a rabbit or not. And whether I’m right for you or not. We’ve never done it before.”\r\n\r\nWhile she was unable to say a word, Alan called out her name and lowered his head further. His eyes, which curved like two crescent moons, glistened as if he had found something interesting. His face was closer than Siana thought, and his body framing hers was taut.\r\n\r\n“I can’t believe you’re rejecting my proposal because you presume to think I finish fast like a rabbit despite not having shared a night with me.”\r\n\r\nA large, masculine hand lightly clasped her locks. Her soft, light brown curls caught in his grasp gently fell down the side of her face.\r\n\r\n“You’ll give the guy who proposed to you a chance to prove he isn’t a rabbit, right?”>"
}