{
	"url": "https://www.novelupdates.com/series/when-the-flowers-falls-ill-see-you-again/",
	"title": "When The Flowers Falls, I’ll See You Again - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/02/When-The-Flowers-Falls-Ill-See-You-Again.jpeg",
	"noveltype": "(CN)",
	"genre": "Drama   Romance   Xianxia   ",
	"tags": "Adapted to Drama   Ancient Times   Cultivation   Demons   Female Protagonist   Gods   Immortals   Past Plays a Big Role   Protagonist Falls in Love First   R*pe Victim Becomes Lover   Reincarnation   R*pe   Time Travel   ",
	"rating": "(2.6 / 5.0, 14 votes)",
	"author": "Shu Ke   蜀客   ",
	"year": "\n2009",
	"ranking": "#4617   #6193   #10040   #10271   #11201   ",
	"reviewcount": "1 Review sorted by",
	"description": "A thousand years ago, she was only a camellia demon, but he was the controller of the Zhong Tian (Central Heavens), Zhong Tian Wang (King of Central Heavens)!\n\nDuring the centennial Flower Festival, she confessed her love for him. Everyone laughed at her. She angrily said, “I just want to be the Empress.”\n\nHe smiled and said: “Then cultivate.” From then on, she focused on cultivating.\n\nFive hundred years later, she asked again, “When can I be your Empress?” He was silent for a moment, then smiled and said, “We’ll talk about it after you enter the Immortal Registry.”\n\nThe number of women who want to be his Empress is more than millions. She finally understands the reason for his silence. She resolutely turned her back and choose that mortal love fate of “using one’s body to repay a kindness.” She abandoned immortality and will reincarnate forever. She doesn’t want to cultivate immortality anymore, she just wants to forget him!\n\nNow, because of his thousand-year guilt, he reversed fate. Bringing the reincarnated her back to her previous life, focusing on helping her cultivate again, wanting to make up what he owed her in the past. When flowers falls, these two meet again…\n\nThat day, the brilliant red enters the eyes, a mountain full camellias, whose eyes will it bewilder…>"
}