{
	"url": "https://www.novelupdates.com/series/dukes-exclusive-painter/",
	"title": "Duke’s Exclusive Painter - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/07/Duke-s-exclusive-painter.jpeg",
	"noveltype": "(KR)",
	"genre": "Romance   Smut   ",
	"tags": "Aristocracy   Artists   Beautiful Female Lead   Different Social Status   European Ambience   Female Protagonist   Handsome Male Lead   Multiple POV   Nobles   R-18   Short Story   ",
	"rating": "(3.3 / 5.0, 24 votes)",
	"author": "Mongsu   ",
	"year": "\n2020",
	"ranking": "#4617   #3772   #6651   #7987   #5832   ",
	"reviewcount": "7 Reviews sorted by",
	"description": "Stendhal Syndrome: A condition in which a person who sees a great work of art feels intensely excited or dizzy due to shock and emotion.\n\nCedric Schulak suffers from impotence from childhood trauma.\n\nHe attends an academy exhibition for a sponsorship event and experiences the so-called ‘Stendhal’s syndrome’, which causes sexual urges.\n\nCedric, who is helpless by a beautiful painting, adopts ‘Rosalia’, the owner of the painting, as his ward.\n\n“Baby, why are you so wary of me? “\n\n* * *\n\n“I don’t know why Duke supports me.”\n\nRoselia did not stare at him even as she spoke to him. Only Cedric’s one-sided gaze continued.\n\nShe said briefly, opening and closing her lips repeatedly for a long time to see if there was something more she wanted to say.\n\nCedric drank fragrant tea and waited patiently for her words.\n\n“What do you want from me?”\n\nWhat do you want? The question was a bit vague.\n\nFor a moment, Cedric felt that the subject of the question had been reversed.\n\nIt’s not that he wants something from Roselia, it’s that Roselia wants something from him.\n\nEither way, she’s in a position to be sponsored by Cedric.\n\n“I just liked your work, and it was you who drew it that caught my eye.”\n\nDespite his explanation, her crimson eyes were still full of suspicion.\n\nCedric laughed a little embarrassedly.\n\nDealing with a child who is six years younger than him, even a woman, was more difficult than he thought.>"
}