{
	"url": "https://www.novelupdates.com/series/yearning-of-you-for-a-long-time/",
	"title": "Yearning of You for a Long Time - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/06/Yearning-of-You-for-a-Long-Time.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Romance   School Life   ",
	"tags": "Childhood Friends   Childhood Love   Early Romance   Female Protagonist   Modern Day   ",
	"rating": "(3.5 / 5.0, 10 votes)",
	"author": "九兜星   ",
	"year": "\n2019",
	"ranking": "#4265   #2376   #10750   #8981   #10743   ",
	"reviewcount": "1 Review sorted by",
	"description": "As we all know, Tang Qishen, the student president of the third High school, is cold and arrogant, reserved and self-contained, and cannot be approached easily.\n\nUntil there was a post on the forum.\n\nAt the seat of the president who is not close to strangers, there is a bright and charming primary school sister. The primary school sister chattered, pushed all the homework she couldn’t do in front of him, and then dozed off as if there were no one else.\n\nOne classmate couldn’t help laughing: “What a brainless fangirl? She’s going to die!”\n\nInformed friend: “Oh, no way? Tang Qishen treats her like a daughter.”\n\n“No, no, no, it’s clearly a child bride!”\n\nShi Luo was ashamed and indignant on the surface. She privately confessed but only got a faint rejection. The young girl looked at him with red eyes wrongfully said, “Can’t I depend on you when I grow up?”, She then decided to close her heart and mind and distanced herself properly.\n\nLater, the students found that the boss, who had always been attentive, was absent-minded, lost his mind and looked heavy.\n\nAfter school that night, at the corner of the school gate, several gangsters blocked Shi Luo: “Follow me. Don’t think about Tang Qishen anymore. There will be no result.”\n\n“What’s wrong with the school flower? I’m not bored with it and throw it away.”\n\nThe man who had always been too calm lost his reason and became cruel. His arm veins is about to burst: “If you don’t want to die, get out of here.”\n\nThen he pressed Shi Luo into his arms and asked in a hoarse voice, “Don’t be afraid, will you come home with me…”\n\nNo one knew. That night, he kissed her wet eyes and said, “When you grow up, you can only rely on me.”>"
}