{
	"url": "https://www.novelupdates.com/series/the-experimental-log-of-the-crazy-lich/",
	"title": "The Experimental Log of the Crazy Lich - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2017/11/The-Experimental-Log-of-the-Crazy-Lich.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Comedy   Fantasy   Harem   Mature   Sci-fi   Seinen   Supernatural   ",
	"tags": "Age Regression   Amnesia   Antihero Protagonist   Apathetic Protagonist   Appearance Different from Actual Age   Army Building   Beautiful Female Lead   Betrayal   Cautious Protagonist   Chuunibyou   Clever Protagonist   Cross-dressing   Cunning Protagonist   Death   Demons   Depictions of Cruelty   Determined Protagonist   Dragons   Elemental Magic   Elves   Enemies Become Allies   Engineer   Evil Gods   Eye Powers   Famous Protagonist   Fantasy Creatures   Fast Learner   Friendship   Game Elements   Genius Protagonist   Ghosts   Goddesses   Godly Powers   Gods   Handsome Male Lead   Hiding True Abilities   Hiding True Identity   Humanoid Protagonist   Kingdom Building   Kingdoms   Knights   Late Romance   Lawyers   Loli   Love Interest Falls in Love First   Magical Technology   Male Protagonist   Manipulative Characters   Master-Disciple Relationship   Multiple Identities   Multiple Realms   Mysterious Past   Necromancer   Nobles   Parody   Past Plays a Big Role   Perverted Protagonist   Politics   Protagonist Strong from the Start   Quirky Characters   Reincarnated in Another World   Reincarnation   Romantic Subplot   Royalty   Ruthless Protagonist   Schemes And Conspiracies   Seven Deadly Sins   Seven Virtues   S*aves   Slow Romance   Soul Power   Souls   Strong Love Interests   Strong to Stronger   Sword And Magic   Sword Wielder   System Administrator   Tragic Past   Twisted Personality   Unique Cultivation Technique   Unreliable Narrator   War Records   Wars   Weak to Strong   Yandere   ",
	"rating": "(4.3 / 5.0, 723 votes)",
	"author": "Angry Squirrel   愤怒的松鼠   ",
	"year": "\n2014",
	"ranking": "#5262   #4744   #298   #8806   #204   ",
	"reviewcount": "89 Reviews sorted by",
	"description": "This is the story of a crazy lich who possesses an internal game system and brings catastrophe to the entire world.\n\n“Let’s look at the daily quests today… it’s the damned choose one-of-two-options-type again. Destroy a town with a population of 30,000 people or above; reward: 10,000 evil points. Steal lollipops from 3 children; reward: 1 evil point. If neither of the quests is completed, then 2 points will be deducted.” \n\n“Tsk! You think I’m s*upid? If I really destroyed a town, a crusade of Epic-ranked Holy Knights would definitely come hunting me down. Even if I earned the points, there wouldn’t be any life left in me to spend them. I better just go be a kindly lollipop bandit.” \n\nI’ve already had enough of being a notorious lich. Who says that a lich can’t be a good person? I’m definitely going to beat this damned system and be an upright and dignified good man.>"
}