{
	"url": "https://www.novelupdates.com/series/who-touched-my-tail/",
	"title": "Who Touched My Tail! - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/02/Who-Touched-My-Tail.jpg",
	"noveltype": "(CN)",
	"genre": "Adventure   Comedy   Fantasy   Historical   Romance   Xianxia   Yaoi   ",
	"tags": "Alternate World   Ancient Times   Apocalypse   Appearance Changes   Appearance Different from Actual Age   Artificial Intelligence   Calm Protagonist   Celebrities   Charismatic Protagonist   Couple Growth   Cross-dressing   Cultivation   Cunning Protagonist   Devoted Love Interests   Doting Love Interests   Episodic   Family Conflict   Famous Protagonist   Fantasy World   Fox Spirits   Futuristic Setting   Handsome Male Lead   Heartwarming   Heavenly Tribulation   Incest   Love Interest Falls in Love First   Modern Day   Multiple Realms   Non-humanoid Protagonist   Obsessive Love   Omegaverse   Outer Space   Overpowered Protagonist   Post-apocalyptic   Revenge   Royalty   Showbiz   Slow Romance   Special Abilities   Strong Love Interests   System Administrator   Transmigration   Tsundere   Unconditional Love   Virtual Reality   Wealthy Characters   World Hopping   Zombies   ",
	"rating": "(4.2 / 5.0, 589 votes)",
	"author": "Xiao Xuan   筱玄   ",
	"year": "\n2016",
	"ranking": "#1983   #3798   #404   #313   #380   ",
	"reviewcount": "115 Reviews sorted by",
	"description": "Xue Ling is a nine tailed fox who has been cultivating for thousands of years but lost all his tails in a moment of capriciousness.\n\nTails are easy to self destruct, but not easy to recover. In order to restore his human figure, he must struggle to destroy the plot, forcibly change the protagonist’s fate, and be the cannon fodder in the first line of attack.\n\nBut why are these plots more and more irrational? The setup is getting more and more weird, and what is with this person that is showing up in every single world?\n\nIt seems that before going through all these worlds, he has forgotten some very important affairs?\n\nSu Xuanyan: Yes, you’ve forgotten me.\n\nXue Ling: Get lost! (▼皿▼#) Clearly every time you are the one that doesn’t remember anything!\n\nSu Xuanyan: Oh, this is purely an accident.>"
}