{
	"url": "https://www.novelupdates.com/series/after-awakening-i-conquered-the-whole-world/",
	"title": "After Awakening, I Conquered The Whole World - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/02/After-Awakening-I-Conquered-The-Whole-World.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Drama   Fantasy   Horror   Josei   Mystery   Romance   Supernatural   Tragedy   ",
	"tags": "Adopted Protagonist   Amnesia   Beautiful Female Lead   Calm Protagonist   Clever Protagonist   Comedic Undertone   Couple Growth   Devoted Love Interests   Doting Older Siblings   Doting Parents   Familial Love   Fated Lovers   Female Protagonist   Handsome Male Lead   Hidden Abilities   Love Interest Falls in Love First   Lovers Reunited   Mysterious Illness   Power Couple   Protagonist Strong from the Start   Schemes And Conspiracies   Siblings Not Related by Blood   Slow Romance   Smart Couple   Strong Love Interests   Suicides   Unconditional Love   Wealthy Characters   ",
	"rating": "(3.9 / 5.0, 17 votes)",
	"author": "Gu Mushuang   ",
	"year": "\nN/A",
	"ranking": "#6970   #2000   #9242   #13810   #11280   ",
	"reviewcount": "5 Reviews sorted by",
	"description": "The first time they met, she said to him, “Mr. Song, I see that you’re ill-fated, and I’m afraid that you will die soon. \nThe people around him accused her of being a fraud, and threatened to beat her. \n\nThe second time she saw him, she said to him, “Mr. Song, you will die tomorrow.” She was nearly beaten. \n\nThe third time they met, he was on the brink of death. ***\n\nQiao Jin was a twenty year old with a meek disposition, but her personality changed drastically after her suicide attempt, and she became neurotic and pompous. \n\nShe is labeled as a possessed lunatic. \n\nSong Yanqing is a blue-blooded 25 year old. He is ill-omened and so sickly that he can barely walk two steps without coughing. \n\nIn Qiao Jin’s eyes, he is a phantom with a short life. \n\nThis is a fictional story about the epic romance between a lunatic that is too big for her britches and a slick noble-born phantom with a short life.>"
}