{
	"url": "https://www.novelupdates.com/series/what-comes-around-goes-around/",
	"title": "What Comes Around Goes Around - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/08/WCAGA-Cover.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Drama   Josei   Romance   Slice of Life   ",
	"tags": "Adapted to Drama   Arrogant Characters   Beautiful Female Lead   Bickering Couple   Boss-Subordinate Relationship   Clumsy Love Interests   Co-Workers   Cohabitation   Cold Love Interests   Cute Protagonist   Female Protagonist   Handsome Male Lead   Hard-Working Protagonist   Lawyers   Love Interest Falls in Love First   Misunderstandings   Modern Day   Multiple POV   Office Romance   Popular Love Interests   Sharp-tongued Characters   Slow Romance   Wealthy Characters   ",
	"rating": "(4.3 / 5.0, 71 votes)",
	"author": "Brilliant Leaf   叶斐然   ",
	"year": "\n2019",
	"ranking": "#5262   #2000   #5176   #7356   #4190   ",
	"reviewcount": "13 Reviews sorted by",
	"description": "When Cheng Yao saw Qian Heng for the first time, she couldn’t possibly understand why he was nicknamed ‘industry cancer’.\n\nThe man in front of her looked brilliant. He was handsome and tall, and his eyes were particularly charming.\n\n‘Nonsense! How could someone so good-looking like him be industry cancer?’ She thought.\n\nThat was until she was severely beaten by socialism – When she tried to persuade her handsome boss on taking a case of public rights protection, her boss gave her a blank look.\n\n“What do you think a successful lawyer should do?”\n\n“Work with passion?”\n\n“What’s my surname?”\n\n“Qian,* of course!”\n\n“Therefore, I will only work for cash.”\n\n…\n\nWhen she asked for a raise, her boss was unconvinced. And at the KTV party he participated in for the first time, he made sure to give her a “reality check”.\n\nIt was hosted in a small theater. At that night, she had drunk too much. Cheng Yao ran to the stage and picked up the microphone.\n\n“What’s up with Qian Heng? This guy’s amazing! Isn’t he impressive? I must have gone insane to let him call me ‘baby’ that day! I, Cheng Yao, must make this clear! WHAT! GOES! AROUND! COMES! AROUND!”\n\nNo one could forget Qian Heng’s terrible expression that night…\n\nBut what they didn’t know was that the next day, Qian Heng pushed Cheng Yao into a corner, and said with an unreadable expression, “Were you satisfied last night, baby?”\n\n*the character for the last name “Qian” also means “money”>"
}