{
	"url": "https://www.novelupdates.com/series/eaten-by-the-tyrant-i-raised/",
	"title": "Eaten By The Tyrant I Raised - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/08/Eaten-By-The-Tyrant-I-Raised.jpg",
	"noveltype": "(KR)",
	"genre": "Adult   Drama   Fantasy   Mature   Psychological   Romance   Smut   Tragedy   ",
	"tags": "Abusive Characters   Aristocracy   Beast Companions   European Ambience   Female Protagonist   Handsome Male Lead   Love Interest Falls in Love First   Male Yandere   Obsessive Love   Possessive Characters   R-18   Royalty   Younger Love Interests   ",
	"rating": "(4.1 / 5.0, 89 votes)",
	"author": "Dan Ri Han   단리한   ",
	"year": "\n2019",
	"ranking": "#4617   #3505   #3329   #3315   #1281   ",
	"reviewcount": "9 Reviews sorted by",
	"description": "Ronée once happened to save a young boy. Despite his rare golden hair, she had thought it nothing more than a coincidence. \n\n“Ronée, love you. I want to be with you forever.” \n\n“Thank you for loving me.” \n\nBut the boy had been twelve at that time, and she had been seventeen. \n\n“But we can’t be together.” \n\nThe age gap was difficult enough, but her father would want to hand her off to a suitable marriage candidate. He was sure to oppose it. So, she rejected him. She had thought that they would never see each other again anyway. However… \n\n“There is no other woman in my eyes but you.”\n\nTen years later, he appeared before Ronée again, having become a king. \n\n“Thank you for loving me. But…” \n\nYou, a king, and I cannot be together. Ronée made up her mind to give him a realistic answer. He whispered quietly to her, his eyes flashing dangerously. \n\n“We still can’t be together?” \n\nA very young and feeble child became the ruler of a continent; his soft and frail hands had become the strong and rough hands of a man. The king, Nabel, slowly moved on top of Ronée and wound himself around her like a vine. \n\n“Where did you learn a thing like this?”\n\nThe childlike Nabel no longer existed. He was dangerous; no, even more than that. Nabel smiled sleepily. \n\n“If it’s for you… I can learn even these sorts of things.” \n\nAt those words coming from the lips of the man with the noblest blood on the continent, Ronée’s eyes widened.>"
}