{
	"url": "https://www.novelupdates.com/series/the-predators-contract-partner/",
	"title": "The Predator’s Contract Partner - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/11/2A68AA30-AA49-47D0-87A6-04598BA1F333.jpeg",
	"noveltype": "(KR)",
	"genre": "Adult   Fantasy   Romance   Smut   Tragedy   ",
	"tags": "Abusive Characters   Adapted to Manhwa   Age Regression   Aristocracy   Beautiful Female Lead   Calm Protagonist   Cautious Protagonist   Child Abuse   Clever Protagonist   Contracts   Depictions of Cruelty   European Ambience   Fallen Nobility   Female Protagonist   Handsome Male Lead   Love Interest Falls in Love First   Loyal Subordinates   Maids   Marriage   Marriage of Convenience   Multiple Timelines   Nobles   Past Trauma   Possessive Characters   Power Couple   Power Struggle   R-18   Revenge   Schemes And Conspiracies   Second Chance   Seduction   Smart Couple   Special Abilities   Strong Love Interests   Time Travel   Weak to Strong   ",
	"rating": "(4.1 / 5.0, 112 votes)",
	"author": "리사벨   ",
	"year": "\n2020",
	"ranking": "#141   #890   #1085   #170   #1002   ",
	"reviewcount": "17 Reviews sorted by",
	"description": "“You shouldn’t have crossed this line, Elisha, if you didn’t want it to be like this.”\n\nA sturdy arm wrapped around her swaying body. Her head became hazy and an intentional hot sweet sigh was pulled out of her.\n\n‘How the hell did I get myself in this situation—’\n\nElisha recalled. This never happened before.\n\n‘Yeah, I remember.’\n\nHer future in which she would become the fake concubine to a demonic man from the same family, and would be eaten to death—even down to her bone marrow. A future in which the Cartier ducal family is embroiled in a power struggle and fragmented.\n\nTo avoid that future, Elisha threw herself at Lucerne, the archrival of her former life.\n\nYeah. There was no problem. She knew this man, before and after her regression. She already knew he was the most notorious maniac in the Empire.\n\n20-year-old Elisha owes 30,000 gold coins (about 15 billion won in Korean currency or around 15 million in USD).\n\nAfter going back in time, in order to avoid a hellish life because of debt, she becomes the most capable illegitimate child in the world and visits Lucerne, the archenemy of her master. \n\n“What do you want from me?”\n\n“Please lend me some money. And… make me your subordinate. I’ll give you all the information I have.”\n\n“Why should I trust you?”\n\n“I’ll give myself up as collateral.”\n\nLucerne listened to Elisha and watched her quietly.\n\n“Okay. But I decide how to deal with the collateral.”\n\n“…….”\n\n“First of all, marry me.”\n\n“…… huh?”\n\nElisha didn’t expect it either. That her information transaction would become a marriage contract.>"
}