{
	"url": "https://www.novelupdates.com/series/cold-sands/",
	"title": "Cold Sands - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/12/Cold-Sands_1609387856.jpg",
	"noveltype": "(CN)",
	"genre": "Drama   Mature   Romance   Tragedy   Yaoi   ",
	"tags": "Ancient China   Aristocracy   Bickering Couple   Caring Protagonist   Character Growth   Cold Love Interests   Confident Protagonist   Confinement   Enemies Become Lovers   Generals   Genius Protagonist   Loner Protagonist   Love Interest Falls in Love First   Manly Gay Couple   Military   Mysterious Family Background   Politics   Royalty   Strong Love Interests   Torture   Unrequited Love   Wars   ",
	"rating": "(4.5 / 5.0, 325 votes)",
	"author": "Mu Yun Lan Qing   牧云岚卿   ",
	"year": "\nN/A",
	"ranking": "#2000   #2000   #2385   #13808   #1608   ",
	"reviewcount": "76 Reviews sorted by",
	"description": "He’s just a low-ranking deputy general and he’s a prince. They meet on the battlefield but it turns out to be the beginning of a complicated and beautiful story.\n\nMurong Yu is a very confident man – until he meets Han Xin.\n\nThere’s nothing he cannot get; there’s nothing he cannot destroy.\n\nTo let live or not, is all up to him.\n\nHe is the future ruler of Great Yan and so it’s only natural that the world should bow down at his feet.\n\nBut he had never thought that one day he would lose control of it.\n\nThat even his own will would be uncontrollable.\n\nMurong Yu can neither get nor destroy this prisoner of war.\n\nHan Xin has never given a care about the world – until he meets Murong Yu.\n\nHe has never cared about anyone, nor has anyone cared about him.\n\nIt doesn’t matter if you’re alone or sad, as long as you can still laugh, life will go on.\n\nHe has learned long ago how to not question, how not to believe, how not to lose and how not to care.\n\nDestiny’s uncaring teasing and humiliations have already become numb to him.\n\nThat’s right, he doesn’t have a care in the world.\n\nEven if it’s this Prince Royal of Great Yan who’s started to warm up to him.>"
}