{
	"url": "https://www.novelupdates.com/series/i-am-really-not-the-son-of-providence/",
	"title": "I Am Really Not The Son of Providence - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/10/I-Am-Really-Not-The-Son-of-Providence.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Comedy   Harem   Xianxia   ",
	"tags": "Adapted to Manhua   Beautiful Female Lead   Body Tempering   Cautious Protagonist   Charismatic Protagonist   Clingy Lover   Clones   Complex Family Relationships   Cultivation   Dao Comprehension   Death of Loved Ones   Dense Protagonist   Early Romance   Eunuch   Eye Powers   Fanaticism   Fast Cultivation   First-time Interc**rse   Handsome Male Lead   Immortals   Lack of Common Sense   Love Interest Falls in Love First   Loyal Subordinates   Lucky Protagonist   Male Protagonist   Misunderstandings   Modern Knowledge   Naive Protagonist   Obsessive Love   Older Love Interests   Overpowered Protagonist   Parody   Poor to Rich   Reverse R*pe   Royalty   Schemes And Conspiracies   Servants   Transmigration   Transported to Another World   Unique Cultivation Technique   Unlucky Protagonist   Weak to Strong   Yandere   Younger Love Interests   ",
	"rating": "(3.5 / 5.0, 100 votes)",
	"author": "Palace in the Clouds   云中殿   ",
	"year": "\nN/A",
	"ranking": "#6970   #982   #4786   #10064   #6840   ",
	"reviewcount": "24 Reviews sorted by",
	"description": "After his transmigration to the cultivation world, Shen Tian discovers that he can see the fortuitous opportunities and their providence haloes of others. \r\n\r\nIn order to rub off some of the luck from these opportune characters, Shen Tian proactively gets close to them. \r\n\r\n… \r\n\r\nEventually, everyone realizes that no matter who it was, as long as they hang out with Shen Tian, they will gain lots of fortuitous opportunities! And there’s no exception to this rule! \r\n\r\nFrom then on, Shen Tian was labelled as the most popular lucky mascot in the cultivation world! \r\n\r\nFairy Qing Yue: 'I once followed my Senior Brother to the Kunlun Secret Realm in the West, and obtained the Sun And Moon Orb!' \r\n\r\nPrincess Ling Long: 'I once followed my Senior Brother to the Imperial Burial Valley in the Northern Sea, and both of us inherited skills from Emperor Dan!' \r\n\r\nImmortal Phoenix Queen: 'Haha, what a bunch of fledglings! Do you know how he got his Dragon-Phoenix Immortal Form?'>"
}