{
	"url": "https://www.novelupdates.com/series/the-villain-has-been-coveting-me-for-a-long-time/",
	"title": "The Villain Has Been Coveting Me for a Long Time - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/09/58416s.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Horror   Romance   School Life   Supernatural   Tragedy   Yaoi   ",
	"tags": "Ancient Times   Calm Protagonist   Cooking   Crime   Cross-dressing   Cute Protagonist   Glasses-wearing Love Interests   Love Interest Falls in Love First   Male Yandere   Modern Day   Multiple Personalities   Possessive Characters   Straight Uke   System Administrator   Thriller   Transported to Another World   World Hopping   ",
	"rating": "(4.2 / 5.0, 68 votes)",
	"author": "天赐我宝   ",
	"year": "\nN/A",
	"ranking": "#6970   #4764   #3748   #5009   #2303   ",
	"reviewcount": "4 Reviews sorted by",
	"description": "Shen Fengyue was a senior back office staff member of Jinjiang harmony Co., Ltd. because of an accident in the company, he was transferred to the task department to deal with bugs.\n\nShen Fengyue rubbed his hands, “Eliminate bugs? Easy, let me do it! ”\n\nHowever,\n\nThe first world——\n\nAt the beginning, Shen Fengyue entered the campus world just like a hero stepping on colorful auspicious clouds, saving a little cutie who was being bullied on the campus. The little cutie was soft, adorable, and easy to tease. When Shen Fengyue was happily playing with him, the little cutie showed his hidden fangs.\n\nThe double personality cutie smiled softly, “Come on, baby.”\n\nShen Fengyue, “?!”\n\nThe second world——\n\nShen Fengyue re-entered the dream world. He refused to believe in evil, so he devoted himself to protecting the handsome and kind-hearted dumb youth. He tried his best to escape from the crazy, ugly woman, and when he thought he was assured of victory, the dumb boss’s backhand was a flag inserted into him, with the words “I am behind the scenes” shining brightly.\n\nShen Fengyue, “…”\n\nThe third world ——\n\nShen Fengyue learned from his previous experiences and didn’t save people indiscriminately after crossing into the next world. However, just when he was picking up a piece of garbage, he was saved by a hero.\n\nHe was extremely grateful and tried to express his gratitude.\n\nThe mermaid boss raised the corner of his lips, “It’s not enough to say thank you when you can repay my gratitude with your body.”\n\nShen Fengyue, “!!!”\n\n. . .\n\nMany years later, someone interviewed the Big Guy, “How did you get the beauty back?”\n\nBig guy, “I have a soul and a heart that loves him.”\n\nShen Fengyue: “….”>"
}