{
	"url": "https://www.novelupdates.com/series/i-will-seduce-the-northern-duke/",
	"title": "I Will Seduce The Northern Duke - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/07/I-will-seduce-the-northern-duke.jpg",
	"noveltype": "(KR)",
	"genre": "Fantasy   Mature   Mystery   Romance   Supernatural   ",
	"tags": "Acting   Adapted to Manhwa   Aristocracy   Arrogant Characters   Beautiful Female Lead   Calm Protagonist   Character Growth   Charismatic Protagonist   Charming Protagonist   Clever Protagonist   Clumsy Love Interests   Cold Love Interests   Comedic Undertone   Confident Protagonist   Contracts   Cunning Protagonist   Determined Protagonist   Devoted Love Interests   Doting Love Interests   European Ambience   Female Master   Female Protagonist   Gate to Another World   Genius Protagonist   Handsome Male Lead   Hard-Working Protagonist   Interdimensional Travel   Kingdoms   Late Romance   Love Interest Falls in Love First   Magic   Magic Beasts   Magical Technology   Modern Knowledge   Mysterious Family Background   Mystery Solving   Mythical Beasts   Nobles   Playful Protagonist   Popular Love Interests   Possessive Characters   Pretend Lovers   Protagonist Strong from the Start   Quirky Characters   Royalty   Schemes And Conspiracies   Secret Identity   Seduction   Shameless Protagonist   Sharp-tongued Characters   Shy Characters   Slow Romance   Stoic Characters   Tomboyish Female Lead   Tragic Past   Transported to Another World   Villainess Noble Girls   Wealthy Characters   ",
	"rating": "(4.2 / 5.0, 105 votes)",
	"author": "Joo Siha   주시하   ",
	"year": "\n2020",
	"ranking": "#1491   #1161   #2284   #1486   #1045   ",
	"reviewcount": "11 Reviews sorted by",
	"description": "'Pretend to be my lover and join the social circle.'\r\n\r\nSelena, the top star that had the entire world's attention, was suddenly warped to Northern Duke's land during an accident while filming. Kalcion, the Northern Duke that saved her from the infernal beasts, offers Selena a chance to go back home in return for collecting information in various social circles by pretending to be his lover. Selena quickly accepts Kalcion's offer, but…\r\n\r\n'Why in the world can't you do this!?'\r\n'Don't you think that the answer to that should be obvious to you, the actress, not to me, the duke?'\r\n\r\nThere was a critical problem. The Northern Duke's acting skills are horrible!\r\n\r\n'…Let's change the plan. I'll seduce you instead.'\r\n\r\nAnd thus the contractual relationship between the two started. Will Kalcion's acting skill improve first, or will he start to have true feelings for Selena instead?\r\n >"
}