{
	"url": "https://www.novelupdates.com/series/i-became-the-stepmother-of-my-ex-husband/",
	"title": "I Became The Stepmother of My Ex-husband - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/09/stepmother.jpg",
	"noveltype": "(CN)",
	"genre": "Drama   Fantasy   Romance   Slice of Life   ",
	"tags": "Ancient China   Aristocracy   Beautiful Female Lead   Charming Protagonist   Clever Protagonist   Cold Protagonist   Determined Protagonist   Devoted Love Interests   Doting Love Interests   Female Protagonist   Handsome Male Lead   Hard-Working Protagonist   Love Interest Falls in Love First   Mob Protagonist   Multiple Reincarnated Individuals   Older Love Interests   Politics   Possessive Characters   Pregnancy   Reincarnation   Revenge   Royalty   Schemes And Conspiracies   Second Chance   Sharp-tongued Characters   Slow Romance   Tragic Past   Transmigration   ",
	"rating": "(4.4 / 5.0, 553 votes)",
	"author": "September Flowing Fire   九月流火   ",
	"year": "\n2018",
	"ranking": "#408   #374   #508   #2739   #485   ",
	"reviewcount": "146 Reviews",
	"description": "Lin Wei Xi found out after she died that she was just a cannon fodder in a novel, used as contrast to the gentle and considerate and virtuous female lead.\r\n\r\nThe male lead was her ex-husband, the dignified heir of Yan Wang, his family were superior and brilliant, but the heroine was not her.\r\n\r\nThe female lead was her concubine-born younger sister, and her husband's white moonlight, his cinnabar mole, no wonder! After Lin Wei Xi died, her husband finally married her sister as he wished. \r\n\r\nShe watched coldly at the two like honey in the oil, in love and harmonious, everyone using the success of her younger sister to contrast the impropriety of the original wife.\r\n\r\nLin Wei Xi sneered, okay, since your love moves the world, then this sister will come back and be your stepmother! \r\n\r\nSo she married her ex-husband’s father, the father-in-law she never met in the previous life, the country’s God of war, who has not remarried after losing his wife, the one that hold military power, the brilliant Yan Wang.\r\n\r\nLater Yan Wang, who was in his prime years and used to act decisively, looked at his small, delicate, much younger wife, and had a headache.\r\n\r\nNo matter, she is still young, he have to spoil her, indulge her, teach her.>"
}