{
	"url": "https://www.novelupdates.com/series/life-as-a-tower-maid-locked-up-with-the-prince/",
	"title": "Life as a Tower Maid: Locked up with the Prince - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/07/Life-as-a-Tower-Maid-Locked-up-with-the-Prince_1626547504.jpg",
	"noveltype": "(KR)",
	"genre": "Comedy   Fantasy   Romance   ",
	"tags": "Aristocracy   Beautiful Female Lead   Cohabitation   Confinement   Contracts   Cooking   Devoted Love Interests   Different Social Status   Dragons   European Ambience   Female Protagonist   Handsome Male Lead   Love Interest Falls in Love First   Magic   Maids   Mob Protagonist   Modern Knowledge   Multiple POV   Nobles   Possessive Characters   Reincarnated in Another World   Reincarnation   Royalty   Transmigration   Transported to Another World   ",
	"rating": "(4.3 / 5.0, 79 votes)",
	"author": "Yeonhan   연한   ",
	"year": "\n2021",
	"ranking": "#1021   #1108   #2739   #1439   #3033   ",
	"reviewcount": "9 Reviews sorted by",
	"description": "I transmigrated into a novel as the maid of a prince who was trapped inside a tower.\n\nIt was depressing enough to be locked up in that tower, but the situation that I found myself in as soon as I transmigrated was straight up whack.\n\nThe original owner of this body, Rosé, threatened the prince and forced him to kiss her!\n\nTo make matters worse, Rosé was completely obsessed with the prince, and while trying to monopolize him, she dies a futile death! \n\nWe’re right on track to [death via decapitation] as soon as the prince escapes the tower.\n\nSo instead, I offered to make a contract with the prince, aptly titled as ‘The Contract for the Life and Death of Rosé Artius’.\n\nNo skinship at all! As long as he guarantees that I’ll live until a ripe old age, I will devote my diligence and loyalty to the prince!\n\nBut somehow… the prince’s gaze was a bit dangerous. And inside the tower, we were totally alone.\n\n“Rosé, let’s kiss.”\n\n…How did it end up like this?!\n\n* * *\n\nThe breath that lingered on my lips disappeared as the stranger moved away.\n\nI stared at the man who kissed me just now.\n\nUnder those dark eyebrows were red eyes that were exceedingly cold.\n\nI was instantly bewitched. I couldn’t look away, as if there was an irresistible force coveting my gaze. Because he’s so handsome.\n\n“Rosé, how long do we have to do this?”\n\nI shuddered as the sweet voice whispered next to my ear. Only then did I come to my senses.\n\nI laughed awkwardly to fill the silence. Ahaha, I really don’t know…\n\n“I-I think we can stop now.”\n\nAt my words, Albert grinned. It was the forced, soulless smile of a salesman. Nonetheless, he was still breathtakingly beautiful.\n\n“Then, can I see it now?”\n\n“…Yes.”\n\nHe took the wand that I had been holding.\n\nIn the novel, the maid Rosé always asked for a kiss from Albert in exchange for letting him see the wand.\n\nIn short, at this very moment, I was digging my own grave.\n\n…Damn it.>"
}