{
	"url": "https://www.novelupdates.com/series/pampered-consort-of-the-fragrant-orchard/",
	"title": "Pampered Consort of the Fragrant Orchard - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/01/32226.jpg",
	"noveltype": "(CN)",
	"genre": "Drama   Martial Arts   Romance   Slice of Life   ",
	"tags": "Age Progression   Ancient China   Arranged Marriage   Assassins   Beautiful Female Lead   Black Belly   Broken Engagement   Business Management   Calm Protagonist   Carefree Protagonist   Caring Protagonist   Childhood Love   Cold Love Interests   Cooking   Cute Protagonist   Devoted Love Interests   Different Social Status   Doctors   Domestic Affairs   Doting Love Interests   Doting Older Siblings   Farming   Female Protagonist   Genius Protagonist   Handsome Male Lead   Love Interest Falls in Love First   Marriage   Medical Knowledge   Modern Knowledge   Multiple POV   Music   Older Love Interests   Overpowered Protagonist   Overprotective Siblings   Persistent Love Interests   Pets   Poisons   Poor to Rich   Previous Life Talent   Protagonist Strong from the Start   Royalty   Schemes And Conspiracies   Strong Love Interests   Strong to Stronger   Time Skip   Transmigration   Underestimated Protagonist   Unique Cultivation Technique   Unique Weapon User   ",
	"rating": "(4.2 / 5.0, 129 votes)",
	"author": "菩提苦心   ",
	"year": "\n2014",
	"ranking": "#1874   #1747   #791   #3697   #1454   ",
	"reviewcount": "21 Reviews sorted by",
	"description": "Du Xiao Li, the legendary person all look up to, yet couldn’t ward off the ridiculousness of fate!\n\nOpening her eyes once again, the steady and calm her was still shocked senseless by her own withered little hands, and the leaking and windy rat infested surroundings before her eyes.\n\nBoth parents dead, three meals uncertain, and her only property was this shabby house and a cute little big brother.\n\nWhat the hell is all this!\n\nBuying a mountain top, planting fruit trees, opening winery, fermenting fruit wine, and developing a supply chain. From then on, profits poured in from all sides, bringing along big brother to lay down a family fortune and become rich!\n\nMaking close friends, kidnapping a prince, fighting villains, a peasant daughter can also live calling the wind and rain, laughing in face of the world!\n\nOh? This little guy looks pretty good, come plant a fruit tree for me then! How about also set a kiddy engagement?\n\nWith the roll of his eyes, the small child, who was currently being enslaved to plant trees gave her a cool turn of his back.\n\nOne separation, several years later, seeing this tall, rich, and handsome emotionless prince tell her with an ice cold face that she and him were already engaged, and moreover have long sealed the deal with a kiss, letting her take responsibility. He really was that little handsome boy from before?!\n\nDu Xiao Li speechlessly look to the sky: I don’t want to be a princess consort! Can I get a refund?!!\n\nThe cold face prince, with a face full of grievance: You said before that once sold, can’t be returned. A few years ago, I’ve already obediently gave myself to you. In these years I’ve always carefully obeyed your teachings, keeping myself pure for you. How can you heartlessly abandon me now? \n\nDu Xiao Li’s jaw was about to drop to the ground: Alright then, seeing that you’re this obedient, you can come home with me!\n\nA certain young master charmingly smiled: This husband shall comply!>"
}