{
	"url": "https://www.novelupdates.com/series/i-can-download/",
	"title": "I Can Download - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/05/candown1.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Comedy   Fantasy   Martial Arts   Sci-fi   Supernatural   ",
	"tags": "Ability Steal   Aliens   Alternate World   Cheats   Fanfiction   Game Elements   Godly Powers   Heroes   Level System   Male Protagonist   Manipulative Characters   Modern Day   Overpowered Protagonist   Ruthless Protagonist   Shield User   Strong to Stronger   Weak to Strong   ",
	"rating": "(2.5 / 5.0, 61 votes)",
	"author": "书瀚丨魏璨   ",
	"year": "\nN/A",
	"ranking": "#2000   #2000   #3872   #8664   #6307   ",
	"reviewcount": "7 Reviews sorted by",
	"description": "After waking up one day, Bruce Lite found himself possessing the body of an American Agent that enjoyed all kinds of benefits, he made tens of thousands of dollars a month, he had power, and everything else he could dream of.\n\nBut when he snapped out of his new found happiness, he realised that he was currently in the Marvel Cinematic Universe. And that's when the desperation set in.\n\nWhile his first reaction to it was that it was pretty 'cool', after realising that at some point in the near future, a purple freak would snap his fingers and he had a 50 - 50 shot at surviving, Bruce felt his whole body go cold.\n\nIn the stories Bruce was familiar with, when this type of situation happened, the person in question would get some kind of ability, or maybe position in the world that could enable him to have a fighting chance.\n\nBut no matter how hard he tried, there was simply nothing there for him to discover in the first place. He was a simple level 3 agent of S.H.I.E.L.D. and that was it. No powers, nothing.\n\nUntil after a while had passed, at a time where Bruce found himself slowly accepting his fate, he suddenly obtained the ability he was looking so desperately for.\n\nHe could now download other people’s abilities. And while nothing in the world was free, and he couldn’t just become a God right off the bat, this gave him a real shot at surviving.\n\nBut after being desperate for that long, would Bruce really be satisfied with just surviving?>"
}