{
	"url": "https://www.novelupdates.com/series/im-a-villainess-but-i-picked-up-the-male-lead/",
	"title": "I’m A Villainess, But I Picked Up the Male Lead - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/01/Im-A-Villainess-But-I-Picked-Up-the-Male-Lead.jpeg",
	"noveltype": "(KR)",
	"genre": "Fantasy   Josei   Romance   Shoujo   ",
	"tags": "Adapted to Manhwa   Aristocracy   Beautiful Female Lead   Empires   European Ambience   Female Protagonist   Female to Male   Handsome Male Lead   Hidden Abilities   Kingdoms   Protagonist Strong from the Start   Reincarnated in Another World   Reincarnation   Royalty   Tomboyish Female Lead   Villainess Noble Girls   Younger Love Interests   ",
	"rating": "(3.8 / 5.0, 32 votes)",
	"author": "Kim Jia   김지아   ",
	"year": "\n2021",
	"ranking": "#6970   #2000   #7981   #8529   #4632   ",
	"reviewcount": "2 Reviews sorted by",
	"description": "I possessed the most powerful villainess in a novel, Countess Edina.\r\n\r\nTo be exact, the villainess who attempted to assassinate the male lead, took his heart, and sold it to a neighboring country.\r\n\r\nAnd so, I tried everything to avoid the male lead until I got his heart back. But then, I happened to find him one bloodied night.\r\n\r\nI tried to look away and just leave him there, but his condition was simply too terrible.\r\n\r\n‘Just this time, and only this time! I’ll help you and pretend I don’t know anything!’\r\n\r\nHowever, since this is the nth time I run into him, I think it would be better to just leave the male lead there next time.\r\n\r\nI’d rather just be nice to him for once, pay my debt, and get over everything!\r\n\r\n“No, I don’t need your kindness.”\r\n\r\nBut… I think the male lead despises me too much…\r\n\r\nCan I survive all this?\r\n\r\n******\r\n\r\n“I still remember those days when you would poison me and send assassins after me.”\r\n\r\n“Oh…haha…”\r\n\r\n“Yet, once again, I still love the Countess.”\r\n\r\n“Wait…what?”\r\n\r\nThe male lead, who saw me as an enemy just a year ago, is now confessing to me, the villainess.\r\n\r\n“Doesn’t this make me seem like I’m crazy?”\r\n\r\nI was frozen and couldn’t say anything, but it was I who felt crazy.\r\n\r\n“But that’s okay. Because I am a crazy bastard.”\r\n\r\nHe whispered softly to me in a deep voice.\r\n\r\nIt wasn’t that I disliked how he’d changed…\r\n\r\nHa. This is all too much. He’s exactly my taste-\r\n\r\nWhat should I do?>"
}