{
	"url": "https://www.novelupdates.com/series/married-thrice-to-salted-fish/",
	"title": "Married Thrice to Salted Fish - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/10/Married-Thrice-to-Salted-Fish.jpg",
	"noveltype": "(CN)",
	"genre": "Drama   Fantasy   Historical   Romance   Yaoi   ",
	"tags": "Ancient China   Androgynous Characters   Arranged Marriage   Bickering Couple   Calm Protagonist   Character Growth   Charming Protagonist   Clever Protagonist   Cold Protagonist   Court Official   Cruel Characters   Death of Loved Ones   Doctors   Dreams   First Love   Generals   Handsome Male Lead   Kind Love Interests   Love Interest Falls in Love First   Marriage   Marriage of Convenience   Medical Knowledge   Multiple Identities   Murders   Poisons   Power Couple   Power Struggle   Royalty   Ruthless Protagonist   Schemes And Conspiracies   Sickly Characters   Slow Romance   Smart Couple   Souls   Terminal Illness   Transmigration   Transported to Another World   Unconditional Love   Younger Love Interests   ",
	"rating": "(4.6 / 5.0, 167 votes)",
	"author": "比卡比   ",
	"year": "\n2021",
	"ranking": "#2384   #1495   #2104   #2811   #1444   ",
	"reviewcount": "33 Reviews sorted by",
	"description": "At eighteen years old, Lin Qingyu was married as part of a Chong Xi into the Nan’an Hou Mansion, becoming the ill Lu Wancheng’s male wife.\r\n\r\nOn the eve of their wedding, Young Master Hou lay lazily on the bed and said, “Beauty, to be honest, I really don’t want to engage in domestic struggles. I just want to drift along, eat and wait to die. I want to be a salted fish.”\r\n\r\n \r\n\r\nA year later, Young Master Hou became gravely ill. He took Lin Qingyu’s hand and sighed, “Wife, I’m going to die, but I think I can continue to transmigrate. In order for you to properly recognize me in the future, let us set a secret code.”\r\n\r\nAfter the death of Young Master Hou, Lin Qingyu was prepared to stay a widow all his life. Unexpectedly, after only half a year, the great general who had rendered outstanding military service, actually came to propose marriage.\r\n\r\nLin Qingyu would rather die. But the general said but one statement, “If odd, change; if even, remain the same?”\r\n\r\nLin Qingyu: “…I will marry you.”\r\n\r\n \r\n\r\nAfter two years, the general died in battle. Before Lin Qingyu even had time to grieve, he was recruited into the palace by the Emperor.\r\n\r\nThe emperor complained aggrievedly, “Baobei, this time I have became the Emperor. My salted fish dreams have been completely shattered…”\r\n\r\nLin Qingyu knew that although his husband was a bag of lazybones, no one was his equal when it came to conspiracy and schemes.\r\n\r\nHe rubbed the Emperor’s head. “Don’t think about it. Get started on those reports. Behave yourself.”\r\n\r\n>"
}