{
	"url": "https://www.novelupdates.com/series/magic-gems-gourmet/",
	"title": "Magic Gems Gourmet (WN) - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/07/magiggemsgourmet_v2b.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Fantasy   Harem   Romance   ",
	"tags": "Ability Steal   Accelerated Growth   Adapted to Manga   Beastkin   Beautiful Female Lead   Demi-Humans   Depictions of Cruelty   Doting Parents   Elemental Magic   Elves   Game Elements   Handsome Male Lead   Hard-Working Protagonist   Harsh Training   Hiding True Identity   Incest   Knights   Level System   Magic   Magic Beasts   Magic Formations   Magical Technology   Male Protagonist   Monsters   Nobles   Overpowered Protagonist   Parent Complex   Polygamy   R-15   Reincarnated in Another World   Royalty   Schemes And Conspiracies   Secret Identity   Sibling Rivalry   Skill Assimilation   Slow Romance   Special Abilities   Sudden Strength Gain   Sword And Magic   Sword Wielder   Underestimated Protagonist   Weak to Strong   ",
	"rating": "(4.1 / 5.0, 151 votes)",
	"author": "ore2gou   Yuuki Ryou   俺２号   結城涼   ",
	"year": "\n2017",
	"ranking": "#2000   #6212   #897   #4250   #757   ",
	"reviewcount": "14 Reviews sorted by",
	"description": "Thanks to the Goddess, he was reincarnated into nobility!　That should have been great―― but the skill he got, 【Toxin Decomposition EX】 was simply too plain, and he was made fun of everyday at home……\r\n\r\nHowever, at one time, he noticed he could eat the magic stones of monsters with that skill and absorbs their abilities, furthermore, he was informed he was the prince of the neighboring country!\r\n\r\nWhat awaited him at the royal castle was an environment where he could train and experiment with the abundant amount of magic stones, bringing out his strong potential――and finally, even acquiring the ability of the legendary monster, the Dullahan!\r\n\r\nSurrounded by an assertive fiancée and a clumsy knight girl, the new life for the boy who will become a “King” begins!>"
}