{
	"url": "https://www.novelupdates.com/series/santairiku-eiyuuki/",
	"title": "Santairiku Eiyuuki - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/09/Santairiku-Eiyuuki.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Comedy   Drama   Ecchi   Fantasy   Harem   Mature   Romance   ",
	"tags": "Adapted to Manga   Age Progression   Beasts   Cheats   Childhood Friends   Contracts   Domestic Affairs   Early Romance   Economics   Elves   Empires   Engagement   Farming   First-time Interc**rse   Genius Protagonist   Hard-Working Protagonist   Humanoid Protagonist   Imperial Harem   Kingdom Building   Leadership   Male Protagonist   Management   Modern Knowledge   Netori   Politics   Polygamy   Power Struggle   R-15   Reincarnation   Religions   Reverse R*pe   Royalty   Schemes And Conspiracies   S*aves   Strategic Battles   Strategist   Strong Love Interests   Sword And Magic   Threesome   Transplanted Memories   Wars   ",
	"rating": "(3.7 / 5.0, 96 votes)",
	"author": "Sakuragi Sakura   桜木桜   ",
	"year": "\n2018",
	"ranking": "#532   #1794   #1639   #747   #1725   ",
	"reviewcount": "8 Reviews sorted by",
	"description": "Possessing memories of being born, raised and died in a country called Japan… the young boy Hercule was born in the imperial household of a declining empire.\n\nThis empire that once was a super power that reigned over the world… is now a country nearing it’s end. The public finances are in bankruptcy, the military strength declined to the point that barbarians are able to wreck havoc in their territories and the neighboring countries squeezed the Empire for tribute payments every year.\n\nAnd the young Hercule is forced to take over this empire!\n\n“Eeh!? I can’t run away!?”\n\n“You can’t.”\n\nThus, the 12 years old Hercule ascends to the throne.\n\nUsing the knowledge from his previous life, Hercule struggles to rebuild the empire… reforming the tax system, revolutionizing the industry, reorganizing the public finances, rebuilding the administration and reforming the military system.\n\nThis will later be known as the story of the young emperor who restored the Lemurian empire, which would later carve it’s name in history as the great monarch of the three continents, the “Divine Light Emperor” Hercule the First.>"
}