{
	"url": "https://www.novelupdates.com/series/realms-in-the-firmament/",
	"title": "Realms In The Firmament - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2017/03/Realms-In-The-Firmament.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Harem   Xuanhuan   ",
	"tags": "Abandoned Children   Alchemy   Amnesia   Appearance Different from Actual Age   Aristocracy   Arranged Marriage   Arrogant Characters   Artifacts   Assassins   Beast Companions   Beautiful Female Lead   Betrayal   Character Growth   Cultivation   Cunning Protagonist   Death   Demons   Dense Protagonist   Doctors   Eye Powers   Familial Love   Famous Parents   Fast Cultivation   Genius Protagonist   Gods   Handsome Male Lead   Hiding True Abilities   Hiding True Identity   Hot-blooded Protagonist   Immortals   Long Separations   Lucky Protagonist   Magic Beasts   Magical Space   Male Protagonist   Misunderstandings   Multiple Realms   Mysterious Family Background   Nobles   Older Love Interests   Orphans   Personality Changes   Politics   Polygamy   Previous Life Talent   Revenge   Romantic Subplot   Royalty   Ruthless Protagonist   Schemes And Conspiracies   S*xual Cultivation Technique   Shameless Protagonist   Sharp-tongued Characters   Strong Love Interests   Sword Wielder   Transmigration   Underestimated Protagonist   Unique Cultivation Technique   Unreliable Narrator   Wars   Weak to Strong   ",
	"rating": "(3.8 / 5.0, 654 votes)",
	"author": "Fengling Tianxia   风凌天下   ",
	"year": "\n2014",
	"ranking": "#6970   #2000   #115   #11907   #461   ",
	"reviewcount": "63 Reviews sorted by",
	"description": "Ye Xiao was a superior cultivator in his previous life. The three factions of the realm kill millions of people every time they attempt to seize cultivation resources. Wealthy towns turn to wastelands in just a single night. They cover up their crime with an assertion that the towns were suffering from pestilence and disasters.\n\nThey forcibly hold all the resources for cultivation, monopolize all valuable practice materials, and keep outsiders from cultivating so that only their three factions could cultivate in the realm. Ye Xiao declared war against the three factions in retaliation for their actions. He fought alone and ended up dying in vain. However, he is reborn into the mortal body of a 16-year-old boy. He will use the powers he cultivated in his last life and slaughter his way back into the Realm. The story begins!>"
}