{
	"url": "https://www.novelupdates.com/series/i-accidentally-seduced-the-male-leads-younger-brother/",
	"title": "I Accidentally Seduced the Male Lead’s Younger Brother - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/02/I-Accidentally-Seduced-the-Male-Leads-Younger-Brother.jpg",
	"noveltype": "(KR)",
	"genre": "Fantasy   Romance   ",
	"tags": "Beautiful Female Lead   Child Abuse   Child Protagonist   Childcare   Childhood Friends   Childhood Love   European Ambience   Female Protagonist   Handsome Male Lead   Love Interest Falls in Love First   Male Yandere   Nobles   Obsessive Love   Spirits   Transmigration   Younger Love Interests   ",
	"rating": "(3.9 / 5.0, 54 votes)",
	"author": "Honey jam-gak   꿀잼각   ",
	"year": "\n2021",
	"ranking": "#867   #869   #5943   #965   #5074   ",
	"reviewcount": "2 Reviews sorted by",
	"description": "She possessed the mistress of the male lead in an R19 novel.\r\n\r\nIn the original novel, the male lead was a trash who abandoned her after getting her pregnant, saying that he belatedly realized that he loved the heroine.\r\n\r\nFortunately, it was still before the original work started.\r\n\r\nI decided to scrap this shit by myself.\r\n\r\n***\r\n\r\n“No, I don’t want to.”\r\n\r\nI flatly rejected Killian’s offer to have an affair with him. When he asked me why, I smiled brightly and answered.\r\n\r\n“The Young Master is not my taste. If I must say, your younger brother is much preferable.”\r\n\r\n“What? You prefer my younger brother?”\r\n\r\nYeah. Not you, but your brother.\r\n\r\n***\r\n\r\nUnlike the original, I firmly set up an iron wall, took care of Lexion, the younger brother who was abused by his older sibling, and protected the original female lead who has low-esteem against that shitty male lead.\r\n\r\nAnd now that I’ve already done what I have to do, I’m off to go.\r\n\r\nBut a few years later,\r\n\r\nLexion, who pushed his older brother and sat in the Duke’s seat, came back to me as a beast with a decadent beauty.\r\n\r\nOn top of that, he’s even holding the engagement document that I signed as a joke during childhood.\r\n\r\n“I’ve never forgotten you for a moment. Please marry me, noona.”\r\n\r\nNo, wasn’t that just for playing house?\r\n\r\nEverytime I refuse his marriage proposal, he will gently hug me around my waist, and ask in such a cold voice.\r\n\r\n“Did your taste change while I was away?”\r\n\r\nLexion’s eyes were full of life as he asked.\r\n\r\nIt’s as if when he found out who my type was, he’ll kill it right away.>"
}