{
	"url": "https://www.novelupdates.com/series/i-tamed-my-ex-husbands-mad-dog/",
	"title": "I Tamed My Ex-Husband’s Mad Dog - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/01/I-Tamed-My-ExHusbands-Mad-Dog.jpg",
	"noveltype": "(KR)",
	"genre": "Fantasy   Romance   Shoujo   ",
	"tags": "Aristocracy   European Ambience   Fallen Nobility   Female Protagonist   Handsome Male Lead   Nobles   Obsessive Love   Royalty   Second Chance   ",
	"rating": "(3.9 / 5.0, 51 votes)",
	"author": "Jaekyum   재겸   ",
	"year": "\n2021",
	"ranking": "#2000   #6215   #5670   #6185   #4096   ",
	"reviewcount": "8 Reviews sorted by",
	"description": "‘Father, please give me a chance to cut him off.’\n\nRight before she died, Reinhardt repeated the same words as she had wished.\n\nWhen she came to her senses, she was back at her father’s funeral 15 years ago.\n\nIt was the time when she was divorced by Prince Michelle, the reason why her father lost his life.\n\nAs revenge, Reinhardt stabbed the Crown Prince’s leg.\n\nAnd as a consequence, she was exiled.\n\nWhile she was on her rough journey, she encountered someone unexpected…\n\n“Are you really Bill Corona?”\n\nShe picked up the poor, dirty child. In her previous life, he was the crown prince’s dog. He was a war hero for her ex-husband.\n\nA great opportunity rolled into Reinhardt’s heart who was thirsty for revenge. She gives the child a new name and decides to use him for her revenge.\n\nShe will never waste this life.\n\nWhile building a fortress to revive the estate, the boy went to war…\n\nThree years passed and he, who was named Wilhelm, had become a man. He was no longer the child she raised.\n\n*\n\n“As you told me… I came back, and I will always come back alive, so give me the reward for my return.”\n\n“W-What kind of reward?”\n\nThe boy’s, or rather, the man’s smile darkened and gave her an answer she never expected.\n\n“You.”\n\n“Me?”\n\n“Yes, Rein.”\n\nHis gentle voice resounded in Reinhardt’s heated ear.\n\n“I love you, Rein.”\n\nReinhardt was thrown into a complicated concept called love.\n\nAnd with that, Reinhardt felt like she wanted to strangle herself.>"
}