{
	"url": "https://www.novelupdates.com/series/the-rich-and-honorable-changan/",
	"title": "The Rich And Honorable ChangAn - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2018/08/006fJMv4gy1fem6n4hy0ij30830auaai.jpg",
	"noveltype": "(CN)",
	"genre": "Romance   Shounen Ai   ",
	"tags": "Ancient China   Arranged Marriage   Cautious Protagonist   Devoted Love Interests   Forced Marriage   Love Interest Falls in Love First   Mpreg   Revenge   Royalty   Schemes And Conspiracies   Slow Romance   Strong Love Interests   Weak Protagonist   ",
	"rating": "(4.3 / 5.0, 309 votes)",
	"author": "Five Cloud   五朵云   ",
	"year": "\n2017",
	"ranking": "#6970   #6137   #1573   #1196   #1061   ",
	"reviewcount": "63 Reviews sorted by",
	"description": "His Mother was tormented to death from prolonged drugs poisoning , his father thought to send him away to a small village (Zhuangzi) in Jing Jiao so he could serve his filial duty to his mother (mourning), everyday he was bullied by servants. Xu Chang An, in this life, he could only watch the little man (villain) who had harmed his mother and was being depressed living in the small village. However, he did not expect to suddenly be given a wedding decree from the emperor to make him become the wife (Wangfei) of the first prince, Xiao Qing Yan.\n\nHe knew in his heart that this matter was his salvation but to Xiao Qingyan, who has a great prospect, this was a disaster. After the great wedding, he took advantage of his new status to avenge his mother and himself. Xu Chang An was aware of the emperor’s intention that time when he was sanctioned a marriage, he all along tried his utmost to support Xiao Qingyan. Until by a lucky coincidence that the imperial government rewarded him, who’d performed great merit. The emperor promised to fulfill his wish, Xu Chang An without hesitation knelt down to request imperial decree to accomplish Xiao Qing Yan’s greatest wish.\n\n“Your servant have no other request, please Your Majesty to bestow decree to allow your servant leave His Highness peacefully. Thank Your Majesty’s benevolence. Long live the emperor, long live for thousand of years.”>"
}