{
	"url": "https://www.novelupdates.com/series/demons-and-goddesses/",
	"title": "Demons and Goddesses - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2018/08/demons-and-goddesses.jpg",
	"noveltype": "(ID)",
	"genre": "Action   Adventure   Drama   Historical   Mystery   Wuxia   ",
	"tags": "Female Protagonist   ",
	"rating": "(2.6 / 5.0, 29 votes)",
	"author": "Asmaraman S. Kho Ping Hoo   ",
	"year": "\n1961",
	"ranking": "#2000   #2000   #11152   #10658   #11909   ",
	"reviewcount": "No Reviews",
	"description": "These series presented a beautiful dancer girl in a birthday-party of an old-man. But her presence was followed by another young murderous girl who was also very beautiful who wanted to kill the host party. But the young murderous girl didn’t know that the dancer girl had preceded her to kill her great enemy and then chased after the dancer girl who was escaping after succeeding to murder the host party.\n\nIn fact both of them had a bond that connected to a single one which was one as disciple and the other was the daughter of that person i.e a man whose his name was Pat-jiu Kiam-ong (Eight Handed King of Swords) Ong Han Cu who was a master and a father of each one of them and who had been murdered brutally by five people fraudulently.\n\nAfter knowing each other through a fierce battle, the dancer girl challenged the young murderous girl to each other race in searching and killing the remaining of their great enemies.\n\nOn their way to fulfill their oath, the two met a young man who was valiant, in different times, different places, and different situations. This young man was able to tear down the hearts of these two girls. The murderous girl really fell in love but was ashamed to express her heart firstly to the young man because she was a woman, while the dancer girl actually also fell in love to the young man but because of an obstacle which had she already been matched with a young noble-man, then she tried her best to resist this feeling.>"
}