{
	"url": "https://www.novelupdates.com/series/a-non-combat-magic-artifact-researcher%e3%80%80%e3%83%bc-actually-was-an-extroadinary-s-rank-mage%ef%bd%9e-though-he-worked-overtime-without-compensation-and-contributed-greatly-he-was-labeled-as-inc/",
	"title": "A Non-combat Magic Artifact Researcher ー Actually Was an Extroadinary S-rank Mage～ Though He Worked Overtime Without Compensation and Contributed Greatly, He Was Labeled as Incompetent and Was Fired - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/10/A-Noncombat-Magic-Artifact-Researcher-Actually-Was-an-Extroadinary-Srank-Mage-Though-He-Worked-Overtime-Without-Compensation-and-Contributed-Greatly-He-Was-Labeled-as-Incompetent-and-Was-Fired.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Fantasy   Slice of Life   ",
	"tags": "Aristocracy   Artifact Crafting   Beast Companions   Calm Protagonist   Dragons   Elves   Fantasy World   Kingdoms   Low-key Protagonist   Magic   Magical Technology   Male Protagonist   Nobles   Schemes And Conspiracies   ",
	"rating": "(2.9 / 5.0, 61 votes)",
	"author": "Ezo Gingitsune   えぞぎんぎつね   ",
	"year": "\n2021",
	"ranking": "#2261   #2900   #2425   #2287   #5336   ",
	"reviewcount": "2 Reviews sorted by",
	"description": "“Strout, from tomorrow on, you have no job to do here.”\n\n“Do you not get it?  He’s saying you’re fired.”\n\nAt the Mages Academy, the extroardinary genius Magecraft Artifact Artisan Werner spent his days developing new Magecraft Tools.\n\nThe Magecraft Tools he designed were all revolutionary.\n\nHe increased the notoriety and fame of his Academy and had plenty of funding.\n\nーーbut.\n\nOne day, suddenly, envying his talents and blinded by the potential profits of the upcoming Magecraft Tools, the President of the Academy and his supporters expelled Werner from the Academy.\n\nWithout any other options, Werner ventured into the wilderness and decided to continue his research in peace there.\n\nHe had enough money saved up, and he is still receiving royalties from his previous inventions.\n\nHe had no doubt that he could live at his own pace this time without worry or concern.\n\nOn the other hand, without him, the Research Division of his Academy was unable to successfully develop any further tools from Werner’s previous research and was in a state of panic!\n\nThe President of the Academy and his supporters struggled to meet deadlines to even publish a poor quality Magecraft Artifact and were at a complete loss.\n\nThe exasperated Kingdom’s politicians began plotting to pull Werner into their organizations, and an underground religious organization began making their moves to go after Werner’s inventions……?!\n\nWith a Dragon and a new female disciple, aiming for peace and safety, a comfortable and behind the scenes daily lifestyle, Werner’s isolated research life begins!!>"
}