{
	"url": "https://www.novelupdates.com/series/the-villain-becomes-the-white-moonlight/",
	"title": "The Villain Becomes The White Moonlight - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/02/whaitomoonlighto1.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Drama   Fantasy   Psychological   Romance   Shounen Ai   Supernatural   ",
	"tags": "Acting   Ancient Times   Bloodlines   Calm Protagonist   Celebrities   Cold Protagonist   Confident Protagonist   Confinement   Cross-dressing   Death   Delusions   Demons   Dense Protagonist   Devoted Love Interests   Doting Love Interests   Dreams   First Love   Ghosts   Half-human Protagonist   Handsome Male Lead   Hard-Working Protagonist   Love Interest Falls in Love First   Manipulative Characters   Misunderstandings   Modern Day   Multiple Realms   Mythology   Obsessive Love   Persistent Love Interests   Popular Love Interests   Possessive Characters   Showbiz   Special Abilities   Wealthy Characters   World Hopping   ",
	"rating": "(4.3 / 5.0, 116 votes)",
	"author": "猫八先生   ",
	"year": "\n2018",
	"ranking": "#3923   #3617   #3126   #6620   #2307   ",
	"reviewcount": "17 Reviews sorted by",
	"description": "Wu! Eat your dreams!\n\nShao Lingheng is the most perfect dish for Du Yan.\n\nHere is the perfect recipe for cooking nightmares, also known as “How to be a qualified villain boss.”\n\n[Youth Tragedy Movie Nightmare – the male lead cheated while drunk, which led to the pregnant female lead’s abortion and breakup. ]\nDu Yan: I want to give the male lead physical health education, refuse pre-marital x behavior, educate the male lead to exploit others and finally wait to be killed.\n\nMale lead: I will follow your thoughts and take away your power, just to keep you with me.\n\n[Historical Power Conspiracy Nightmare – The Male Lead takes advantage of the heroine and destroys the country and her family.]\nDu Yan: I want to become the heroine, then later lift up my skirt and scare the male lead to death, finally wait to be killed by the tricked male lead.\n\nMale lead: You hate this dynasty, then as you wish, I will ruin it for you.\n\n[Netherworld Ghost Movie Nightmare – The Male Lead ended up killing all his teammates]\nDu Yan: I want to kill the male lead and make him a ghost, and finally wait to be killed by the bullied male lead.\n\nMale lead: If I can always haunt you after becoming a ghost, then I am willing.\n\n***\n\nIt’s so much trouble to fill one’s stomach!\n\nAs the only bloodline left by the Beast Boqi in a low-level energy plane, Du Yan, after awakening, fell into the tragic situation of not having enough to eat every day. Until he met Shao Lingheng, the movie emperor who was too deep into his roles and was troubled by nightmares every night.\n\nBut you never know, the things happened were unexpected.\n\nShao Lingheng: That man is the cinnabar mole in my heart, white moonlight in the sky. He has paid a lot for me.\n\nDu Yan: Wait, are we not on the same channel?>"
}