{
	"url": "https://www.novelupdates.com/series/hypocritical-adonis/",
	"title": "Hypocritical Adonis - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/04/Hypocritical-Adonis.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Drama   School Life   Yaoi   ",
	"tags": "Calm Protagonist   Handsome Male Lead   Lazy Protagonist   Love Interest Falls in Love First   Manly Gay Couple   Modern Day   Seme Protagonist   System Administrator   ",
	"rating": "(4.2 / 5.0, 42 votes)",
	"author": "常念君   ",
	"year": "\n2020",
	"ranking": "#5262   #4835   #6270   #7470   #4917   ",
	"reviewcount": "9 Reviews sorted by",
	"description": "Qi Cheng, confident, unruly, elegant, and unrestrained, was conferred the title No.1 Pretender of XX High-School by his dorm-mate.\n\nOne day, his peaceful life suddenly had many inexplicable options.\n\nBy a dark corner, with a body full of injuries lay a handsome young man.\n\n【A Handsome Young Man From The Same School Was Detected 10 Meters Ahead. Do You Want To Help Him?】\n\n【A: Rescue and Flirt】\n\n【B: The Clothes Are Dirty, You Have To Help Wash Them \\\\(≧▽≦)/】\n\nQi Cheng raised his eyebrow and happily choose B. first before proceeding to choose A.\n\nIn the school’s Conference Hall, excellent and indifferent student representatives hurry to the assembly hall. A speech draft falls to the ground.\n\n【[Two Meters Ahead, The Top Student Lost His Important Papers. Do You Want To Offer Him Help?】\n\n【A: Help When He Is Crying And His Eyes Are Red】\n\n【B: Still Want To See The Top Student Wail In Public】\n\nQi Cheng bends down to pick up the speech draft from the ground and smirks.\n\nThe principal invited a popular boy group to boost the morale for the school’s 26th-anniversary celebration.\n\nThe boy group leader’s expression was very haughty, the curve of his mouth was flirtatious and somewhat aesthetic, the light hinting at his muscles. \n\n【The Handsome Superstar In Front IS About To Be Splashed With A Water Bottle By A Student In The Front Row. Do You Want To Help Him?】\n\n【A: Don’t Help, Dancing Like That Is Nice]】\n\n【B: How Is One Bottle Of Water Enough】\n\nQi ‘Hypocritical’ Cheng narrowed his eyes. 'Shameless options indeed.”\n>"
}