{
	"url": "https://www.novelupdates.com/series/forced-to-marry-the-enemy-prince/",
	"title": "Forced to Marry the Enemy Prince - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/06/ForcedMarryEnemyPrince.jpg",
	"noveltype": "(CN)",
	"genre": "Drama   Gender Bender   Historical   Romance   Yaoi   ",
	"tags": "Ancient China   Androgynous Characters   Clever Protagonist   Cross-dressing   Cute Protagonist   Doting Love Interests   Early Romance   Enemies Become Lovers   Forced Marriage   Genius Protagonist   Handsome Male Lead   Hiding True Identity   H*ndjob   Love at First Sight   Love Interest Falls in Love First   Misunderstandings   Mpreg   Possessive Characters   Pregnancy   Royalty   Sickly Characters   Strategist   Strong Love Interests   Wars   Weak Protagonist   ",
	"rating": "(4.2 / 5.0, 189 votes)",
	"author": "乔柚   ",
	"year": "\n2020",
	"ranking": "#1389   #2097   #1746   #638   #1135   ",
	"reviewcount": "48 Reviews sorted by",
	"description": "Xian Sheng was a lovable yet sickly person. In order to survive, he was disguised as a girl and raised as a princess at a young age.\n\nOne day, two countries were at war and the situation was dire. He ran up to the city wall to cheer for his Elder Brother, but the Crown Prince of the enemy country spotted him.\n\nHis sharp and piercing eyes penetrated across tens of thousands of soldiers and landed on Xian Sheng’s delicate face.\n\nWith a marriage contract in exchange for peace, the two countries were in an uproar.\n\nNorth Country’s Crown Prince eyed Xian Sheng covetously, promising to stop the war as soon as this beauty was in his arms.\n\nSouth Country’s Royal Family was alarmed and anxious. ‘You’re trying to seize a Prince here!!!’\n\nFor temporary peace, Xian Sheng married the Crown Prince for his country. He said that his body wasn’t feeling well as an excuse in order to stall for time and avoid being exposed.\n\nYet the Crown Prince, Zhan Lue, was ruthless and seemingly wanted to swallow Xian Sheng alive the moment he saw him.\n\nDay after day, the Crown Prince thought of Xian Sheng more and more because he couldn’t have a taste of him.>"
}