{
	"url": "https://www.novelupdates.com/series/a-warrior-exiled-by-the-hero-and-his-lover/",
	"title": "A Warrior Exiled by the Hero and His Lover - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/12/A-Warrior-Exiled-by-the-Hero-and-His-Lover.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Fantasy   Harem   Romance   Seinen   Tragedy   ",
	"tags": "Adapted to Manga   Adventurers   Alternate World   Betrayal   Cheats   Childhood Friends   Demon Lord   Dense Protagonist   Dragon Slayers   Dragons   Elves   Fantasy World   Former Hero   Friends Become Enemies   Game Elements   Heroes   Kingdoms   Level System   Love Interest Falls in Love First   Male Protagonist   Mind Control   Monsters   Netorare   Overpowered Protagonist   Polygamy   Revenge   R*pe   Secret Identity   S*aves   Strong to Stronger   Sudden Strength Gain   Sword And Magic   Sword Wielder   Weak to Strong   World Travel   ",
	"rating": "(2.8 / 5.0, 142 votes)",
	"author": "Tokugawa Lemon   徳川レモン   ",
	"year": "\n2020",
	"ranking": "#2002   #654   #676   #152   #1914   ",
	"reviewcount": "25 Reviews",
	"description": "After losing his girlfriend to a brave hero, Toru is expelled from his S-Rank party. With a feeling of sadness and pain in his heart, he defeats a demon he meets outside the city, and his ability [to save experience] is broken! Toru becomes level 300 in the blink of an eye! With this power that far surpasses that of heroes, there is nothing that can stop him. Kaede, a s*ave he met on his journey, forms a group called the “Mangyu Brigade”, and easily completes dungeons, acquires the legendary sacred weapons, and thanks to his skills, his friends level up easily! He rescued a countess who was attacked by bandits on the road, and befriended a legendary beast. Toru’s journey continues at a leisurely pace, as he repeatedly encounters various people along the way, while his former party of heroes are deprived of opportunities to play an active role and fall into decline. This is the beginning of the life of a 300 level warrior!>"
}