{
	"url": "https://www.novelupdates.com/series/a-complete-explanation-of-the-negative-textbooks-for-the-imperial-examination/",
	"title": "A Complete Explanation of the Negative Textbooks for the Imperial Examination - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/06/A-Complete-Explanation-of-the-Negative-Textbooks-for-the-Imperial-Examination.jpg",
	"noveltype": "(CN)",
	"genre": "Drama   Fantasy   Romance   Slice of Life   ",
	"tags": "Ancient China   Clever Protagonist   Court Official   Cunning Protagonist   Farming   Handsome Male Lead   Hard-Working Protagonist   Male Protagonist   Medical Knowledge   Multiple Transported Individuals   Slow Growth at Start   Slow Romance   Wars   ",
	"rating": "(4.1 / 5.0, 12 votes)",
	"author": "September Flowing Fire   九月流火   ",
	"year": "\n2018",
	"ranking": "#2000   #2225   #10145   #11528   #11370   ",
	"reviewcount": "4 Reviews sorted by",
	"description": "My father joined the army and became a marquis, but his wife is not my mother, what should I do? The stepmother seems to be transmigrating. She is gentle and virtuous, but in fact she wants to kill me, what should I do? The grandmother is snobby and wants me to give up the position of the eldest son. What should I do? When preparing for the imperial examination, the relatives make trouble and want me to fail the examination. What should I do?\n\nThe above answers are all in the “Complete Explanation of the Negative Textbooks for the Imperial Examination”. This book covers family disputes, imperial examination difficulties, officialdom troubles, king and ministers. Suitable for people interested in a powerful villain minister.\n\nWith a book in hand, taking scientific exam, and the teaching will not give a full refund! Later, when the noble families taught their children to study, they would always take Xiao Jingduo as an example: “Read well, don’t go astray. Don’t learn from him. You can’t disgrace the words of the sages.”\n\nThe world’s evaluation of Xiao Jing Duo is mixed. What he is most criticized for is that he has no literati style. And he is willing to be the sword of the regent princess and work for the princess. Until later, Xiao Jing Duo married the princess regent.\n\nCourtier: …………No wonder!>"
}