{
	"url": "https://www.novelupdates.com/series/the-easter-egg-game/",
	"title": "The Easter Egg Game - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/05/The-Easter-Egg-Game.png",
	"noveltype": "(CN)",
	"genre": "Action   Horror   Psychological   Supernatural   Yaoi   ",
	"tags": "Apocalypse   Awkward Protagonist   Cautious Protagonist   Character Growth   Cold Love Interests   Cowardly Protagonist   Cruel Characters   Dark   Death   Depictions of Cruelty   Dystopia   Gore   Late Romance   Modern Day   Mutated Creatures   Mutations   Pacifist Protagonist   Slow Romance   Survival Game   Teamwork   Timid Protagonist   Unlimited Flow   Zombies   ",
	"rating": "(4.1 / 5.0, 46 votes)",
	"author": "Bó Mù Bīng Lún   薄暮冰轮   ",
	"year": "\n2016",
	"ranking": "#4080   #3372   #6149   #8982   #4962   ",
	"reviewcount": "7 Reviews sorted by",
	"description": "Book 1\n\nOn the day he received the Easter Egg, Lin Jue’s entire life changed. That nightmarish night, everyone in the school became zombies apart from the thirteen who had received an easter egg. It wasn’t because of a deadly virus, but rather a cruel game. Unable to leave the school, they were able to find a bargaining chip for life in the plaza. The prowling hunters in the dark were not the most fearsome opponents, the hidden Judas in the survivors was the most deadly. As everyone died one by one, the survivors struggled, waiting for dawn.\n\nBook 2\n\nIt was a nightmare- in a sealed off university campus, the thirteen who received easter eggs were trapped and forced to fight for the sake of seeing the next sunrise. The Judas hidden among the players, the enemies that surrounded them on all fronts, the companions that were ready to turn against each other… \n\nWhen Lin Jue woke up on his dormitory bed, there were no wounds on his body; everything from the previous night had just seemed like a dream. But Lilith was still giving out her easter eggs, and Song Hanzhang and Lu Ren were already there. The second round was just about to start. It turned out that all of it, all of it was real.\n\nBook 3\n\n“It means that the world we are in now is fake.” That one sentence from Song Hanzhang woke Lin Jue up from the joy he felt from surviving the second round.\n\nFrom the moment they received the easter eggs, they had stopped existing in the world of men, and been made to struggle to survive in an endless game. The zombies of the first round, the insects of the second round; every round resulted in piles of casualties in this dangerous world. And in the third round… they were faced with an unprecedented, terrifying crisis.\n\nA team from 2002 and a team from 2022 began a battle of life and death with Lin Jue and the others from the 2012 team. Only one could survive, so who would be the real winner?>"
}