{
	"url": "https://www.novelupdates.com/series/the-undead-queen-has-arrived-in-the-apocalypse/",
	"title": "The Undead Queen Has Arrived in the Apocalypse - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/01/The-Undead-Queen-Has-Arrived-In-The-Apocalypse.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Harem   Josei   Mature   Romance   Sci-fi   Supernatural   Xuanhuan   ",
	"tags": "Apocalypse   Beautiful Female Lead   Calm Protagonist   Female Protagonist   Godly Powers   Handsome Male Lead   Polyandry   Protagonist Strong from the Start   Reverse Harem   Ruthless Protagonist   ",
	"rating": "(4.1 / 5.0, 16 votes)",
	"author": "血染丹枫   ",
	"year": "\n2015",
	"ranking": "#2000   #2000   #8293   #8664   #8217   ",
	"reviewcount": "4 Reviews sorted by",
	"description": "Waking up after a thousand year slumber only to find that the world had entered doomsday.\r\n\r\nZombies are rampant, morals become corrupted, and human nature reveals its depravity. Sitting in her dimensional world, she expresses her happiness.\r\n\r\nShe, history’s notorious favorite consort of King Zhou of Shang and portrayed as a malevolent fox spirit in tales, “Su Daji”, was actually Hua Yao, the chieftess of the Flower Deity tribe.\r\n\r\nThe State of Shang was destroyed and she was suppressed by Jiang Ziya with the Soul Eater Sword in a place of extreme Yin, only being discovered by archeologists thousands of years later……\r\n\r\nThousands of years later, Hua Yao woke up again, but it was a year and a half before the apocalypse. At that time, the reborn guy and reborn girl had not yet appeared, and Hua Yao was still working hard to stock up her dimensional world……\r\n\r\nOne year later, when the preparations of her dimensional world was almost done, the reborn girl appeared……\r\n\r\nScenario 1: “Ah, every reborn person was a dumb idiot in the previous life!”\r\n\r\nHua Yao sighed as she looked at this so-called reborn person who was pushed into the jaws of zombies by the relatives that she desperately protected in the previous life once again being pushed into the jaws of zombies by so-called friends.>"
}