{
	"url": "https://www.novelupdates.com/series/no-one-should-ever-know-that-im-seriously-in-love-with-my-brother-right/",
	"title": "No One Should Ever Know That I’m Seriously In Love With My Brother, Right? - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/10/No-One-Should-Ever-Know-That-Im-Seriously-In-Love-With-My-Brother-Right.jpeg",
	"noveltype": "(JP)",
	"genre": "Comedy   Harem   Romance   School Life   Slice of Life   ",
	"tags": "Beautiful Female Lead   Brother Complex   Incest   Male Protagonist   Modern Day   Secret Relationship   Siblings   Sister Complex   Younger Sisters   ",
	"rating": "(3.2 / 5.0, 39 votes)",
	"author": "Hozumi Kei   保住圭   ",
	"year": "\n2021",
	"ranking": "#2000   #2000   #8780   #9888   #8384   ",
	"reviewcount": "No Reviews",
	"description": "You can't tell anyone about this first love!\r\nA forbidden 'brother and sister' love story that will make you faint in agony.\r\nA meltingly sweet love comedy by Kei Hozumi, a master of lovey-dovey pure love!\r\n\r\n\r\n'Onii-chan, no one can know about our relationship, okay?'\r\nA high school boy, Yuma Chiharu, is in love with his younger sister, Chimari.\r\nThe relationship between the two siblings is a highly confidential affair.\r\nIf the school or their parents find out, the worst that can happen is that they'll be separated! They must not let that happen!\r\nBut then―\r\n'Hey, who was that girl you were kissing the other day?'\r\nTo his surprise, his senior at school, Kii, witnessed his first kiss with Chimari...\r\nWhen they're caught making out, the secret of the siblings is in jeopardy!\r\nHe's not going to let anyone get in the way of his sister and him―!\r\n\r\nWhat would happen if I actually tried to have a serious love affair with my too-cute sister?\r\nA straightforward love comedy about an older brother and a younger sister who are in love with each other.\r\nA story of pure love between an older brother and a younger sister that will make you faint in agony without being found out, starts now!>"
}