{
	"url": "https://www.novelupdates.com/series/prince-herscherik-and-the-kingdom-of-sorrow/",
	"title": "Herscherik (Reincarnated Prince Series) - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2016/09/cover2.png",
	"noveltype": "(JP)",
	"genre": "Adventure   Drama   Fantasy   Gender Bender   Slice of Life   ",
	"tags": "Adapted to Manga   Age Progression   Aristocracy   Caring Protagonist   Charismatic Protagonist   Child Protagonist   Female to Male   Handsome Male Lead   Kingdoms   Loyal Subordinates   Male Protagonist   Master-Servant Relationship   Nobles   Proactive Protagonist   Reincarnated in Another World   Royalty   Transmigration   ",
	"rating": "(4.5 / 5.0, 155 votes)",
	"author": "Kusunoki Nobiru   楠のびる   ",
	"year": "\n2014",
	"ranking": "#4080   #3551   #2021   #5450   #1111   ",
	"reviewcount": "19 Reviews sorted by",
	"description": "The day prior to female otaku Hayakawa Ryouko’s 35th birthday, she departed the world in a traffic accident. As she opened her eyes again, she was reincarnated into a beautiful blonde-haired prince of a great kingdom in a fantasy world.\n\nIn that great kingdom… In Greisis kingdom, there’s a king despised by his retainers, tyrant nobles, corrupt officials, and so on… It’s in a precarious situation.\n\nFor the sake of protecting his father and family, as well as helping the citizens, the reincarnated Prince Herscherik is determined to fight.\n\nMaking use of his skill as an office clerk in the past, being full of initiative in his nature along with his (otaku-ish) intellect, the reincarnated prince faces many kinds of incidents.\n\nBooks in this series:\n\nI. Reincarnated Prince and the Kingdom of Sorrow\n\nII. Reincarnated Prince and the Knight of Twilight\n\nIII. Reincarnated Prince and the Magus of White Rainbow\n\nIV. Reincarnated Prince and the Hero of Light\n\nV. Reincarnated Prince and the Pride of Warring Kingdom\n\nVI. Reincarnated Prince Series: Short Story Collection\n\nVII. Reincarnated Prince and the Divine Priest of the Land of the Sun>"
}