{
	"url": "https://www.novelupdates.com/series/chinese-almanac-master/",
	"title": "Chinese Almanac Master - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/01/tumblr_pkwlh5eJCO1wswvyq_1280.jpg",
	"noveltype": "(CN)",
	"genre": "Fantasy   Mature   Mystery   Smut   Supernatural   Yaoi   ",
	"tags": "Adapted to Anime   Clever Protagonist   Cold Love Interests   Contracts   Divine Protection   God-human Relationship   Gods   Handsome Male Lead   Lazy Protagonist   Loner Protagonist   Love Interest Falls in Love First   Magic   Mature Protagonist   Modern Day   Mythology   Seeing Things Other Humans Can't   Spirits   ",
	"rating": "(4.3 / 5.0, 43 votes)",
	"author": "石头羊   ",
	"year": "\n2015",
	"ranking": "#6970   #4733   #7908   #8369   #5193   ",
	"reviewcount": "2 Reviews sorted by",
	"description": "Huangli Shi, according to legends, refers to a Fangshi who can alter the effects of seasonal solstices, solar terms, and festivals, and is able to predict each day’s fortune.\r\n\r\nXiao Nanzhu, an unemployed young man, decided to take on his usual job that has been passed down for generations, after being inspired by his childhood friend. Now he just wants to call 110.\r\n\r\nChuxi: What are you looking at? You don’t want to live past new year’s eve?\r\n\r\nChuba: Today’s fortune is terrible, nothing’s going to turn out right. I’m afraid there might be a… bloody disaster.\r\n\r\nQingming: So am I a solar term or a festival? In that case, I should get double the pay, right?\r\n\r\nDongzhi: Alas, digestion happens faster when it comes to winter. I want to eat dumplings and wonton and sweet dumplings～\r\n\r\nXiao Nanzhu: “…”\r\n\r\nNote:\r\n1.Huangli Shi 黄历师: Huangli is a traditional Chinese calendar which not only involves dates, seasons, festivals but also do-s and don’t-s on each day and moon phases, Shi refers to master.\r\n\r\n2.Fangshi 方士: A mysterious type of Daoist who possesses special power and works in the field such as medical, fortune-telling, forecasting, and astrology\r\n\r\nOriginally named “Secret Archives of Unscientific Materialism (不科学唯物主义秘密档案)”, the novel was formally renamed to “Huangli Shi (黄历师)” on April 24, 2018, due to the animated adaptation of the novel.>"
}