{
	"url": "https://www.novelupdates.com/series/the-spaces-twelve-zodiac-comes-to-farm/",
	"title": "The Space’s Twelve Zodiac Comes to Farm! - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/10/farm.jpg",
	"noveltype": "(CN)",
	"genre": "Historical   Shoujo   Slice of Life   Supernatural   ",
	"tags": "Ancient China   Farming   Female Protagonist   Magic   Magical Space   Transmigration   ",
	"rating": "(4.4 / 5.0, 19 votes)",
	"author": "Chu Tian’s Bai Yan Jing   Young Farmer Bird’s White Eyes   雏田的白眼   ",
	"year": "\n2020",
	"ranking": "#2000   #2000   #7831   #9150   #8613   ",
	"reviewcount": "3 Reviews sorted by",
	"description": "A secret service agent traverses through another dimension and ends up transmigrating into the body of a peasant girl in Ancient China. One day, a rat pops out of her portable dimension claiming that there were eleven other supreme beings just as powerful as it is. The impoverished, hungry and dizzy Li Bailian (White Lotus on a Plum Branch) knew that her fortune had finally changed for the better!\n\nThe small peasant girl’s name is Li Bailian, a girl who possesses a  gentle-looking exterior but is actually tough as nails on the inside (IDIOM). Everyone in the village says that the five girls of the Li family are the most pitiful and are mistreated all day long. The outrageous grandfather, grandmother, younger and eldest uncle can’t control this overbearing little girl, so they conspire to sell her and her family into s*avery.\n\nNeighboring countries discovered that the great Han Kingdom have started to experience numerous, ominous disasters:\n\nSomewhere, on the eve before the earthquake, rats suddenly flooded the streets and ran rampant (idiom), only to bite those who were staying in their houses! Later, when the earthquake collapsed the homes, the commoners proclaimed that the Rat Immortal had descended!\n\nLocusts were wreaking widespread havoc in the countryside, leaving the commoners in a panic. Out of nowhere, a flock of chickens appeared and the locusts suddenly were on the verge of extinction….\n\nA nearby country had no food left in their granaries and plotted to steal supplies from the great Han Kingdom. Suddenly, the enemy army’s leading general was bitten to death by a snake that seemed to have popped out of thin air!\n\nLi Bailian was framed by others while she was unconscious. When she awoke, the Old Emperor and his wife were preparing to run, his pale, disheveled appearance was that of one who had seen great upheaval. \n\n“Daughter-in-Law, you’re awake? One of my sons has rebelled, Hua’ er thought you were going to die so he left without a second thought. I’ve thrown off our pursuers, let’s quickly escape!”\n\n“What’s that on your clothes?” Bailian asked, seeing the dragon on the Old Emperor’s robe.\n\n“Ah, daughter-in-law this design is just meant to fool people, there isn’t really…”\n\nAnd before the last of the Emperor’s words could be sounded out, a lustrous, silvery dragon hurtled out, lightning flashing and thunder roaring, suddenly flying towards the enemy troops…>"
}