{
	"url": "https://www.novelupdates.com/series/secret-service-princess-the-cold-princes-black-belly-wife/",
	"title": "Secret Service Princess: The Cold Prince’s Black Belly Wife - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2017/09/15534s.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Fantasy   Martial Arts   Romance   Shoujo   Xuanhuan   ",
	"tags": "Arranged Marriage   Beautiful Female Lead   Black Belly   Cold Protagonist   Cruel Characters   Cunning Protagonist   Female Protagonist   Handsome Male Lead   Past Plays a Big Role   Possessive Characters   Secret Identity   Transmigration   ",
	"rating": "(4.3 / 5.0, 34 votes)",
	"author": "尛羽宝宝   ",
	"year": "\n2015",
	"ranking": "#2000   #2000   #7506   #5817   #4747   ",
	"reviewcount": "2 Reviews sorted by",
	"description": "She is the 21st century best secret agent, died after a plane crash and transmigrated to a dysnasty not found in history. Not to mention being reincarnated as an infant, to suffer repeatedly by being framed by the Madame, bullied and humiliated by the Shu daughters, years of patience only for the sky to strike.\n\nThe number one landlord in the country? Jiang Hu’s hard to get a hold off and can barely catch a glimpse off ghost doctor? A patriarchal clan of saints who was supposed to be extinct a thousand years ago? Which one is really her?\n\nHe is the Tianfeng Dynasty’s most capable prince, and at the same time the most beloved son of the emperor. He is cold, he is ruthless, he is cruel, he is bloodthirsty, and he treated women as clothing. Everyone knows that he is heartless, but nobody knows that he has been in love before. \n\nHe was a man who has been silenced, her lover from a thousand years ago. A thousand years of entanglement, willing to give everything, just to exchange for that one beautiful woman’s smile.\n\n“Who are you?’\n\n” I’m your husband.”\n\n“You think I’m three years old? My husband looks better than you.”\n\n“I’m your husband 1,000 years ago.”\n\nThe woman, petrified, carefully asked, “How old are you this year?”\n\n“2,220 years old.”\n\n“Get the hell out! Bastard!! 2,220 years old!! Why don’t you say your dad was 12,000 years old?”\n\n“My father is in fact this age, you still remember.”\n\n“…”>"
}