{
	"url": "https://www.novelupdates.com/series/the-young-supporter-of-darkness/",
	"title": "The Young Supporter of Darkness - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/08/The-Young-Supporter-of-Darkness.jpg",
	"noveltype": "(KR)",
	"genre": "Comedy   Fantasy   Romance   Shoujo   ",
	"tags": "Abandoned Children   Age Regression   Aristocracy   Cute Children   European Ambience   Female Protagonist   Monsters   Nobles   Reincarnation   Revenge   Royalty   Second Chance   Villainess Noble Girls   ",
	"rating": "(3.9 / 5.0, 29 votes)",
	"author": "리아란   ",
	"year": "\n2021",
	"ranking": "#1326   #6156   #6890   #5147   #5256   ",
	"reviewcount": "2 Reviews sorted by",
	"description": "I was reincarnated as the villainess, Daphne, whose death was set in stone. I didn’t want to die nor be sold.\n\n‘So, let’s change the original story!’\nWith that in mind, I won the female lead’s favor and made the male lead a crown prince.\n\n‘Goodbye, my sister. You were really useful.’\n\n… Despite my efforts, the male lead betrayed me. I, who had regressed to the age of 13, made a pledge.\n‘I will surely make the filthy royal family and that bastard, the male lead, crawl on the floor.’\n\n“I’ll sponsor you.”\nAs a result, I decided to sponsor the ultimate villain.\n\nEverything went well until I decided to sponsor the villain.\n\n“Come here, my lovely child.”\nAfter saving the time-limited father-in-law, why did he become so friendly?\n\n“Madam! I brought you a duck…, your lunch is flying awayyy!!”\n“My physique is in good shape!!!”\n“Madam, I have brought a bear for you!”\n“Everyone get out of here.”\n\nWhat is it about me that the people here adore so much?\n\n“Ah, you pretended you didn’t know when you actually knew?”\n\nAlso, why is it so fun to tease the ultimate villain, who I was so afraid of in my previous life? It occurred to me that everyone here wouldn’t be bothered by my departure, so I left them in peace.\n\n“Where are you going, Daphne?”\n\nI was mistaken.>"
}