{
	"url": "https://www.novelupdates.com/series/sevens/",
	"title": "Sevens - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2015/12/sevens.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Comedy   Drama   Fantasy   Harem   Mystery   Psychological   Romance   Shounen   ",
	"tags": "Abandoned Children   Abusive Characters   Adventurers   Automatons   Beautiful Female Lead   Character Growth   Childhood Friends   Clever Protagonist   Dense Protagonist   Depictions of Cruelty   Devoted Love Interests   Dragons   Dungeons   Dwarfs   Elves   Emotionally Weak Protagonist   Family Conflict   Fantasy World   Firearms   Goddesses   Guilds   Handsome Male Lead   Hard-Working Protagonist   Human-Nonhuman Relationship   Kingdom Building   Leadership   Magic   Male Protagonist   Manipulative Characters   Monsters   Multiple Personalities   Multiple POV   Mythical Beasts   Naive Protagonist   Nobles   Past Plays a Big Role   Politics   Polygamy   R-15   Royalty   Schemes And Conspiracies   Spirit Advisor   Strategic Battles   Strong Love Interests   Teamwork   Underestimated Protagonist   Wars   Weak to Strong   Yandere   Younger Sisters   ",
	"rating": "(4.2 / 5.0, 1320 votes)",
	"author": "Mishima Yomu   Wai   わい／三嶋　与夢   ",
	"year": "\n2014",
	"ranking": "#2210   #2550   #214   #55   #28   ",
	"reviewcount": "145 Reviews sorted by",
	"description": "Lyle Walt is a young noble boy and heir looking forward to the day he can inherit his family’s territory. Except around when he was 10 year old, his parents started neglecting him more and more in favour of his little sister, Celes.\nOn his fifteenth birthday, he is challenged to a duel by his sister to see who will inherit the household and horribly loses, being cast out of his family. Afterwards, he gets treated by the family groundskeepers and receives the family heirloom Gem from him that Lyle’s grandfather had entrusted to him. From there, he begins an aimless journey with his childhood friend and former fiancée, Novem, and the Gem-turned-Jewel that houses the memories, personalities, and Skills of seven of his ancestors.>"
}