{
	"url": "https://www.novelupdates.com/series/i-just-crave-for-your-pheromones/",
	"title": "I Just Crave for Your Pheromones - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/02/I-Just-Crave-for-Your-Pheromones.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Drama   Fantasy   Romance   Yaoi   ",
	"tags": "Abandoned Children   Absent Parents   Acting   Calm Protagonist   Celebrities   Character Growth   Charming Protagonist   Child Abuse   Clever Protagonist   Cohabitation   Cold Love Interests   Cold Protagonist   Cute Protagonist   Depression   Devoted Love Interests   Doting Love Interests   Dreams   Famous Protagonist   Fated Lovers   First Love   First-time Interc**rse   Glasses-wearing Love Interests   Handsome Male Lead   Modern Day   Omegaverse   Past Trauma   Popular Love Interests   Protagonist Falls in Love First   Showbiz   Shy Characters   Special Abilities   Suicides   Tragic Past   Weak to Strong   ",
	"rating": "(4.4 / 5.0, 206 votes)",
	"author": "Zhǐ jǐn   夂槿   ",
	"year": "\n2020",
	"ranking": "#684   #575   #2638   #575   #2311   ",
	"reviewcount": "42 Reviews sorted by",
	"description": "Top traffic star and entertainment circle beauty Tong Che is a special Omega. He will be in heat every day when he is off suppressants.\r\n\r\nTong Che thought he would have to be in a permanent relationship with suppressants for the rest of his life. Until one night, he dreamt of his idol, Mu Hanfeng, a three-golden movie star known as the 'Alpha with the strongest restraint.'\r\n\r\nIn the dream, he was bitten by Mu Han Feng. When he woke up, Tong Che found that the dream was even more effective than inhibitors!\r\n\r\nFrom that moment on, Tong Che looked forward to being marked by Mu Hanfeng in his dreams.\r\n\r\n~\r\n\r\nMu Hanfeng did not know when it started, but he always had a lustful Omega in his dreams.\r\n\r\nThe little Omega would kiss him on his eyelids and the bridge of his nose, and sometimes secretly kiss him on the lips.\r\n\r\nThe little Omega also liked to touch his abs and feel his waist, and occasionally even had the audacity to pester him for a mark.\r\n\r\nAt first, Mu Hanfeng found it amusing, then he was sexually aroused. But later, he became indispensable to him.>"
}