{
	"url": "https://www.novelupdates.com/series/legend-of-galactic-heroes/",
	"title": "Legend of Galactic Heroes - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2015/10/LoGH_vol1_first_edition_tokuma_novels.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Drama   Fantasy   Psychological   Sci-fi   ",
	"tags": "Adapted to Anime   Adapted to Manga   Aristocracy   Assassins   Award-winning Work   Cosmic Wars   Cunning Protagonist   Domestic Affairs   Empires   Handsome Male Lead   Kingdom Building   Male Protagonist   Military   Nobles   Outer Space   Politics   Royalty   Ruthless Protagonist   Schemes And Conspiracies   Strategist   Wars   ",
	"rating": "(4.5 / 5.0, 41 votes)",
	"author": "Tanaka Yoshiki   ",
	"year": "\n1982",
	"ranking": "#5262   #2000   #9005   #8371   #7948   ",
	"reviewcount": "2 Reviews sorted by",
	"description": "The story is staged in the distant future within our own Milky Way Galaxy, approximately in the late 36th century. A portion of the galaxy is filled with terraformed worlds inhabited by interstellar traveling human beings. For 150 years two mighty space powers have intermittently warred with each other: the Galactic Empire and the Free Planets Alliance.\n\nWithin the Galactic Empire, based on mid 19th century Prussia, an ambitious military genius, Reinhard von Müsel, later conferred Reinhard von Lohengramm, is rising to power. He is driven by the desire to free his sister Annerose, who was taken by the Kaiser as a concubine. Later, he wants not only to end the corrupt Goldenbaum dynasty but also to defeat the Free Planets Alliance and to unify the whole galaxy under his rule.\n\nIn the Free Planets Alliance Star Fleet is another genius, Yang Wen Li. He originally aspired to become a historian through a military academy, and joined the tactical division only out of need for tuition money. He was rapidly promoted to an admiral because he demonstrated excellence in military strategy in a number of decisive battles and conflicts. He becomes the archrival of Reinhard, though they highly respect one another. Unlike Reinhard he is better known for his underdog victories and accomplishments in overcoming seemingly impossible odds and mitigating casualties and damages due to military operations.\n\nAs a historian, Yang often predicts the motives behind his enemies and narrates the rich history of his world and comments on it. One of his famous quotes is: “There are few wars between good and evil; most are between one good and another good.”\n\nBesides the two main heroes, the story is full of vivid characters and intricate politics. All types of characters, from high nobility, admirals and politicians, to common soldiers and farmers, are interwoven into the story. The story frequently switches away from the main heroes to the Unknown Soldier fighting for his life on the battlefield.\n\nThere is a third neutral power nominally attached to the Galactic Empire called the Phezzan Dominion, a planet-state (city-state on a galactic scale) which trades with both warring powers. There is also a Terraism cult, which claims that humans should go back to Earth, gaining popularity throughout the galaxy. Throughout the story executive political figures of Phezzan in concert with the upper-hierarchy of the Terraism cult orchestrate a number of conspiracies to shift the tide of the galactic war so that it may favor their objectives.>"
}