{
	"url": "https://www.novelupdates.com/series/married-the-scum-gongs-villain-brother/",
	"title": "Married the Scum Gong’s Villain Brother - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/05/Married-the-Scum-Gongs-Villain-Brother_1622380679.png",
	"noveltype": "(CN)",
	"genre": "Romance   Slice of Life   Yaoi   ",
	"tags": "Absent Parents   Business Management   Businessmen   Calm Protagonist   Charming Protagonist   Clever Protagonist   Cold Love Interests   College/University   Cute Protagonist   Dense Protagonist   Doting Love Interests   Early Romance   Family Conflict   Genius Protagonist   Handsome Male Lead   Heartwarming   Love Interest Falls in Love First   Marriage   Marriage of Convenience   Modern Day   Older Love Interests   Programmer   Smart Couple   Terminal Illness   Transmigration   Wealthy Characters   ",
	"rating": "(4.1 / 5.0, 315 votes)",
	"author": "Guan Hongyi   管红衣   ",
	"year": "\n2020",
	"ranking": "#228   #265   #1062   #300   #1057   ",
	"reviewcount": "69 Reviews sorted by",
	"description": "Jing Xun transmigrated into a novel called “All for love” and became the protagonist shou who was about to jump off the building because of love.\n\nIn the original book, the video of the protagonist jumping off a building circulated on the internet; he was known as a college student who wasted educational resources and did not have self-respect.\n\nAs a learning tyrant, Jing Xun asked: “Seriously, who is that?”\n\nJing Xun was good-looking and good at studying. He was simply excellent in all aspects but his health was not good.\n\nAlthough he had transmigrated into a BE scum novel, he felt very fortunate because he finally had a healthy body… so Jing Xun planned to kick the scum gong away and do all the things he couldn’t do before.\n\nHowever, he didn’t expect that the first extraordinary thing he did after transmigrating was to stand in a claustrophobic and dim room after being drugged, and ask for help from a handsome and indifferent Mr. Long Legs:\n\n“Mister, can you help me?”\n\nAfter a night of passion, Jing Xun felt that this gentleman was a good person.\n\nUntil two days later, Mr. Long legs came to the door and wanted to marry him.\n\nJing Xun: …Wasn’t it just a one-night stand!?>"
}