{
	"url": "https://www.novelupdates.com/series/sage-monarch/",
	"title": "Sage Monarch - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2016/04/1337051552793.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Fantasy   Martial Arts   Seinen   Xuanhuan   ",
	"tags": "Absent Parents   Adapted to Manhua   Angels   Army Building   Arrogant Characters   Artifacts   Assassins   Battle Academy   Beasts   Betrayal   Body Tempering   Buddhism   Caring Protagonist   Cautious Protagonist   Clan Building   Clever Protagonist   Complex Family Relationships   Cosmic Wars   Cultivation   Dao Comprehension   Demons   Destiny   Divination   Dragons   Enlightenment   Fast Cultivation   Fox Spirits   Friendship   Gods   Half-human Protagonist   Heavenly Tribulation   Hiding True Abilities   Hiding True Identity   Honest Protagonist   Immortals   Kingdom Building   Leadership   Loner Protagonist   Low-key Protagonist   Lucky Protagonist   Magic Formations   Magical Space   Magical Technology   Male Protagonist   Mind Control   Multiple Realms   Multiple Timelines   Mysterious Family Background   Mysterious Past   Mythical Beasts   Ninjas   Outer Space   Personality Changes   Pill Concocting   Politics   Precognition   Protagonist with Multiple Bodies   Psychic Powers   Race Change   Racism   Revenge   Ruthless Protagonist   Schemes And Conspiracies   Sealed Power   Sect Development   Servants   Souls   Spatial Manipulation   Spear Wielder   Special Abilities   Sudden Strength Gain   Time Manipulation   Time Paradox   Time Travel   Transplanted Memories   Unique Cultivation Technique   Unique Weapon User   Unique Weapons   Wars   Weak to Strong   World Travel   ",
	"rating": "(3.5 / 5.0, 514 votes)",
	"author": "Divine Dreamwalker   Meng Ru Shen Ji   梦入神机   ",
	"year": "\n2011",
	"ranking": "#2000   #2000   #176   #712   #1259   ",
	"reviewcount": "85 Reviews sorted by",
	"description": "Yang Qi was the son of the patriarch of a wealthy family from a small town.\r\n\r\nBelieving himself to be in love, he stole a pill for his lover, only to have the girl betray him, by taking the pill and leaving him behind.\r\n\r\nCaught, his dantian was crippled and left to die under the lightning.\r\n\r\nThis lightning helped him to recover his lost martial arts and also helped him gain a new, divine-like cultivation technique.\r\n\r\nAfter this second chance, he gains more power as he sought revenge and also to find about his missing mother….>"
}