{
	"url": "https://www.novelupdates.com/series/i-crossed-the-line-without-knowing-it-was-the-male-lead/",
	"title": "I Crossed the Line Without Knowing It Was the Male Lead - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/12/I-Crossed-the-Line-Without-Knowing-It-Was-the-Male-Lead.jpg",
	"noveltype": "(KR)",
	"genre": "Fantasy   Romance   Shoujo   ",
	"tags": "Aristocracy   Beautiful Female Lead   Childhood Friends   Cute Children   European Ambience   Female Protagonist   Handsome Male Lead   Mob Protagonist   Nobles   Possessive Characters   Reincarnated in Another World   Reincarnation   Yandere   ",
	"rating": "(3.8 / 5.0, 12 votes)",
	"author": "초코냥이   ",
	"year": "\n2021",
	"ranking": "#2000   #6274   #9941   #6515   #8252   ",
	"reviewcount": "2 Reviews sorted by",
	"description": "I possessed a devastating novel that ended with a confinement ending due to the female protagonist’s obsession.\n\nI feel sorry for the male lead, but I’m just an extra who didn’t even appear in the novel.\n\nWhether the two of them mess up each other or end up together, I decided to live my own life.\n\nTo become a world-class fashion designer, my long-cherished dream. \n\nSince she is the only child of her parents, who has all the wealth, power, harmony, and beauty, so there’s nothing she can’t do.\n\nAt the age of ten, she decided to look for a fiancé at her mother’s party, but she accidentally saw a boy being dragged instead.\n\nHis outfit was sloppy, but his face is seriously pretty.\n\nAfter that, all I can think of is that child, so I set out to find him.\n\n“Can I use my wish coupon now?”\n\n“Okay……What is it?”\n\n“Be my muse.”\n\nI found that child, whose name is Jeff, and wrote a memorandum to befriend him, so we often meet and play together, but that’s not enough. \n\nStrangely, whenever I see Jeff, I get possessive.\n\n“There’s something I really want to show you.”\n\n“What is it?”\n\n“My hideout!”\n\nThe day Jeff’s mother was sick, and I couldn’t see him for a long time, I met him and went to my hideout, where I had an accident.\n\nWhen I woke up after being ill for a long time, I was relieved that Jeff is there, but after that, I never saw him again…>"
}