{
	"url": "https://www.novelupdates.com/series/pure-love-%e2%9c%95-insult-complex/",
	"title": "Pure Love ✕ Insult Complex - Novel Updates",
	"image": "https://www.novelupdates.com/img/noimagefound.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adult   Drama   Harem   Martial Arts   Psychological   Romance   School Life   Seinen   ",
	"tags": "Abandoned Children   Academy   Adopted Protagonist   Assassins   Average-looking Protagonist   Beautiful Female Lead   Blackmail   Bodyguards   Brainwashing   Breast Fetish   Character Growth   C*nnilingus   Cohabitation   Confident Protagonist   Confinement   Cooking   Depictions of Cruelty   Determined Protagonist   Devoted Love Interests   Economics   Enemies Become Lovers   Exhibitionism   First-time Interc**rse   F*llatio   Hard-Working Protagonist   H*ndjob   Inheritance   Kind Love Interests   Living Alone   Loli   Loneliness   Love at First Sight   Male Protagonist   Male Yandere   Marriage   Marriage of Convenience   Masochistic Characters   M*sturbation   Modern Day   Modern Knowledge   Multiple Identities   Netori   Nobles   Nudity   Obsessive Love   Older Love Interests   Organized Crime   Orphans   Outdoor Interc**rse   Paizuri   Past Plays a Big Role   Past Trauma   Politics   Polygamy   Popular Love Interests   Pregnancy   Priestesses   R-18   R*pe Victim Becomes Lover   Revenge   R*pe   Sadistic Characters   Secret Organizations   S*x Friends   S*x S*aves   Sharp-tongued Characters   Shoujo-Ai Subplot   Showbiz   Siblings Not Related by Blood   Stockholm Syndrome   Strong Love Interests   Threesome   Toys   Tragic Past   Tsundere   Twisted Personality   Ugly to Beautiful   Unconditional Love   Weak to Strong   Wealthy Characters   Yandere   Younger Love Interests   ",
	"rating": "(4.2 / 5.0, 863 votes)",
	"author": "銀三〇（ゆだ）   ",
	"year": "\n2011",
	"ranking": "#264   #249   #79   #479   #214   ",
	"reviewcount": "131 Reviews",
	"description": "I fell in love. Her name was Shirasaka Yukino. I could only look at her from a distance. However one day I heard that she already had a boyfriend. Even if I love her, I can’t have her. The devil sent me an invitation. I can make her mine!>"
}