{
	"url": "https://www.novelupdates.com/series/prince-kurobuta-who-reincarnated-as-a-villain-character-remembered-his-previous-life-and-was-changed-he-would-be-the-strongest-if-he-escapes-from-the-death-end/",
	"title": "Prince Kurobuta Who Reincarnated as a Villain Character Remembered His Previous Life and Was Changed, He Would Be the Strongest if He Escapes From the Death End~ - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/09/Prince-Kurobuta-who-reincarnated-as-a-villain-character-remembered-his-previous-life-and-was-changed-he-would-be-the-strongest-if-he-escapes-from-the-death-end.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Fantasy   Harem   Romance   School Life   Shounen   ",
	"tags": "Appearance Changes   Aristocracy   Arranged Marriage   Beastkin   Beautiful Female Lead   Charismatic Protagonist   Charming Protagonist   Demi-Humans   Demon Lord   Demons   Dragon Riders   Dragons   Fat to Fit   Game Elements   Gamers   Handsome Male Lead   Hard-Working Protagonist   Heroes   Kingdoms   Level System   Love Interest Falls in Love First   Magic   Maids   Male Protagonist   Personality Changes   Reincarnated in a Game World   Royalty   Second Chance   Sword And Magic   Sword Wielder   Weak to Strong   ",
	"rating": "(3.7 / 5.0, 47 votes)",
	"author": "Yuusha Shounen   少年ユウシャ   ",
	"year": "\n2020",
	"ranking": "#2000   #2000   #3469   #1687   #5420   ",
	"reviewcount": "6 Reviews sorted by",
	"description": "“You’ve been a great help. Thank you.\r\n\r\n“It’s a lie!! …… Brad-sama thanked me? No way!\r\n\r\nThe prince, Brad von Pistel is a proud, insidious, dark-skinned, ugly prince known as the “Black Pig Prince”,\r\n\r\nIn the middle of a training class at the Royal Academy, he recalls the memories of his previous life as Kurokawa Hayato, an otaku gamer who is an Arasa-ossan. At the same time, he realizes that the world he lives in is very similar to the RPG “Final Quest” that was so popular in his previous life.\r\n\r\nHowever, in the story, Brad is a villainous character who later becomes the king and is destined to die at the hands of the hero.\r\n\r\nThere is still some time before that day arrives, but if he doesn’t change his ways, he will end up dead. Brad decides to change himself and live an honest life in order to avoid the end of his life at all costs.\r\n\r\nBut as he becomes kinder to those around him, diets, and uses his knowledge of the game to become stronger, he becomes a handsome prince, and instead of just avoiding the end of his life, he ends up being worshipped by those around him!\r\n\r\nIt’s supposed to be a success story where everything you do turns out good, but the author’s personality is so twisted that even he doesn’t know how it will turn out.>"
}