{
	"url": "https://www.novelupdates.com/series/the-tyrants-last-doll/",
	"title": "The Tyrant’s Last Doll - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/12/Its-Dangerous-Playing-the-Tyrants-Doll.jpeg",
	"noveltype": "(KR)",
	"genre": "Fantasy   Romance   ",
	"tags": "Beautiful Female Lead   Calm Protagonist   Caring Protagonist   Cohabitation   Cute Protagonist   Death of Loved Ones   Depictions of Cruelty   Devoted Love Interests   Doting Love Interests   Enemies Become Lovers   European Ambience   Fallen Nobility   Fantasy World   Female Protagonist   Gods   Handsome Male Lead   Lazy Protagonist   Love Interest Falls in Love First   Male Yandere   Mute Character   Nobles   Obsessive Love   Past Trauma   Possessive Characters   Priests   Quirky Characters   Reincarnated in Another World   Reincarnation   Reverse Harem   Royalty   S*aves   Slow Romance   Special Abilities   Stockholm Syndrome   Strong Love Interests   Tragic Past   Weak to Strong   ",
	"rating": "(3.9 / 5.0, 108 votes)",
	"author": "유세니   ",
	"year": "\n2020",
	"ranking": "#2318   #2220   #2153   #1948   #2171   ",
	"reviewcount": "7 Reviews sorted by",
	"description": "I was reincarnated into a bloody novel famous for its bad ending!\r\n\r\nI’m even the last “doll” of the tyrant Emperor, who is suffering from insomnia due to his severe trauma?\r\n\r\nI must survive his grasp until the original heroine appears a year later to save the tyrant.\r\n\r\nBut he’s starting to obsess over me, while I’m thinking about running away to safety?\r\n\r\nEven the heroine who appeared earlier than expected is suspicious!\r\n\r\n‘Then what about my grand plan to leave the tyrant to the heroine and run away?’\r\n\r\nWill I be able to survive safely?\r\n\r\n***\r\n\r\n“Who are you.”\r\n\r\nThe hairs on my whole body stood up. It was as if a hungry black panther was making a threatening sound.\r\n\r\n“I must have told you not to let anyone in.”\r\n\r\nI saw golden eyes that seemed to be made by melted honey between scattered black hair.\r\n\r\nI was suffocated when I met with those fascinating, but young eyes.\r\n\r\n‘You’re not gonna kill me if I make eye contact with you, are you?’\r\n\r\nHe came close to me while I was distracted for a moment.\r\n\r\n‘What just happened?’\r\n\r\nI was suffocated as soon as I was surprised.\r\n\r\nIt was because the emperor, who came closer to me in no time, grabbed my waist and lifted me into the air.\r\n\r\n‘Well, at this rate, I’m going to die right now, let alone three years of dawn!’\r\n\r\nThe golden eyes that entranced me shook slightly.\r\n\r\nA moment passed, and a husky and low voice flowed through his red lips.\r\n\r\n“Lily… … Ana?”\r\n\r\n“Lilly… do you know?”\r\n\r\nThat was the name of the original heroine.\r\n\r\nAnd it was the moment that I officially became a tyrant’s doll.>"
}