{
	"url": "https://www.novelupdates.com/series/cultivating-in-online-games/",
	"title": "Cultivating in Online Games - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/11/Cultivating-in-Online-Games.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Romance   Xianxia   Yaoi   ",
	"tags": "Cultivation   Hiding True Identity   Misunderstandings   MMORPG   Past Plays a Big Role   Reincarnated in a Game World   Secret Identity   Seme Protagonist   Sickly Characters   Sword Wielder   Transported into a Game World   ",
	"rating": "(4.0 / 5.0, 42 votes)",
	"author": "Cyan Wings   Qing Se Yu Yi   青色羽翼   ",
	"year": "\n2020",
	"ranking": "#1860   #1306   #6318   #2161   #5662   ",
	"reviewcount": "3 Reviews sorted by",
	"description": "Dugu Zhuo’s life was exhausted by fate. His skills were destroyed, his kinship was severed, his friends were lost, his father was killed, and even his only beloved Ye Zhou was gone. Wearing a spirit jade that protected Ye Zhou’s remnant soul, he scoured around every corner of the world, trying to find Ye Zhuo’s remaining soul to stay with him in the afterlife.\r\n\r\nUntil one day, when his lifespan was approaching an end, he entered an illusion and saw Ye Zhou being chased by several monsters. After dealing with the monsters, a strange voice rang in his ears:\r\n\r\n[Ding, you killed the monsters and get 3 low-grade spirit stones.]\r\n\r\n[Ding, you killed the monsters, and get the secret book .]\r\n\r\n[Ding, you killed the monsters, and get a precious healing spirit grass.]\r\n\r\n\r\n[Ding, you have levelled up, and your skills are restored by 1%.]\r\n\r\nAnd the Ye Zhuo he just “rescued” raised his sword angrily and yelled: “How dare you steal my monster!”\r\n\r\nDugu Zhuo: “?”\r\n\r\n——\r\n\r\nYe Zhou encountered a strange player named Dugu Zhuo in the holographic online game “Nine Heavens”. He doesn’t understand common sense, doesn’t know how to play, doesn’t go offline to rest, and often looks at him with deep eyes. Ye Zhou only accepted him as a very handsome apprentice, and taught him how to upgrade and play.\r\n\r\nJust when Ye Zhou was thinking about whether to meet with his apprentice, an announcement was shared across the whole server: [Player Ye Zhou triggers the final plot “Sword Tomb” and unlocked the final boss of the game, Dugu Zhuo.]\r\n\r\nYe Zhou: “…”\r\n\r\n\r\nBy coincidence, he has the same name as his apprentice!>"
}