{
	"url": "https://www.novelupdates.com/series/infinite-escape-room-no-parkour/",
	"title": "Infinite Escape Room: No Parkour - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/10/Infinite-Escape-Room-No-Parkour.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Horror   Psychological   ",
	"tags": "Clever Protagonist   Female Protagonist   God-human Relationship   ",
	"rating": "(2.6 / 5.0, 5 votes)",
	"author": "小酥醒   ",
	"year": "\n2021",
	"ranking": "#2000   #2000   #11484   #10271   #12336   ",
	"reviewcount": "1 Review sorted by",
	"description": "\n\nThe evil creatures in the three thousand worlds know that killing all human players who had lost themselves and preventing them from clearing a level and go through rebirth is the meaning of their existence.\n\nThe Scythe Knight(Centaur) held a crescent scimitar with blood dripping on the forest floor. The horse hooves trembled and the Knight panted.\n\nStaring at the girl in black, he said: “You… You can really run!”\n\nHis four hooves can’t outrun a human girl’s two legs! What a disgrace this is to him!\n\n“Come, continue chasing me. I’ll let you hehehe~” \n\nScythe Knight: “Chase what woman! Go to the next clearance point! Get out!”\n\n“You’ve been chasing me for so long and you know me by now. Why don’t you give me some souvenirs, little horse?” \n\nScythe Knight: ??? I think you’re ignorant of the system here.\n\nSystem: Congratulations to Player•Shi Yu for snatching the mane of the Scythe Knight. It can be made into winter clothes, gloves, etc.\n\nThe bald Scythe Knight lay on the ground and gloated at the misfortune of the next evil creature as the girl vanished on his spot.\n\nLao Tzu cannot let this professional parkour player leave the other Evil creatures alone. Let’s all suffer!\n\nNext stop Evil Creature: ??? Don’t let her come here!!!\n\nThe three thousand worlds’ ultimate boss has heard the evil creatures crying at each other, saying that their possessions were snatched by the professional parkour player! \n\nIntrigue by these rumors, the Cthulhu himself turned into a beautiful human male and said, “Let’s see if that little girl dare snatch something from this Lord!”\n\nHowever, after lurking to Shiyu’s side, the Cthulhu said: “This human being was so bold that she dares to snatch the heart of this Lord!”\n\nSystem: Congratulations to Player•Shi Yu for getting the crazy and paranoid love of the Boss. This thing is non-physical and is extremely lethal. Use it with caution.\n\nShi Yu: ???>"
}