{
	"url": "https://www.novelupdates.com/series/i-came-back-and-conquered-it-all/",
	"title": "I Came Back And Conquered It All - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/05/sdasaa-12.jpg",
	"noveltype": "(KR)",
	"genre": "Action   Adventure   Drama   Fantasy   Shounen   ",
	"tags": "Accelerated Growth   Adventurers   Age Regression   Aliens   Alternate World   Apathetic Protagonist   Appearance Changes   Appearance Different from Actual Age   Betrayal   Clever Protagonist   Death   Demons   Determined Protagonist   Dungeons   Famous Protagonist   Fantasy World   Friends Become Enemies   Game Elements   Game Ranking System   Gate to Another World   Godly Powers   Gods   Guilds   Hard-Working Protagonist   Hunters   Interdimensional Travel   Level System   Loyal Subordinates   Magic   Male Protagonist   Modern Day   Monsters   Overpowered Protagonist   Parallel Worlds   Parasites   Possession   Race Change   Reincarnation   Revenge   Schemes And Conspiracies   Second Chance   Special Abilities   Strong to Stronger   Sword And Magic   Sword Wielder   System Administrator   Time Travel   Weak to Strong   World Hopping   World Travel   ",
	"rating": "(4.1 / 5.0, 279 votes)",
	"author": "Woo Sung   ",
	"year": "\n2020",
	"ranking": "#1380   #6153   #1358   #418   #1812   ",
	"reviewcount": "65 Reviews sorted by",
	"description": "“It’s finally here,” the man with the sword said in an echoing whisper.\n\n“The Tower of Choice, the last floor!” the band of five exclaimed together in response.\n\n\nAngelica came down from the altar, her expression drowsy as if she found it very annoying. Then, she looked us over.\n\n“I'll tell you again, but you’ve been working hard so far. Without you, I wouldn't have been able to go up to the hundredth floor by myself”\n\n[Dominating Touch (Rank: SSS, Active)]\n“All of you die.”\n\nThud!\n\nOne by one, they fall to the floor.\n\nAngelica’s dagger pierced my neck, and I felt a roaring pain and darkness well up in front of my eyes. I was drifting away from my senses and from everything else. After that, I was engulfed by deep darkness.>"
}