{
	"url": "https://www.novelupdates.com/series/my-fake-wife/",
	"title": "My Fake Wife - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/02/My-Fake-Wife_1612594473.jpg",
	"noveltype": "(KR)",
	"genre": "Adult   Drama   Josei   Mature   Romance   Smut   ",
	"tags": "Adapted to Drama   Arranged Marriage   Beautiful Female Lead   Cold Love Interests   Couple Growth   Female Protagonist   Handsome Male Lead   Love Interest Falls in Love First   Marriage   Modern Day   Popular Love Interests   Possession   Possessive Characters   Slow Romance   Twins   Wealthy Characters   ",
	"rating": "(3.6 / 5.0, 14 votes)",
	"author": "만다라   ",
	"year": "\n2021",
	"ranking": "#5262   #2000   #11920   #6514   #8750   ",
	"reviewcount": "No Reviews",
	"description": "Taking the place of her twin sister who had disappeared before her political marriage, Yeon-woo had to pretend to be her sister.\r\n\r\nIt was precisely a fake marriage.\r\n\r\nShe thought she'd simply keep a certain distance from her prickly and cold-hearted husband, Ki-tae.\r\n\r\nBut at some point, he demanded that she fulfilled her marital duties.\r\n\r\nWith her sister's whereabouts still unknown, Yeon-woo felt guilty as she became affectionate with Ki-tae.\r\n\r\nKi-tae, on the other hand, knows that Yeon-woo is not really his wife, but he can't control his possessiveness towards her...\r\n\r\n* * *\r\n\r\n'Cha Ki-tae, I didn't know it was you.'\r\n\r\n'Really?'\r\n\r\n'If I had known you were a big shot, I wouldn't have done this.”\r\n\r\n'It's too late.'\r\n\r\nYeon-woo was resentful of his cold temper. But she knew that it was her who started this twisted relationship, not anyone else.\r\n\r\n'I'm sorry. Please forgive me.'\r\n\r\nYeon-woo's eyes flickered. Ki-tae turned a blind eye to her appeal.\r\n\r\n'If you want to be forgiven, use your body.'\r\n\r\nHe was affectionate for a moment, but the man in front of her no longer showed mercy, as if it were an illusion.\r\n\r\n'What...do you want me to do?'\r\n\r\n'Stop crying, go to my room, and take off your clothes.'\r\n\r\nAnd as soon as Ki-tae put his nose against her neck and called out her real name, Yeon-woo, the fragile relationship like walking on a tightrope began to change.>"
}