{
	"url": "https://www.novelupdates.com/series/a-con-artist-but-thats-okay/",
	"title": "A Con Artist But That’s Okay - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/11/image-0.jpg",
	"noveltype": "(KR)",
	"genre": "Drama   Fantasy   Josei   Mature   Romance   ",
	"tags": "Aristocracy   Female Protagonist   Nobles   Revenge   ",
	"rating": "(3.7 / 5.0, 12 votes)",
	"author": "Portofino   포르토피노   ",
	"year": "\n2020",
	"ranking": "#2000   #2000   #10501   #8982   #6550   ",
	"reviewcount": "1 Review sorted by",
	"description": "I. want. to. go. back!\n\nUnder the guidance of her obstinate father, Seizel had been living as ’the most perfect lady in the world’ until her demise as an unexpected murderer.\n\nThat very day when her miserable ten-year-long imprisonment was about to end with her beheading, her second life commenced.\n\nI’m just not gonna give a f*ck!\n\nI’ll screw them over before they screw me over!\n\nI’ll chew them up and spit them out before they can leech off me!\n\nNo more Ms. Nice Girl. Now, Seizel decided to live however she wants!\n\nWhile she was at it, she planned to become the greatest con artist who swindles the empire itself, and picked up some former cellmates to get the second act of her life going…\n\nWhy does it seem like the world’s gonna end when I’ve just made up my mind!\n\n“……Open your eyes, you fine lad. I need to get my money’s worth.”\n\nFor a world that’s easier to exploit!\n\nAs a final, bite-the-bullet act of charity, she took in and patched up ’The Empire’s Last Guardian’ Duke Leviaus, saving him from the brink of death. Now, all he has to do is bring glory to the empire……\n\nWow. What kind of a sucker is this?\n\n“About who saved me, I cannot remember anything.”\n\nThe person who saved him is me, yet I’m about to be done dirty by randos, hell no.\n\nThus, unintentionally gaining the title of duchess, Seizel kickstarts her ’getting her money’s worth’ project.\n\n“As long as you pay the promised fees on time, I will act as the perfect duchess for a year.”\n\n“That would not be necessary. Everything in this house belongs to Your Ladyship anyway.”\n\nBut this man was a sucker of another level that was never before seen or heard. Courteous, pushy, clingy.\n\n“W-what are you doing here, Your Grace?”\n\n“It’s our first night together, my lady.”\n\n…and lecherous.>"
}