{
	"url": "https://www.novelupdates.com/series/there-was-no-secret-organization-to-fight-with-the-worlds-darkness-so-i-made-one-in-exasperation/",
	"title": "There Was No Secret Organization to Fight with the World’s Darkness so I Made One (In Exasperation) - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/02/hangire-v1cov.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Comedy   Fantasy   Sci-fi   Seinen   Slice of Life   Supernatural   ",
	"tags": "Aliens   Awkward Protagonist   Beautiful Female Lead   Betrayal   Boss-Subordinate Relationship   Buddhism   Chuunibyou   Determined Protagonist   Elves   Evil Organizations   Hard-Working Protagonist   Harsh Training   Hiding True Abilities   Hiding True Identity   Interdimensional Travel   Loyal Subordinates   Male Protagonist   Manipulative Characters   Modern Day   Overpowered Protagonist   Parody   Pets   Psychic Powers   Quirky Characters   Romantic Subplot   Schemes And Conspiracies   Secret Organizations   Special Abilities   Store Owner   Time Skip   Timid Protagonist   Wealthy Characters   ",
	"rating": "(4.2 / 5.0, 358 votes)",
	"author": "Kurodome Hagane   黒留ハガネ   ",
	"year": "\n2018",
	"ranking": "#1183   #1660   #798   #1499   #550   ",
	"reviewcount": "49 Reviews sorted by",
	"description": "The protagonist wakes up to a superpower one day, out of the blue! But there’s no organization targeting the protagonist’s superpower! The prettiest girl in his grade doesn’t turn out to be a psychic like the protagonist himself! No door opens to another world and he doesn’t get summoned! There is no secret history in the protagonist’s past! There is no reveal explaining the protagonist’s sudden attainment of his superpower! So normal! Such overwhelming normalcy! He graduates from school and gets a job without anything happening! He lives as a mediocre working adult! Having enough power to fight against all of humanity yet not seeing anything happen finally makes him snap! Fine, be that way! If this is the way it’s gonna be, then I’ll make it! I’ll make the secret supernatural organization myself! Welcome to my manmade extraordinariness!>"
}