{
	"url": "https://www.novelupdates.com/series/i-bought-the-villains-with-money/",
	"title": "I Bought the Villains With Money - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/08/I-Bought-the-Villains-With-Money.jpg",
	"noveltype": "(KR)",
	"genre": "Drama   Fantasy   Romance   ",
	"tags": "Beautiful Female Lead   Betrayal   European Ambience   Female Protagonist   Handsome Male Lead   Loyal Subordinates   Magic   Money Grubber   Nobles   Reincarnation   Revenge   Royalty   Schemes And Conspiracies   Second Chance   Strong Love Interests   Villainess Noble Girls   Wealthy Characters   ",
	"rating": "(3.5 / 5.0, 23 votes)",
	"author": "Lee Inhye   이인혜   ",
	"year": "\n2021",
	"ranking": "#2261   #2171   #7391   #5450   #6515   ",
	"reviewcount": "No Reviews",
	"description": "[If more than three people doubt the death, the soul will be saved.]\r\n\r\nI was betrayed by my uncle and my trusted lover and stood in front of the guillotine.\r\n\r\nEven if I die, I swore to avenge my enemies and sharpened my blade of revenge.\r\n\r\n“I, Cassion Richte Petrora, cannot accept Diana’s death.”\r\n\r\nI had my head decapitated, and when I opened my eyes, I returned to my 13 years old self.\r\n\r\nI made a vow as I shed tears of joy.\r\n\r\n“The revenge I was planning to avenge in hell, I will give it to you in this lifetime.”\r\n\r\n***\r\n\r\nThe only thing I had was money, and what I didn’t have was people.\r\n\r\nSo, I gathered people with money…\r\n\r\n“Let’s poison him, *cough*. You have a lot of money, so you can handle that, right?”\r\n\r\nSaid the twisted sickly prince,\r\n\r\n“Are you sure you want to save the body? Can I open it?”\r\n\r\nSaid the doctor who was crazy about anatomy,\r\n\r\n“Just give me the information. If you could do that, I will do anything for you.”\r\n\r\nSaid the clueless aunt who had no sense of justice and conscience, Zoe, in the presence of information.\r\n\r\n“Be my disciple.”\r\n\r\nEven the best con artist on the continent wanted to make me his disciple.\r\n\r\nSomehow, I only gathered people who smelled like villains.\r\n\r\nWill I be able to get my revenge on my enemies safely?>"
}