{
	"url": "https://www.novelupdates.com/series/ragweed-princess-of-the-livitium-imperial-kingdom/",
	"title": "Ragweed Princess of the Livitium Imperial Kingdom - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/05/Ragweed-Princess-of-the-Livitium-Imperial-Kingdom_1653637890.jpg",
	"noveltype": "(JP)",
	"genre": "Adventure   Fantasy   Gender Bender   Supernatural   ",
	"tags": "Adapted to Manga   Appearance Changes   Beautiful Female Lead   Elemental Magic   Fat to Fit   Female Protagonist   Magic   Magical Space   Male to Female   Reincarnated in Another World   Reincarnation   Royalty   Summoning Magic   Sword And Magic   Ugly to Beautiful   Witches   ",
	"rating": "(3.9 / 5.0, 18 votes)",
	"author": "Sasaki Ichiro   佐崎　一路   ",
	"year": "\n2013",
	"ranking": "#797   #573   #8179   #820   #7911   ",
	"reviewcount": "No Reviews",
	"description": "\r\nIn the Frontier County of Aulanthia of the Livitium Imperial Kingdom, there lives Princess Syltianna who is……so ugly, both in her face and in her personality. One day, Princess Syltianna, widely known with the name the Ragweed Princess of the Livitium Imperial Kingdom, is evicted by the First Queen Consort and killed in a dark forest inhabited by demon beasts. She is then saved by a passing witch, and upon her revival, she regains her memory of her previous life as a high school boy on Earth, and decides to live in the forest as the witch’s apprentice.\r\n\r\n“Nobles and whatnot are just a pain in the back, I’d rather live as a commoner,” she says, deciding to wash her hands off of it. Moreover, she goes the whole way to diet in between her devout training as a witch. She is supposed to live a quiet life, but after overachieving so many things, she brings her own downfall. She thinks to herself “Huh? What about my plan to live a life secretly like a weed in a forest?”\r\n\r\nThis is largely a heartwarming fantasy story. The characters are modeled after the familiar fairytale format, with princes, witches, and evil queens, but our MC is just too strong to be dealt with by any ordinary means.>"
}