{
	"url": "https://www.novelupdates.com/series/i-was-banished-because-the-hero-party-didnt-need-an-assassin-so-i-started-guarding-my-childhood-friend-the-second-princess/",
	"title": "I Was Banished Because the Hero Party Didn’t Need an Assassin, so I Started Guarding My Childhood Friend, the Second Princess! - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/07/I-was-banished-because-the-hero-party-didnt-need-an-assassin-so-I-started-guarding-my-childhood-friend-the-second-princess.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Comedy   Fantasy   Romance   Shounen   ",
	"tags": "Assassins   Bodyguards   Childhood Friends   Fantasy World   Hard-Working Protagonist   Male Protagonist   Protagonist Strong from the Start   R-15   Royalty   Underestimated Protagonist   ",
	"rating": "(3.0 / 5.0, 16 votes)",
	"author": "Eno   煙雨   ",
	"year": "\n2020",
	"ranking": "#2000   #2000   #7897   #1681   #7631   ",
	"reviewcount": "1 Review sorted by",
	"description": "'Noah’s presence may cause rumors to spread that are detrimental to the party, so I’m banishing him as of today.”\n\n“What? What do you mean?!”\n\nI’ve been devoted to this party until now. If someone was in danger, I would have risked my life to save them, and I would have taken on the role of the villain. That’s how much faith I had in this party.\n\nBut why?\n\nBecause assassins have a bad image? If that’s the case, all I have to do is work harder, right? And yet… Then Oliver, the hero, said, “You belong to a reputable household that directly supervises the funds of the royal family so I had no choice but to let you in. Besides, I’ve achieved my goal.”\n\nThat’s right. I was just used as a bridge for the country to provide financial support to the hero party. That’s not fair… As I was cowering in the square, my childhood friend and the second princess, Rubia Lorelei, made me a proposal.\n\n“Would you like to be my bodyguard?”\n\nThis encounter would change my life. Oliver didn’t realize it at the time\nhow much I’ve contributed to this party. That’s when the downfall of the heroic party began.>"
}