{
	"url": "https://www.novelupdates.com/series/rebirth-of-the-evil-mother-in-law/",
	"title": "Rebirth of the Evil Mother-In-Law - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/04/MIL_cover.jpg",
	"noveltype": "(CN)",
	"genre": "Drama   Fantasy   Supernatural   ",
	"tags": "Adopted Children   Adultery   Aristocracy   Arrogant Characters   Beautiful Female Lead   Betrayal   Black Belly   Boss-Subordinate Relationship   Bullying   Business Management   Businessmen   Calm Protagonist   Celebrities   Complex Family Relationships   Confident Protagonist   Cruel Characters   Cunning Protagonist   Debts   Determined Protagonist   Devoted Love Interests   Divorce   Economics   Family   Family Conflict   Famous Protagonist   Fast Learner   Female Protagonist   Handsome Male Lead   Hiding True Abilities   Late Romance   Magical Space   Manipulative Characters   Mature Protagonist   Modern Day   Multiple POV   Multiple Reincarnated Individuals   Nationalism   Past Plays a Big Role   Proactive Protagonist   Prophecies   Reincarnation   Revenge   Righteous Protagonist   Romantic Subplot   Schemes And Conspiracies   Second Chance   Single Parent   Tragic Past   Transmigration   Wealthy Characters   Younger Love Interests   ",
	"rating": "(4.1 / 5.0, 358 votes)",
	"author": "Zhái Miāo   宅喵   ",
	"year": "\n2020",
	"ranking": "#360   #1669   #142   #89   #422   ",
	"reviewcount": "101 Reviews sorted by",
	"description": "After dying alone in a mental institution, Fang Junrong discovered that she was the evil mother-in-law in a prominent family doting novel. Her daughter-in-law was the female lead who was loved by all.\n\nIn the novel, the female lead was kind and nice, and the male lead loved her so much that he’d die for her in a heartbeat.\n\nHer future father-in-law doted on her and treated her better than his own daughter.\n\nFang Junrong, the evil mother-in-law, was the only one who didn’t care for her. She had gotten the evil character’s script and wanted to set the female lead up every chance that she got and finally landed herself in the mental institution.\n\nAfter she was rebirthed and facing her son who wanted her blessings, Fang Junrong tore up the script. Whoever wanted the role of the evil mother-in-law could have it! She was going to get a divorce and take half of the money, then she’d figure out where she wanted to go from there alongside her daughter!>"
}