{
	"url": "https://www.novelupdates.com/series/as-long-as-you-have-the-shop-skill-the-dungeonized-world-is-a-breeze-the-bullied-youths-payback-lifestyle/",
	"title": "As Long as You Have the [Shop] Skill, the Dungeonized World Is a Breeze ~The Bullied Youth’s Payback Lifestyle~ - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/06/As-Long-as-You-Have-the-Shop-Skill-the-Dungeonized-World-Is-a-Breeze-The-Bullied-Youths-Payback-Lifestyle.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Fantasy   Harem   School Life   Shounen   ",
	"tags": "Adapted to Manga   Bullying   Cold Protagonist   Cooking   Cute Children   Determined Protagonist   Dungeons   Earth Invasion   Familiars   Fantasy Creatures   Fantasy World   Hiding True Identity   Magic   Male Protagonist   Modern Day   Multiple Identities   Overpowered Protagonist   R-15   Revenge   Special Abilities   Transformation Ability   Weak to Strong   ",
	"rating": "(2.7 / 5.0, 52 votes)",
	"author": "Juupon Sui   十本スイ   ",
	"year": "\n2020",
	"ranking": "#1171   #2189   #2667   #1050   #5551   ",
	"reviewcount": "13 Reviews sorted by",
	"description": "I, Bouchi Hiro, was ostracized by the entire school because I stood up against the student who held an absolute power in the school. But no matter what kind of bullying I received every day, I never yielded. Today as well, I was getting beaten up behind the school building. But at that moment, I heard the students screaming―That was the moment when the world was transformed.\n\nOn the school grounds, the students were being attacked and killed one after another by monsters that seemed to have come out from an RPG. Using this opportunity, I managed to escape and return home safely. Then at that time, I realized that I had a strange power dwelling inside me. A skill called “Shop”.\n\nAs long as I could pay for it, I have the ability to buy variety of items on Earth, and even fantasy items that couldn’t possibly exist on Earth. In this world, where humans were gradually being wiped out, I decided to make the most of my new skill to live a slow, comfortable life free of worries.\n\nIt was truly thrilling and delightful to see all the people whom hated and ostracized me being killed one after another because they didn’t have the power I did.\n\nThis is the payback story of a boy who was once bullied, and uses his skill to take advantage of those who are now left with nothing.>"
}