{
	"url": "https://www.novelupdates.com/series/duke-please-let-go-of-my-ankle/",
	"title": "Duke, Please Let Go of My Ankle! - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/09/Duke-Please-Let-Go-of-My-Ankle.jpeg",
	"noveltype": "(KR)",
	"genre": "Comedy   Fantasy   Romance   Shoujo   ",
	"tags": "Beautiful Female Lead   Contracts   European Ambience   Female Protagonist   Misunderstandings   Nobles   Reincarnated in Another World   Reincarnation   ",
	"rating": "(3.9 / 5.0, 11 votes)",
	"author": "제주감귤   ",
	"year": "\n2020",
	"ranking": "#6970   #2000   #10759   #7727   #7619   ",
	"reviewcount": "1 Review sorted by",
	"description": "\r\nI wrote a love letter and accidentally sent it to the wrong recipient.\r\n\r\nIn other words, I sent it to Duke Derek Fritt, who was called the 'Bloodbath of Criantes', and took first place in the war.\r\n\r\nThe man who's likely to break the bed on the first night of marriage.\r\n\r\nDuke! Please, please don't open it and return the letter!\r\n\r\n[(Exclusive) Duke of Fritt, 'Must find the person who wrote the letter.']\r\n\r\n[Breaking News] A public official wrote, \r\n'The criminal was very meticulous and manipulative and would pay the price of blood.']\r\n\r\nThe letter that should have been sealed finally became known to the world.\r\n\r\nBut… The guy who Audrey thought would kill her was a little weird?\r\nWhy are you wearing colorful clothes that you didn't even wear before, or say something I couldn't understand if it's a compliment or a murder-warning.\r\n\r\n'Your eyes look sharp like a sword.'\r\n\r\n'...what?'\r\n\r\n“It was a beautiful sword given by His Majesty before the war. Just as soon as the fly landed, it was sliced into two. It was a beautiful sword, but it turned red, stained with blood. No matter how much blood you wipe, it won't come off.'\r\n\r\n'!'\r\n\r\nAudrey's face turned white.\r\n\r\n'Does that mean you want to take my life with your sword?'\r\n\r\nThe confusing romance between the Duke of Fritt, and Audrey's fate sewn by a wrong letter.\r\n\r\n\r\n>"
}