{
	"url": "https://www.novelupdates.com/series/asteroid/",
	"title": "Asteroid - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/07/Asteroid.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Drama   Romance   Yaoi   ",
	"tags": "Adapted to Drama CD   Amnesia   Awkward Protagonist   Celebrities   Childhood Love   Cold Love Interests   Devoted Love Interests   Famous Protagonist   First Love   Flashbacks   Handsome Male Lead   Lovers Reunited   Misunderstandings   Modern Day   Music   Omegaverse   Popular Love Interests   Second Chance   Showbiz   Unconditional Love   ",
	"rating": "(4.2 / 5.0, 37 votes)",
	"author": "Wei Feng Ji Xu   微风几许   ",
	"year": "\n2019",
	"ranking": "#2071   #1717   #6904   #4194   #5317   ",
	"reviewcount": "8 Reviews sorted by",
	"description": "Xu Tangzhou lost his memory. He always dreamed of an unfamiliar Alpha who made his legs go weak, and his dreams caused one to be red in the face.\n\nOne day, he saw the Alpha he dreamed of on TV. Apparently, the other party was a huge celebrity called Ling Che.\n\nNot long after, he debuted and his manager said that he wanted to find someone to guide him.\n\nAfter meeting Ling Che, Xu Tangzhou’s facial expression was indifferent. “Oh.”\n\nXu Tangzhou’s inner thoughts: Ahhhhhhhhhh he’s so hot!\n\nFour years ago, Ling Che’s Omega disappeared overnight and thoroughly broke up with him.\n\nFour years later, Ling Che had already become the king of the music industry. He met the partner who was newly assigned to him by his company for a business couple.\n\nThat newcomer was called Xu Tangzhou.\n\nThe manager smiled obsequiously. “Our Zhou Zhou looks like a cold beauty but beneath the surface, he’s exceptionally pure.”\n\nLing Che coldly laughed. “You want me to guide him? Maybe in the next life.”\n\nThat night, the cold beauty that was exceptionally pure beneath the surface appeared in front of Ling Che’s room door.\n\nHe was clean and fresh, and he loosely wore a bathrobe with a wide collar.\n\nThe next day, the sweetest CP in the history of the entertainment industry was born.>"
}