{
	"url": "https://www.novelupdates.com/series/long-live-summons/",
	"title": "Long Live Summons! - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2016/09/Long-Live-Summons-1.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Comedy   Ecchi   Harem   Mature   Xuanhuan   ",
	"tags": "Adapted to Manhua   Alchemy   Arranged Marriage   Artifacts   Assassins   Battle Academy   Beast Companions   Beasts   Beautiful Female Lead   Broken Engagement   Charismatic Protagonist   Cold Protagonist   Confident Protagonist   Cultivation   Cunning Protagonist   Demon Lord   Demons   Dwarfs   Elves   Evolution   Fast Cultivation   F*llatio   Game Elements   Gods   Handsome Male Lead   Hard-Working Protagonist   Harem-seeking Protagonist   Hiding True Abilities   Human-Nonhuman Relationship   Love Interest Falls in Love First   Lucky Protagonist   Male Protagonist   Master-Servant Relationship   Money Grubber   Monster Girls   Monster Tamer   Monsters   Multiple Realms   Mysterious Past   Mythical Beasts   Older Love Interests   Perverted Protagonist   Pets   Philosophical   Polygamy   Romantic Subplot   Ruthless Protagonist   Secretive Protagonist   S*xual Cultivation Technique   Shameless Protagonist   S*aves   Special Abilities   Strength-based Social Hierarchy   Strong Love Interests   Sudden Strength Gain   Summoning Magic   Threesome   Transmigration   Transported to Another World   Trickster   Underestimated Protagonist   Wars   Weak to Strong   World Travel   ",
	"rating": "(3.8 / 5.0, 1542 votes)",
	"author": "Xia Fei Shuang Jia   霞飞双颊   ",
	"year": "\n2010",
	"ranking": "#3802   #4190   #54   #6030   #60   ",
	"reviewcount": "162 Reviews sorted by",
	"description": "The Soaring Dragon Continent is a world of summons, you can only become strong if you become a summoner! Yue Yang, an average high school boy, was suddenly kicked into this world. When he woke up, he was greeted with a lot of worried faces and found out that he had assumed another person’s identity. Turns out he’s the good-for-nothing third son of the Yue Family, who had just recently drowned himself because of a failed engagement. Unlike the third son of the Yue Family who was useless in summoning, Yue Yang succeeded in making a contract with a summoning grimoire on his first try, even when the other guy failed for the past fifteen years. Others would have a headache making contracts with beasts afterwards, but countless beasts tried to gain favour with Yue Yang instead, acting like a good kid before him.\n\n Yue Yang the brat, however, didn’t feel grateful at all: “Scram, Mythical Beasts! Do you think you are cool like that? Go away from me now, I only like beautiful summons!”\n\nEven when royal families approached him for his talents, the shameless brat replied, “I’m not interested in government stuff, I’m only interested in beauties!”>"
}