{
	"url": "https://www.novelupdates.com/series/bat/",
	"title": "Bat - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/09/Bat.jpeg",
	"noveltype": "(CN)",
	"genre": "Adult   Martial Arts   Wuxia   Yaoi   ",
	"tags": "Abusive Characters   Adapted to Drama CD   Adventurers   Ancient China   Antihero Protagonist   Betrayal   Black Belly   Calm Protagonist   Charming Protagonist   Clever Protagonist   Death   Death of Loved Ones   Determined Protagonist   Enemies Become Lovers   Family Conflict   Handsome Male Lead   Hidden Abilities   Hiding True Identity   Incest   Investigations   Manipulative Characters   Master-Disciple Relationship   Murders   Protagonist Strong from the Start   Ruthless Protagonist   Sadistic Characters   Schemes And Conspiracies   Secret Identity   Serial Killers   Skill Assimilation   Sword Wielder   Torture   Yandere   ",
	"rating": "(4.0 / 5.0, 30 votes)",
	"author": "Feng Nong   風弄   风弄   ",
	"year": "\n2005",
	"ranking": "#2000   #2000   #7634   #8532   #7022   ",
	"reviewcount": "2 Reviews sorted by",
	"description": "During Grand Elder Bai’s birthday banquet, the always mysterious Feng Long, the Alliance Leader of Wulin, came to personally offer his birthday wishes, making the old man brimming with smiles.\n\nWhen the distinguished guest graced everyone with his presence, the joyous atmosphere grew even stronger. Whilst the eyes of the crowd as well as their admiration and envy focused on the pride of Wulin, Feng Long’s eyes, instead fell upon the most inconspicuous corner of the birthday banquet. \n\n“I, Feng Long, am untalented. To think that there is such a handsome new talent in Wulin. May I ask this honorable friend for your name?”\n\nThe people from the Bai family secretly frowned. The guests in the hall were also distinguished and outstanding talents, why was it that the stain of the Bai Family, the most unloved by his father, the third young master of the Bai Family, who was not even allowed to learn the Bai family’s style of martial arts, had attracted the attention of the Alliance Leader, Feng Long?\n\nThis is the world-famous Bilu sword? \n\nAfter one meeting, Bai Shaoqing immediately came to a conclusion: this person was powerful, he should not stay any longer at the Bai Family Manor. Out of the thirty-six stratagems, fleeing was the best answer.>"
}