{
	"url": "https://www.novelupdates.com/series/rezero-kara-hajimeru-isekai-seikatsu/",
	"title": "Re:Zero Kara Hajimeru Isekai Seikatsu (LN) - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/03/ReZero-Kara-Hajimeru-Isekai-Seikatsu-LN.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Comedy   Drama   Fantasy   Psychological   Romance   Seinen   Tragedy   ",
	"tags": "Adapted to Anime   Adapted to Manga   Award-winning Work   Beastkin   Beautiful Female Lead   Caring Protagonist   Cruel Characters   Dark   Death   Demons   Depictions of Cruelty   Depression   Determined Protagonist   Discrimination   Dragons   Elves   Fantasy World   Gore   Maids   Male Protagonist   Manipulative Characters   Multiple Timelines   Mysterious Past   Naive Protagonist   Past Trauma   Racism   Resurrection   Royalty   Seven Deadly Sins   Strong Love Interests   Suicides   Sword And Magic   Time Loop   Time Manipulation   Time Travel   Torture   Tragic Past   Transported to Another World   Twins   Unlucky Protagonist   Weak Protagonist   Witches   ",
	"rating": "(4.3 / 5.0, 116 votes)",
	"author": "Nagatsuki Tappei   長月 達平   ",
	"year": "\n2012\r\n",
	"ranking": "#2000   #2000   #6895   #8230   #4115   ",
	"reviewcount": "5 Reviews sorted by",
	"description": "Suddenly a high school student Subaru Natsuki has been summoned to another world on the way back from the convenience store. With the biggest crisis of his life being summoned to another world and no sign of the one who summoned him things become worse when he is attacked.\n\nBut when he is saved by a mysterious silver-haired girl with a fairy cat, Subaru cooperates with the girl to return the favor. When they finally manage to get a clue Subaru and the girl are attacked and killed by someone.\n\nSubaru then awakens in the place he was summoned and notices the ability he gained “Returns by Death” a helpless boy that only has the ability to rewind time by dying. And beyond the despair can he save the girl from the fate of death!>"
}