{
	"url": "https://www.novelupdates.com/series/the-tyrants-beloved-doll/",
	"title": "The Tyrant’s Beloved Doll - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/05/fej428jkeQ_bettter_resolution.jpg",
	"noveltype": "(KR)",
	"genre": "Drama   Fantasy   Psychological   Romance   ",
	"tags": "Abandoned Children   Absent Parents   Abusive Characters   Adapted to Manhwa   Age Progression   Aristocracy   Beautiful Female Lead   Bookworm   Bullying   Character Growth   Child Abuse   Child Protagonist   Cold Love Interests   Complex Family Relationships   Couple Growth   Cruel Characters   Dark   Death   Death of Loved Ones   European Ambience   Fantasy World   Female Protagonist   Genius Protagonist   Handsome Male Lead   Heartwarming   Hiding True Abilities   Hiding True Identity   Honest Protagonist   Jealousy   Kingdoms   Magic   Maids   Male Yandere   Manipulative Characters   Military   Multiple POV   Multiple Timelines   Nobles   Obsessive Love   Politics   Rebellion   Reincarnation   Revenge   Royalty   Second Chance   Sharp-tongued Characters   Siblings Not Related by Blood   Slow Romance   Stockholm Syndrome   Strong Love Interests   Strong to Stronger   Time Loop   Wars   Weak to Strong   ",
	"rating": "(4.2 / 5.0, 263 votes)",
	"author": "Baek Yi Dam   백이들   ",
	"year": "\n2020",
	"ranking": "#1125   #861   #946   #1420   #412   ",
	"reviewcount": "35 Reviews sorted by",
	"description": "Her brother, who was the one who caused a coup d’etat, had sliced her throat. After she returned to the time before she died, she decided that she would somehow tame him and survive!\n\nBut..\n\nDid she tame him too much?\n\n***\n\n“Brother, why don’t you get married?”\n\nThere was no reply from him, instead the glass that he held popped and cracked.\n\n“Oh no! You’re bleeding.”\n\n“Why should I get married?”\n\n“Eh?”\n\n“I already have you.”\n\nWhy should you get married, you say? You have to get the Empress so I can leave this castle! Sezh laughed strangely.\n\n“Sezh.”\n\nAt that moment, she stumbled and Raytan pulled her body into his arms. His red eyes started to gleam suggestively while looking down at Sezh who was trapped in his arms.\n\n“You know we are not real siblings.”>"
}