{
	"url": "https://www.novelupdates.com/series/one-step-forward-to-the-flower-path/",
	"title": "One Step Forward to the Flower Path - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/01/One-Step-Forward-to-the-Flower-Path.png",
	"noveltype": "(KR)",
	"genre": "Drama   Fantasy   Psychological   Romance   Slice of Life   ",
	"tags": "Adapted to Manhwa   Ancient Times   Aristocracy   Beautiful Female Lead   Character Growth   Child Abuse   Cute Children   Doting Older Siblings   Doting Parents   Empires   European Ambience   Familial Love   Family   Female Protagonist   Heartwarming   Kingdoms   Multiple POV   Reincarnation   Second Chance   Siblings   Sibling's Care   Time Skip   Torture   Tragic Past   Unconditional Love   ",
	"rating": "(4.2 / 5.0, 58 votes)",
	"author": "Nokta   녹타   ",
	"year": "\n2019",
	"ranking": "#567   #6290   #5759   #7467   #4042   ",
	"reviewcount": "4 Reviews sorted by",
	"description": "I lived my whole life being used by other people and died at the age of 16. I thought it would be over like that, but when I opened my eyes again, I was back in the past. I thought I’d die while living the rest of my life in pain one more time.\n\nBut suddenly, a father who I had never seen before appeared before me. My dad, who I didn’t even know existed.\n\n“When are you going to take away my powers?”\n\nDante’s eyes shook greatly at Ivanna’s words.\n\n“Everyone did. You, when will you take it?”\n\n“…I won’t.”\n\n“Why?”\n\nIvanna couldn’t understand. Everyone coveted her power. Everyone wanted it, saying she was a sacrifice sent by God for humans.\n\n So why does he refuse?\n\n“No one will take your power now. No one will bother you. I’ll protect you.”\n\n“You’re trying to take my power.”\n\n“I’m not.”\n\n“Everyone said that and stole my power from me. They locked me up in prison.”\n\nIt was too cruel for a mere five-year-old to say. But the young Ivanna’s face had no emotion as if what she said was natural.\n\nDante’s heart eventually collapsed when he saw his daughter completely shattered.>"
}