{
	"url": "https://www.novelupdates.com/series/ive-transmigrated-into-this-movie-before/",
	"title": "I’ve Transmigrated Into This Movie Before - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/01/intothismobie.jpg",
	"noveltype": "(CN)",
	"genre": "Adult   Drama   Fantasy   Mystery   Psychological   Romance   Supernatural   Tragedy   ",
	"tags": "Acting   Beautiful Female Lead   Betrayal   Celebrities   Character Growth   Complex Family Relationships   Criminals   Cruel Characters   Death   Death of Loved Ones   Depictions of Cruelty   Determined Protagonist   Devoted Love Interests   Familial Love   Famous Parents   Famous Protagonist   Female Protagonist   Hard-Working Protagonist   Identity Crisis   Living Alone   Love Interest Falls in Love First   Love Rivals   Manipulative Characters   Modern Day   Movies   Multiple Realms   Mute Character   Mysterious Family Background   Mysterious Past   Mystery Solving   Naive Protagonist   Older Love Interests   Past Plays a Big Role   Past Trauma   Persistent Love Interests   Schemes And Conspiracies   Siblings   Thriller   Time Loop   Time Paradox   Time Travel   Torture   Transmigration   Unrequited Love   World Hopping   ",
	"rating": "(4.6 / 5.0, 305 votes)",
	"author": "Her Highness, Nightmare   梦魇殿下   ",
	"year": "\n2016",
	"ranking": "#509   #582   #1723   #1550   #1452   ",
	"reviewcount": "81 Reviews sorted by",
	"description": "– Question: “What is scarier than the personal experience of transmigrating into a horror movie?”\n\nAnonymous: “Transmigrating into a movie you’ve never seen before.”\n\n– “Poor comment! There’s nothing scary about that!”\n\nAnonymous reply: “You sure? Can you be sure your dad isn’t a murderer? Can you be certain your spouse isn’t out to kill you for insurance money? Can you even be certain there isn’t any hidden lethal weapon in your son’s lunchbox? The scariest thing is that you have never seen this movie before so, you have absolutely no idea of any ‘surprise’ that awaits you ahead!”\n\nHence, this novel is also called [’surprise’ that awaits you].>"
}