{
	"url": "https://www.novelupdates.com/series/isekai-shoukan-wa-nidome-desu/",
	"title": "Isekai Shoukan wa Nidome Desu - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2017/02/meh2.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Fantasy   Harem   Mature   Psychological   Romance   Shounen   ",
	"tags": "Abusive Characters   Adapted to Anime   Adapted to Manga   Apathetic Protagonist   Beastkin   Betrayal   Bullying   Childhood Friends   Demon Lord   Demons   Dragons   Dungeons   Former Hero   Goddesses   Godly Powers   Heroes   Knights   Lazy Protagonist   Male Protagonist   Masochistic Characters   Multiple POV   Multiple Transported Individuals   Overpowered Protagonist   Past Plays a Big Role   Polygamy   Protagonist Strong from the Start   Reluctant Protagonist   Royalty   Sadistic Characters   Special Abilities   Sword And Magic   Transported to Another World   Underestimated Protagonist   Wars   Yandere   ",
	"rating": "(3.4 / 5.0, 354 votes)",
	"author": "Kishimoto Kazuha   岸本 和葉   ",
	"year": "\n2015",
	"ranking": "#3802   #4157   #598   #2726   #326   ",
	"reviewcount": "33 Reviews sorted by",
	"description": "As the world of 〈Eclair〉is in danger as the war between the Human, Beastman and Demon race is being waged, a man was summoned to save the world, and he indeed save the world according to his mission, and returns to the Human Country. However, what was waiting for him was the trap of the Human King, who was afraid that the Hero who acquired power would take his position. Trapped, the Hero was put under transfer magic, being born again as a baby in modern times.\n\n16 years later, he spent his high school life under the name Suzaki Setsu. He continued looking for a method to return to the different world again, even if he is bullied for beeing gloomy guy who always reads books, he continued looking for it non-stop.\n\nBut suddenly he once again stepped on the soil of the different world. Summoned by the hero summon of the Human country……..this time along with his classmates.\n\n“War again? Sounds troublesome, don’t wanna.”\n\nFortunately, he was summoned to the different world of 5 years later, slipping out of the Human country, he decided to meet people such as the good old Demon King and the Beast King.\n\nHowever he keeps on getting caught up in nasty plot, this is the story of the former hero who doesn’t have the motivation.>"
}