{
	"url": "https://www.novelupdates.com/series/a-neets-guide-to-the-parallel-world-healer-the-strongest-cheat/",
	"title": "A NEET’s Guide to the Parallel World: Healer, the Strongest Cheat? - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/11/bqdh3o43ht1tijsel6mb72ykcbn0_89s_kr_to_5u94.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Drama   Fantasy   Harem   Tragedy   ",
	"tags": "Ability Steal   Adapted to Manga   Adventurers   Anti-social Protagonist   Antihero Protagonist   Assassins   Beasts   Brainwashing   Bullying   Cheats   Corruption   Death of Loved Ones   Demi-Humans   Depictions of Cruelty   Dishonest Protagonist   Divine Protection   Dungeons   Elemental Magic   Emotionally Weak Protagonist   Eye Powers   Fantasy Creatures   Fantasy World   Game Elements   Guilds   Healers   Knights   Lack of Common Sense   Level System   Magic   Magic Beasts   Magic Formations   Male Protagonist   Mind Control   Monsters   Multiple Transported Individuals   Mythical Beasts   Naive Protagonist   Nobles   Overpowered Protagonist   Past Plays a Big Role   Past Trauma   Poisons   Polygamy   Reincarnated in Another World   Revenge   Royalty   Ruthless Protagonist   Schemes And Conspiracies   Selfish Protagonist   Skill Assimilation   Skill Creation   Special Abilities   Sudden Strength Gain   Suicides   Summoning Magic   Sword And Magic   Sword Wielder   Torture   Transported to Another World   Twisted Personality   Underestimated Protagonist   Weak to Strong   ",
	"rating": "(2.6 / 5.0, 173 votes)",
	"author": "Jyouryuu Romero   蒸留ロメロ   ",
	"year": "\n2018",
	"ranking": "#3314   #6317   #932   #662   #1394   ",
	"reviewcount": "49 Reviews sorted by",
	"description": "Right after jumping off the roof Masamune was caught up in his classes transition to a new world. \r\n\r\nA throne hall.\r\n\r\nThe students had all received high-class jobs such as Sage or hero. Except for Masamune, who became a healer, the weakest known occupation. \r\n\r\nCursed at and called incompetent, he alone is banished. After wondering the darkness, Masamune who received the skill [mischief inversion {extreme}] through inverting the healing magic gained the ominous magic [Encroachment Wave].\r\n\r\nNow the strongest, Masamune swore his revenge.\r\n\r\nDemons and the white cat tribe, precious companions he met on his journey. Together they explore the new world.>"
}