{
	"url": "https://www.novelupdates.com/series/rebirth-to-eighties-the-villains-mother-raises-her-cubs-daily/",
	"title": "Rebirth to Eighties: The Villain’s Mother Raises Her Cubs Daily - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/08/Rebirth-to-eighties-The-Villains-Mother-Raises-Her-Cubs-Daily.png",
	"noveltype": "(CN)",
	"genre": "Drama   Fantasy   Romance   ",
	"tags": "Beautiful Female Lead   Childcare   Complex Family Relationships   Cooking   Cute Children   Devoted Love Interests   Fat to Fit   Female Protagonist   Handsome Male Lead   Hard-Working Protagonist   Late Romance   Love Interest Falls in Love First   Medical Knowledge   Merchants   Smart Couple   Time Travel   Transmigration   Ugly to Beautiful   ",
	"rating": "(2.0 / 5.0, 22 votes)",
	"author": "Yu Ren Mei   虞人美   ",
	"year": "\n2021",
	"ranking": "#2000   #2391   #7589   #10271   #8201   ",
	"reviewcount": "8 Reviews sorted by",
	"description": "Jiang Ran, a heir to a family of traditional Chinese medicine, has developed new medicines and won numerous awards, but what she wanted was cooking and eating delicacies.\n\nAfter years of diligence, Jiang Ran finally won the National Food Contest, but she transmigrated into a book. She was divorced by the male protagonist of  the book and eventually died on the street.\n\nThe original owner in the book has fat head and big ears, oily pox on the face, lazy and selfish.\n\nBefore she divorce by the male lead, she bullied the male lead’s parents, siblings, and after the divorce, took their son to the streets.\n\nJiang Ran who transmigrated in the book: “…”\n\nSo…\n\nJiang Ran transmigrated in the book.\n\nIn order to avoid tragic death on the street, she cook food, open restaurants, save people diligently, and treat more illnesses.\n\nShe paid off the money that the original owner owed to her in-laws and raised the son who would become the villain in the original book.\n\nAs for the husband?\n\n“When will you come back, and ask for a divorce!”\n\nMale protagonist: \n\nPei Huai is about to graduate and is going to go home.\n\nBut he found that the content of the letter sent by his younger brother and sister had changed recently.\n\nBrother: Sister-in-law cooks so delicious! Like sister-in-law!\n\nSister: The clothes made by my sister-in-law are so beautiful! Like sister-in-law!\n\nPei Huai felt that things were not like it should be, so he decided to go home and have a look.\n\nAs soon as I entered the house, he faced a bright and beautiful face: “Husband is back? Did you come back for a divorce?”\n\nPei Huai said shamelessly: No, I am not!>"
}