{
	"url": "https://www.novelupdates.com/series/salted-fish-doesnt-want-to-inherit-hundred-of-billion-property/",
	"title": "Salted Fish Doesn’t Want to Inherit Hundred of Billion Property - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/08/Salted-Fish-Doesnt-Want-to-Inherit-Hundred-of-Billion-Property.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Fantasy   Romance   Shounen Ai   Slice of Life   ",
	"tags": "Business Management   Businessmen   Economics   Handsome Male Lead   Love Interest Falls in Love First   Loyal Subordinates   Lucky Protagonist   Misunderstandings   Modern Day   Pets   Transmigration   Wealthy Characters   ",
	"rating": "(4.2 / 5.0, 14 votes)",
	"author": "刺猬的糖果摊   ",
	"year": "\n2020",
	"ranking": "#3017   #1124   #10107   #7143   #9279   ",
	"reviewcount": "2 Reviews sorted by",
	"description": "Qing Qin dressed as the cannon fodder character with the same name in the book, is an unlucky man who was imprisoned for a major accident after inheriting the richest man’s family business.\n\nNow, he is about to start the first round of investment competition.\n\nThe winner of the competition will inherit the richest man’s 100 billion family business and embark on the road of cannon fodder, while the loser gets 10 million, which was enough for him to enjoy himself.\n\nQing Qin: “Okay, 1 million loses 1 million, and 10 million loses 10 million. If I don’t lose the game, I will be a dog!”\n\nSeven years later.\n\nQing Qin is worth 100 billion yuan and is listed on the Forbes Rich List.\n\nThe former richest man burst into tears: “I now understand why you refused to compete to be heir in the first place. Even without the protection of your parents, you can create a business empire alone!”\n\nThe protagonist confessed to the media: “With all the properties under Lou’s family as a gift. I hope you can agree to my pursuit.”\n\nQing Qin looked up at the sky and sighed. He could only write sadly in his autobiography: “Really, I didn’t think about making money at first…” \n\nThis book became a bestseller. Netizens are happy to play along– \n\n“Actually, I don’t plan to make money.”\n\n“It’s not that I make money, but that money put itself into my arms.”\n\n“Damn money, go away!”>"
}