{
	"url": "https://www.novelupdates.com/series/paradise-of-demonic-gods/",
	"title": "Paradise of Demonic Gods - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2016/09/c75c10385343fbf26247185ab87eca8065388f64.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Fantasy   Martial Arts   Tragedy   Xuanhuan   ",
	"tags": "Academy   Accelerated Growth   Apathetic Protagonist   Arrogant Characters   Betrayal   Blind Protagonist   Calm Protagonist   Cold Protagonist   Determined Protagonist   Discrimination   Enemies Become Allies   Evil Gods   Famous Protagonist   Game Elements   Genius Protagonist   Handsome Male Lead   Hard-Working Protagonist   Level System   Limited Lifespan   Loner Protagonist   Male Protagonist   Modern Day   Monsters   Overpowered Protagonist   Personality Changes   Politics   Revenge   Ruthless Protagonist   Special Abilities   Strength-based Social Hierarchy   Stubborn Protagonist   Sword Wielder   Torture   Transported to Another World   Underestimated Protagonist   Wars   Weak to Strong   ",
	"rating": "(3.7 / 5.0, 472 votes)",
	"author": "Bear Wolfdog   熊狼狗   ",
	"year": "\n2016",
	"ranking": "#2000   #2000   #104   #784   #754   ",
	"reviewcount": "58 Reviews sorted by",
	"description": "“Obtaining the topmost degree of talent in sword arts in the world requires giving up 72 years of lifespan, which leaves you with only five more years of your life. At the same time, you will never be able to feel love, kinship, and friendship, and you’ll end up leading a lonely life until your death, unable to procreate, or to have any descendants.\r\n\r\n“From now onwards, everything related to happiness in the human world shall no longer be of your concern. Are you willing to accept this?”\r\n\r\n“Hahahaha, I’m already alone bereft of all support, my hopes dashed to pieces, shouldering only absolutely irreconcilable grudge and hatred, why would I disagree? Why would I not want it? I couldn’t ask for anything better!!”\r\n\r\nHis sword sweeps across the Divine Continent for seven days and nights, moving 90,000 miles through the starry skies, unhindered.\r\n\r\nHe slays saints and buddhas in Heaven, slaughters demons and devils in Hell, sweeping away all the grievances in his heart!>"
}