{
	"url": "https://www.novelupdates.com/series/the-princess-doesnt-want-to-marry-her-ideal-type/",
	"title": "The Princess Doesn’t Want To Marry Her Ideal Type - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/11/The-Princess-Doesnt-Want-To-Marry-Her-Ideal-Type.jpg",
	"noveltype": "(KR)",
	"genre": "Fantasy   Romance   Shoujo   ",
	"tags": "Adapted to Manhwa   Aristocracy   Beautiful Female Lead   Empires   Female Protagonist   Handsome Male Lead   Marriage   Nobles   ",
	"rating": "(3.0 / 5.0, 3 votes)",
	"author": "Ranov   라노브   ",
	"year": "\n2020",
	"ranking": "#2000   #2000   #12454   #10477   #10127   ",
	"reviewcount": "1 Review sorted by",
	"description": "“My youngest daughter.”\r\n\r\n“Yes, Father.”\r\n\r\n\r\n\r\n“This Father swears. That at any cost I’ll find your particular, complicated, and confusing ideal type!”\r\n\r\n“Yes, Father.”\r\n\r\nThe third Princess Kiriel Empirion of the empire’s greatest knight family Empirion, while responding without interest, thought, ‘As if a person like that would exist when in the first place I made up that ideal type because I don’t want to get married’.\r\n\r\nBut Kiriel overlooked two things.\r\n\r\nThe first, her romantic father, if it’s about his children, his spirit blazes with passion, and the second, in Condition 3, she didn’t write exactly what kind of talent he must posses.\r\n\r\n“My youngest! This Father of yours! Finally in 10 years! Your ideal type! I found them of course!”\r\n\r\nAt that, “Almost 300 years ago in the holy war! Although he’s a sorcerer, who were the enemy of knights!”\r\n\r\n“I’m going to go lose my mind.”\r\n\r\n“Huh?”\r\n\r\n“Nothing.”\r\n\r\nThe mess that I made, I have to clean it up,.\r\n\r\n“Relel, relellellou.”\r\n\r\n“It’s read Edwin Solitaire Re-li-gie-use”\r\n\r\n“Relige… Anyways, why are you in here?!”\r\n\r\nFirst, I need to chase out that person with the hard name. The story of a woman who asked for a fake ideal type, and a man who is pretending to be that fake ideal type.>"
}