{
	"url": "https://www.novelupdates.com/series/reasons-to-protect-the-witchs-son/",
	"title": "Reasons to Protect the Witch’s Son - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/12/Reasons-to-Protect-the-Witchs-Son.jpeg",
	"noveltype": "(KR)",
	"genre": "Action   Adventure   Fantasy   Romance   Shoujo   ",
	"tags": "Abandoned Children   Adopted Protagonist   Ancient Times   Beautiful Female Lead   Clever Protagonist   Fantasy World   Female Protagonist   Handsome Male Lead   Kingdoms   Knights   Love Interest Falls in Love First   Magic   Nobles   Power Couple   Protagonist Strong from the Start   Royalty   Second Chance   Strong Love Interests   Time Skip   Witches   ",
	"rating": "(4.3 / 5.0, 15 votes)",
	"author": "Yeon Ryeoha   연려하   ",
	"year": "\n2020",
	"ranking": "#2000   #2000   #9496   #5641   #5873   ",
	"reviewcount": "1 Review sorted by",
	"description": "The witch who had massacred thousands of people and destroyed the capital of the kingdom.\nElaine was considered a dear family to the witch.\n\nBut that night, a tragedy happened.\nElaine loses everything and wakes up to the world 20 years later.\nPossessing the witch’s heart in her chest.\n\n‘Please protect him and my child...Lichst.’\n\nIt was the witch’s last request.\nShe set out to find Lichst to protect him and fulfill her promise, but the young and innocent child had become a stony, cold-hearted man.\n\nA pair of purple eyes stared at her dryly.\n\n”Sir Elaine, was it?”\n“I advise you in advance, you’d better give up.”\n\nHowever, Elaine draws her sword to keep her promise and seek revenge.\nBefore Elaine, the truth about the witch’s death begins to unravel… \n\n***\n\nA glimpse of annoyance showed in Lichst’s eyes.\n\n“Sir Elaine, what are you doing?”\n“Oh, well, the lid looks a bit sharp.”\n“...I can open the lid myself.”\n\nThe faces of the knights around them were struck with amazement.\nShe dares treat the Duke of Killiard, the best knight in the kingdom, a man who is compared to the sharpest blade, like a child.\nThe knights thought in unison.\n\n‘That woman, she’s not ordinary!’\n>"
}