{
	"url": "https://www.novelupdates.com/series/epoch-of-twilight/",
	"title": "Epoch of Twilight - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2017/05/Epoch-of-Twilight.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Fantasy   Harem   Martial Arts   Mature   Mystery   Romance   Sci-fi   Supernatural   Tragedy   ",
	"tags": "Aliens   Apocalypse   Artifact Crafting   Beast Companions   Beasts   Beautiful Female Lead   Betrayal   Calm Protagonist   Cautious Protagonist   Character Growth   Charismatic Protagonist   Clever Protagonist   Dark   Determined Protagonist   Early Romance   Evolution   Firearms   Game Elements   Genetic Modifications   God Protagonist   Gore   Handsome Male Lead   Level System   Loli   Male Protagonist   Mature Protagonist   Military   Modern Day   Monster Tamer   Monsters   Mutated Creatures   Mutations   Overpowered Protagonist   Polygamy   Post-apocalyptic   Pragmatic Protagonist   Pregnancy   Psychic Powers   R*pe   Ruthless Protagonist   Saving the World   Special Abilities   Survival   Sword Wielder   Threesome   Weak to Strong   ",
	"rating": "(3.1 / 5.0, 465 votes)",
	"author": "Don't Play People for A Fool   人勿玩人   ",
	"year": "\n2016",
	"ranking": "#2000   #6245   #350   #1027   #1326   ",
	"reviewcount": "74 Reviews sorted by",
	"description": "Have you ever thought that the state of the world as it presently is, could revert to the laws of the ancients? When a series of strange incidents beginning with the disappearance of his friend led Luo Yuan to question the possibility of an apocalypse, he becomes embroiled in the midst of a global-scale chaos.\n\nEvolution has turned the flora and fauna of the vast and bountiful Earth into something that had never been seen before. Coincidentally, the all-dominating Homo sapiens have ended up at the bottom of the food chain. From mystery to crisis, will Luo Yuan discover a means of saving humanity by racing to the top of the food chain? Or will he strive in accordance with the law of the jungle? It is the dawn of an age of the survival of the fittest.>"
}