{
	"url": "https://www.novelupdates.com/series/villains-sick-beauty-sister/",
	"title": "Villain’s Sick Beauty Sister - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/03/Villains-Sick-Beauty-Sister.jpg",
	"noveltype": "(CN)",
	"genre": "Josei   Romance   School Life   Slice of Life   ",
	"tags": "Adopted Children   Amnesia   Artists   Beautiful Female Lead   Bickering Couple   Books   Bullying   Character Growth   Cold Love Interests   Cold Protagonist   Complex Family Relationships   Female Protagonist   Handsome Male Lead   Misunderstandings   Modern Day   Possessive Characters   Reincarnation   Shy Characters   Siblings Not Related by Blood   Sickly Characters   Slow Romance   Transmigration   Tsundere   Twins   Weak Protagonist   ",
	"rating": "(3.8 / 5.0, 46 votes)",
	"author": "Wu Xia Song   雾下菘   ",
	"year": "\n2019",
	"ranking": "#5262   #6161   #5046   #5808   #4279   ",
	"reviewcount": "13 Reviews sorted by",
	"description": "Lu Nian transmigrated into the book, through the story she became a sickly woman with inconsequential role in the plot.\n\nThe Eldest lady of the wealthy Lu family the poor and sick beauty Lu Nian, the little cannon fodder who died within a few chapters in the original plot, but unfortunately, in order to assist the eldest lady, the Lu family took back a fake brother from the orphanage when she was young. His name is Elder brother, in fact, he is the servant of the eldest lady. He has a low status in the Lu family and is as humble as a dog. Anyone can beat and scold him.\n\nOnce Lu Nian transmigrated, she saw the pale and handsome young man stepped under her feet in front of her. His eyes were gloomy and cold, staring at her not far away. Lu Nian shivered when she heard his name. Qin Si?\n\nIsn’t this what the last biggest villain in the book looked like when he was a teenager?\n\nThe last man in power of the Lu family was cold and uncaring, vicious, and overwhelmingly powerful. He took revenge one by one for the crimes he suffered when he was young, and he almost died in the hand of the male protagonist.\n\nShe was so scared to death that she decided to treat him well in her next limited life, hoping that he would save at least one dog’s life after he blackened.\n\nQin Si never thought that one day he would be able to receive the gentleness from her fingers.\n\nThe delusion that secretly grew, once came true, as long as she looked at him more and smiled at him, he could do nothing and give her life.>"
}