{
	"url": "https://www.novelupdates.com/series/shan-you-mu-xi/",
	"title": "Shan You Mu Xi - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/07/Shan-You-Mu-Xi.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Drama   Historical   Martial Arts   Mature   Mystery   Slice of Life   Yaoi   ",
	"tags": "Adapted to Drama CD   Age Progression   Ancient China   Assassins   Brother Complex   Brotherhood   Character Growth   Charismatic Protagonist   Clever Protagonist   Coming of Age   Complex Family Relationships   Couple Growth   Court Official   Death of Loved Ones   Doting Love Interests   Empires   Fast Learner   Generals   Genius Protagonist   Handsome Male Lead   Hard-Working Protagonist   Mysterious Family Background   Near-Death Experience   Orphans   Poisons   Politics   Power Couple   Power Struggle   Proactive Protagonist   Royalty   Schemes And Conspiracies   Secret Identity   Strategic Battles   Strategist   Strong Love Interests   Unrequited Love   Wars   ",
	"rating": "(4.2 / 5.0, 13 votes)",
	"author": "Fei Tian Ye Xiang   非天夜翔   ",
	"year": "\n2020",
	"ranking": "#4617   #4677   #10673   #10270   #10682   ",
	"reviewcount": "2 Reviews sorted by",
	"description": "'There are trees in the mountains and there are branches on the trees,\n\nI adore you, oh! You do not know.'\n\n~From Song of the Yue Boatman\n\n—\n\nHundreds of rivers converge, the thousand-mile rise of Taishan’s bluffs, and a myriad of waves surge in the Eastern Sea.\n\nAll beneath the heavens, is the extent of the ruler’s land. All within the territory of a state, are each the ruler’s subjects. \n\nBeacons light up all over the Divine Land, danger lurks in every corner of the State of Yong.\n\nAfter reuniting with Geng Shu, Jiang Heng begins to put all his effort into assisting the ruler of Yong State’s plans, but he unexpectedly falls into perilous situations time and time again. Geng Shu, who always accompanied Jiang Heng by his side, is acutely aware that the various mishaps all appear to be closely related to Jiang Heng’s past—was Jiang Heng really his own blood-related younger brother?\n\nThese two extraordinary young men wander throughout the country from state to state, experiencing trials, however, the truth obtained uncovered a cruel and unexpected past that couldn’t be erased. The lingering heroic spirits each possess their own unfulfilled long-cherished wishes. With the great Divine Land finally unified, how would they confront their own choices of the future?\n\nThe seven stars of the Northern Sky bore witness to the end of a stormy period of history; until the ruins once again transform into the richly ornamented tall towers of a manor.\n\nWhen the blazing city lights languidly flicker, those people and events worth engraving into memory, will forever be preserved within every stroke of ink in a painting of this vast expanse of rivers and mountains.>"
}