{
	"url": "https://www.novelupdates.com/series/death-is-the-only-ending-for-the-villain/",
	"title": "Death Is The Only Ending For The Villain - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/08/악역의_엔딩은_죽음뿐_최종720x1098.jpg",
	"noveltype": "(KR)",
	"genre": "Drama   Fantasy   Josei   Mature   Psychological   Romance   Tragedy   ",
	"tags": "Abandoned Children   Absent Parents   Abusive Characters   Acting   Adapted to Manhwa   Adapted to Visual Novel   Adopted Children   Adopted Protagonist   Antihero Protagonist   Aristocracy   Arrogant Characters   Beautiful Female Lead   Betrayal   Calm Protagonist   Child Abuse   Clever Protagonist   Cold Love Interests   Cold Protagonist   Complex Family Relationships   Cruel Characters   Demons   Determined Protagonist   Devoted Love Interests   European Ambience   Evil Religions   Family Conflict   Famous Protagonist   Female Protagonist   Game Elements   Handsome Male Lead   Jealousy   Kingdoms   Magic   Male Yandere   Manipulative Characters   Mind Control   Nobles   Obsessive Love   Otome Game   Past Plays a Big Role   Past Trauma   Persistent Love Interests   Possessive Characters   Psychopaths   Quiet Characters   Reincarnated in a Game World   Royalty   Schemes And Conspiracies   Siblings Not Related by Blood   Sister Complex   S*aves   Smart Couple   Strong Love Interests   Tragic Past   Transmigration   Transported into a Game World   Twisted Personality   Villainess Noble Girls   Wealthy Characters   Yandere   ",
	"rating": "(4.1 / 5.0, 703 votes)",
	"author": "권겨을   ",
	"year": "\n2019",
	"ranking": "#1732   #568   #540   #1314   #72   ",
	"reviewcount": "180 Reviews",
	"description": "I’ve reincarnated as the reverse harem game’s villainess, the one and only adopted daughter of the ducal Eckart family.\n\nBut the difficulty just has to be the worst!\n\nEverything I do will only lead me to death.\n\nI must be paired with one of the main male characters from the heroine’s harem before the ‘real daughter’ of the duke family appears!\n\nTwo older brothers who always pick a fight with me on every little thing.\n\nThe insane crown prince whose route will always lead to my death.\n\n‘I only see the heroine and no one else’s wizard, and also her loyal s*ave knight, too!\n\n‘First, let’s take some of them which I see no hope in, out of the list!’\n\n“I didn’t know my place up until now. From now on, I’ll live as quiet as a mouse so you wouldn’t care the slightest bit!\n\nBut why do their interests in me keep on rising every time I draw the line?!>"
}