{
	"url": "https://www.novelupdates.com/series/can-i-not-marry/",
	"title": "Can I Not Marry - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2015/12/cannotmarry.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Drama   Romance   Shoujo   ",
	"tags": "Female Protagonist   Forced Living Arrangements   Forced Marriage   Handsome Male Lead   Love Interest Falls in Love First   Marriage of Convenience   Modern Day   Naive Protagonist   Weak Protagonist   Wealthy Characters   ",
	"rating": "(3.8 / 5.0, 149 votes)",
	"author": "Yi Jin   忆锦   ",
	"year": "\n2009",
	"ranking": "#2000   #2000   #4386   #3856   #2639   ",
	"reviewcount": "17 Reviews sorted by",
	"description": "In the past when someone mentioned getting married, Du Lei Si (Durex) would feel fearful enough to flee.\n\nWhat is so good about getting married? Organizing a wedding ceremony is akin to spending money like running water. After giving birth, you must also raise the child. If you don’t maintain yourself well, you will get out of shape.\n\nAs a result, maybe a vixen will grab your husband and take your baby away.\n\nNot getting married! Definitely not getting married!\n\nHowever, fate is like this. Whatever you are afraid of, unfortunately, it will be given to you.\n\nI was walking on the street, minding my own business, yet, impossibly, I encountered a stranger proposing marriage. He placed a dazzling diamond ring right in front of me. This handsome guy knelt down on one leg and looked at me with such a sincere expression: “Miss, would you please marry me?”\n\nThis, isn’t this like some drama?\n\nAfter pondering over it, I decided that this surely must be a stunt from some television station’s new program. Invite a celebrity to pretend to be a passer-by who proposes marriage. This year, with the economic crisis, being a producer is not easy.\n\nThus, out of kindness, I accepted the diamond ring. Only to find out that all of this was actually real! The diamond ring is really and truly a genuine diamond from South Africa. Moreover, the groom is also a genuine rich man!\n\nActually, wasn’t this just like the legend of marrying into a rich and powerful family? I always feel that in front there is the belly black President who is like a ruthless wolf watching me attentively, and if I am not careful, he will tear me apart and swallow me into his belly. Whereas behind there is the crowd who do not know the truth, standing in a circle and watching as the drama unfolds. I still have not explained clearly but Mrs. President’s fame has already spread quickly from mouth to mouth.\n\nThis time, Du Lei Si really feels regret.\n\nWho can tell me, can I not marry ah?>"
}