{
	"url": "https://www.novelupdates.com/series/rebirth-the-gold-master-cultivation-program/",
	"title": "Rebirth: The Gold Master Cultivation Program - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/07/Rebirth-The-Gold-Master-Cultivation-Program.jpg",
	"noveltype": "(CN)",
	"genre": "Fantasy   School Life   Yaoi   ",
	"tags": "Abusive Characters   Cold Protagonist   Fat Protagonist   Handsome Male Lead   Hard-Working Protagonist   Modern Day   Reincarnation   Second Chance   ",
	"rating": "(3.5 / 5.0, 4 votes)",
	"author": "今日元旦   ",
	"year": "\n2022",
	"ranking": "#2000   #2000   #13461   #13810   #13349   ",
	"reviewcount": "No Reviews",
	"description": "In his previous life, Fang Cheng's father died and his mother was seriously ill. In order to save his mother, he was willing to sell his body and became a canary raised by the president.\r\n\r\n \r\n\r\nThe President was gentle and fragile, and he couldn't help but fall into it.\r\n\r\nThe contract expired and the two broke up.\r\n\r\nThe president committed suicide on the 50th day after the breakup.\r\n\r\n\r\n\r\nThe secretary said:\r\n\r\n'Someone told Mr. He: 'Love has the power to destroy and save a person.''\r\n\r\n'President He wanted to try it.'\r\n\r\n'He didn't want to live for a long time.'\r\n\r\n'He wasn't interested in everything, he felt there was no happiness and sadness, no satisfaction and disappointment.'\r\n\r\n'He didn't fall in love with you, so don't be sad.'\r\n\r\n'This so-called nurturing love was just his last self-help for himself. When he felt disappointed with the world, it didn't matter if you compromised.'\r\n\r\nAnd Fang Cheng, who was left behind, didn't even have the qualifications to be sad.\r\n\r\n\r\n\r\nFang Cheng was reborn.\r\n\r\nHe exhausted all means and rushed towards He Yu full of blood.\r\n\r\nTransferred to his school, broke into his life, and returned all the tenderness and tolerance he received from him in his previous life hundreds of times.\r\n\r\nBut the young He Yu was so gloomy, silent, and lifeless.\r\n\r\n- How can I keep you?\r\n\r\n- This time, will you fall in love with me?\r\n\r\n- Please, fall in love with me.\r\n\r\n\r\n\r\nHe Yu's eyes were really beautiful, amber with a green tone, like the leaves of early autumn wrapped in ice, clear and translucent.\r\n\r\nHe was staring at Fang Cheng with such a pair of eyes, completely ignoring the other's red ears, and asked solemnly, 'Can I solve the 'equation' today?'\r\n\r\n>"
}