{
	"url": "https://www.novelupdates.com/series/underneath-the-bandages-you-are-prettier-than-anyone/",
	"title": "Underneath The Bandages, You Are Prettier Than Anyone - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/02/Underneath-The-Bandages-You-Are-Prettier-Than-Anyone.jpg",
	"noveltype": "(JP)",
	"genre": "Comedy   Ecchi   Romance   School Life   ",
	"tags": "Beautiful Female Lead   Bullying   Childhood Friends   Childhood Love   Cohabitation   Devoted Love Interests   Early Romance   First Love   Heartwarming   Kind Love Interests   Love Interest Falls in Love First   Love Triangles   Male Protagonist   Modern Day   Past Plays a Big Role   Popular Love Interests   R-15   Strong Love Interests   ",
	"rating": "(3.5 / 5.0, 56 votes)",
	"author": "Sora Chiaki   そらちあき   ",
	"year": "\n2022",
	"ranking": "#6970   #1184   #3738   #4387   #5324   ",
	"reviewcount": "2 Reviews sorted by",
	"description": "At Haru Hinakura’s elementary school, there was a girl with bandages wrapped around her face—Her name was Yuki.\r\n\r\nNo one at their elementary school had ever seen Yuki’s face under the bandages, and finding that sight disgusting, they repeatedly bullied her in insidious ways. Then Haru rescued her, and their relationship began that day.\r\n\r\nHe became Yuki’s first friend, protecting her from the bullies around them, as she relied upon and missed him profoundly. They played together every day, and love gradually sprouted between the two. Unfortunately, the day they had to part ways suddenly came—They found a hospital that could treat Yuki in a distant foreign country.\r\n\r\nThe two vowed to meet again, and even though they had separated, they continued to love each other. Several years later, they finally met again. On the day of the high school entrance ceremony, Yuki appeared in front of Haru once more, this time without bandages.\r\n\r\nUnderneath the gauze, her true face, once wrapped, could be seen for the first time—She was as beautiful as an angel.\r\n\r\nIn the years they’ve been apart, Haru would come to realize just how strong Yuki’s feelings had become. Their following days dripped in sweet honey, as she repays the kindness Haru has always given her.>"
}