{
	"url": "https://www.novelupdates.com/series/alice-san-wa-template-o-shiranai/",
	"title": "Alice-san wa Template o Shiranai - Novel Updates",
	"image": "https://www.novelupdates.com/img/noimagefound.jpg",
	"noveltype": "(JP)",
	"genre": "Adventure   Comedy   Drama   Fantasy   Shoujo Ai   Slice of Life   ",
	"tags": "Age Regression   Appearance Changes   Cheats   Dragons   Evil Gods   Fantasy Creatures   Fantasy World   Game Elements   Goddesses   Godly Powers   Gods   Humanoid Protagonist   Lack of Common Sense   Level System   Loli   Magic   Magical Space   Maids   Multiple POV   Overpowered Protagonist   Protagonist Strong from the Start   Race Change   Reincarnated in Another World   Strong to Stronger   Vampires   ",
	"rating": "(4.2 / 5.0, 48 votes)",
	"author": "Kankitsu Ue   カンキツウエ   干木津上   ",
	"year": "\n2019",
	"ranking": "#2000   #2000   #4856   #8369   #5730   ",
	"reviewcount": "3 Reviews sorted by",
	"description": "Arisugawa Kyoko, a self-proclaimed ordinary high school girl, fell down and died in a bathroom, then met a god called the Creator God and was reincarnated in a different world.\n\nShe is reborn in a completely unknown world, and begins her new life as Alice.\n\nA new world and a new life.\n\nAll kinds of encounters, adventures and dramas are waiting for her.\n\nYes, this is a story about reincarnation in a different world that can be found anywhere.\n\nThe main character is a girl who doesn’t know any of this kind of templates, priviledges, flags, conventions, cheats, common sense, etc… Except that she’s a girl who doesn’t know any of that stuff.\n\nA forest that explodes and blows up when you scream.\n\nHer reincarnated race is the true ancestors of vampires that became extinct 30,000 years ago.\n\nThe first dragon she encountered was the Black Death Ruin Dragon.\n\nA number of statuses that would astound even a god.\n\n「Elves? Race? I don’t quite understand, maybe it’s like the Pekingese race? It doesn’t matter what.」\n\n「What? I am Vampire?」\n\n「Immortality…? Huh? Then where’s the talk about the nice body that make people envy?」\n\n「Eighty billion in magic power… that’s definitely a lot. No, it might not be too much.」\n\nThis is a story about Alice, an ordinary girl who knows nothing about such otherworldly things.>"
}