{
	"url": "https://www.novelupdates.com/series/a-fake-holy-mother-in-the-zombie-apocalypse/",
	"title": "A Fake Holy Mother in the Zombie Apocalypse - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/06/A-Fake-Holy-Mother-in-the-Zombie-Apocalypse.jpg",
	"noveltype": "(CN)",
	"genre": "Adventure   Comedy   Fantasy   Romance   ",
	"tags": "Apocalypse   Beautiful Female Lead   Cooking   Devoted Love Interests   Female Protagonist   Handsome Male Lead   Love Interest Falls in Love First   Magical Space   Modern Day   Multiple Reincarnated Individuals   Post-apocalyptic   Second Chance   Special Abilities   Strong Love Interests   System Administrator   Tragic Past   Transmigration   Zombies   ",
	"rating": "(4.6 / 5.0, 148 votes)",
	"author": "九阶幻方   ",
	"year": "\n2020",
	"ranking": "#1944   #2026   #1801   #1912   #2145   ",
	"reviewcount": "40 Reviews sorted by",
	"description": "Bei Nuan found herself in an apocalypse novel that didn’t have a romantic pairing and became the holy mother female supporting character that specialized in being a drag to the team. In the end, she sacrificed the team to save a city of people and was cursed out by the readers.\n\nBei Nuan: I know the male protagonist and the plot. I’ll definitely be good at playing the female support character’s second chance.\n\nThere was a ding in her head. The task of the Holy Mother has begun. Play the role of a holy mother in front of the male protagonist. You can leave this world when you get to 100%.\n\nBei Nuan: “…”\n\n[Although I do good things every day, I’m really not a good person.]\n\n***\n\nThe male protagonist, Lu Xingchi, had a bug-level existence and easily crushed everything, but one small detail left his team being wiped out. \n\nThe first thing he did after he was reborn was to plan on throwing that holy mother white lotus into a pile of zombies.\n\nBut, as the days dragged on, he found it harder and harder to do so.\n\n***\n\nSystem: New task unlocked: Within the next 24 hours, acting like a holy mother in front of the male lead will not give you any Holy Mother points. Acting like a holy mother in front of Male B, Male C, and Male D will get you double Holy Mother points.\n\nBei Nuan: There was such a good thing?\n\nLu Xingchi discovered that that girl, who had solemnly vowed yesterday, “I’ll follow you every step of the way. Every second that I’m separated from you is a waste of my life,” had disappeared.>"
}