{
	"url": "https://www.novelupdates.com/series/jiang-hus-road-is-curved/",
	"title": "Jiang Hu’s Road is Curved - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2015/12/s24449577.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Comedy   Drama   Josei   Martial Arts   Romance   Wuxia   ",
	"tags": "Beautiful Female Lead   Betrayal   Character Growth   Cruel Characters   Cultivation   Female Protagonist   Handsome Male Lead   Love Interest Falls in Love First   Manipulative Characters   Misunderstandings   Naive Protagonist   Near-Death Experience   Obsessive Love   Parody   Revenge   Secret Identity   Transmigration   Transported to Another World   ",
	"rating": "(4.5 / 5.0, 438 votes)",
	"author": "Ying Zhao   影照   ",
	"year": "\n2012",
	"ranking": "#6970   #6381   #1671   #1878   #1006   ",
	"reviewcount": "86 Reviews sorted by",
	"description": "Alone, Pang Wan entered the Jiang Hu[1]. Her dream was to become a pure lady [2], to find her destined other half.\n\nTo fulfill this dream, everyday, she would dress elegantly in white and sit in the teahouse to admire handsome men and read her novels.\n\nShe heard, the demonesses [3] related to Jiang Hu were all, depending on their martial arts capabilities, divided into groups of three, six and nine.\n\nCurrently, the evil woman, who had the beauty of a blossoming flower, who had a heart like snakes and scorpions, who could kill at such a young age, was a once in a century’s peerless demoness.\n\nShe also heard that the demoness had came down the mountains to challenge the Wu Lin [4] champion Gu Xi Ju, to take the title of number one and to wreck havoc in the Jiang Hu.\n\nYet again she heard that all those who had decent martial arts skills vowed to get rid of this witch.\n\nAiyaya, it’s not good! Isn’t this demoness her? She did not kill the person! She did not start the fire!\n\nThis infamous name of the demoness is also not what she wanted!\n\nLooks like Jiang Hu’s road is very curved, she'd better run!\n\n—–\n\n[1] Literally translated as rivers and lakes. Refers to the pugilist world.\n\n[2] Direct translation: A lady like a White Lotus, meaning pure.\n\n[3] Not exactly the supernatural kind. It’s kind of a name for the women of Jiang Hu.\n\n[4] Wu Lin meaning martial arts.>"
}