{
	"url": "https://www.novelupdates.com/series/dont-hide-from-me/",
	"title": "Don’t Hide From Me! - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/01/Dont-hide-from-me.jpeg",
	"noveltype": "(CN)",
	"genre": "Comedy   Romance   School Life   Slice of Life   Yaoi   ",
	"tags": "Apartment Life   Calm Protagonist   Clingy Lover   Dense Protagonist   Doting Parents   Easy Going Life   First Love   Heartwarming   Manly Gay Couple   Misunderstandings   Modern Day   Possessive Characters   Protagonist Falls in Love First   Roommates   Wealthy Characters   Yandere   Younger Love Interests   ",
	"rating": "(4.2 / 5.0, 103 votes)",
	"author": "今闲   ",
	"year": "\n2021",
	"ranking": "#6970   #4226   #3276   #3061   #2924   ",
	"reviewcount": "21 Reviews sorted by",
	"description": "Ye Yao found out that he was in love with his friend Lu Xun.\n\nThey ate and slept together, were almost inseparable, and were each other’s best friends.\n\nFrom what he has learnt over the years, Lu Xun is a straight man of steel, and because of his good looks, he is very attractive to guys with a male sexual orientation.\n\nWhenever such a person appeared, Lu Xun would cut them off without a second thought. Even if he was a good friend before, he would still blackball them without any hesitation, keeping them completely out of his world.\n\nTo preserve this friendship, Ye Yao minimised the time he spent with Lu Xun, a relationship that should not have been discovered.\n\nLu Xun wanted to travel alone with him, but he refused.\n\nLu Xun wanted to take a bath with him, but he refused.\n\nLu Xun wants to sleep with him, but he still refuses.\n\n……\n\nYe Yao managed to reduce his contact with Lu Xun, but one day, when he was alone at home, he was blocked by Lu Xun.\n\nThe man who was always cheerful and sunny to him now had a horrible dark face and pinned him against the wall.\n\n“Hiding from me?” Lu Xun laughed coldly, “If you can’t give a proper reason …… you can’t blame me for following you every minute of every day.”\n\nYe Yao confesses in part.\n\nHe tells Lu Xun that he likes men, but does not say that he likes Lu Xun.\n\nLu Xun, who shunned homosexuality like a snake, gave him exceptional treatment.\n\nNot only does he not stay away from him, he takes him to the movies and tries to straighten him out.\n\n“What’s so great about smelly, hard men, it’s disgusting.” Lu Xun put his arm around Ye Yao’s shoulders and pointed at the man working hard on the computer screen with one hand, saying to Ye Yao, “It’s hard and smelly, let’s not like men anymore, okay?”\n\nYe Yao was silent for a moment: “You’re right about everything, but …… I’m the one down there.”\n\nLu Xun was stunned, and then fled.\n\nYe Yao thought his friendship with Lu Xun would end here, but at one of the social events, in the darkness, he was wrapped up in a familiar embrace.\n\nThe usually casual voice was now full of anger: “How dare you let another man touch you?”\n\n**\n\nYe Yao finally understood.\n\nLu Xun, who was straight, had become gay without Lu Xun knowing it himself.>"
}