{
	"url": "https://www.novelupdates.com/series/unparalleled-path-reincarnated-as-the-ai-for-a-space-battleship/",
	"title": "Unparalleled Path ~ Reincarnated as the AI for a Space Battleship ~ - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2018/12/71FysBwUr8L.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Comedy   Harem   Romance   Sci-fi   ",
	"tags": "Adapted to Manga   Artificial Intelligence   Betrayal   Cheats   Cosmic Wars   Firearms   Futuristic Setting   Loli   Male Protagonist   Non-humanoid Protagonist   Outer Space   Politics   Reincarnated as an Object   Royalty   Strategic Battles   Strategist   Tsundere   Wars   ",
	"rating": "(4.2 / 5.0, 118 votes)",
	"author": "Matsuya Daisuki   松屋大好   松屋大好 練習中   ",
	"year": "\n2017",
	"ranking": "#5262   #4873   #2342   #4724   #2575   ",
	"reviewcount": "12 Reviews sorted by",
	"description": "After regaining consciousness, high schooler Asagaya Makato has become an AI for a space battleship. As if that wasn’t enough, the ship has been surrounded by enemies, and he himself has a damaged engine, putting him in a dire situation.\r\n\r\nThe warship commander had already died in combat, and taking the place of the temporary commander is a young girl of the imperial family, who had joined the ship out of courtesy. Makoto had tried convincing himself that this was a dream, but being persuaded by the girl, he stands as a battleship.\r\n\r\nAfter somehow crushing the enemy at point-blank range, the fleet’s fight is over, and the battle for the fate of the empire has ended in a crushing defeat. Makato gathers up the survivors and plans to escape the battleground, but there’s a large enemy fleet on the route to the empire. He makes a jump deep into the enemy territory on a slim chance, but —\r\n\r\nSet 10,000 years in the future, a young boy has been turned into an incredibly powerful cheat AI and leads a small fleet to become peerless. There’s romantic comedy, imperial intrigue, ancient weapons, philosophy, and more!>"
}