{
	"url": "https://www.novelupdates.com/series/the-whole-entertainment-industry-thought-i-was-an-alpha/",
	"title": "The Whole Entertainment Industry Thought I Was an Alpha - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/07/The-whole-entertainment-industry-thought-I-was-an-Alpha.jpg",
	"noveltype": "(CN)",
	"genre": "Romance   Yaoi   ",
	"tags": "Acting   Businessmen   Cold Love Interests   Handsome Male Lead   Hiding True Identity   Omegaverse   Online Romance   Showbiz   ",
	"rating": "(3.9 / 5.0, 22 votes)",
	"author": "I'm Sorry For The Four   对四要不起   ",
	"year": "\n2020",
	"ranking": "#6970   #6283   #8739   #11528   #6325   ",
	"reviewcount": "2 Reviews sorted by",
	"description": "Lin Si was a top idol in the entertainment industry and was called the “Most wanted Alpha to be marked by” by Omegas.\n\nHowever, the Alpha persona that Lin Si has set up was fake because he was a real Omega.\n\nLin Si, who was so constrained to fall in love during the day, registered an account on the dating app “Bubble”: Forgot to Love.\n\nOne day, he met “44”, an Alpha with whom he had a match rate of 94.800%, on the square.\n\nAfter his relentless efforts in the super-sweet online dating app Bubble “Forgot to Love”, he is finally going to meet with “44”.\n\nBut at the agreed place, what he saw was a cold-faced, Omega-phobic boss: Lu Wei.\n\nEven more unfortunate, the two people who injected too much pheromone inhibitors were led into the most unstoppable fever period of their own lives.\n\nLin Si: Lu Wei? Eh! Why are you biting my neck for…? It’s me, Lin Si!\n\nLu Wei: Baby, it’s me.\n\nLin Si: ? ? ? ? ? ?\n\n————\n\nBefore they met, because of the influence of pheromone inhibitors on his glands, Lin Si’s experienced strong side effects and had to rely on Alpha’s pheromone to regulate his glands’ hormones.\n\nAnd the Alpha with the highest genetic match with him was Lu Wei.\n\nTherefore, he and Lu Wei were forced to live together, and they would look at each other while feeling disgusted.\n\nLater on…\n\nLin Si shrank under the quilt, curled up: Lu Wei, you big liar! Alpha does not have such an intense fever period! Go back and sleep in your room today!!\n\nLu Wei: Give me a hug.>"
}