{
	"url": "https://www.novelupdates.com/series/the-hero-king-reincarnate-to-master-the-art-of-war-and-thus-i-became-the-strongest-knight-disciple-%e2%99%80-in-the-world/",
	"title": "The Hero King, Reincarnate to Master the Art of War ~And Thus, I Became The Strongest Knight Disciple (♀) in The World~ - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/04/Hero-King.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Comedy   Fantasy   Gender Bender   ",
	"tags": "Academy   Adapted to Anime   Adapted to Manga   Age Progression   Artifacts   Beautiful Female Lead   Childhood Friends   Dragon Riders   Dragon Slayers   Dragons   Familial Love   Family   Female Protagonist   Former Hero   Goddesses   Gods   Heroes   Knights   Magic   Magic Beasts   Male to Female   Previous Life Talent   Protagonist Strong from the Start   Reincarnation   Strong to Stronger   Sword And Magic   Sword Wielder   Underestimated Protagonist   ",
	"rating": "(3.6 / 5.0, 112 votes)",
	"author": "Hayaken   ハヤケン   ",
	"year": "\n2019",
	"ranking": "#793   #657   #809   #973   #1522   ",
	"reviewcount": "12 Reviews sorted by",
	"description": "With the Goddess’ blessing, he became a 『Divine Knight』 and founded an Empire.\r\nAs time passed, he grows older, and by the time the heavens called for him to come, the Goddess showed before him, asking for his last wish.\r\n\r\nHe wished to be reincarnated in the future.\r\nHe dedicated all his life for his people, he had no time to master his own arts.\r\nThis time, he wishes to live for himself, forging his body to the utmost limit.\r\n\r\nThe Goddess complied with his wish.\r\nIn the far future, the King shall reincarnate as the 『daughter』 of a renowned Knight family.\r\nAnd, under some circumstances, she is labeled as a failure of a Knight, however——\r\n\r\n「How convenient. I can stand on the foremost line without needing any rank. No better training than actual combat!」\r\n\r\nThus, the legend of the world’s strongest, most beautiful Knight Disciple (♀) has begun—>"
}