{
	"url": "https://www.novelupdates.com/series/a-sword-master-childhood-friend-power-harassed-me-harshly-so-i-broke-off-our-relationship-and-make-a-fresh-start-at-the-frontier-as-a-magic-swordsman/",
	"title": "A Sword Master Childhood Friend Power Harassed Me Harshly, So I Broke Off Our Relationship And Make A Fresh Start At The Frontier As A Magic Swordsman. - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/08/magic-swordsman.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Comedy   Fantasy   Harem   Romance   Shounen   Supernatural   ",
	"tags": "Accelerated Growth   Adapted to Manga   Adventurers   Beast Companions   Beastkin   Beautiful Female Lead   Childhood Friends   Childhood Love   Dense Protagonist   Determined Protagonist   Elemental Magic   Fast Learner   Genius Protagonist   Guilds   Handsome Male Lead   Hard-Working Protagonist   Hidden Abilities   Hiding True Identity   Male Protagonist   Monster Tamer   Monsters   Multiple POV   Nobles   Orphans   Overpowered Protagonist   Polygamy   Quirky Characters   R-15   Royalty   Sentient Objects   Shoujo-Ai Subplot   Strength-based Social Hierarchy   Strong Love Interests   Strong to Stronger   Sudden Strength Gain   Sword And Magic   Sword Wielder   Tsundere   Weak to Strong   ",
	"rating": "(2.9 / 5.0, 200 votes)",
	"author": "Shingyou Gaku   シンギョウ ガク   ",
	"year": "\n2020",
	"ranking": "#2773   #3670   #572   #242   #1210   ",
	"reviewcount": "34 Reviews sorted by",
	"description": "The power harassment from Alfine ー a girlfriend and childhood friendー, who are the same age, grew up together, and became adventurer together, is painful.\r\n\r\nA peerless beauty, a person with the title Sword Master and called the Flawless Sword Goddess, a capable woman with achievement recognized by the Kingdom and rewarded with appointment as a knight and became a noble.\r\n\r\nOn the other hand, I'm treated as that capable woman Alfine's accessory, hurled abusive language by her, often power harassed by her with insults as an adventurer, losing my dignity as a man and as a person, I resigned to spending my daily life in position as a lover-cum-caretaker.\r\n\r\nHowever changes come to those daily life.\r\n\r\nAlfine, who became busy as the kingdom's knight, often became unable to take part in adventures, the times I took requests alone increased, and I was able to regain my lost dignity.\r\n\r\nThen I became aware to the abnormality of the situation I was in.\r\n\r\nThen, to regain myself, I decided to abandon her repeated power harassment.\r\n\r\nIn addition to all the equipment I received until now, I returned the sword which we gave to each other when we became an adventurer to her, then I declared our break up, and left that place quickly. From now on, I will change my name and appearance and live freely.\r\n\r\nAs soon as I decided so, everything went well, and when I realized, I was praised by the people around me and became the greatest adventurer on the frontier.\r\n\r\nWhat's more, I got a proposal to marry the frontier lord's daughter from a female adventurer.>"
}