{
	"url": "https://www.novelupdates.com/series/reborn-wife-is-invincible/",
	"title": "Reborn Wife Is Invincible - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/02/Reborn-Wife-Is-Invincible.jpg",
	"noveltype": "(CN)",
	"genre": "Drama   Josei   Romance   ",
	"tags": "Aristocracy   Arrogant Characters   Business Management   Celebrities   Charismatic Protagonist   Childhood Love   Cold Protagonist   Devoted Love Interests   Family Business   Female Protagonist   Masochistic Characters   Master-Servant Relationship   Military   Modern Day   Protagonist Strong from the Start   Reincarnation   Second Chance   Showbiz   Strong Love Interests   Wealthy Characters   ",
	"rating": "(4.0 / 5.0, 20 votes)",
	"author": "Demonic Water Grass   Mei Ye Shui Cao   魅夜水草   ",
	"year": "\n2015",
	"ranking": "#6970   #2000   #7466   #6512   #6946   ",
	"reviewcount": "7 Reviews sorted by",
	"description": "Betrayed by everyone close and her family ruined, Luo Yoo had lived for 25 years. Only until death did she understand who was truly good to her in this world. If possible, she really did not want to just die like this. She had yet to thank that man who had helped her when she was in dire straits, that man who was willing to go bankrupt and lose his life for her!\r\n\r\nWhen she had been thrown down from a 80+ floors building, she had seen with her own eyes that man who followed her and jumped down. At that moment Luo Yoo told herself that if she could have a second chance, she would definitely treat this man well! She would also never let her life become this miserable again, she wanted to repay that man’s kindness and take her revenge!\r\n\r\nThe instant she landed, she thought she had died but in the blink of an eye, she realised she had returned to 10 years ago, back to when everything had just begun.\r\n\r\nConfusion, enlightenment, a delightful surprise! As the daughter of a rich and influential family, she swears that in this life, she would definitely make those people who betrayed her pay the price they deserve. She would also definitely bring that man, who pledged his life to follow her, under her wing and cherish him well!\r\n\r\nYe Yunchen, the illegitimate son of the Ye Family, was cold-hearted and handsome, vicious and ruthless. His IQ could go either ways to the extreme. In front of others, his IQ was naturally extremely high but in front of Luo Yoo, he was as silly as a loyal dog, even if he was kicked fiercely by his master, he would only pitifully continue to please his master, never thinking of betrayal. \r\n\r\nYe Yunchen’s life was filled with too much darkness, while Luo Yoo was his only source of sunlight. Therefore, he is willing to give up anything to protect her, his life, his dignity, his everything!>"
}