{
	"url": "https://www.novelupdates.com/series/the-male-leads-were-stolen-by-the-extra/",
	"title": "The Male Leads Were Stolen by the Extra - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/06/The-Male-Leads-Were-Stolen-by-the-Extra_1654745366.jpg",
	"noveltype": "(KR)",
	"genre": "Fantasy   Romance   ",
	"tags": "Betrayal   Broken Engagement   Cruel Characters   Demon Lord   Empires   European Ambience   Fantasy Creatures   Fantasy World   Female Protagonist   Healers   Nobles   Transmigration   ",
	"rating": "(4.4 / 5.0, 7 votes)",
	"author": "초암   ",
	"year": "\n2022",
	"ranking": "#2000   #6249   #12124   #7589   #9097   ",
	"reviewcount": "No Reviews",
	"description": "The female lead who lost the male leads to an extra who didn’t even appear in the original story... That’s me.\r\n\r\nSellonia, who fell into a coma on the way back from defeating the Demon King.\r\nI wandered around the deathbed for months and was revived, but what?\r\n\r\n“I want you to break off our engagement. I want to hurry up marrying Grace, you know.”\r\n“I’d like you to pretend as if the Knight’s Oath I gave to you never happened.”\r\n“Give back my heart. I'm going to give it to Grace.'\r\n\r\nMy fiance, who was the male lead, the Holy Knight, and the dragon who were the second male leads, all of the guys who were my colleagues turned away.\r\nYou bastards who even have no principles!\r\n\r\nThere were many curse words in my lower stomach, but what could I do to stop it?\r\nI was trying to start a new life in a cool way.\r\nHowever…\r\n\r\n“You, do you know me?”\r\n\r\nJust how is the dead Demon King alive?\r\n\r\n“I-I don’t know you, though…”\r\n“No, you seem to know me. Tell me. Who am I?”\r\n\r\nTo make matters worse, the Demon King, who has no memory, sticks perfectly to my side and won’t leave.\r\nI had no choice but made an effort to prevent the return of the Demon King,\r\n\r\n“What should I do to hold your hand all the time?”\r\n\r\nSomehow it’s not enough to say those wicked words,\r\n\r\n“Should I kill all those bastards who left you? Just tell me.”\r\n\r\nWhat’s even worse, it looks like he’ll kill the male leads for me!\r\n>"
}