{
	"url": "https://www.novelupdates.com/series/the-jack-of-all-trades-kicked-out-of-the-heros-party-the-swordsman-who-became-a-support-mage-due-to-party-circumstances-becomes-all-powerful/",
	"title": "The Jack-of-all-trades Kicked Out of the Hero’s Party ~ The Swordsman Who Became a Support Mage Due to Party Circumstances, Becomes All Powerful - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/01/The-Jackofalltrades-kicked-out-of-the-heros-party-The-Swordsman-who-became-a-support-mage-due-to-party-circumstances-becomes-all-powerful_1643326907.jpg",
	"noveltype": "(JP)",
	"genre": "Adventure   Fantasy   Harem   Romance   Shounen   ",
	"tags": "Adapted to Manga   Fantasy World   Male Protagonist   Protagonist Strong from the Start   Sword And Magic   Sword Wielder   ",
	"rating": "(3.8 / 5.0, 52 votes)",
	"author": "Itsuki Togami   都神樹   ",
	"year": "\n2021",
	"ranking": "#160   #532   #4500   #256   #5989   ",
	"reviewcount": "6 Reviews sorted by",
	"description": "“Orn Doula, today will be your last day in the party.” \n\nSince the party was lacking someone who could play the essential role of Enchanter, it was the quickly adaptable Orn who had converted from Swordsman to Enchanter.\n\nOn a certain day, Orn, who belongs to the Hero Party is suddenly informed by the party leader – “your skills are lacking, so leave the party”. The other party members also insult him as a “weakling” and a “jack of all trades but a master of none”.\n\nOrn is someone with both average physical abilities and magical skills – nothing outstanding.\n\nStill, his worth is in being able to easily acquire skills that ordinary people have to obtain through much effort, Undeniably a “jack of all trades and master of none”. And that was why he had coveted and devoured all kinds of knowledge and techniques.\n\nAfter being expelled from the party and getting a fresh start, he decides to resume adventuring. This being so, he chooses to return as a Swordsman since he was an Enchanter only due to party circumstances.\n\n-However, having been an Enchanter was definitely not a waste.\n\nHis time in the Hero Party, knowledge, experience, and development of countless original magic will certainly nurture Orn into a Swordsman of unconventional strengths.>"
}