{
	"url": "https://www.novelupdates.com/series/i-like-your-pheromones/",
	"title": "I Like Your Pheromones - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/11/I-Like-Your-Pheromones.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Romance   School Life   Shounen Ai   Slice of Life   ",
	"tags": "Adapted to Drama CD   Carefree Protagonist   Character Growth   Confident Protagonist   Dense Protagonist   Doting Love Interests   Enemies Become Lovers   First Love   First-time Interc**rse   Love Interest Falls in Love First   Modern Day   Omegaverse   Popular Love Interests   Strong Love Interests   ",
	"rating": "(4.6 / 5.0, 186 votes)",
	"author": "Yǐnlù Xīng   引路星   ",
	"year": "\n2019",
	"ranking": "#424   #675   #1851   #1302   #843   ",
	"reviewcount": "35 Reviews sorted by",
	"description": "As a good-looking Beta with a good family background, Duan Jiayan has lived a smooth sailing life for more than ten years, until he met Lu Xingci in high school.\n\nLu Xingci’s family situation is better than his, he is taller than him and plays basketball better than him. Needless to say, his grades are a whole tier above Duan Jiayan’s. Even his friends can’t help but occasionally praise Lu Xingci.\n\nMost importantly, every girl that Duan Jiayan has set his sights on, all admitted that they have liked Lu Xingci for a few years already.\n\nSince then, Duan Jiayan has never thought well of Lu Xingci, till the day he received his new medical report. He is a late-blooming Omega, and because he became an Omega this late, it came with dire consequences. Now Alphas will feel the need to beat up other people whenever they come near Duan Jiayan. He himself is now allergic to every Alpha’s pheromone, except Lu Xingci’s.\n\n*\n\nOne night during a self-study session, Duan Jiayan became extremely uncomfortable and ended up asking Lu Xingci to bite him and leave a temporary mark.\n\nAfter finishing the bite, Lu Xingci asked: “We Alphas have very bad tempers, now that I’ve bitten you, are there any rewards?”\n\n“Why don’t you…” Duan Jiayan tentatively asked: “Be a little more generous?”\n\n“Sure,” the other party kneeled slightly and tilted down his head, exposing his white neck: “Then you’ve to also bite back. Once you do, I won’t make a fuss anymore.”\n\nDuan Jiayan: “…”>"
}