{
	"url": "https://www.novelupdates.com/series/shes-not-our-daughter/",
	"title": "She’s Not Our Daughter! - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/12/Shes-Not-Our-Daughter.jpg",
	"noveltype": "(KR)",
	"genre": "Comedy   Drama   Fantasy   Romance   ",
	"tags": "Abandoned Children   Amnesia   Aristocracy   Beautiful Female Lead   Calm Protagonist   Childcare   Childhood Love   Clever Protagonist   Clingy Lover   Cold Love Interests   Complex Family Relationships   Couple Growth   Cute Children   Cute Protagonist   Cute Story   Devoted Love Interests   Different Social Status   Doting Love Interests   European Ambience   Family Conflict   Female Protagonist   First Love   Handsome Male Lead   Hard-Working Protagonist   Kind Love Interests   Kingdoms   Long Separations   Lovers Reunited   Misunderstandings   Mob Protagonist   Nobles   Past Trauma   Persistent Love Interests   Popular Love Interests   Possessive Characters   Proactive Protagonist   Shy Characters   Siblings   Strong Love Interests   Tragic Past   Tsundere   Unconditional Love   Wealthy Characters   Younger Sisters   ",
	"rating": "(3.4 / 5.0, 71 votes)",
	"author": "Doreda   도레다   ",
	"year": "\n2020",
	"ranking": "#6970   #4085   #3428   #6706   #2564   ",
	"reviewcount": "16 Reviews sorted by",
	"description": "A few years ago, my ex-boyfriend, who I broke up with after our one-night stand, came to visit me as a duke. He said he regretted abandoning me.\r\n\r\nWhat are you talking about? What’s there to regret when we’ve split up with ease?\r\n\r\nAlso, I think he even misunderstood my sister’s daughter for ours.\r\n\r\n“I had no idea. I didn’t know you were raising our child alone.”\r\n\r\nWhat is this situation?\r\n\r\nJust then, my niece, who hid herself behind my back, stuck her tongue out at him.\r\n\r\n“I hate you, you’re a bad guy who abandoned us. Go away!”\r\n\r\nHe staggered in a shocked manner.\r\n\r\nNo, he didn’t abandon you.\r\n\r\nAnd I’m not your mother!>"
}