{
	"url": "https://www.novelupdates.com/series/when-i-was-job-hunting-i-was-asked-by-god-to-establish-a-country-in-another-world/",
	"title": "When I Was Job Hunting, I Was Asked by God To Establish a Country in Another World - Novel Updates",
	"image": "https://www.novelupdates.com/img/noimagefound.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Fantasy   Harem   Romance   ",
	"tags": "Angels   Boss-Subordinate Relationship   Cheats   Demi-Humans   Dwarfs   Elves   Gods   Human-Nonhuman Relationship   Kingdom Building   Kingdoms   Level System   Love Interest Falls in Love First   Male Protagonist   Master-Servant Relationship   Polygamy   Royalty   ",
	"rating": "(3.4 / 5.0, 5 votes)",
	"author": "Ichirimo Kousei   一里茂孤星   ",
	"year": "\n2020",
	"ranking": "#2000   #2000   #13060   #9324   #12289   ",
	"reviewcount": "No Reviews",
	"description": "Koichi Kotoriyuu, who was working for a black company as a corporate animal, retired after suffering a physical injury.\n\nWhen he was looking for a job after recovering, he received an interesting email from a job site.\n\nI went to the interview and found out that it was a simulation game about urban development.\n\nWhen I went to the interview, I was asked to build a country by a god of another world.\n\nThis is a story about an ordinary old man who is rejuvenated to the age of 20, gets a cheat from God, and establishes a country while traveling back and forth to Earth.\n\nThe story is about an ordinary old man who is rejuvenated at the age of 20.\n\nI’m aiming for a happy ending in the end, despite all that happens.\n\nIt’s a story about turning a medieval world into a near-future world with magic and cheats. It’s a story like that.\n\nThis is a story about a medieval world that is turned into a futuristic world with magic and cheats. It also takes place on Earth, but in a different world line than the real world. There will be non-existent countries, incidents, etc.\n\nIt’s a harem. I wonder if I can have 100 lovers? I don’t know>"
}