{
	"url": "https://www.novelupdates.com/series/half-immortal/",
	"title": "Half Immortal - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/08/Half-Immortal.jpg",
	"noveltype": "(CN)",
	"genre": "Horror   Mystery   Shounen Ai   ",
	"tags": "Amnesia   Calm Protagonist   Clever Protagonist   Confident Protagonist   Cunning Protagonist   Death   Glasses-wearing Love Interests   Gore   Handsome Male Lead   Human-Nonhuman Relationship   Lovers Reunited   Low-key Protagonist   Mysterious Past   Near-Death Experience   Past Plays a Big Role   Power Couple   Pragmatic Protagonist   Protagonist Strong from the Start   Ruthless Protagonist   Seeing Things Other Humans Can't   Special Abilities   Strong Love Interests   Survival Game   Teamwork   Time Manipulation   Unlimited Flow   Unlucky Protagonist   ",
	"rating": "(4.2 / 5.0, 73 votes)",
	"author": "西瓜炒肉   ",
	"year": "\n2021",
	"ranking": "#735   #2887   #4787   #3250   #3698   ",
	"reviewcount": "5 Reviews sorted by",
	"description": "1. Yan Wei entered a black tower that disappeared into the clouds and accidentally entered a world inside the tower that was filled with all sorts of instances.\r\n\r\nIn the instances, there were puppets leaning over to kiss a statue, paintings of people without eyes, a pale and dishevelled female ghost with a mouth filled with blood….\r\n\r\nEach floor was a level; if you don’t enter, you die. Only those who reach the top can live.\r\n\r\nAfter Yan Wei thoroughly understood the rules, he found that he had a skill called “Half Immortal” —- As long as he was in an instance, he would acquire an immortal body every second day.\r\n\r\nYan Wei: Going wild.jpg\r\n\r\n2. Yan Mingguang who was ascending the tower took off his glasses and held a cigarette as he leaned against the wall watching the young man not far away slowly approach the boss.\r\nThe young man was calm and composed. With one hand in his pocket, he used his other hand to grab the boss’s hand and carefully examined it. His clear voice carried nonchalance: “Don’t move. Let me see what clues you have on you……Hey, stop struggling. You can’t kill me anyway……..”\r\n\r\nThe clock ticked past midnight——–\r\n\r\nThe young man’s calm expression changed immediately. He looked at the boss with eyes filled with fear and turned and ran towards him.\r\nSeeing that the boss was now charging over, Yan Mingguang tossed his cigarette aside, frowned and said coldly: “Let go.”\r\nThe young man clung tightly onto him: “No! Save me!!!”\r\n“Not saving.”\r\nThe young man’s eyes brightened: “Thank you!!”\r\nYan Mingguang who found that he had already crushed the boss’s head, “……..”\r\n\r\n3. One day, while the instance was being broadcasted.\r\nThe players who were watching the broadcast found that the thigh-hugging, weak and useless player Yan Wei had suddenly appeared before the boss all the other players were trying to avoid.\r\nThe audience: “??? Is he in a hurry to die??”\r\nThe next moment, the young man chased after the boss, shouting, “Stop running, I won’t be too mean!!”\r\nThe boss’s face was filled with panic, the audience’s faces were filled with confusion.\r\nThis was different from what they had in mind?\r\n\r\n*Cold and aloof gong with explosive fighting power who says one thing but does another x sometimes seeking death, sometimes faking cowardice, quick-witted shou>"
}