{
	"url": "https://www.novelupdates.com/series/today-the-manager-is-also-very-kind/",
	"title": "Today the Manager is Also Very Kind - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/01/todaymanager23.jpg",
	"noveltype": "(CN)",
	"genre": "Drama   Romance   Yaoi   ",
	"tags": "Celebrities   Devoted Love Interests   Fat to Fit   Love Interest Falls in Love First   Low-key Protagonist   Management   Manipulative Characters   Manly Gay Couple   Modern Day   Mysterious Past   Previous Life Talent   Showbiz   Transmigration   ",
	"rating": "(4.0 / 5.0, 78 votes)",
	"author": "He Wu   呵芜   ",
	"year": "\n2018",
	"ranking": "#2000   #4796   #3766   #3399   #2837   ",
	"reviewcount": "21 Reviews sorted by",
	"description": "Ji Bu, the gold medal manager who was trapped and imprisoned, woke up to be a vicious rich second generation Xin Nanyi. He was hated and feared by his girls group he played with, and his uncle deliberately slaughtered him.\n\nJi Bu had no choice but to go back to his old career, fight against greedy uncles and all kinds of rivals, win the trust of the girls group, lead the “girls” to the top, and hold them up as a powerful girls group with a high traffic rate and a good harvest.\n\nXin Nanyi just wants to work hard and be a good manager, but there is always a film emperor who is unwilling to let him go, either to press him on the bed or to deceive him.\n\nShocked! Popular girls group members with the manager intimate hug was photographed, the atmosphere was ambiguous like a couple.\n\nAfter being chased by fans and reporters, Nan Ge the broker who sent the blade laxatives, found the strongest excuse to clarify on Weibo: “I like men.”\n\nWhen the words were uttered, it caused a great disturbance, the members of the girls group are silent, the fans are exclaimed and Weibo was paralysed.\n\nA certain film emperor smiled: It’s a coincidence that I’m a man.\n\nNan Ge: ……\n\nGentle and kindhearted manager decathlon shou vs Multi-gold shield black belly cold and cute big film emperor gong\n\nBeing ugly and fat just after crossing, then gradually lose weight and become handsome, handsome as inspirational chicken stock.\n\nThe gong has always been very handsome!!! But still acting.>"
}