{
	"url": "https://www.novelupdates.com/series/martial-arts-master/",
	"title": "Martial Arts Master - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2017/10/MAM_1.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Drama   Martial Arts   Romance   School Life   Sports   Xuanhuan   ",
	"tags": "Average-looking Protagonist   Battle Competition   Beautiful Female Lead   Bickering Couple   Calm Protagonist   Caring Protagonist   Character Growth   Chat Rooms   Coming of Age   Cultivation   Cute Story   Devoted Love Interests   Different Social Status   Doting Parents   Early Romance   Famous Protagonist   Fast Cultivation   First Love   First-time Interc**rse   Friendship   Hard-Working Protagonist   H*ndjob   Honest Protagonist   Inheritance   Long-distance Relationship   Male Protagonist   Marriage   Master-Disciple Relationship   Modern Day   Naive Protagonist   Poor Protagonist   Poor to Rich   Protagonist Falls in Love First   Righteous Protagonist   Slow Growth at Start   Slow Romance   Special Abilities   Sudden Strength Gain   Time Skip   Weak to Strong   ",
	"rating": "(4.1 / 5.0, 379 votes)",
	"author": "Cuttlefish That Loves Diving   爱潜水的乌贼   ",
	"year": "\n2016",
	"ranking": "#5262   #4697   #782   #6613   #1779   ",
	"reviewcount": "85 Reviews sorted by",
	"description": "Here, martial arts are no longer legends. They have been passed on from generation to generation, from century to century. \n\nAfter being confronted by science and technology, they have completely integrated into modern society and all kinds of martial arts competitions are taking place across the country as the consensus between who's superior among scholars are hard to reach, but among martial artists, it isn't that difficult!\n\nLou Cheng has found an unknown cultivation item that fuses with him and helps him with the first part of martial arts, meditation.\n\nFacing his dream and the glory in his heart, he will advance step by step, becoming the warrior of this modern city and the hero of the era!>"
}