{
	"url": "https://www.novelupdates.com/series/live-broadcasting-raising-dragons-in-the-interstellar/",
	"title": "Live Broadcasting Raising Dragons in the Interstellar - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/08/Live-Broadcasting-Raising-Dragons-in-the-Interstellar.jpg",
	"noveltype": "(CN)",
	"genre": "Romance   Sci-fi   Shounen Ai   Slice of Life   ",
	"tags": "Adopted Children   Animal Characteristics   Calm Protagonist   Caring Protagonist   Celebrities   Childcare   Clingy Lover   Cold Protagonist   Cooking   Cute Children   Cute Story   Dragons   Familial Love   Famous Protagonist   Futuristic Setting   Handsome Male Lead   Hard-Working Protagonist   Heartwarming   Human-Nonhuman Relationship   Kind Love Interests   Love at First Sight   Love Interest Falls in Love First   Manly Gay Couple   Omegaverse   Orphans   Power Couple   Protagonist Strong from the Start   Royalty   Shapeshifters   Slow Romance   Special Abilities   Strong Love Interests   Teachers   Transformation Ability   Transmigration   Transported to Another World   ",
	"rating": "(4.4 / 5.0, 325 votes)",
	"author": "Yú Zhī Shuǐ   鱼之水   ",
	"year": "\n2020",
	"ranking": "#883   #2880   #979   #1086   #934   ",
	"reviewcount": "69 Reviews sorted by",
	"description": "Shen Mian, who had powerful wood and spatial abilities, was kicked out by his family for being an omega, became homeless and had zero deposits. The original owner was still a childcare teacher and was assigned to the most marginal planet and served as the dean of the childcare centre.\n\nThe childcare centre was small and broken. As the dean, Shen Mian has to live broadcast to generate income in addition to raising cubs.\n\nSo one day, on the largest interstellar live broadcasting platform, appeared a large scale meng selling scene, also known as Awei Crematorium, the audiences passed on word of mouth- in live room 1551, the dragons have gathered!\n\nThe cubs are a hundred pounds, they will breathe fire, can fight and will also sell meng, the centre’s dean Shen Mian is better than an alpha. The popularity of the live broadcast room was so great that the small centre became the best childcare centre in the interstellar.\n\nShen Mian diligently raised the cubs, but he did not want the imperial prince that was among the cubs he raised.\n\nShen Mian: I, the dean, raise dragons.\n\nCrown Prince: Raise, raise nine, raising an adult, is it enough?\n\nShen Mian: See if a slap is enough.\n\nCrown Prince: Enough, it’s enough, thank you, wife.>"
}