{
	"url": "https://www.novelupdates.com/series/108-maidens-of-destiny/",
	"title": "108 Maidens of Destiny - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2016/03/108-bigger.png",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Ecchi   Fantasy   Harem   Martial Arts   Mature   Seinen   Xuanhuan   ",
	"tags": "Aggressive Characters   Archery   Arrogant Characters   Artifacts   Assassins   Beautiful Female Lead   Buddhism   Calm Protagonist   Caring Protagonist   Clever Protagonist   C*nnilingus   Cold Love Interests   Confident Protagonist   Contracts   Cultivation   Determined Protagonist   Early Romance   Enemies Become Lovers   Fast Cultivation   F*llatio   Genius Protagonist   Hard-Working Protagonist   Harem-seeking Protagonist   Hiding True Identity   Honest Protagonist   Loli   Male Protagonist   Modern Knowledge   Netori   Pill Based Cultivation   Pill Concocting   Polygamy   Romantic Subplot   Ruthless Protagonist   S*xual Cultivation Technique   Shameless Protagonist   Special Abilities   Strategic Battles   Strong Love Interests   Threesome   Transported to Another World   Unconditional Love   Underestimated Protagonist   Unique Weapons   Weak to Strong   World Travel   ",
	"rating": "(4.1 / 5.0, 361 votes)",
	"author": "She’s Cold As Ice   她酷的像冰   ",
	"year": "\nN/A",
	"ranking": "#3710   #2732   #363   #2682   #777   ",
	"reviewcount": "43 Reviews sorted by",
	"description": "“Your servant is Majestic Star ‘Panther Head’ Lin Chong, from this day forward I am your woman!”\n\nWhen the beautiful and heroic young girl in front of him shouted those heaven shattering words, Su Xing was overwhelmed with shock.\n\nAnd so the tale of the 108 maidens of destiny from legends begins.\n\nIn Liangshan Continent, a genius is defined as a Star Master who is capable of signing the Star Duel Covenant contract with two Star Maidens. This was truly the limit.\n\nBut right now Su Xing’s dilemma is how to convince the “Strength Star” Lu Junyi to become his eighth Star Knight. And this is just the beginning…\n\n---\n\nThis novel is based on the ancient Chinese classic Water Margin or Outlaws of the Marsh. 108 beautiful maidens with earth shattering power is unleashed into the Liangshan Continent every 108 years. Our hero, a military pilot, ripped through space and time while test flying a new fighter jet and ended up in this world.>"
}