{
	"url": "https://www.novelupdates.com/series/clearing-an-isekai-with-the-zero-believers-goddess-the-weakest-mage-among-the-classmates/",
	"title": "Clearing an Isekai with the Zero-Believers Goddess – The Weakest Mage among the Classmates (WN) - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/04/EUgeIkdU8AAxOff.jpeg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Comedy   Fantasy   Harem   Romance   Shounen   ",
	"tags": "Adapted to Manga   Adventurers   Aristocracy   Award-winning Work   Beastkin   Calm Protagonist   Cheats   Childhood Friends   Clever Protagonist   Clingy Lover   Cold Love Interests   Cold Protagonist   Complex Family Relationships   Conditional Power   Cunning Protagonist   Demi-Humans   Demon Lord   Demons   Dense Protagonist   Depictions of Cruelty   Determined Protagonist   Devoted Love Interests   Discrimination   Divination   Divine Protection   Dragons   Elemental Magic   Elves   Engagement   Evil Gods   Fairies   Fallen Nobility   First-time Interc**rse   Game Elements   God-human Relationship   God Protagonist   Goddesses   Godly Powers   Gods   Guilds   Hard-Working Protagonist   Heroes   Hidden Abilities   Human-Nonhuman Relationship   Indecisive Protagonist   Kingdoms   Lack of Common Sense   Level System   Limited Lifespan   Loli   Loner Protagonist   Love Interest Falls in Love First   Magic   Magic Beasts   Male Protagonist   Misunderstandings   Monster Girls   Monsters   Multiple POV   Multiple Realms   Multiple Transported Individuals   Mythology   Near-Death Experience   Nobles   Overpowered Protagonist   Polite Protagonist   Politics   Polygamy   Post-apocalyptic   Quirky Characters   R-15   Reincarnation   Religions   Royalty   Schemes And Conspiracies   Secret Relationship   Skill Books   Slow Growth at Start   Special Abilities   Spirit Users   Spirits   Strong Love Interests   Summoned Hero   Sword And Magic   Time Travel   Transformation Ability   Transported to Another World   Unconditional Love   Underestimated Protagonist   Vampires   Wars   Weak to Strong   Wealthy Characters   Yandere   ",
	"rating": "(4.2 / 5.0, 1029 votes)",
	"author": "大崎アイル   ",
	"year": "\n2018",
	"ranking": "#26   #95   #61   #32   #102   ",
	"reviewcount": "204 Reviews sorted by",
	"description": "Makoto Takatsuki is a normal high school student and a hardcore RPG player.\n\nHowever, “normal” goes out the window when his whole class is involved in a bus crash and whisked away to another world! Powerful gods rule this strange new land of magic and monsters, and every newcomer is blessed with strong stats and unique skills.\n\nWell, not quite. Makoto’s stats turn out to be pathetic, and his skills are super weak compared to his classmates’…he’s even stuck as an apprentice mage. Worse still, he’s given only ten years to live! \n\nLuckily, Makoto soon meets a minor goddess named Noah, who appears in Makoto’s dreams and asks him to become her first believer. With the help of Noah’s blessings and a divine weapon, Makoto seeks to become strong enough to rescue his goddess from the dungeon where she’s been trapped. \n\nBy training hard and using his weak skills in unorthodox ways, Makoto proves that, even when playing on hardcore difficulty, an RPG player always makes it to the end!>"
}