{
	"url": "https://www.novelupdates.com/series/welcome-to-the-guild-of-the-exiled/",
	"title": "Welcome to the Guild of the Exiled - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/09/Welcome-to-the-Guild-of-the-Exiled.jpg",
	"noveltype": "(JP)",
	"genre": "Comedy   Fantasy   Harem   Seinen   ",
	"tags": "Adapted to Manga   Beastkin   Guilds   Male Protagonist   Management   Proactive Protagonist   Sword And Magic   Underestimated Protagonist   ",
	"rating": "(3.9 / 5.0, 28 votes)",
	"author": "メソポ・たみあ   ",
	"year": "\n2020",
	"ranking": "#6970   #2036   #5629   #5247   #6905   ",
	"reviewcount": "2 Reviews sorted by",
	"description": "'Expulsion boom'.\r\n\r\nIn this world, such phrase had become prevalent.\r\n\r\nWith the advent of 'Status Scouter', a convenient item that quantifies and visualises stats, a trend was set for high-ranking parties to expel their friends whose status numbers were in the low-end.\r\n\r\n\r\nEisen, who had graduated from the Guild Master Academy, had been harbouring doubts regarding the status-oriented world. In addition, with his inherent skill called 'Appraisal Eye' that detects hidden skills in people, he realised that the adventurers who had been exiled for their 'incompetence' were actually competent people with hidden skills.\r\n\r\nThus, Eisen decided to initiate a new guild for these exiles and took them in one after another. Just like that, the guild began to grow bigger.\r\n\r\n\r\n\r\n\r\n'Off you go with your useless ability!'\r\n\r\n'Ah, then you wouldn't mind it if I take them in, yes?'\r\n\r\n\r\n\r\n\r\n'We don't need people with low stats here!'\r\n\r\n'You dumping this kid? Are you people off your rockers....?'\r\n\r\n\r\n\r\n\r\nIn Eisen's emerging guild, talented people who cannot be measured by numerical values gather, and eventually the name of the guild will be echoed all around the world.\r\n\r\nConversely, the S-ranked party that couldn't see beyond the numerical value of their status and abandoned these people will tumble and fall in their pursuit of failure. Then they will learn who were the incompetent one all along.\r\n\r\n'Oh, so now your party is on the brink of collapse? That's what you get for ditching your precious friend!'>"
}