{
	"url": "https://www.novelupdates.com/series/thriller-trainee/",
	"title": "Thriller Trainee - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/05/Thriller-Trainee.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Fantasy   Horror   Supernatural   Yaoi   ",
	"tags": "Anti-social Protagonist   Appearance Changes   Appearance Different from Actual Age   Arrogant Characters   Calm Protagonist   Card Games   Clever Protagonist   Cold Protagonist   Confident Protagonist   Couple Growth   Depictions of Cruelty   Enemies Become Lovers   Famous Protagonist   Game Elements   Game Ranking System   Gore   Handsome Male Lead   Human-Nonhuman Relationship   Leadership   Love Interest Falls in Love First   Loyal Subordinates   Magic   Male Yandere   Manipulative Characters   Manly Gay Couple   Marriage   Mind Control   Multiple Realms   Murders   Near-Death Experience   Obsessive Love   Orphans   Popular Love Interests   Power Couple   Previous Life Talent   Prophecies   Protagonist Strong from the Start   Puppeteers   Sadistic Characters   Slow Romance   Smart Couple   Stoic Characters   Strong Love Interests   Strong to Stronger   Survival Game   Teamwork   Thriller   Transmigration   Twisted Personality   Unlimited Flow   World Hopping   ",
	"rating": "(4.7 / 5.0, 286 votes)",
	"author": "Raven   Wang Ya   妄鸦   ",
	"year": "\n2020",
	"ranking": "#711   #1223   #1461   #1388   #841   ",
	"reviewcount": "57 Reviews sorted by",
	"description": "The washed-up magician Zong Jiu transmigrated into a horror, infinite flow novel about a survival show, taking the place of the cannon fodder who died tragically in the first evaluation round. This show was very interesting. Out of the tens of thousands of people, only a hundred people could survive, and the c-position (strongest contender) could even get a universal wish ticket.\n\nIf it were someone else, they’d probably be scared to death.\n\nNo one expected that Zong Jiu was not only unafraid, but also caused a sensational stir, shamelessly showing off his tricks the whole way.\n\nOnce his tricks stopped, and his life could be considered safe and sound, he ended up in a rivalry with the novel’s big villain.\n\nToday you try to get at me, tomorrow I’ll get you back, back and forth, it’s pretty fun, heh.\n\nAs a result, though it was just playing around, one time they got carried away and really did end up sleeping together. Watching the nemesis who was pressing him to the ground, Zong Jiu lazily lifted his gaze. “If you want to kill me then kill me, don’t speak nonsense.” Even when at a disadvantage, he showed no trace of fear, and actually continued to provoke him.\n\nThat person used his ice-cold finger to trace his ear, and the action heading toward the aorta suddenly stopped.\n\n“What a pity. I’ve changed my mind.”\n\n—\n\nHe was once very willing to personally give Zong Jiu death. Every day, he used to regret not gouging out his flesh, personally snapping his neck. But after this person fell into his hands, another, more urgent desire grew like weeds.\n\nCompared to winning or losing, he would rather see him crying and panting, with eyes red, begging for mercy.>"
}