{
	"url": "https://www.novelupdates.com/series/little-expert-bending-plot-lines-back/",
	"title": "Little Expert Bending Plot Lines Back - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/08/LEBPLB.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Drama   Fantasy   Romance   School Life   Yaoi   ",
	"tags": "Ancient China   Apocalypse   Calm Protagonist   Charming Protagonist   Cold Protagonist   Confinement   Cross-dressing   Death of Loved Ones   Dense Protagonist   Devoted Love Interests   Doting Love Interests   Episodic   Futuristic Setting   Handsome Male Lead   Interdimensional Travel   Love Interest Falls in Love First   Lucky Protagonist   Magic   Modern Day   Multiple Realms   Possessive Characters   Protagonist Strong from the Start   Slow Romance   Strong Love Interests   System Administrator   Transmigration   Wealthy Characters   World Hopping   Zombies   ",
	"rating": "(3.5 / 5.0, 46 votes)",
	"author": "Zi Ying   梓楹   ",
	"year": "\n2016",
	"ranking": "#6970   #6237   #5966   #6617   #4731   ",
	"reviewcount": "5 Reviews sorted by",
	"description": "In an era where a variety of male and female supporting leads, villains, and cannon fodders made face-slapping counterattacks against the male leads, the Lord System had to find a host to act as the male leads that had been slapped to death.\r\n\r\nThus, the mild-tempered Miao Anyun was picked by the system to transmigrate into different worlds, acting as the male lead.\r\n\r\nThere was no need to follow the original work to protect the plot line because even Lord System felt that the plots of these worlds had essentially already collapsed and were probably beyond saving. Meaning, if the plot could be bent back, he should do it, but if he couldn’t, then it was fine.\r\n\r\nMiao Anyun didn’t even need to stay in character. Lord System only had one basic requirement——he had to make sure the male lead stayed alive.\r\n\r\nAt first, Miao Anyun didn’t make any unnecessary moves, as he just wanted to quietly go about his own business. However, for some inexplicable reason, these male supporting lead and villain counter-attackers approached him one after another, constantly gluing themselves to his side.\r\n\r\nAs for the Lord Plot that had long ago gone out-of-control like a wild horse, it was actually, for the most part, bent! back! on! track!\r\n\r\nLord System: The plot was bent back, but why do I still feel sorry for the host… You animals, stay away from my family’s host, bastards!>"
}