{
	"url": "https://www.novelupdates.com/series/transmigrating-as-a-mary-sue-character/",
	"title": "Transmigrating as a Mary Sue Character - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/09/B0B53CDC-1E4C-4076-9CA9-DBFF25DA5122.jpeg",
	"noveltype": "(CN)",
	"genre": "Comedy   Fantasy   Romance   School Life   ",
	"tags": "Adopted Children   Beautiful Female Lead   Brother Complex   Childhood Friends   Childhood Love   Clever Protagonist   Doting Older Siblings   Doting Parents   Female Protagonist   First Love   Handsome Male Lead   Hard-Working Protagonist   Love Interest Falls in Love First   Modern Day   Reverse Harem   Sibling Rivalry   Siblings Not Related by Blood   Sister Complex   Transmigration   Villainess Noble Girls   Wealthy Characters   ",
	"rating": "(3.9 / 5.0, 93 votes)",
	"author": "一夜从灯   ",
	"year": "\n2020",
	"ranking": "#1888   #3174   #1412   #2714   #2313   ",
	"reviewcount": "23 Reviews sorted by",
	"description": "Shi Ning transmigrated into a story in a book.\n\nShe transmigrated as a female supporting character in a school-life novel named “F4 and Their Little Fairy.”\n\nIn the book, Shi Ning was a daughter of a rich family who grew up with four male childhood friends. She was their pampered princess and they showered her with love. However, in the original book setting because she had feelings for the male lead, she was overly envious of the heroine and staged a series of events to hurt her. This caused the four male leads to break ties with her. Since then, everyone shunned her and she ended up being miserable.\n\nAfter Shi Ning learnt the flow of the story—she felt elated and satisfied!\n\nIt’s better to transmigrate as a female supporting character. Falling in love was a matter that only involved the male and female lead and had nothing to do with her.\n\nAs long as she stayed away from those protagonists and made sure to do everything to avoid her death, she wouldn’t turn into a cannon fodder.\n\nShe could finally study with peace of mind. She could finally make her dreams come true and be admitted to Peking University.\n\nBut there seemed to be something wrong with the current script—\n\nHow did this F4, who supposedly only loved the heroine, became like this;\n\nHer brother, Shi Chen, who was originally disappointed in her: ‘Those three boys, don’t pay attention to them. This brother of yours will support you for life.’\n\nThe hot and honest top student: ‘Shi Ning , you never noticed that I have loved you for many years…’\n\nThe future top idol in the entertainment industry: ‘Who the hell wants to be your brother? I want to be your boyfriend instead.’\n\nThe most outrageous was Nan Xiao, the supposed male protagonist of the story, who almost destroyed her appearance for the sake of the heroine in the original script.\n\nIn the corner of an aisle where no one else was present, Nan Xiao grabbed her hand and kabedoned her against the corner of the wall.\n\nThe possessiveness and desires of love were so strong that it couldn’t be suppressed. He grabbed her waist and with a fiery gaze asked,\n\n“Shi Ning, why do you ignore this Laozi*?”\n\nShi Ning’s inner thoughts retorted: ‘Because your name is Nan Xiao, not learning.’\n\nThe male lead would be decided on as the new plot continued to unravel.\n\n#The whole world loves the heroine, but the heroine only loves learning#\n\n* arrogant term to address himself>"
}