{
	"url": "https://www.novelupdates.com/series/the-reincarnated-princess-wants-territory-rather-than-love-so-she-needs-a-political-marriage-his-proposition-is-unexpected/",
	"title": "The Reincarnated Princess Wants Territory Rather Than Love, So She Needs a Political Marriage! His Proposition Is Unexpected - Novel Updates",
	"image": "https://www.novelupdates.com/img/noimagefound.jpg",
	"noveltype": "(JP)",
	"genre": "Comedy   Fantasy   Romance   ",
	"tags": "European Ambience   Female Protagonist   Royalty   Transmigration   Transported into a Game World   ",
	"rating": "(2.0 / 5.0, 4 votes)",
	"author": "Hiiragi Ichiha   柊 一葉   ",
	"year": "\n2020",
	"ranking": "#2000   #2000   #12568   #6706   #9983   ",
	"reviewcount": "No Reviews",
	"description": "-- Lead an army to win battles and increase your territory. \r\nFairis reincarnated in the world of the game 'Stealing a Kingdom'.\r\nUsing her knowledge of the game, she becomes the princess of the empire and plays an active role in the war, to the extent that she is called the Warrior Princess.\r\n\r\nHowever, when peace comes, her father, the king, gives her a heartless order... \r\n'Get married!!'\r\n\r\n'Well, I didn't come from another world just to fall in love. Yes, let's get married for political reasons!'\r\n\r\nFairis wants a partner that understands the true nature of their relationship, but for some reason she's now competing with her sister, the princess to see who gets married first.\r\nCandidates are the son of the Prime Minister, the son of the Knights' Commander, the son of the Great Mage, etc.\r\nIn addition, the sorcerer Orfed, the last boss of the game, is another candidate for the groom's post.\r\n\r\n'What is this? An otome game? Why do I need such glittering men when I just need a business partner!?'\r\n\r\nFairis, who wants more territory than finding love or giving her father a son-in-law, wonders who can she marry to control the territory herself.\r\n\r\nHowever, Orfed, who was not interested in status, money, or territory, confessed to her.\r\n\r\n'Love is heavy, but ...'\r\n\r\nOrfed urges Fairis to marry him, while Fairis tries to somehow create a rational, loveless political marriage.\r\n\r\nThis is a story about a reincarnated princess with no love skills and the handsome sorcerer she saved when he was young.>"
}