{
	"url": "https://www.novelupdates.com/series/rebirth-of-the-film-emperors-beloved-wife/",
	"title": "Rebirth of the Film Emperor’s Beloved Wife - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2018/07/RFEBW.jpg",
	"noveltype": "(CN)",
	"genre": "Drama   Josei   Martial Arts   Romance   Supernatural   ",
	"tags": "Acting   Awkward Protagonist   Beautiful Female Lead   Betrayal   Boss-Subordinate Relationship   Business Management   Calm Protagonist   Celebrities   Childcare   Cold Love Interests   Cold Protagonist   Comedic Undertone   Cooking   Couple Growth   Dense Protagonist   Devoted Love Interests   Different Social Status   Doting Love Interests   Familial Love   Family Business   Famous Protagonist   Female Protagonist   First Love   Game Elements   Handsome Male Lead   Heartwarming   Level System   Love Interest Falls in Love First   Magical Space   Marriage of Convenience   Modern Day   Mysterious Family Background   Orphans   Overprotective Siblings   Pets   Popular Love Interests   Possessive Characters   Power Couple   Pregnancy   Reincarnation   Revenge   Second Chance   Secret Relationship   Showbiz   Sister Complex   Slow Romance   Stoic Characters   System Administrator   Twins   Wealthy Characters   ",
	"rating": "(4.4 / 5.0, 394 votes)",
	"author": "Mei Ye Shui Cao   魅夜水草   ",
	"year": "\nN/A",
	"ranking": "#6970   #4753   #446   #2695   #386   ",
	"reviewcount": "79 Reviews sorted by",
	"description": "Su Yanyi: The president of Resplendent Entertainment, the legendary Entertainment Queen, and the support pillar every artist wanted.\n\nShe lost everything to one scheme, and only then did she realize that the man she had always treated with coldness and indifference was actually deeply in love with her. At the end of her life, she was left with endless, irreparable regret.\n\n“If I am given another life, I will make every single person who owed me pay me back a hundredfold, and I will do everything within my power to ensure you a safe and happy life!”\n\nMaybe her persistence was simply too impressive, because in the blink of an eye, she returned to a time three years ago and obtained a very special System—The Virtuous Wife System.\n\nWas this telling her that she had been the Entertainment Queen for too long, so she should try something new and become a virtuous wife instead?\n\nQin Jiran: The new generation Film Emperor, handsome and domineering, a lofty male god in the eyes of countless fans. \n\nIn his entire life, he only ever loved Su Yanyi. It was a pity that she did not love him back, and even after three years of marriage together, it was all still just a contractual transaction to her.\n\n“Yanyi, do we have to divorce?” Hidden within the man’s cold, hard expression was deep sorrow and despair.\n\nIn both her past life and her present life, their fates intertwined. Su Yanyi was reborn back to the day they were supposed to divorce. \n\nWill she adhere to the choice she had made in her past life, or will she embark on a different path? \n\nWith the help of the Virtuous Wife System, the dense and stoic Su Yanyi set out to pamper her oblivious husband, stumbling over her own inexperience as she tried to convince him that no, he was not having auditory hallucinations, and no, she was not feeling ill!\n\nJust, why was the first task —make him smile genuinely ten times— already so difficult?>"
}