{
	"url": "https://www.novelupdates.com/series/she-is-the-protagonist/",
	"title": "She is the Protagonist - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/05/SheisProtagonist4.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Drama   Romance   Yuri   ",
	"tags": "Acting   Adapted to Drama CD   Adopted Children   Beautiful Female Lead   Broken Engagement   Celebrities   Clever Protagonist   Devoted Love Interests   Doting Love Interests   Doting Parents   Family   Famous Protagonist   Heartwarming   Modern Day   Multiple Reincarnated Individuals   Multiple Timelines   Music   Power Couple   Protagonist Falls in Love First   Reincarnation   Second Chance   Shameless Protagonist   Strong Love Interests   System Administrator   Time Loop   Tragic Past   Transmigration   Unconditional Love   Villainess Noble Girls   Wealthy Characters   ",
	"rating": "(4.6 / 5.0, 220 votes)",
	"author": "Re Dao Hun Jue   热到昏厥   ",
	"year": "\n2019",
	"ranking": "#3923   #3762   #1352   #3295   #1769   ",
	"reviewcount": "42 Reviews sorted by",
	"description": "Tang Han Qiu is the daughter of a business giant and is controlled by an invisible force, forcing her to become an evil female supporting character, constantly chasing after the male lead who she particularly despised, constantly tripping the innocent female lead, using every means and effort to become disgusting and annoying.\n\nIn this regard, she said to herself: I can’t stand it anymore, let me go, thank you.\n\nThen she was reborn, not only reborn, the power that controlled her also disappeared – she could control her body!\n\n– Male lead? Sorry, I don’t like this s*upid man. Get lost immediately, thank you.\n\n– Female lead? Sorry… Wait! How come the female lead is different?\n\nNow the current prosperous main heroine – the superstar Yu Ru Bing sat opposite her, smiling like a flower while looking at her.\n\n“President Tang, would you consider keeping me?”\n\n“The price is not expensive, a piece of candy is enough.”\n\n•Yu Ru Bing’s Perspective•\n\nYu Ru Bing inexplicably transmigrated into the female lead and was mysteriously tied to a system.\n\nThen she gloriously became the most rebellious and beloved host.\n\nNot only did she refuse to cooperate with the system to do tasks to make Tang Han Qiu turn back into a vicious female supporting character, but she was also keen to troll the system, and hates the system.\n\nAs long as she can drive the system despondent, then she’ll be happy.\n\nIn order to be happy, the female lead in the presence of the female supporting character Tang Han Qiu became a career fan, committed to making Tang Han Qiu better and better.\n\nThe system was so angry, it couldn’t stop her, and every day it was in a despondent state.\n\nIt’s just Yu Ru Bing, this career fan, this front has deteriorated.\n\n– She became Tang Han Qiu’s wife fan.>"
}