{
	"url": "https://www.novelupdates.com/series/i-became-the-older-brother-of-the-heroine-in-an-abusive-novel/",
	"title": "I Became the Older Brother of the Heroine in an Abusive Novel - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/12/I-Became-the-Heroine-of-Abusive-Novel-and-Her-Elder-Brother.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Drama   Fantasy   Historical   Romance   Yaoi   ",
	"tags": "Adapted to Drama CD   Ancient China   Calm Protagonist   Caring Protagonist   Cautious Protagonist   Child Abuse   Clever Protagonist   Cold Love Interests   Court Official   Enemies Become Lovers   Fated Lovers   First-time Interc**rse   Handsome Male Lead   Love Interest Falls in Love First   Misunderstandings   Multiple POV   Past Trauma   Possessive Characters   Power Struggle   Reincarnation   Royalty   Schemes And Conspiracies   Second Chance   Smart Couple   Stoic Characters   Time Travel   Tragic Past   Twisted Personality   ",
	"rating": "(4.4 / 5.0, 65 votes)",
	"author": "Liu Gou Hua   刘狗花   ",
	"year": "\n2020",
	"ranking": "#6970   #2422   #6026   #7856   #5414   ",
	"reviewcount": "14 Reviews sorted by",
	"description": "Duke of Yongning’s heir, Jun Huailang was reborn and found that he was a cannon fodder N in a xiaoma literature*.\n\nThe male protagonist, Xue Yan, who was originally an unfavored prince, was ostracized and persecuted since he was a child. After the blackening, he formed a private party to support his younger brother to the throne and became a sovereign regent.\n\nHe also slaughtered the young Empress Dowager’s whole family, forcing the Empress Dowager to stay with him. The Empress Dowager fell in love with him and was willing to be his plaything.\n\nThe whole book was full of an indescribable scene between the two of them. It made Jun Huailang tremble in anger.\n\nBecause this Empress Dowager was not someone else, but his own biological younger sister. It was not someone else’s family that was slaughtered, but his family.\n\nAfter rebirth, facing a younger sister who was only six years old, Jun Huailang, the gentleman of Qianqian, made up his mind for the first time.\n\nHe’s going to kill that beast for his sister.\n\nNote:\nXiaoma literature: A novel in which the male protagonist ’s father married a young and beautiful young mother (stepmother).>"
}