{
	"url": "https://www.novelupdates.com/series/guide-on-how-to-fail-at-online-dating/",
	"title": "Guide on How to Fail at Online Dating - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/05/Guide-on-How-to-Fail-at-Online-Dating.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Romance   School Life   Yaoi   ",
	"tags": "Adapted to Drama CD   College/University   First Love   First-time Interc**rse   Gamers   Handsome Male Lead   Hiding True Identity   Love Interest Falls in Love First   Manly Gay Couple   Misunderstandings   MMORPG   Modern Day   Online Romance   Power Couple   Proactive Protagonist   Senpai-Kouhai Relationship   Shameless Protagonist   Slow Romance   Straight Uke   Unlucky Protagonist   Wealthy Characters   ",
	"rating": "(4.7 / 5.0, 884 votes)",
	"author": "Jiàng Zi Bèi   酱子贝   ",
	"year": "\n2019",
	"ranking": "#2425   #3042   #737   #1408   #399   ",
	"reviewcount": "176 Reviews sorted by",
	"description": "The cousin that Jing Huan has been closest to since he was a child was labelled as 'the other woman' in a certain popular online game: only after devoting herself did she know that the other party was a jerk with a girlfriend.\n\nAfter several days of being bullied online by people in the game, his cousin went abroad in a fit of anger and sorrow.\n\nJing Huan couldn't take this lying down; he decided to take revenge for his cousin using the same method as that guy - buy a character in game and kill that slag guy thousands of times online.\n\nWith his strength and skill as the Great God when the game was first launched, wouldn't he be able to kill that guy and force him to quit the server in minutes?!\n\nHe went online, eager to fight, but made a discovery after conducting a round of investigations — this slag guy was the number one DPS server-wide, number one on the expert ranking list, number one on the wealth ranking list, number one on the popularity ranking list, and number one on the fame ranking list.\n\nConclusion: Can't screw him over.\n\nJing Huan felt despondent. He was just about to give up when he personally witnessed his dormmate's online relationship end right after meeting each other in real life. The other party had sent fake photos and changed their voice, and had even cheated him of his money, triggering his dormmate so much that he was almost admitted to a hospital.\n\nJing Huan felt enlightened as a sudden realisation dawned on him. After comforting his roommate, he moved the high-priced voice changer back to his rented house overnight.>"
}