{
	"url": "https://www.novelupdates.com/series/qiang-jin-jiu/",
	"title": "Qiang Jin Jiu - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/07/Qiang-Jin-Jiu.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adult   Drama   Historical   Mature   Mystery   Romance   Yaoi   ",
	"tags": "Adapted to Drama CD   Ancient China   Androgynous Characters   Aristocracy   Army   Bickering Couple   Calm Protagonist   Cold Protagonist   Determined Protagonist   Devoted Love Interests   Enemies Become Lovers   Generals   Handsome Male Lead   Hated Protagonist   Leadership   Love Interest Falls in Love First   Manipulative Characters   Military   Nobles   Past Plays a Big Role   Past Trauma   Politics   Possessive Characters   Power Couple   Power Struggle   Pragmatic Protagonist   Rebellion   Schemes And Conspiracies   Sickly Characters   Smart Couple   Strategic Battles   Strategist   Strong Love Interests   Time Skip   Wars   Wealthy Characters   ",
	"rating": "(4.6 / 5.0, 311 votes)",
	"author": "Tang Jiuqing   唐酒卿   ",
	"year": "\n2018",
	"ranking": "#542   #423   #1603   #995   #606   ",
	"reviewcount": "62 Reviews",
	"description": "The six prefectures of Zhongbo were offered to foreign enemies on a silver platter, and Shen Zechuan was taken into custody in the capital, reduced to a drowning dog* loathed and condemned by all. Xiao Chiye followed the scent of the furor and made his way over. But instead of setting others on him, he kicked Shen Zechuan with his very own leg, rendering the latter an invalid. Who would expect this invalid to turn around and bite him in a counterattack until he was all drenched in blood? That was the start of an epic feud between both men who tore at each other every time they come face-to-face with one another.\n\n“Fate wants to bind me here for life, but this is not the path I choose. The yellow dust submerged my brothers deep under. I have no wish to bow in submission to an illusory fate. The imperial edict can’t save my troops, and the imperial court can’t fill the stomachs of my mounts. I’m no longer willing to lay down my life for this purpose. I want to surmount that mountain. I am going to fight for myself.”\n\nNote: a drowning dog is someone who is down and out, having lost favor or power.>"
}