{
	"url": "https://www.novelupdates.com/series/mesmerizing-ghost-doctor/",
	"title": "Mesmerizing Ghost Doctor - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2018/08/Mesmerizing-Ghost-Doctor.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Comedy   Fantasy   Gender Bender   Josei   Romance   Xuanhuan   ",
	"tags": "Adapted to Manhua   Alchemy   Artifacts   Assassins   Beast Companions   Beautiful Female Lead   Betrayal   Black Belly   Cross-dressing   Cultivation   Cunning Protagonist   Dense Protagonist   Disfigurement   Doctors   Familial Love   Female Protagonist   Genius Protagonist   Handsome Male Lead   Love Interest Falls in Love First   Loyal Subordinates   Magical Space   Nobles   Overpowered Protagonist   Phoenixes   Protagonist Strong from the Start   Slow Romance   Strong Love Interests   Strong to Stronger   Transmigration   ",
	"rating": "(4.0 / 5.0, 262 votes)",
	"author": "Feng Jiong   凤炅   ",
	"year": "\n2016",
	"ranking": "#3567   #2000   #273   #6512   #1002   ",
	"reviewcount": "40 Reviews sorted by",
	"description": "She, a modern hidden ghost leader of an organization which gathered insane prodigies proficient in the various differing skill-sets. Highly skilled in medicine and poison, executes covert assassinations, viewed as insane and demonic in the eyes of people of the world. Killed in an accident, and reborn into the body of a disfigured young girl.\r\n\r\nWhat? Face disfigured, identity stolen? A return to the family dim and hopeless? Her identity can be given up, her family can be forgone, but as for the one who harmed her predecessor who inhabited this same body, if she didn’t at least make them scream in unimaginable agony and throw them into a state of wretchedness, how could she live up to her demonic reputation? Endless turmoil ensues and it’s a battle to dominate over all! See how she shook the world dressed in a suit of red, her sword up against the dominant powers that rocked the Heavens! Her name spread across the seas, shocking the earth!>"
}