{
	"url": "https://www.novelupdates.com/series/my-time-as-a-cat-in-college/",
	"title": "My Time as a Cat in College - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/07/catincollege.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Fantasy   Romance   School Life   Slice of Life   Supernatural   ",
	"tags": "Academy   Animal Characteristics   Carefree Protagonist   Cute Protagonist   Dense Protagonist   Elemental Magic   Fantasy World   Female Protagonist   Love Interest Falls in Love First   Magic   Magic Beasts   Modern Day   Non-humanoid Protagonist   Shapeshifters   Underestimated Protagonist   ",
	"rating": "(4.3 / 5.0, 42 votes)",
	"author": "Mu An Qian   暮安浅   ",
	"year": "\n2020",
	"ranking": "#2000   #6382   #4507   #6514   #5398   ",
	"reviewcount": "6 Reviews sorted by",
	"description": "Kitty Qi Xiaohan received an admissions notice. The lion who notified her gleefully smiled and told her that the employment rate after school was 100%, guaranteed.\n\nWith a heart of longing, Qi Xiaohan packed her luggage and moved to the school. When the schedules were issued, Qi Xiaohan was shocked to find out that even a cat was required to learn calculus and that they were not allowed to drop out!\n\nWhat kind of modern-day education scam was this!\n\nThe kitty stretched her legs. Well, she was already here. On the first day, she put in all her effort to learn how to write her name.\n\nAfter the initial exam was over, the fluffy classmates anxiously glanced at Qi Xiaohan, who had struggled with the cultural lessons. They wanted to console her, but were stunned when they found out she was unexpectedly ranked number one!\n\nThey glanced at the adorable little kitty, and then at the list.\n\nFluffy classmates: !\n\n……\n\nLang Chen, the descendant of a mythical beast, was ordered by the school to lead the group of new students. When he saw a tiny kitty who was the size of his paw, he furrowed his brows:\n\nHow had admissions been conducted this year? Where had this poor thing come from?\n\nWatching the small kitty blindly following him, Lang Chen silently decided that the kitty could stay.\n\nHe would take good care of this junior sister who was both delicate and cute.\n\nWho knew that, when faced by fire-breathing beasts during school training, the delicate kitty would confidently stand at the very front and expose a mouth of white, small kitty teeth, and meow hostilely:\n\n“I’ll knock your head off! To make string!”\n\nLang Chen: ? ? ?\n\nWhat was this cat doing?\n\n【How about a first-year fluffy and clever junior sister? Raising the claws pose】.jpg\n\n【Junior sister that is able to fight is super cute】.jpg>"
}