{
	"url": "https://www.novelupdates.com/series/the-king-of-the-battlefield/",
	"title": "The King of the Battlefield - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2016/04/Battlefield.png",
	"noveltype": "(KR)",
	"genre": "Action   Adventure   Fantasy   Martial Arts   Mystery   Shounen   Supernatural   ",
	"tags": "Ability Steal   Angels   Antihero Protagonist   Apocalypse   Army Building   Arrogant Characters   Artifacts   Assassins   Calm Protagonist   Clever Protagonist   Cold Protagonist   Confident Protagonist   Death   Demi-Humans   Demon Lord   Demons   Determined Protagonist   Dragons   Dwarfs   Elves   Evolution   Fairies   Fantasy Creatures   Fantasy World   First-time Interc**rse   Game Elements   Gods   Guilds   Hard-Working Protagonist   Harsh Training   Hiding True Identity   Humanoid Protagonist   Kingdom Building   Level System   Loyal Subordinates   Lucky Protagonist   Male Protagonist   Mind Break   Mind Control   Monsters   Multiple Realms   Necromancer   Ninjas   Overpowered Protagonist   Phoenixes   Politics   Previous Life Talent   Race Change   Ruthless Protagonist   Schemes And Conspiracies   Second Chance   Skill Assimilation   Special Abilities   Strength-based Social Hierarchy   Sword And Magic   Sword Wielder   Time Skip   Time Travel   Transformation Ability   Transported to Another World   Wars   Weak to Strong   ",
	"rating": "(4.1 / 5.0, 1043 votes)",
	"author": "Onhu   온후   ",
	"year": "\n2016",
	"ranking": "#5262   #6368   #160   #551   #64   ",
	"reviewcount": "143 Reviews sorted by",
	"description": "Humanity was on the brink of destruction. Muyoung, an assassin from the Forest of Death, fell to his knees. There were corpses all around him. For years, he had worked for the Forest of Death and had finally been able to eradicate them. Now, he, himself, was about to die. He closed his eyes as he felt his heart stop beating.\n\nSuddenly, Muyoung opened his eyes. By some miracle, he was still alive. He then realized that he had actually gone back 40 years in time. Join him as he decides to fix humanity’s past mistakes and fight against the 72 demons of the Underworld.>"
}