{
	"url": "https://www.novelupdates.com/series/the-bride-of-a-hundred-gold-coins-abandoned-daughter-receives-proposal-from-her-estranged-childhood-friend/",
	"title": "The Bride of a Hundred Gold Coins: Abandoned Daughter Receives Proposal from Her Estranged Childhood Friend - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/01/The-Bride-of-a-Hundred-Gold-Coins-Abandoned-Daughter-Receives-Proposal-from-Her-Estranged-Childhood-Friend.jpeg",
	"noveltype": "(JP)",
	"genre": "Fantasy   Romance   Shoujo   ",
	"tags": "Aristocracy   Beautiful Female Lead   Childhood Friends   European Ambience   Female Protagonist   Handsome Male Lead   Magic   Marriage of Convenience   R-15   ",
	"rating": "(3.0 / 5.0, 2 votes)",
	"author": "Seo Yuuri   瀬尾優梨   ",
	"year": "\n2018",
	"ranking": "#2000   #2000   #13462   #11316   #12262   ",
	"reviewcount": "No Reviews",
	"description": "“Rejoice, Dita! A nobleman is willing to buy you for a hundred gold coins!”\r\n\r\nThe Baron’s niece, Dietrinde, loses her fiancé to her cousin and was almost forced to become the second wife of a middle-aged man.\r\n\r\nThen, Balthazar Rüger, a knight from a Count family, asks for a hand in marriage to her, in exchange for a hundred gold coins.\r\n\r\nHowever, this man Balthazar, a beautiful popular young man in the castle… was a childhood friend of Dietrinde who she had never seen since they fell apart when they were kids.\r\n\r\nBalthazar said to her that he didn’t ask Dietrinde to marry him out of love, so she gave up seeking his affection and decided to work at her husband’s workplace, the Knight’s Station.\r\n\r\nDietrinde works hard at her work by making the best use of the clerical skills she has cultivated over the years, and she soon also discovers that there is a young lady who has feelings for Balthazar.\r\n\r\nMoreover, it seems that Dietrinde has some circumstances with her husband that are not ordinary to her…?\r\n \r\n“I love you. …I know it’s really too late, but will you be my wife…?”\r\n\r\nAfter overcoming their differences, what awaits her is a life filled with happiness with her husband.>"
}