{
	"url": "https://www.novelupdates.com/series/transmigrated-into-a-school-idol-and-forced-to-do-business/",
	"title": "Transmigrated into a School Idol and Forced to Do Business - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/05/ForcedtoDoBusiness1b.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Drama   Romance   School Life   Shounen Ai   ",
	"tags": "Academy   Awkward Protagonist   Businessmen   Caring Protagonist   Cold Love Interests   Cute Protagonist   Cute Story   Dense Protagonist   Determined Protagonist   Devoted Love Interests   Doting Parents   Enemies Become Lovers   Familial Love   First Love   Friendship   Jealousy   Kidnappings   Love Interest Falls in Love First   Misunderstandings   Multiple Reincarnated Individuals   Naive Protagonist   Persistent Love Interests   Proactive Protagonist   Revenge   Strong Love Interests   Transmigration   Wealthy Characters   ",
	"rating": "(4.3 / 5.0, 489 votes)",
	"author": "Yu Wu Xiao Tian Bing   雨雾小甜饼   ",
	"year": "\n2020",
	"ranking": "#3314   #829   #1007   #440   #497   ",
	"reviewcount": "111 Reviews sorted by",
	"description": "Yu Bai Zhou transmigrated into a book.\n\nThe talented protagonist was the top student in school. Due to his excellence in every subject, many people were dissatisfied with him, so they devised various schemes to mess with him, to the extent that they left a dark shadow on his high school years.\n\nHowever, the villains did not know that the seemingly poor protagonist was actually the eldest son of the richest man in City A.\n\nAnd in six years, the protagonist would replace his father’s position as the new richest man in City A with his own capabilities. Ten years later, he would become the youngest and richest man in the country! When that happens, the villains would be tortured to death by the protagonist!\n\n… As bad luck would have it, Yu Bai Zhou transmigrated into the villain that bullied the protagonist the most.\n\nIn order to live for a few more years, Yu Bai Zhou, the villain, begins to formulate a character correction plan.\n\nHowever, just as he is struggling to save his image in the eyes of the protagonist, out of the blue, the protagonist anxiously pushes him against the wall, and traps him within the circle of his arms. Those refined brown eyes watch him attentively. “Yu Bai Zhou, if you make trouble again, I will kiss you.”\n\nYu Bai Zhou, who was just kabedon’ed, panics. “Can someone tell me, exactly where did I go wrong?!”>"
}