{
	"url": "https://www.novelupdates.com/series/viscount-lady/",
	"title": "Viscount Lady - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/07/Viscount-lady.jpeg",
	"noveltype": "(KR)",
	"genre": "Comedy   Romance   Smut   ",
	"tags": "Aristocracy   European Ambience   Female Protagonist   Pregnancy   ",
	"rating": "(4.3 / 5.0, 7 votes)",
	"author": "마뇽   ",
	"year": "\nN/A",
	"ranking": "#2836   #2191   #11580   #6881   #10741   ",
	"reviewcount": "No Reviews",
	"description": "“You are pregnant.”\n\nShe heard a sound like a clear rip off. \n\n“Am I pregnant?”\n\n“Yes, you are pregnant.”\n\nIngrid’s face turned white.\n\nThe doctor calmly said that she was pregnant, pregnant, and pregnant several times, and each time Ingrid’s complexion got worse and worse. \n\n“Whose child is this ?”\n\nIngrid asked the doctor like a fool. \n\n“How would I know that?”\n\nright. How will the doctor know who the father of the child in my womb is?\n\nBut Ingrid didn’t know either. Who the hell is this kid’s father? \n\n“Pregnant?!” \n\nThe stepmother, fearing that his father would fall when he will found out about it, decides with a sad expression on her face. \n\n“I can’t do anything for the family. I have no choice but to choose someone quickly and get you married.”\n\n“You mean hiding my  pregnancy?” \n\nno. How can you get married while wearing a human mask and hiding the fact that you are pregnant?\n\nThen the person who will become a husband should know and raise a child who is not his or her own, does that make sense?\n\nIsn’t that what humans do? \n\n“then. Will you  go into the convent, give birth to this child, send the child to orphanage, and live as a nun for the rest of your  life?” \n\nNo, how could you say such a scary thing.\n\nI hate being a nun and I hate sending my children to an orphanage. \n\n“If you don’t want to be like that, do what I tell you.”\n\n“But no matter how quickly we get married, it would take two months. What should I do if the date of birth does not match?”\n\n“You can call it premature birth.”\n\n“No matter how premature… … .”\n\n“You can start with the speeding violation and insist that it is a premature birth a month earlier.” \n\nno, mother. Do you think that’s possible?\n\nReluctantly, Ingrid follows her stepmother’s scheme and starts looking for a man to speed up.\n\nAnd a man caught in Ingrid’s eyes.\n\nIt was Ian Gray, the man in question who had proposed to her the other day and was rejected.\n\nDuke Ian Gray has a history of being divorced once due to tuberculosis and prostheticism.\n\nThat man was perfect.>"
}