{
	"url": "https://www.novelupdates.com/series/i-became-the-madam-of-the-house/",
	"title": "I Became the Madam of The House - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/09/Ebk0MjEUwAIuogU.jpeg",
	"noveltype": "(KR)",
	"genre": "Drama   Fantasy   Romance   Shoujo   ",
	"tags": "Aristocracy   Arranged Marriage   Beautiful Female Lead   Calm Protagonist   Contracts   Death of Loved Ones   European Ambience   Family Business   Female Protagonist   Loneliness   Marriage of Convenience   Mysterious Family Background   Nobles   Pirates   Survival   Transmigration   Younger Brothers   ",
	"rating": "(3.9 / 5.0, 41 votes)",
	"author": "유지난   ",
	"year": "\n2019",
	"ranking": "#2000   #2000   #6942   #6514   #4122   ",
	"reviewcount": "1 Review sorted by",
	"description": "After possessing the eldest daughter of Count Leire, Archel , became the head of the family following her parent’s death. The only way to protect her little brother and herself from the old foxes who are after her family was...\r\n\r\n“I know that you need Leire’s sea territory.”\r\n\r\nIn order to acquire a shield called Gael Von Zenat, the infamous guardian of the eastern sea, but in reality, he was the head of a pirate family.\r\n\r\n“I’ll give you the sea territory there. So, please marry me.”\r\n\r\nIt wasn’t a romantic proposal. It was just a perfect deal. You take care of our family’s sea, and I’ll protect myself and my brother.\r\n\r\nI thought so, but...\r\n\r\n“When I graduate, be sure to divorce my sister.”\r\n\r\n“I think I’ve already told you that I don’t want to divorce her.”\r\n\r\nThe relationship between the two is unusual.\r\n\r\n***\r\n\r\n“Gael, stop it.”\r\n\r\nShe tried to move away but Gael didn’t budge at all.\r\n\r\n“What do you mean? I said that I believe in you, didn’t I?”\r\n\r\n“No.”\r\n\r\nArchel said after a moment of silence.\r\n\r\n“For real, it seems like you really do. I swear it seemed like you love me.”\r\n\r\nThat’s just an illusion.\r\n\r\nAfter watching my expression, a smile disappeared from Gael’s face.\r\n\r\n“Am I mistaken?”\r\n\r\n------------>"
}