{
	"url": "https://www.novelupdates.com/series/the-lazy-swordmaster/",
	"title": "The Lazy Swordmaster - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/01/The-Lazy-Swordmaster.jpeg",
	"noveltype": "(KR)",
	"genre": "Action   Adventure   Comedy   Drama   Fantasy   Martial Arts   Slice of Life   Supernatural   ",
	"tags": "Adapted to Manhwa   Aristocracy   Arrogant Characters   Calm Protagonist   Carefree Protagonist   Caring Protagonist   Clever Protagonist   Complex Family Relationships   Confident Protagonist   Dense Protagonist   Depression   Determined Protagonist   Devoted Love Interests   Dragons   Enemies Become Allies   Fantasy World   Former Hero   Gods   Hiding True Abilities   Human Experimentation   Kingdoms   Late Romance   Lazy Protagonist   Love Interest Falls in Love First   Loyal Subordinates   Maids   Male Protagonist   Master-Servant Relationship   Multiple POV   Nobles   Overpowered Protagonist   Past Plays a Big Role   Past Trauma   Priestesses   Protagonist Strong from the Start   Reincarnated in Another World   Romantic Subplot   Ruthless Protagonist   Schemes And Conspiracies   Secretive Protagonist   Slow Romance   Strong Love Interests   Sword And Magic   Sword Wielder   Terminal Illness   Time Manipulation   Tragic Past   Underestimated Protagonist   ",
	"rating": "(3.7 / 5.0, 877 votes)",
	"author": "Green Tea   ",
	"year": "\n2016",
	"ranking": "#3633   #3237   #82   #3171   #93   ",
	"reviewcount": "87 Reviews sorted by",
	"description": "“I finally managed to kill the demon lord. Can’t I rest now? At least for a bit. Actually, just leave me alone. I'm not working anymore.”\n\nIn his past life, Riley Iphelleta was a hero who defeated the demon lord. Though he emerged victorious from his battles, the emotional strains from fighting all the time got the best of him.\n\nAfter experiencing a rebirth in a powerful family who upheld their reputation through swordsmanship and didn't lack the power to support his leisurely life, Riley decided to become House of Iphelleta's lazy swordsman, but the course of the path he walked was never easy.\n\nHe’ll need to make a choice to bare his fangs or continue his naps…>"
}