{
	"url": "https://www.novelupdates.com/series/the-s-class-hunter-doesnt-want-to-be-a-villainous-princess/",
	"title": "The S-Class Hunter Doesn’t Want To Be A Villainous Princess - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/01/The-SClass-Hunter-Doesnt-Want-To-Be-A-Villainous-Princess.jpg",
	"noveltype": "(KR)",
	"genre": "Action   Fantasy   Mystery   Romance   ",
	"tags": "Beautiful Female Lead   Complex Family Relationships   European Ambience   Female Protagonist   Game Elements   Handsome Male Lead   Hunters   Interdimensional Travel   Protagonist Strong from the Start   Strong Love Interests   Transmigration   Villainess Noble Girls   ",
	"rating": "(4.1 / 5.0, 29 votes)",
	"author": "Haegang   해강   ",
	"year": "\n2021",
	"ranking": "#1944   #1327   #9773   #4345   #7265   ",
	"reviewcount": "No Reviews",
	"description": "She had transmigrated into a fantasy novel with Constellations; god-like, celestial beings. \nAnd after 10 years, she finally attained rank No.1 as a Hunter and cleared the tower...\n\nBut, now she transmigrated into a Romance-Fantasy novel as an exalted and infamously evil princess?\n\n[The 'Lord of Vile Blood' inquires about the damn place they've been taken to.]\n[The 'Monarch of Billows and Healing' feels bewildered.]\n[The 'Emperor of Enticement' is content with being in a world they are familiar with.]\n\nThankfully, It wasn't just me who had been sent here. The Constellations had come along with me.\nUpon a further observation of the princess, it seemed like she hadn't lived a 'stereotypical' villainess's life?\nDay after day, people would enact stratagems and assassination attempts were an inevitable daily occurrence.\n\n[The 'Lord of Vile Bood's' LV.999 skill 'Red Liquid of Impenetrability; Combater of Ten Thousand Poisons' rids you of the poison from a mandrake (mandragora officinarum)!]\n[The 'Monarch of Billows and Healing's' LVL.999 skill 'Divine Water' heals your injuries without leaving a single scar!]\n[The 'Emperor of Enticement's' LVL.999 skill 'Lull of Sleep' knocks the assassin out!]\n\nBut, what the hell. Everything's so dull compared to my previous life.\nI planned to clear my mission while savoring the moments when I'd be able to take a break and rest,\nBut presently, her older brothers and the male lead, who had previously tormented the villainess, began to follow me around.\n\n'I like that you've had a change of mind. But, you have to change your mind about me — and only me. Understood?'\n'I'm sorry for never trusting you before.'\n'... I'm undeserving of your forgiveness, aren't I, René?'\n\nEven the Sovereign of War, a man that was dubbed as the 'empire's ray of hope', came in contact with me...\n\n'I've made up my mind.'\n'Pardon?'\n'I shall acknowledge you as my teacher and devote myself to you, My Lady.'\n\nAlright. I'll avenge her previous misdeeds and give you whatever you desire,\nPlease, just send me back home, you deplorable system.\n\nA tale of how the No.1 Hunter, Lee Young, unfortunately gets transmigrated into a Romance-Fantasy novel, and how she intends to escape a novel that is filled with many obstacles!\nWill she truly be sent back home once she clears her mission this time?\n>"
}