{
	"url": "https://www.novelupdates.com/series/if-you-wish-for-something-useless/",
	"title": "If You Wish For Something Useless - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/10/If-You-Wish-For-Something-Useless.jpeg",
	"noveltype": "(KR)",
	"genre": "Fantasy   Romance   ",
	"tags": "Beautiful Female Lead   Cold Protagonist   Depression   European Ambience   Female Protagonist   Handsome Male Lead   Hiding True Identity   Identity Crisis   Love Interest Falls in Love First   Love Triangles   Mysterious Family Background   Nobles   Past Trauma   Protagonist Strong from the Start   Reincarnation   Secret Identity   Siblings Not Related by Blood   Sister Complex   Tragic Past   ",
	"rating": "(4.0 / 5.0, 34 votes)",
	"author": "Masne S   마스네S   ",
	"year": "\n2021",
	"ranking": "#4080   #1883   #6136   #4722   #5595   ",
	"reviewcount": "5 Reviews sorted by",
	"description": "Evelyn was a stranger and didn’t share a drop of blood with them.\r\n\r\nThere was no place for an impostor who acted as a replacement for the sake of the graceful main character.\r\n\r\n‘If I’m meant to be kicked out and killed anyway, I choose to leave on my own two feet over experiencing a miserable death again!’\r\n\r\n* * *\r\n\r\nEvelyn spoke simply, attempting to disguise her dismay at the unexpected meeting.\r\n\r\n“Young Master, it’s been a while.”\r\n\r\n“…Young Master?”\r\n\r\n“Addressing you as ‘Elder Brother’ might be–”\r\n\r\n“I’m—”\r\n\r\nIt happened in a split second. Ethan approached her rapidly from a few feet away and stood nose-to-nose before her.\r\n\r\n“That’s right. I’m not your elder brother.”\r\n\r\nBurning emotions flared in his crystalline-clear eyes.\r\n\r\nEvelyn winced when she noticed it.\r\n\r\n“Even if we don’t see one another often, the fact that I’m your elder brother and you’re my sister will not change.”\r\n\r\nHe used to utter such things in a sweet voice, but everything changed, now that he knows they don’t have a single drop of blood in common.>"
}