{
	"url": "https://www.novelupdates.com/series/god-level-demon/",
	"title": "God Level Demon - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2017/07/godleveldemon.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Comedy   Harem   School Life   Xuanhuan   ",
	"tags": "Alchemy   Angels   Arrogant Characters   Artificial Intelligence   Beautiful Female Lead   Bloodlines   Cheats   Clever Protagonist   College/University   Confident Protagonist   Cultivation   Cunning Protagonist   Demons   Dragons   Fast Cultivation   Futuristic Setting   Gods   Handsome Male Lead   Hated Protagonist   Heavenly Tribulation   Lack of Common Sense   Late Romance   Lucky Protagonist   Magic Beasts   Magical Space   Male Protagonist   Misunderstandings   Multiple Identities   Multiple Realms   Older Love Interests   Outer Space   Overpowered Protagonist   Parody   Polygamy   Poor to Rich   Pregnancy   Proactive Protagonist   Romantic Subplot   Ruthless Protagonist   Saints   Schemes And Conspiracies   S*xual Cultivation Technique   Shameless Protagonist   Special Abilities   Strong Love Interests   Student-Teacher Relationship   System Administrator   Transmigration   Transported to Another World   Weak to Strong   World Tree   ",
	"rating": "(3.9 / 5.0, 223 votes)",
	"author": "拉姆   ",
	"year": "\n2016",
	"ranking": "#5262   #6249   #2110   #7991   #2702   ",
	"reviewcount": "36 Reviews sorted by",
	"description": "'Shameless Xia Ping, not only did you steal my martial arts manual and medicinal pills, you even took my fiancée! We're not finished!'\n\n'He's the embarrassment of the Martial Way and a parasite of the human race. A complete scumbag.'\n\n'There's nothing that he won't do. Not only would he not help an old person cross the road, he would even steal the lollipop of a three year old.'\n\n'He causes problems everywhere. All of the geniuses of those big families have been beaten up by him before. Now, he's no longer tolerated by either humans or gods!'\n\nCountless martial arts experts of Yanhuang Star hated Xia Ping down to the very bone. They were just itching to completely crush him into pieces.\n\nAs for Xia Ping? Facing the hatred of so many people, he just calmly pulled up the interface of the 'Grand Hatred System' and looked at all the wonderful things there. He rubbed his chin, 'I've already saved up so many Hatred Points. What should I exchange for now? Saint-grade medicinal pills? Or perhaps that Primordial Pill? The peerless martial art skill, Tathagata Palm also seems pretty good too. But then there's that divine weapon, the Cosmic Cauldron. It really is too difficult to choose!'>"
}