{
	"url": "https://www.novelupdates.com/series/the-reincarnated-boys-growth-log-the-harder-i-work-the-stronger-i-can-become/",
	"title": "The Reincarnated Boy’s Growth Log ~The Harder I Work The Stronger I Can Become!?~ - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/11/growthlog_v1d.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Comedy   Ecchi   Fantasy   Harem   Romance   Shounen   ",
	"tags": "Academy   Accelerated Growth   Adventurers   Age Progression   Appearance Different from Actual Age   Beastkin   Beautiful Female Lead   Brother Complex   Charming Protagonist   Cheats   Clingy Lover   Demi-Humans   Demon Lord   Demons   Dense Protagonist   Depictions of Cruelty   Dragons   Elves   Game Elements   Gods   Handsome Male Lead   Hard-Working Protagonist   Heroes   Heterochromia   Human-Nonhuman Relationship   Incest   Kind Love Interests   Level System   Loli   Magic   Male Protagonist   Marriage   Multiple POV   Multiple Transported Individuals   Naive Protagonist   Nobles   Older Love Interests   Overpowered Protagonist   Polygamy   R-15   Reincarnated in Another World   Reincarnation   Royalty   Shota   S*aves   Spear Wielder   Spirits   Strong to Stronger   Sword And Magic   Time Skip   Weak to Strong   Younger Love Interests   Younger Sisters   ",
	"rating": "(3.5 / 5.0, 180 votes)",
	"author": "Yama   やま   ",
	"year": "\n2016",
	"ranking": "#509   #371   #517   #514   #764   ",
	"reviewcount": "26 Reviews sorted by",
	"description": "Katsuragi Hayato who was an ordinary student, met with a traffic accident on the way home after school and died.\n\nBecause of the woman he saved at the time, he was reincarnated into a new world by a Goddess calling herself the Reincarnation God.\n\nThe new world is the so-called sword and magic world, there are tons of strong demons, there is a Demon King, and it’s said that the neighbouring country is warring with various countries.\n\nIn order to survive in this world, he needs to get stronger, using the skill he received from the Goddess and he decides to live a life as 「Leivelt・Runwalker」\n\nIt’s a story about meeting various people and growing.>"
}