{
	"url": "https://www.novelupdates.com/series/cinderella-wasnt-me/",
	"title": "Cinderella Wasn’t Me - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/06/Cinderella.jpg",
	"noveltype": "(KR)",
	"genre": "Action   Drama   Fantasy   Romance   Shoujo   ",
	"tags": "Adapted to Manhwa   Aristocracy   Beautiful Female Lead   Betrayal   Character Growth   Conditional Power   Couple Growth   European Ambience   Female Protagonist   Handsome Male Lead   Nobles   Obsessive Love   Power Couple   Protagonist Strong from the Start   Revenge   Royalty   Secret Identity   Smart Couple   Strong Love Interests   Villainess Noble Girls   ",
	"rating": "(3.9 / 5.0, 42 votes)",
	"author": "과앤   ",
	"year": "\n2020",
	"ranking": "#6970   #2000   #7132   #9147   #3970   ",
	"reviewcount": "2 Reviews sorted by",
	"description": "People called Terryl ‘Cinderella.’\n\nIt was meant to be a charming nickname for her, who was a mere Baron’s daughter before falling in love with the second son of a Marquis.\n\nHowever one day, he abruptly bid adieu, leaving Terryl wounded by her lover’s betrayal.\n\nAnd suddenly, the so-called ‘King of the North,’ Duke of Rihan, stood in front of her.\n\nHe identified himself as Terryl’s biological father, whom she assumed was no longer alive.\n\nBecause she became the Duke’s daughter overnight, she had to put in a lot of work to become the Duke’s successor!\n\n* * * * \n\nThree years later, Terryl, seeking vengeance on her ex-lover, offers Cesio, the Marquis’ eldest son, a contract of engagement to take away what her former lover desired most, the title of ‘Marquis.’\n\n“I want an engagement with Young Lord Cesio.”\n\n“All right, take full advantage of me.”\n\nAs the two were engaged, they became more aware of one another, and as Terryl becomes closer to Cesio, she learns an unexpected secret about him…\n\n‘Terryl,’ who became the Duke’s heir overnight, and ‘Cesio,’ who inherited the Marquisate after being engaged to her.\n\nWill ‘Cinderella’ find love by the end of this tale?>"
}