{
	"url": "https://www.novelupdates.com/series/hero-no-im-an-ordinary-citizen-monster/",
	"title": "Hero? No, I’m an Ordinary Citizen (Monster) - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/08/Hero-No-Im-an-Ordinary-Citizen-Monster.jpeg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Fantasy   Shounen   ",
	"tags": "Beastkin   Caring Protagonist   Curses   Depictions of Cruelty   Evil Gods   Former Hero   Gods   Hard-Working Protagonist   Hiding True Abilities   Hiding True Identity   Love Interest Falls in Love First   Male Protagonist   Mind Break   Mind Control   Multiple POV   Multiple Transported Individuals   Overpowered Protagonist   Protagonist Strong from the Start   R-15   Royalty   Summoned Hero   Sword And Magic   Torture   Transported to Another World   World Hopping   ",
	"rating": "(3.5 / 5.0, 122 votes)",
	"author": "Kitanashi Kita   東西南喜多   ",
	"year": "\n2016",
	"ranking": "#6970   #2000   #1232   #2413   #3024   ",
	"reviewcount": "14 Reviews sorted by",
	"description": "In the summer when I was 16 years old, I was summoned to another world as a hero.\r\n\r\nAfter that, a psychic, an alchemist, a sage, spirit mage, Demon Lord —being summoned by many other worlds, I repeated a lot of meetings and partings.\r\n\r\nLives I could save; lives I couldn’t save.\r\n\r\nHatred, sadness, happiness; with many things mixed, I recklessly pushed through.\r\n\r\nAnd then, at the seventh parallel world summoning, I was dragged in a hero summoning.\r\n\r\nBeing summoned into Rivadeil, I wish for a peaceful life as an [Ordinary Citizen <Monster>]\r\n\r\n——But his wish wasn’t fulfilled at all.\r\n\r\nHe was dragged into it this time around, so he was thinking of passing this one half-heartedly, but he was dragged into trouble right from the start.\r\n\r\nThe truth of the hero summoning, the disease of the king; dragged into the rampant darkness of the kingdom, by the time he noticed, he was turning into a central figure.\r\n\r\nAs he watched over the summoned heroes from the shadows and under the sun, he complained as he resolved the problems that he was dragged into.\r\n\r\nAnd so, new encounters bring forth new enemies, and the tragedy repeats.\r\n\r\nThis is a story of a pitiful ‘toy’ that had its fate distorted by a god and wants to bring back what he has lost…>"
}