{
	"url": "https://www.novelupdates.com/series/everyone-was-obsessed-with-me-after-i-became-the-youngest-princess-favourite/",
	"title": "Everyone Was Obsessed With Me After I Became the Youngest Princess Favourite - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/03/Everyone-was-Obsessed-with-me-after-I-became-the-Youngest-Princess-Favourite_1646504934.jpg",
	"noveltype": "(KR)",
	"genre": "Comedy   Fantasy   Romance   ",
	"tags": "Beautiful Female Lead   Betrayal   Character Growth   Child Protagonist   Childcare   Childhood Friends   Comedic Undertone   Cute Children   European Ambience   Fearless Protagonist   Female Protagonist   Flashbacks   Friendship   Handsome Male Lead   Maids   Nobles   Orphans   Slow Romance   Wizards   ",
	"rating": "(4.0 / 5.0, 26 votes)",
	"author": "Heeyoon   희윤   ",
	"year": "\n2022",
	"ranking": "#4080   #4718   #5418   #3631   #5613   ",
	"reviewcount": "3 Reviews sorted by",
	"description": "While performing my duty as a top agent of the Information Guild, a sword pierced through my chest.\n\nI definitely thought at that time I died without a hitch…\n\nWhat? 8 years old?! Back to my hellish nursery days?!!\n\n“Hi, I’m Diana!”\n\nJust then, Diana, the youngest princess of the Duke of Elrad, appeared before me.\n\nIn order not to repeat the bitter regrets of my past life, I took care of Diana, and I was going to send this lovely daughter to the Duke of Elrad… but wasn’t she too nice to me?\n\n“Sister! You’re really pretty! My princess! I’ll protect you!”\n\nThen, Diana never wanted to leave me even just for a second,\n\n“Am I an adult that you can’t rely on?”\n\n“I’m sure I’ve warned you that men’s appearance isn’t everything!!”\n\nOf course, the Duke of Elrad and his second son, who were known as indifferent to everyone except their family.\n\n“I told you not to leave my side without my permission.”\n\nEven the first son of the Duke, who’s famous for being cold, was acting strange!\n\nI monopolised Diana’s affection, but why did everyone become obsessed with me?>"
}