{
	"url": "https://www.novelupdates.com/series/when-an-alpha-is-marked-by-one-of-his-own-kind/",
	"title": "When an Alpha is Marked by One of His Own Kind - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/04/When-an-Alpha-is-Marked-by-One-of-His-Own-Kind.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Mature   Romance   Slice of Life   Sports   Yaoi   ",
	"tags": "Absent Parents   Adopted Protagonist   Awkward Protagonist   Black Belly   Clubs   Cold Protagonist   Complex Family Relationships   Devoted Love Interests   Doting Love Interests   e-Sports   Family Conflict   First-time Interc**rse   Game Elements   Gamers   Handsome Male Lead   Love Interest Falls in Love First   Lovers Reunited   Manly Gay Couple   Modern Day   Multiple POV   Omegaverse   Past Trauma   Possessive Characters   Power Couple   Quiet Characters   Siblings Not Related by Blood   Sickly Characters   Stubborn Protagonist   Teamwork   Tragic Past   ",
	"rating": "(4.4 / 5.0, 250 votes)",
	"author": "Early bird   Zǎo gēng niǎo   早更鸟   ",
	"year": "\n2020",
	"ranking": "#6970   #4842   #2217   #561   #1573   ",
	"reviewcount": "36 Reviews sorted by",
	"description": "Within the industry, everyone knew Team DG’s captain Lu Zhe and Team BLX’s top laner Shen Qiao didn’t get along. They said it was due to hormones. They said it was a basic AA incompatibility.\n\nLu Zhe once said of Shen Qiao: “Obsessed with kills. Lone wolf.”\n\nWith a cold smile, Shen Qiao said of Lu Zhe: “Command’s mediocre. Shitty jungler.”\n\nBut then…\n\nWhen Team DG, champions of the last tournament season, stumbled during the Spring Tournament and fell during the semifinals, someone cut through the furious cursing and swearing that had consumed the internet and leaked the news—\n\nShen Qiao was going to be traded. He was joining Team DG.\n\nWhen that news came out, the internet roared.\n\nDid Shen Qiao and Lu Zhe fight today?\n\nOn esports forums, trolls and haters placed their bets. It was endless, until Team DG won its second world championship crown.\n\nHalf a month after the tournament.\n\nThe players of Team DG hosted a livestream: “The lodgings were awful. Captain and Qiaoqiao had to share a room. Aren’t we pitiful?”\n\nShen Qiao, sitting next to the monitor, glanced over through hooded eyes. He caught a glimpse of a bullet comment and echoed it out loud: “Did we fight?”\n\nHe lifted a hand to his neck. “We fought.”\n\nLu Zhe approached with a cup of black tea. Just in time to see Shen Qiao touch the bite mark on his throat. He added:\n\n“We even broke the bed.”>"
}