{
	"url": "https://www.novelupdates.com/series/mushoku-tensei/",
	"title": "Mushoku Tensei (WN) - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2015/08/mushokutensei.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Comedy   Drama   Ecchi   Fantasy   Harem   Mature   Tragedy   ",
	"tags": "Academy   Adapted to Anime   Adapted to Drama CD   Adapted to Manga   Age Progression   Alternate World   Appearance Different from Actual Age   Aristocracy   Arranged Marriage   Artifact Crafting   Artifacts   Award-winning Work   Beastkin   Beautiful Female Lead   Caring Protagonist   Character Growth   Childcare   Childhood Friends   Childhood Love   Childhood Promise   Cousins   Cowardly Protagonist   Cute Children   Death   Death of Loved Ones   Demon Lord   Demons   Dolls/Puppets   Dragons   Dungeons   Dwarfs   Elemental Magic   Elves   Eye Powers   Familial Love   Family   Fantasy World   First-time Interc**rse   Friends Become Enemies   Friendship   Gods   Guilds   Hard-Working Protagonist   Human-Nonhuman Relationship   Incest   Loli   Magic   Male Protagonist   Manipulative Characters   Marriage   Military   Monsters   Multiple POV   Near-Death Experience   Neet   Older Love Interests   Perverted Protagonist   Polygamy   Pregnancy   R-15   Reincarnated in Another World   Siblings   S*aves   Special Abilities   Strong Love Interests   Student-Teacher Relationship   Sword And Magic   Threesome   Time Skip   Unique Weapons   Wars   Weak to Strong   World Travel   ",
	"rating": "(4.3 / 5.0, 1233 votes)",
	"author": "Rifujin na Magonote   理不尽な孫の手   ",
	"year": "\n2012\r\n",
	"ranking": "#4617   #2875   #1176   #4216   #131   ",
	"reviewcount": "137 Reviews sorted by",
	"description": "A 34-year-old NEET otaku, chased out from his house by his family, found that his life is reaching a dead end. He then recalled that his life could actually have been much better if he had made better choices in the past.\n\nJust when he was at the point of regret, he saw a truck moving at fast speed, and three high schoolers in its path. Mustering all the strength he had, he tried to save them and ended getting run over by the truck, quickly ending his life.\n\nThe next time he opened his eyes, he is reincarnated to a world of sword and magic as Rudeus Greyrat. Born to a new world, a new life, Rudeus decided that, “This time, I’ll really live my life to the fullest with no regret!” Thus starts the journey of a man yearning to restart his life.>"
}