{
	"url": "https://www.novelupdates.com/series/death-spiral-infinite-flow/",
	"title": "Death Spiral [Infinite Flow] - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/08/Death-Roundabout-Infinite-Flow.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Horror   Mature   Mystery   Psychological   Supernatural   Yaoi   ",
	"tags": "Apathetic Protagonist   Calm Protagonist   Character Growth   Charismatic Protagonist   Cheats   Comedic Undertone   Death   Depictions of Cruelty   Devoted Love Interests   Game Elements   Gate to Another World   Gore   Handsome Male Lead   Leadership   Love at First Sight   Love Interest Falls in Love First   Manly Gay Couple   Misunderstandings   Multiple POV   Murders   Mystery Solving   Past Plays a Big Role   Resurrection   Selfless Protagonist   Smart Couple   Special Abilities   Stoic Characters   Survival Game   Teamwork   Thriller   Unlimited Flow   Younger Love Interests   ",
	"rating": "(4.6 / 5.0, 144 votes)",
	"author": "Deep Sea Surgical Scalpel   Shen Hai Shou Shu Dao   深海手术刀   ",
	"year": "\n2020",
	"ranking": "#2071   #2465   #2986   #3786   #2534   ",
	"reviewcount": "23 Reviews sorted by",
	"description": "I shall die and die again to know that life is inexhaustible.\r\n\r\nRabindranath Tagore [Stray Birds].\r\n\r\n[Nth+1 Event Log]\r\nDetected [Core Player]’s death.\r\n\r\n-> Reset world\r\n\r\nThe ghost monsters are resetting…. The world is resetting… Resurrecting all the players… Other than [Core Player], all other player’s memories are erased… Relationship meter is erased…\r\n\r\n! Warning ! Detected [Player X]’s memory is still partially retained.\r\n\r\nResetting player again.\r\n\r\n! Warning ! [Player X]’s memory imprint is too deep to be erased.\r\n\r\nDeleting the player.\r\n\r\n! Warning ! [Player X] is an important character and cannot be deleted.\r\n\r\n…..\r\n\r\nOverride the bug, reset the world to the beginning.\r\n\r\n***After completing the Nth+1 time of resetting***\r\n\r\n**Instance is restarting**\r\n\r\n! Warning ! [Player X] has made contact with [Core Player].\r\n\r\n! Warning ! [Player X]’s feelings towards [Core Player] has exceeded the maximum threshold.\r\n\r\n! Warning ! [Player X] and [Core Player] are commencing indescribable actions.\r\n\r\n! Warning! The following content cannot be displayed according to the relevant rules and regulations.>"
}