{
	"url": "https://www.novelupdates.com/series/otome-game-no-heroine-de-saikyou-survival/",
	"title": "Otome Game no Heroine de Saikyou Survival (LN) - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/11/Otome-Game-no-Heroine-de-Saikyou-Survival.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Fantasy   ",
	"tags": "Abandoned Children   Absent Parents   Academy   Adapted to Manga   Adventurers   Age Progression   Aggressive Characters   Aristocracy   Assassins   Beast Companions   Beautiful Female Lead   Blood Manipulation   Bloodlines   Calm Protagonist   Cautious Protagonist   Child Protagonist   Cold Protagonist   Cunning Protagonist   Dark   Death   Demi-Humans   Depictions of Cruelty   Dwarfs   Elemental Magic   Elves   Fantasy World   Female Protagonist   Friendship   Game Elements   Guilds   Hard-Working Protagonist   Harsh Training   Hiding True Identity   Kidnappings   Kingdoms   Knights   Level System   Loyal Subordinates   Magic   Maids   Multiple Reincarnated Individuals   Murders   Nobles   Orphans   Otome Game   Psychopaths   Reincarnation   Royalty   Ruthless Protagonist   Schemes And Conspiracies   Slow Growth at Start   Social Outcasts   Spirits   Strong to Stronger   Survival   Teachers   Time Skip   Torture   Transplanted Memories   Vampires   Weak to Strong   Yandere   ",
	"rating": "(4.7 / 5.0, 321 votes)",
	"author": "Haru no Hi   Harunohi Biyori   春の日   春の日びより   ",
	"year": "\n2021",
	"ranking": "#874   #642   #1022   #1201   #1153   ",
	"reviewcount": "45 Reviews",
	"description": "A girl Alicia lived as an orphan in a world of sword and magic Ciel.\n\nOne day, she learned that she was an “otome game’s heroine”. Even her parents’ death was simply a part of the scenario. Alicia judged the heroine’s setting as 「nonsense」and discarded it decisively. She introduced herself as adventurer 『Aria』, gradually mastered multiple weapons and magic, and grew to become the 「Ash Crowned Princess of Slaughter」! But, by accepting a request to guard the “villainess”, before she realized it she got dragged into the stage where nobles quarreled against each other――？\n\n「I am “I”. I’m not a game character!」\n\nCreate weapon! Train your body!\n\nSurvive the fighting against powerful enemies and smash apart the otome game!\n\nA sublime and exhilarating other world battle fantasy with charming fighting heroine!>"
}