{
	"url": "https://www.novelupdates.com/series/his-white-moonlight-turned-out-to-be-me/",
	"title": "His White Moonlight Turned Out to be Me - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/06/His-White-Moonlight-Turned-Out-to-be-Me.jpg",
	"noveltype": "(CN)",
	"genre": "Romance   Shounen Ai   ",
	"tags": "Celebrities   First Love   Love Interest Falls in Love First   Modern Day   Showbiz   Singers   ",
	"rating": "(4.1 / 5.0, 17 votes)",
	"author": "一枚纽扣   ",
	"year": "\n2020",
	"ranking": "#2000   #2000   #9891   #8532   #7719   ",
	"reviewcount": "1 Review sorted by",
	"description": "Xu Yu was a small star from a talent audition show. He was too beautiful so he was often used by netizens to edit CP videos. It was also because he was too beautiful that he always took the shou position in the various CPs. He was a big, overall shou.\r\n\r\nOn the day that he terminated his contract with the company, Xu Yu received an interview notice from a brand company to interview to become the male advertiser for the next quarter. Xu Yu went and to his surprise, the interviewer was Su Yuanjiu, the big president of the brand company.\r\n\r\nSu Yuanjiu, president of a top, international luxury brand. A person who clearly wasn’t in the entertainment industry but had a huge fanbase on a CP video clips website. It wasn’t known where these fans got the information but they heard Su Yuanjiu had a white moonlight and shamelessly named the fan group White Moonlight.\r\n\r\nOn this website, Su Yuanjiu matched perfectly with whomever his CP was. It didn’t matter if they were a gong, how alpha they were or how manly they were, everyone automatically turned into a shou in front of Su Yuanjiu. Netizens called him the big, overall gong.\r\n\r\nThe amazing thing was that there was no intersection between this big, overall shou and gong on this website.\r\n\r\nThen one day, netizens found that the big, overall gong had opened a Weibo account. Then they found that the first thing Su Yuanjiu did after opening his Weibo was to follow Xu Yu and only Xu Yu. Just as everyone was talking about the relationship between Su Yuanjiu and Xu Yu, Su Yuanji sent a Weibo post.\r\n\r\n“Who is interested in editing a CP video between Xu Yu and me? I want to watch it.”\r\n\r\nEveryone: ?????\r\n\r\nEveryone: What?!!!!!\r\n\r\nEveryone: Leave it to me!!!!!\r\n\r\nLater, Su Yuanjiu sent a second Weibo post. “I heard some people are calling themselves White Moonlight? Sorry, my white moonlight is back.”>"
}