{
	"url": "https://www.novelupdates.com/series/sweet-finale-to-a-lifetime-of-quick-transmigrations/",
	"title": "Sweet Finale to a Lifetime of Quick Transmigrations - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/12/SF-cover.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Drama   Josei   Romance   Slice of Life   ",
	"tags": "Amnesia   Beautiful Female Lead   Calm Protagonist   Caring Protagonist   Celebrities   Character Growth   Charismatic Protagonist   Confident Protagonist   Devoted Love Interests   Doting Love Interests   Doting Older Siblings   Doting Parents   Familial Love   Female Protagonist   Handsome Male Lead   Male Yandere   Manipulative Characters   MMORPG   Modern Day   Mysterious Past   Older Love Interests   Orphans   Possession   Possessive Characters   Second Chance   S*x Friends   Showbiz   Siblings   Sister Complex   System Administrator   Transmigration   Unrequited Love   Younger Brothers   ",
	"rating": "(4.0 / 5.0, 122 votes)",
	"author": "锦橙   ",
	"year": "\n2019",
	"ranking": "#1444   #4164   #2511   #4150   #2257   ",
	"reviewcount": "45 Reviews sorted by",
	"description": "After Su Nuo had died, she discovered that she lived in a novel where the female supporting character had overtaken her role as the female lead.\n\nThe female supporting character, who had transmigrated into Su Nuo’s world, was pretty and outstanding. She had easily replaced the good-for-nothing dodder of a female lead.\n\nThen, Su Nuo went through a series of quick transmigrations —\n\nThe flirtatious concubine of a troubled nation, the cannon fodder in a prestigious family, a young girl who joined the military for her father…\n\nSu Nuo transmigrated back to her original world after completing ten quick transmigration assignments.\n\nOutside the patient’s room, the fiance that she had grown up with mocked her coldly, “I don’t care if you try to commit suicide for me 100 times. I will never be interested in you.”\n\nThis was the day after she had attempted suicide for Shen Weng. It was a warm and sunny day in spring, and she was 19 years old.\n\n***\n\nSu Nuo was a well-pampered, sweet pushover. Shen Wang hadn’t liked her since she was a child.\n\nHowever…\n\nHe later discovered that his pampered and tender fiancee had turned into a female despot.>"
}