{
	"url": "https://www.novelupdates.com/series/sha-po-lang/",
	"title": "Sha Po Lang - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/06/Sha-Po-Lang.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Comedy   Drama   Historical   Martial Arts   Mature   Mecha   Mystery   Romance   Shounen Ai   Xuanhuan   ",
	"tags": "Ancient China   Aristocracy   Blind Protagonist   Buddhism   Caring Protagonist   Character Growth   Charismatic Protagonist   Charming Protagonist   Clever Protagonist   Comedic Undertone   Complex Family Relationships   Confident Protagonist   Couple Growth   Curses   Determined Protagonist   Devoted Love Interests   Disabilities   Doting Love Interests   Famous Protagonist   Fast Learner   Fearless Protagonist   Generals   Genius Protagonist   Glasses-wearing Protagonist   Guardian Relationship   Handsome Male Lead   Hard-Working Protagonist   Leadership   Love Interest Falls in Love First   Loyal Subordinates   Medical Knowledge   Military   Mysterious Family Background   Mysterious Illness   Politics   Power Couple   Power Struggle   Protagonist Strong from the Start   Royalty   Schemes And Conspiracies   Secret Identity   Secret Organizations   Shameless Protagonist   Slow Romance   Smart Couple   Strategist   Strong Love Interests   Time Skip   Tragic Past   Unconditional Love   Wars   Younger Love Interests   ",
	"rating": "(4.6 / 5.0, 577 votes)",
	"author": "Priest   ",
	"year": "\n2015",
	"ranking": "#3923   #4751   #1343   #6030   #237   ",
	"reviewcount": "94 Reviews sorted by",
	"description": "“The first person to dig ziliujin fuel out of the ground could never have predicted that what they dug out was the beginning of a dog-eat-dog age.\n\nOur entire life was but an ugly confidence game of greed; this is something everyone knows, but that they could not bring to light.\n\nFrom where did this con begin? Maybe from atop the first clean white canvas sails of a foreign ship that sailed across the ocean, or from beneath the great wing of a Giant Kite as it rose unsteadily into the skies — or from a time even before that: as the spreading ziliujin, like an ink stain upon the earth, turned the great plains of the wild north into a sea of flames.\n\nOr maybe it was when We… when I met Gu Yun in a world all covered in ice and snow.”>"
}