{
	"url": "https://www.novelupdates.com/series/im-not-afraid-of-being-a-scumbag/",
	"title": "I’m Not Afraid of Being a Scumbag - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/09/Im-Not-Afraid-of-Being-a-Scumbag.png",
	"noveltype": "(CN)",
	"genre": "Fantasy   Romance   ",
	"tags": "Beautiful Female Lead   Female Protagonist   Handsome Male Lead   Misunderstandings   Modern Day   Proactive Protagonist   Protagonist Falls in Love First   Strong Love Interests   System Administrator   Transmigration   Wealthy Characters   ",
	"rating": "(3.3 / 5.0, 15 votes)",
	"author": "Tang Shan Yue   糖山月   ",
	"year": "\n2019",
	"ranking": "#2000   #6195   #9147   #10658   #9366   ",
	"reviewcount": "4 Reviews sorted by",
	"description": "Tang Luo transmigrated into a CEO novel and became a white, super rich and beautiful……. female who loved the ML dearly.\n\nThe ML thought she had a poisonous heart and kept harming the FL which led to her parents telling her to get out of the house. She soon died miserably, alone, without any friends and relatives.\n\nSystem: The two months life countdown begins, please ask for the ML’s forgiveness as soon as possible! The ML has to believe that you have no malicious intention towards the FL. Only then your survival time will be extended. This side proposes you to quickly apologize to the FL…….\n\nNo! Tang Luo firmly refused: I will solve the problem from its root!\n\nAt once, Tang Luo kicked the idiot ML who only knew how to misunderstand herself and raced against time to cleanly and thoroughly eat the successful, beautiful, and mysterious big shot. Then pulled him to handsomely face the ML: “Open your eyes, this is the person I love, my darling. Everything in the past was a misunderstanding!” 　　　　\n\nTwo months later, when the threat to her life was thoroughly removed, Tang Luo enjoyed her life. She travelled, shopped and tasted many gourmet food but suddenly found herself blocked in a room. \n\n“So…. are you tired of playing? Have you seen enough?” The handsome big shot smiled in anger and closed in on her step by step, “Is it boring after you caught it? Hm?”>"
}