{
	"url": "https://www.novelupdates.com/series/no-one-knows/",
	"title": "No One Knows - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/09/No-One-Knows.jpg",
	"noveltype": "(CN)",
	"genre": "Drama   Shounen Ai   Tragedy   ",
	"tags": "Betrayal   Confinement   Cruel Characters   Death   Emotionally Weak Protagonist   First Love   Forced Living Arrangements   Loneliness   Long Separations   Misunderstandings   Modern Day   Past Plays a Big Role   Revenge   Selfless Protagonist   Short Story   Sickly Characters   Terminal Illness   ",
	"rating": "(3.9 / 5.0, 23 votes)",
	"author": "Youlan   又蓝   ",
	"year": "\nN/A",
	"ranking": "#936   #1924   #9070   #4455   #11907   ",
	"reviewcount": "3 Reviews sorted by",
	"description": "On a cold wintry evening, he finally closed his eyes for an eternity.\r\n\r\nHe thought, “So be it.”\r\n\r\n***\r\n\r\nHe Yusen came back, hoping to have one last look at his ex-lover, whom he still loved so much. However, what met him was a pair of eyes full of hatred and excruciating pain from the other person’s sharp words tinged with obvious animosity. In addition, another person was already by his side — his new lover.\r\n\r\nWith all of these laid painfully in front of him, he could only resign to his fate and keep his illness a secret upon himself. Nevertheless, in his last moments, he wasn’t able to endure his innermost desire and called him, “Lu-ge, how good would it be…” if I didn’t get sick?\r\n\r\nUnsure if he was able to say the rest, he forever closed his eyes. No one came to know what his last words were.\r\n\r\n***\r\n\r\nLu Jing didn’t hear He Yusen’s words. When his ex-lover came back, all he wanted to do was return all the pain he had suffered to the person who ruthlessly abandoned him. For that purpose, he introduced a new lover and went to various places that he and He Yusen promised to visit together when they were young.\r\n\r\nHe didn’t imagine that this thirst for revenge would cost him the chance to see the person one last time.>"
}