{
	"url": "https://www.novelupdates.com/series/youre-right-theyll-expel-me-if-i-run-into-the-store-with-a-weapon/",
	"title": "You’re Right, They’ll Expel Me if I Run into the Store with a Weapon!! - Novel Updates",
	"image": "https://www.novelupdates.com/img/noimagefound.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Comedy   Fantasy   Harem   School Life   Slice of Life   ",
	"tags": "Battle Academy   Beautiful Female Lead   Evil Organizations   Love Interest Falls in Love First   Male Protagonist   Military   Misunderstandings   Modern Day   Multiple POV   Mysterious Past   Possessive Characters   R-15   Special Abilities   Strong Love Interests   Weak Protagonist   Yandere   ",
	"rating": "(3.6 / 5.0, 38 votes)",
	"author": "こまこま   ",
	"year": "\n2018",
	"ranking": "#3567   #2000   #8107   #3705   #9799   ",
	"reviewcount": "No Reviews",
	"description": "Hiroki Ogino is a typical high school student. Or rather, it’s already 『Hiroki Ogino was a typical high school student』  in the past tense.\n\nDue to a slight mis-understanding, he was yanked away from the typical route and got transferred to a branch of the『Combat College』established by the Japanese Government.\n\nThis school has an unusual curriculum and is established in each country individually.\n\nTo gain admission into the school, the prerequisite is to have 『Combat Strength』. As a condition for admission, it is absolutely necessary to have 『Combat Strength』.\n\nTo Hiroki, what’s going to happen next is a series of convenient misunderstandings\n\nUnbeknown to him, the people around him are accelerating the misunderstandings, leading to him being misunderstood as the strongest in 『Combat Studies Japan Branch』.\n\n『Serious』×『Gag』\n\n「Dropouts are not accepted!  I had to double check the school guide to see whether it was possible!   Eh? Aren’t I an exceptional case? Is it really unacceptable? Ahh, I understand. If that’s the case, I will point a gun at my teammates or the general public in the midst of a mission and drop out! ! Because I don’t want to die yet! 」>"
}