{
	"url": "https://www.novelupdates.com/series/i-thought-you-were-a-time-limited-husband/",
	"title": "I Thought You Were A Time-Limited Husband - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/01/I-Thought-You-Were-A-TimeLimited-Husband.jpg",
	"noveltype": "(KR)",
	"genre": "Comedy   Fantasy   Romance   ",
	"tags": "Aristocracy   Arranged Marriage   Beautiful Female Lead   European Ambience   Female Protagonist   Handsome Male Lead   Love Interest Falls in Love First   Nobles   Sickly Characters   Transmigration   ",
	"rating": "(4.3 / 5.0, 25 votes)",
	"author": "Gaonna Light   가온나라빛   ",
	"year": "\n2021",
	"ranking": "#5262   #4671   #7056   #7355   #6142   ",
	"reviewcount": "2 Reviews sorted by",
	"description": "“Six months. Be sure to kill your husband within that time frame.”\n\nAt the order of her mother-in-law, she became the supporting role of a wife who kills her husband.\n\n“Wow…… handsome….”\n\nA husband too handsome to poison.\n\nAlice couldn’t bring herself to poison him.\n\nShe managed to avoid her mother-in-law from suspecting her by secretly using sacred power instead of poison.\n\n“Mother, I will be a priest as the former wife of the Duke! I will become a deaconess and pray for the Duke’s well-being for the rest of my life!”\n\nBut why did this happen?\n\nOn the very day she tried to leave the Duke, the unconscious duke, her husband, woke up.\n\n“You were the one who pulled me out of the darkness, so take responsibility.”\n\nI saved a drowning person, and he had the nerve to give me a bundle.\n\n* * *\n\n“If you don’t like money and power… how about me? I’ll give you my body if you want.”\n\nWhat are you offering…?\n\nAlice pulled on her earlobe slightly, wondering if she had just heard something wrong. \n\nAnd asked him back as calmly as possible. \n\n“I’m sorry, Duke, but… are you crazy?”\n\n“Unfortunately, I’m not crazy yet. Rather, my mind is clearer than ever.”\n\nKaillus raised the corners of his mouth with a nonchalant expression. \n\nSo you’re saying that you’re going to sacrifice yourself? His words looked sincere – this man. \n\nAlice had a hunch as she looked into his dark eyes. That her life is twisted.>"
}