{
	"url": "https://www.novelupdates.com/series/sickly-husbands-contractual-wife/",
	"title": "Sickly? Husband’s Contractual Wife - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/11/sicklyisit2.jpg",
	"noveltype": "(KR)",
	"genre": "Fantasy   Romance   ",
	"tags": "Abusive Characters   Adapted to Manhwa   Aristocracy   Arranged Marriage   Arrogant Characters   Beautiful Female Lead   Contracts   Death   Different Social Status   Divorce   European Ambience   Female Protagonist   Handsome Male Lead   Love Interest Falls in Love First   Marriage   Marriage of Convenience   Misunderstandings   Mob Protagonist   Nobles   Personality Changes   Second Chance   Shameless Protagonist   Siblings   Sickly Characters   Slow Romance   Transmigration   Weak to Strong   ",
	"rating": "(4.1 / 5.0, 114 votes)",
	"author": "Serian   세리안   ",
	"year": "\n2019",
	"ranking": "#5262   #4816   #2231   #2010   #1646   ",
	"reviewcount": "8 Reviews sorted by",
	"description": "I'm Selena, a daughter born to a family well-known for their fertile women. I was sold off in a marriage to a sickly duke whose life hung in the balance, for the sake of producing an heir of his family. They provided me a medicine purported to aid in pregnancy, and the astrologist even advised me about good days to sleep together, but...there was no child.\n\n'So, are there any signs of pregnancy?'\n\n'Ah, I-I'm sorry.'\n\n'You're useless. What luck do you think won you the position of the duke's wife?'\n\nI couldn't say a word.\n\n‘No, excuse me. I only have to look at the sky to pluck a star. That's how I attained this position.'\n\n***\n\nA husband who doesn't like touching me in the least.\n\nBut he's still pitiful so let's at least make him healthy by feeding him nutritious food, getting him to exercise, and I'll personally test any doubtful food first. Once he recovers from my extensive efforts, I'll sign an annulment paper and flee, but...\n\n'You agreed to a contract to bear me an heir. But to think you would go back on your words...'\n\nAlthough he's in good health now, my 'former' husband has become a bit too healthy.\n\n'You're healthy now!'\n\n'The duties of marriage are sacred. I will collect my dues.'\n\n'Wait. Wait! But we're divorced? We're no longer husband and wife...'\n\nHe smirked then took a piece of paper from his breast pocket and tossed it to me.\n\n'We aren't divorced yet.'>"
}