{
	"url": "https://www.novelupdates.com/series/do-flowers-bloom-in-the-fallen-land/",
	"title": "Do Flowers Bloom in the Fallen Land? - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/06/Do-Flowers-Bloom-in-the-Fallen-Land.jpg",
	"noveltype": "(KR)",
	"genre": "Adult   Drama   Fantasy   Harem   Mature   Romance   Smut   ",
	"tags": "Aristocracy   Arranged Marriage   Arrogant Characters   Beautiful Female Lead   Character Growth   Cold Love Interests   Complex Family Relationships   Different Social Status   Empires   European Ambience   Female Protagonist   First Love   First-time Interc**rse   Handsome Male Lead   Jealousy   Male Yandere   Marriage   Nobles   Obsessive Love   Omegaverse   Possessive Characters   Power Struggle   R-18   Reverse Harem   Royalty   Strong Love Interests   Timid Protagonist   Weak to Strong   ",
	"rating": "(3.5 / 5.0, 15 votes)",
	"author": "이낙낙   ",
	"year": "\n2022",
	"ranking": "#2182   #2076   #10260   #5569   #8684   ",
	"reviewcount": "1 Review",
	"description": "Seira was divorced.\r\n\r\nIt had been eight years since she became the fiancee of the Crown Prince Calrad Lowell Viseltium. Will she live as a Duchess with nothing but pride, or will she abandon her family and live with the Crown Prince? Seira had to choose.\r\n\r\nTossed to the cold, but steadfastly survived. By grinding her teeth, she grew stronger and protected her family and her father's name. But still, one step ahead seemed like a cliff towards doom. The dead land was barren and there was nothing to hold on to.\r\n\r\nMen reached out towards her. Whose hand should she choose to hold? Or should she not catch any of it?\r\n\r\n“For now, just focus on me. Otherwise, you will regret it.” - Baron Jeff.\r\n\r\n“Even if my kindness is fake, what does it have to do with you?” - Louis Franto\r\n\r\n“I will not grant you freedom now.” - Calrad Lowell Viseltium\r\n\r\n“You can have me whenever you want.” - Aven Helford\r\n\r\nBlack flowers that swallowed despair bloom all over the continent, and greed like hunger blooms at the very heart of Viseltium.>"
}