{
	"url": "https://www.novelupdates.com/series/surviving-as-an-obsessive-servant/",
	"title": "Surviving As An Obsessive Servant - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/11/Surviving-As-An-Obsessive-Servant.jpg",
	"noveltype": "(KR)",
	"genre": "Comedy   Drama   Fantasy   Gender Bender   Romance   ",
	"tags": "Aristocracy   Beautiful Female Lead   Cross-dressing   European Ambience   Female Protagonist   Handsome Male Lead   Master-Servant Relationship   Nobles   Obsessive Love   Reincarnation   Servants   Shameless Protagonist   Sickly Characters   Transmigration   ",
	"rating": "(4.1 / 5.0, 46 votes)",
	"author": "이투   ",
	"year": "\n2021",
	"ranking": "#1710   #1338   #4736   #1978   #3722   ",
	"reviewcount": "6 Reviews sorted by",
	"description": "The third time to die after suffering from the same rare disease in the BL novel.\n\nShe can’t die in vain like this anymore. \n\nSo, special measures were taken. \n\n‘Let’s put a spoon on the well-prepared medicine table!’\n\nYoung master, I won’t miss a single drop of medicine and a breath! \n\nShe disguised herself as a servant and tried to serve the sick Young Master.\n\nIt couldn’t get any better than this that even the power of the spirits from his breath heals me!\n\nBut it was not easy to do that—.\n\n“Get out! Get out!—I’m sick of everything now!!!—Wait. What are you doing on your knees now?”\n\n“Master, if you’re going to throw it away, please put it in my mouth.”\n\nI was embarrassed and told him this while trying to stop him from turning his arm around and throwing a medicine bottle.\n\n“I don’t care if you spray it on my face—”\n\nThe Young Master’s pupils were wildly changing at the time.\n\nI’m a woman who does what I have to do.\n\nAs much as possible, I took good care of my master, who is my lifesaver. \n\nAs well as serving, I gave hugs, carried him, and became his legs and walked around everywhere.\n\nDid he recognize my true value as the heir to a venerable Duke? \n\nThe master looked at me tiredly from time to time, but he did not kick me out. \n\nNow, you must have recovered, and you must have paid back your kindness. \n\nWhen I was slowly trying to escape—.\n\n—The Young Master has become weird. \n\n“Where are you trying to run away when you like me so much?”\n\n“…..”\n\n“You said you’d die without me.”\n\nSuddenly, he had the face of a hungry predator. >"
}