{
	"url": "https://www.novelupdates.com/series/transmigrating-into-the-male-leads-villainess-older-sister/",
	"title": "Transmigrating Into The Male Lead’s Villainess Older Sister - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/08/Transmigrating-Into-The-Male-Leads-Villainess-Older-Sister.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Romance   Slice of Life   Supernatural   ",
	"tags": "Abandoned Children   Abusive Characters   Acting   Artists   Beautiful Female Lead   Celebrities   Cold Love Interests   Cowardly Protagonist   Cruel Characters   Cute Protagonist   Family Conflict   Fated Lovers   Female Protagonist   Handsome Male Lead   Lucky Protagonist   Male Yandere   Models   Modern Day   Multiple Reincarnated Individuals   Overprotective Siblings   Psychopaths   Showbiz   Siblings   Sickly Characters   Sister Complex   Slow Romance   Transmigration   Villainess Noble Girls   Younger Brothers   ",
	"rating": "(4.0 / 5.0, 345 votes)",
	"author": "Zhí Dēng Yè Xíng   执灯夜行   ",
	"year": "\nN/A",
	"ranking": "#852   #599   #683   #336   #601   ",
	"reviewcount": "94 Reviews sorted by",
	"description": "Siyu transmigrated into a manhua and became the male lead’s half-sister. The sister had a sickly fragile body, one that couldn’t even withstand a gust of wind. It’s a pity that her heart was so vicious. \n\nOver and over, she tried to kill the male and female lead. Until finally she was hated by all, deserted by everyone close, cursed by people, and died miserably alone in the rain one night. \n\nNow the question was: how could she stay alive in peace as a sickly beautiful lady who always vomits blood for no reason and could drop dead at any time? \n\nFortunately, Siyu soon discovered that she could see another person’s luck. So, as long as other people around her had better luck than hers, she could rely on their blessings to extend her life. \n\nAs for her... Siyu looked into the mirror. No matter how she looked at it, the person in the mirror looked like she would die early. It’s not an exaggeration. If you’re talking about bad luck, then everyone else was tr*sh. \n\nThe wave was stable; no matter how crazy she played, she wouldn’t die! (～￣▽￣)～  \n\nUntil she came across a great god who was feared by everybody—\n\nSiyu: “Don’t, don’t come near me QAQ”\n\nFifth Master Lu smiled gently whilst the beads on his hand were shattered into pieces, “Run away once more, and I’ll break your leg.”>"
}