{
	"url": "https://www.novelupdates.com/series/farmer-lady-of-fortune-imperial-concubine-dont-be-too-sweet/",
	"title": "Farmer Lady of Fortune, Imperial Concubine, Don’t Be Too Sweet - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/03/PLF.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Josei   Romance   Slice of Life   ",
	"tags": "Age Progression   Ancient China   Beautiful Female Lead   Business Management   Carefree Protagonist   Caring Protagonist   Cheats   Child Protagonist   Childhood Friends   Cute Protagonist   Devoted Love Interests   Doting Love Interests   Doting Older Siblings   Doting Parents   Familial Love   Farming   Female Protagonist   Handsome Male Lead   Loli   Love Interest Falls in Love First   Magical Space   Male Yandere   Medical Knowledge   Modern Knowledge   Possessive Characters   Reincarnation   Strong Love Interests   Tragic Past   ",
	"rating": "(3.8 / 5.0, 72 votes)",
	"author": "Chengzi cheng cheng   橙子澄澄   ",
	"year": "\nN/A",
	"ranking": "#1750   #932   #1628   #2687   #2620   ",
	"reviewcount": "18 Reviews sorted by",
	"description": "A blessed baby was born out of Xinghua Village, the family pampered her, the villagers boasted of her, and her blessings were boundless. \n\nThe emphatic biased grandma: I’m biased towards my granddaughter, if you’re unhappy about it, suck it up! \n\nThe wild devil grandpa boasting his granddaughter: What’s this, you ask? My granddaughter has made ginseng Ganoderma tea for me! \n\nThe gentle and doting mother: A baby girl should be coddled, don’t move, let your brother do it! \n\nThe dad striving for favor: Little darling, dad will take you flying, want to ride a horse, come to dad quickly! \n\nLiu Yusheng bloomed like a flower behind her family. With a golden needle, she became a renowned doctor, the spiritual spring in her space healed diseases, her family was flourishing, but there’s this man who always slipped into her boudoir. \n\n“Sheng Sheng, I haven’t been treated yet today.” \n\n“… My lord, although I am a divine doctor, I really don’t know how to treat mental illness.” \n\n“I’m not mentally ill.” \n\n“You are.” \n\n“I’m not.” \n\n“…” \n\nHe is the majestic Nanling Prince. The world says that Nanling Prince is a man of outstanding looks and modesty, and as holy as the moon in the sky. \n\nBut before Liu Yusheng, he turned into a lunatic. For her, no madness means death.>"
}