{
	"url": "https://www.novelupdates.com/series/mystical-journey/",
	"title": "Mystical Journey - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2017/11/myst_j.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Fantasy   Martial Arts   Mature   Mecha   Mystery   School Life   Sci-fi   Supernatural   Tragedy   ",
	"tags": "Antihero Protagonist   Antique Shop   Body Tempering   Brother Complex   Calm Protagonist   Cheats   Demon Lord   Demons   Dragons   Firearms   Game Elements   Gate to Another World   Godly Powers   Gods   Hard-Working Protagonist   Hiding True Abilities   Hiding True Identity   Hot-blooded Protagonist   Incest   Indecisive Protagonist   Interdimensional Travel   Legends   Magic   Male Protagonist   Multiple Realms   Multiple Reincarnated Individuals   Mythical Beasts   Naive Protagonist   Overpowered Protagonist   Parallel Worlds   Psychic Powers   Reincarnation   Reverse R*pe   Romantic Subplot   Ruthless Protagonist   Schemes And Conspiracies   Soul Power   Souls   Strength-based Social Hierarchy   Transformation Ability   Transmigration   Transported to Another World   Underestimated Protagonist   Unreliable Narrator   Unrequited Love   Vampires   Wars   Weak to Strong   Werebeasts   World Hopping   World Travel   Younger Sisters   ",
	"rating": "(3.5 / 5.0, 200 votes)",
	"author": "Get Lost   滚开   ",
	"year": "\n2013",
	"ranking": "#6970   #6291   #811   #9891   #2677   ",
	"reviewcount": "48 Reviews sorted by",
	"description": "One moment, Luo Jing was at the brink of death after accidentally touching a power outlet while showering. The next, he was in the body of a man named Garen, with memories of a past he was never a part of flowing into his head. As he slowly gets used to the body of Garen, he begins to explore a planet beyond his own logical comprehension. His journey will see him go from surviving in a planet locked in the 20th century, to wielding secret techniques so powerful that they level cities overnight. However, his journey doesn’t end with Garen. Instead this is but the first of many bodies that Luo Jing will come to wield in his mystical journey between worlds. >"
}