{
	"url": "https://www.novelupdates.com/series/siege-in-fog/",
	"title": "Siege in Fog - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/05/Siege-in-Fog.jpg",
	"noveltype": "(CN)",
	"genre": "Drama   Historical   Romance   Shoujo   Tragedy   ",
	"tags": "Abusive Characters   Adapted to Drama   Beautiful Female Lead   Cold Protagonist   Female Protagonist   Handsome Male Lead   R*pe   ",
	"rating": "(4.2 / 5.0, 57 votes)",
	"author": "Fei Wo Si Cun   匪我思存   ",
	"year": "\n2011",
	"ranking": "#2000   #2000   #5925   #6713   #7948   ",
	"reviewcount": "3 Reviews sorted by",
	"description": "The story is about the warlord’s Republic of China. The predators in the north, the Yi Family are seemingly calm. The father is kind and the sons are filial. Further inland, it is actually full of lumps of rage. The third son, Yi Lian Kai (Elvis Han Dong Jun) is extremely ambitious, even keeping a low profile, the second son, Yi Lian Shen takes decisive steps as he assesses the complete situation.\n\nThe third son of the Yi Family, Yi Lian Kai has feelings for the newest student, Qin Sang. To marry Qin Sang, Yi Lian Kai goes through painstaking efforts, and in the end, Qin Sang is forced to marry into the Yi Family. After the marriage, the third son of the Yi Family doesn’t change his playboy style. He is arrogant and despotic. When a superior is killed, this triggers their pains and sorrows. The couple is courteous to each other, and Yi Lian Kai seems like he is cold and unfeeling to Qin Sang. In reality, this all has a reason behind it. Seeing the Yi Family that appears calm on the outside, but is actually full of conflict in the inside, as the three brothers fight a battle to win the most of the inheritance and property. Endlessly.\n\nThe secret identity of the Japanese officer, Pan Jian Chi, accidentally becomes Yi Lian Kai’s lieutenant. But in Qin Sang’s memories, Pan Jian Chi is an honest, advanced fighter for the revolution. The meeting of the enemies, great changes in identity, a new love, old friends, a country’s grief. This is the siege of fog.>"
}