{
	"url": "https://www.novelupdates.com/series/kyoukai-senjou-no-horizon/",
	"title": "Kyoukai Senjou no Horizon - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/02/Horizon4A_cover.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Comedy   Ecchi   Fantasy   Harem   Romance   Sci-fi   Shounen   ",
	"tags": "Adapted to Anime   Adapted to Game   Adapted to Manga   Alternate World   Androids   Battle Academy   Carefree Protagonist   Childhood Friends   Contracts   Elves   Familiars   Folklore   Futuristic Setting   Gods   Human-Nonhuman Relationship   Kingdom Building   Magic   Male Protagonist   Multiple POV   Narcissistic Protagonist   Perverted Protagonist   Politics   Polygamy   Power Struggle   Sentient Objects   Shameless Protagonist   Shoujo-Ai Subplot   Special Abilities   War Records   Wars   Werebeasts   ",
	"rating": "(4.1 / 5.0, 99 votes)",
	"author": "Kawakami Minoru   ",
	"year": "\n2008\r\n",
	"ranking": "#6970   #2000   #4371   #11742   #1868   ",
	"reviewcount": "4 Reviews sorted by",
	"description": "Kyoukai Senjou no Horizon chronicles the story of a futuristic civilization returned to Earth after constant warfare hindered them from traveling beyond the post-Apocalyptic Earth. At this stage, a small archipelago called the Divine States were the only hospitable land on Earth. In order to regain the space-faring technology they had lost after many years of war, they decided to recreate history with a book called the Testament as a guide.\r\n\r\nIt is the year 1648 in the Testament Era. Toori Aoi, Chancellor and Student Council President of the only academy on the airborne city-ship Musashi, faces the ten-year anniversary of the death of his childhood friend Horizon Ariadust in an accident. As he prepares to celebrate the occasion by proposing to P-01s (an automaton who looks exactly like Horizon) he discovers that his suspicion about P-01s’ appearance actually has a basis in truth; P-01s is in fact Horizon Ariadust, reborn into a robotic body. In addition to this, Horizon’s emotions had been stripped away and are now stored in eight powerful weapons called the Mortal Sin Armaments; which are now in the possession of key people in various established countries in the Divine States.\r\n\r\nTo retrieve the emotions of Horizon Ariadust, Toori Aoi along with his friends and allies begins a crusade against different obstacles as key events in history are recreated in a futuristic manner.>"
}