{
	"url": "https://www.novelupdates.com/series/using-a-wok-to-reorganize-life-and-fly-to-immortality/",
	"title": "Using a Wok to Reorganize Life and Fly to Immortality - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/07/Using-a-Wok-to-Reorganize-Life-and-Fly-to-Immortality.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Fantasy   Xianxia   ",
	"tags": "Alchemy   Ancient Times   Comedic Undertone   Cooking   Cultivation   Female Protagonist   Lack of Common Sense   Magic Beasts   Pill Based Cultivation   Sect Development   Slow Romance   Transmigration   Unique Cultivation Technique   ",
	"rating": "(4.2 / 5.0, 44 votes)",
	"author": "盐焗大龙虾   ",
	"year": "\n2022",
	"ranking": "#48   #59   #3423   #68   #6559   ",
	"reviewcount": "10 Reviews",
	"description": "Su Yu, a descendant of a royal chef, entered a novel of the immortal world. She became a second senior sister who took over a mountain full of wounded and disabled from her missing senior brother.\n\nAccording to the original plot, her third junior brother’s golden core was broken. Her fourth junior brother gets into trouble. Her fifth junior brother was deceived… In short, they are dead, casualties, or injured.\n\nSu Yu: Ah, this… our division seems to be over.\n\nLooking at a group of skinny, weak, or disabled juniors, Su Yu, who wanted to retire: What kind of immortals are cultivating and fighting? Come and help me cook! Peace is a blessing!\n\nHowever, when she researched the ingredients in this world of cultivating immortals and decided to make a pot of delicious vegetables… the spiritual energy in the wok was great and the fragrance spread, but there was a faint circle of energy, which turned into super-quality spiritual pill that could repair broken meridians lying on the bottom of the wok.\n\nSu Yu: !\n\nThe seriously wounded and waiting to die juniors: !\n\nMaster Su didn’t believe in failure. When she was preparing to make a lotus leaf roasted rib, oil dripped and the aroma was overflowing. But at the bottom, there was a faint gleam of light accompanied a two-foot-long spirit sword, unparalleled in sword energy and a rare treasure once in a century.\n\nJunior brother who gave up cultivation because of lack of spirit swords: !\n\nLooking at the pots and pans full of spiritual pills and spiritual treasures piled up in her small kitchen, Su Yu frowned.\n\nYou may not believe it, but I just want to make a dish.\n\nThe heroine who sucked her luck but went all the way to decline: ???\n\n—\n\nBecause his cultivation rose too fast, the number one senior brother of Zhiqiong Peak, Xiao Muge, had to go far to the northern glacier to suppress his terrifying cultivation.\n\nA year later, he finally avoided the Ascension Thunder Tribulation and rushed back to his sect, preparing to regain the luck for his juniors, but he almost didn’t recognize his own peak.\n\nHis third junior brother with a broken golden core had leveled up into Yuan Ying. His fourth junior, with extremely poor musical talent, had become a complete success… And his second junior sister, who is sullen, cold, and has never been out of her room, is sitting on the throne of the peak leader with her phoenix eyes narrowed. Her red lips raised when she enjoyed her junior’s respectful thanks. “Second Senior Sister is the master of our peak. She has powerful wisdom and is omnipotent. Senior Brother… Who is Senior Brother?”\n\nXiao Muge: ?>"
}