{
	"url": "https://www.novelupdates.com/series/white-horse-neighing-in-the-west-wind/",
	"title": "White Horse Neighing in the West Wind - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2015/09/swordswoman.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Historical   Tragedy   Wuxia   ",
	"tags": "Adapted to Drama   Ancient China   Female Protagonist   Unrequited Love   ",
	"rating": "(3.6 / 5.0, 12 votes)",
	"author": "Jin Yong   ",
	"year": "\n1961",
	"ranking": "#2000   #2000   #11873   #13810   #11551   ",
	"reviewcount": "No Reviews",
	"description": "White Horse Neighing in the West Wind by Jin Yong was first serialized in the newspapers in 1961.\r\n\r\nLi Wenxiu, a young Han Chinese maiden, loses her parents in the Gobi Desert while escaping from a group of bandits who are after a map of the Gaochang labyrinth. Placed on a white steed, she flees to Kazakh territory and is taken into the care of Old Man Ji, an elderly Han Chinese man. While growing up, she meets Supu, a Kazakh boy, and starts a romance with him. However, Supu's father disapproves of the relationship between his son and a Han Chinese girl, so they are forced to separate.\r\n\r\nSeveral years later, Li Wenxiu meets Hua Hui, a hermit, in an oasis in the Gobi Desert, and helps him cure his wounds. Hua Hui feels grateful to her and accepts her as his apprentice and teaches her martial arts. She returns home in the midst of heavy snowfall and sees Supu, his father, and his new lover taking shelter in her house. Chen Dahai, the leader of the group of bandits who killed Li Wenxiu's parents, arrives at Li's home and suspects that the map he has been hunting for is inside the house. He ransacks the house for the map and eventually finds it. The secret of the map is revealed when blood is spilled onto the cloth. Chen wants to silence Supu and the others but is stopped and defeated by Li, who has disguised herself as an old man.\r\n\r\nChen Dahai flees with the map and finds his way to the labyrinth, while Li Wenxiu and Supu gather five others to join them in pursuing Chen and the bandits. The seven of them make their way to the labyrinth, where they are surprised to find ordinary items associated with Han Chinese culture instead of treasure and riches as they expected. To their horror, they encounter a 'ghost' who haunts them by killing their companions without leaving any traces. Just as they are about to flee, Supu learns that his lover has been kidnapped by the 'ghost' and he tracks the 'ghost' to its lair in the labyrinth, where he discovers that the 'ghost' is actually a martial arts expert in disguise.\r\n\r\nThe 'ghost' tells his story and reveals that he was forced into exile because he was betrayed by his apprentice, who is actually Old Man Ji. The 'ghost' is the hermit Hua Hui, whom Li Wenxiu saved earlier. To everyone's surprise, Old Man Ji is revealed to be actually a man in his 30s in disguise as an old man. Old Man Ji and Hua Hui start fighting with each other. Li is shocked to realise that the two, who are close to her, are actually enemies. Hua Hui eventually dies in his futile attempt to kill everyone in the labyrinth. After leaving the labyrinth, Li Wenxiu hears the true story behind the items hidden in the labyrinth and their origins. She decides to leave the land for central China as she feels miserable after the loss of two of her loved ones and the marriage of her lover to another woman.>"
}