{
	"url": "https://www.novelupdates.com/series/girls-dormitory-escape/",
	"title": "Girls’ Dormitory Escape - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/05/Girls-Dormitory-Escape.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Fantasy   Horror   Supernatural   ",
	"tags": "Calm Protagonist   College/University   Female Protagonist   Modern Day   Survival   Survival Game   Zombies   ",
	"rating": "(3.5 / 5.0, 20 votes)",
	"author": "火茶   ",
	"year": "\nN/A",
	"ranking": "#4617   #4846   #9666   #7590   #10698   ",
	"reviewcount": "1 Review sorted by",
	"description": "How do you survive when your dorm room becomes a playground?\r\n\r\nIn the dormitory building at 8 o'clock at night, the nightlife belonging to the university had just begun.\r\n\r\nSuddenly, the lights went out. All universities in the world were plunged into darkness. \r\n\r\n'Ding ding ding, dang dang dang'\r\n\r\n'Dear classmates, welcome to [Dormitory Survival Game], happy dormitory life begins!' Blood flowed from the sink, the bed tent turned into a different dimension space, and the zombies crashed into the dormitory.\r\n\r\nThere are countless pairs of peeping eyes outside the door and balcony. Water shortage, food shortage, extreme environment, survival crisis.\r\n\r\n'Instructions for students: The highest rule for dormitory survival—'\r\n\r\n'First, the living cannot leave the dormitory.'\r\n\r\n'Second, please protect your dormitory.'\r\n\r\n'Third, please protect your roommates.'\r\n\r\n'Fourth, every weekend there will be an update in the global dormitory survival rankings, please work hard to rush into the double first-class, 985, 211*, and strive to be the world's top!'\r\n\r\n-------\r\n\r\nWhen she heard the strange singing, Tang Xinjue was opening the bags of daily necessities with a toothbrush in her mouth.\r\n\r\n[Congratulations, classmates, what you are holding now will become your innate ability!]\r\n\r\n'...'\r\n\r\nTang Xinjue fell silent as she saw the toilet plunger in her hand.\r\n\r\n-------\r\n\r\n*) 985 and 211 universities means some better universities in China.>"
}