{
	"url": "https://www.novelupdates.com/series/the-villainess-is-happy-today/",
	"title": "The Villainess is Happy Today - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/12/img_20191020_092710.jpg",
	"noveltype": "(KR)",
	"genre": "Comedy   Drama   Fantasy   Romance   Shoujo   ",
	"tags": "Adapted to Manhwa   Aristocracy   Beautiful Female Lead   Broken Engagement   Calm Protagonist   Caring Protagonist   Clingy Lover   Confident Protagonist   Cunning Protagonist   Doting Parents   Engagement   European Ambience   Familial Love   Female Master   Female Protagonist   Handsome Male Lead   Love Interest Falls in Love First   Master-Servant Relationship   Money Grubber   Nobles   Obsessive Love   Possessive Characters   Royalty   Single Parent   S*aves   Strong Love Interests   Transmigration   Transported to Another World   Villainess Noble Girls   Wealthy Characters   Werebeasts   Younger Love Interests   ",
	"rating": "(4.0 / 5.0, 124 votes)",
	"author": "니니양   ",
	"year": "\n2019",
	"ranking": "#6970   #6141   #2713   #918   #1377   ",
	"reviewcount": "10 Reviews sorted by",
	"description": "The night she, who used to live as a powerful and elegant modern city woman, heard about the marriage of her ex-boyfriend.\n\nShe was depressed, she fell asleep.\n\n‘Why did i become a Villainess?’\n\nIn any case, she played the role of a villainess who is losing her fiancé and harasses the main character.\n\nThere’s nothing bad about it, though. Because this villainess has everything!\n\nBut the first thing you have to do is ask your tr*sh fiance to break up!\n\n“Let’s break up.”\n\n“…what?”\n\n“Why? Aren’t you being unfair?”\n\nYou think it’s fair to ask me to marry you when you’ve been playing around with another girl?\n\nDear Villainess, why did you hang yourself on this prideful man?!\n\n“Even if you’re the Crown Prince, you shouldn’t have ignored me. I am Raylene Shan Kandmion, after all.”\n\nDon’t you think you should have fun with all the money and power you have?>"
}