{
	"url": "https://www.novelupdates.com/series/if-i-disobey-the-duke/",
	"title": "If I Disobey the Duke - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/06/If-I-Disobey-the-Duke.jpg",
	"noveltype": "(KR)",
	"genre": "Drama   Fantasy   Romance   Smut   ",
	"tags": "Abusive Characters   Adapted to Manhwa   Aristocracy   Arranged Marriage   Beautiful Female Lead   Betrayal   Calm Protagonist   Caring Protagonist   Cautious Protagonist   Clever Protagonist   Complex Family Relationships   Cute Protagonist   European Ambience   Family Conflict   Female Protagonist   Handsome Male Lead   Jealousy   Love Interest Falls in Love First   Love Rivals   Marriage of Convenience   Monsters   Nobles   Obsessive Love   Past Trauma   Poor Protagonist   R-18   Smart Couple   Strong Love Interests   Tragic Past   Weak Protagonist   Weak to Strong   ",
	"rating": "(3.6 / 5.0, 85 votes)",
	"author": "글뽑는자판기   ",
	"year": "\n2021",
	"ranking": "#770   #1110   #2647   #1222   #2577   ",
	"reviewcount": "7 Reviews",
	"description": "“Sin… it’s a word that suits me, not you.”\n\nA mesmerizing low-pitched voice rang into my ears. It sounded heavy and deep as if it came from a cave.\n\nIt was a devilish baritone, like a deep rumble from a cavern. Lily didn’t seem to notice how it sounded like he was restraining his anger.\n\nThis was the first time she heard his voice.\n\n“Tell me. Who were you mourning for until our wedding day today?”\n\nLily wore a plain black dress that covered her from neck to toe in uncomfortable and unsightly fabric. Even if she really was mourning, the outfit was just too excessive.\n\n“Is it for your first husband who died during the war? Or is it for your second husband who died recently?”\n\n“It’s not like that. I’m really… Ah!”\n\nHe turned her over until she was on all fours. A hand mercilessly slid into her dress. The sound of the stiff fabric crumpling accompanied her scream.\n\nIt was obvious what a touch to the inner thigh meant. Tension and fear curled in her gut as the duke firmly held her by her hair, causing her to look up and see the sacred artefacts and statues on the wall. Her conscience flinched.\n\nLily shut her eyes and his voice pierced through like a punishment once again.\n\n“Or were you thinking about your third husband’s―my―death?”\n\nDuke Vladislav de Winter. And as of today, Lily’s third spouse.\n\nThey were supposed to be having their wedding in this very chapel.\n\nLily was unable to answer his question as his fingers unexpectedly dug into the apex of her thighs. Thick, calloused fingers spread her flesh and brushed against a particularly sensitive spot.\n\nElectricity coursed through her body.>"
}