{
	"url": "https://www.novelupdates.com/series/being-an-extra-actor-in-an-escape-game/",
	"title": "Being an Extra Actor in an Escape Game - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/07/Being-an-Extra-Actor-in-an-Escape-Game.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Drama   Horror   Mystery   Sci-fi   Shounen Ai   ",
	"tags": "Acting   Amnesia   Apathetic Protagonist   Apocalypse   Artificial Intelligence   Calm Protagonist   Clever Protagonist   Cold Protagonist   Cruel Characters   Depression   Determined Protagonist   Game Elements   Handsome Male Lead   Lazy Protagonist   Loneliness   Loner Protagonist   Love Interest Falls in Love First   Misunderstandings   Murders   Mystery Solving   Persistent Love Interests   Post-apocalyptic   Psychopaths   Quirky Characters   Secret Organizations   Seme Protagonist   Slow Romance   Strong Love Interests   Survival Game   Unlimited Flow   ",
	"rating": "(4.5 / 5.0, 131 votes)",
	"author": "诸君肥肥   ",
	"year": "\n2020",
	"ranking": "#364   #537   #1427   #781   #1181   ",
	"reviewcount": "32 Reviews sorted by",
	"description": "Xu Beijin is an extra in the game ‘Escape.’ His usual role is to lie on the floor to be the corpse, while observing how the Missiontakers scratch their heads to figure out a way to survive.\n\nAll the other extras work extremely hard as if trying to win the next Oscar’s in order to leave this cruel, despairing world; while Xu Beijin has a simple, monotonous, tedious life.\n\nUntil one day, he picked up a streaming system…\n\nXu Beijin’s life has been entirely upended.\n\nWhile lying on the floor as a corpse, the audience goes “AAAAAAAH Host what’s that behind you uwuwu…”\n\nWhile he’s reading the script out loud, the audience goes “Hehehe Beibei’s so cute acting all serious! I want to lick!”\n\nWhile he’s working hard to figure out the truth about this world, the audience goes “Today our Bei is also the hardworking Bei!”\n\nWhile he’s… he’s working hard dating Lin Qin, the audience goes “?!?! This isn’t the horror game stream I signed up for!”>"
}