{
	"url": "https://www.novelupdates.com/series/after-transmigrating-the-wealthy-actor-and-i-have-a-he-ending/",
	"title": "After Transmigrating, the Wealthy Actor and I have a HE Ending - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/05/007S8ZIlgy1ge3tlblkphj30p00z0ta1.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Fantasy   Romance   Shounen Ai   Slice of Life   ",
	"tags": "Acting   Calm Protagonist   Carefree Protagonist   Charismatic Protagonist   Charming Protagonist   Cute Story   Dense Protagonist   Devoted Love Interests   Doting Love Interests   Doting Parents   Hidden Abilities   Love Interest Falls in Love First   Misunderstandings   Modern Day   Shameless Protagonist   Showbiz   Transmigration   Tsundere   ",
	"rating": "(3.9 / 5.0, 138 votes)",
	"author": "Yiqun Tu Bo Shu   一群土拨薯   ",
	"year": "\n2020",
	"ranking": "#3633   #2000   #2363   #2883   #2384   ",
	"reviewcount": "40 Reviews sorted by",
	"description": "Sheng Xing Ze accidentally gets pulled into an absurd BL story and becomes the cannon fodder villain who only lives up to three chapters of the book. \r\nIn order to survive, he decides to stay away from the protagonists. \r\n#You follow your unrequited love, I will follow my mediator dream#\r\n\r\nThe director and his wife are having a quarrel: \r\nSheng Xing Ze: I'm coming!\r\nAfter that, the filming crew watches as the director runs around confessing his love to his wife on a loudspeaker. \r\n\r\nThe Idol King and the Idol Queen breaks up: \r\nShen Xing Ze: I'm coming!\r\nAfter that, the news of the Idol King kneeling down on one knee to propose to his girlfriend is all over Weibo. \r\n\r\nThe president and his wife wants to divorce:\r\nShen Xing Ze: I'm coming!\r\nLater on, the president books out the entire building to apologize to his wife. \r\n\r\nThe Film Emperor and his boyfriend quarrels:\r\nShen Xing Ze: ...Don't get in my business.\r\nThe Film Emperor: ....\r\n#Got found out that I've mistaken my spouse likes to wear women clothes, what should I do, waiting for response#\r\n\r\nShen Xing Ze's fans have always been in distress, their idol is so different from other idols.\r\nOther idols will try to compete for a chance to be the male lead, but their idol only focuses on being the golden mediator. \r\nOther idols' fan meetings will have games for them to play to win the idols' autographs, their fan meeting is about requests to sort out family conflicts and couple quarrels.\r\nThe Film Emperor and other famous celebrities are willing to let him gain some popularity from them, their idol will straight out reject them because he doesn't know them well.\r\n#Idol wants to retire from acting to become the host of a blind date show#>"
}