{
	"url": "https://www.novelupdates.com/series/an-incompetent-explorer-who-failed-to-make-his-high-school-debut-but-mastered-being-a-human-being-for-some-reason-beautiful-girls-are-approaching-me-one-after-another-despite-not-having-a-level-ski/",
	"title": "An Incompetent Explorer Who Failed to Make His High School Debut but Mastered Being a Human Being ~ For Some Reason Beautiful Girls Are Approaching Me One After Another Despite Not Having A Level, Skill, or Ability Score ~ - Novel Updates",
	"image": "https://www.novelupdates.com/img/noimagefound.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Fantasy   Harem   School Life   Shounen   ",
	"tags": "Adventurers   Appearance Changes   Beautiful Female Lead   Brother Complex   Dense Protagonist   Dungeons   Earth Invasion   Familiars   Game Elements   Handsome Male Lead   Hidden Abilities   Hiding True Abilities   Lack of Common Sense   Love Interest Falls in Love First   Male Protagonist   Misunderstandings   Modern Day   Monsters   Naive Protagonist   Overpowered Protagonist   Popular Love Interests   Sister Complex   Skill Assimilation   Sudden Strength Gain   Underestimated Protagonist   ",
	"rating": "(3.3 / 5.0, 39 votes)",
	"author": "Miporion   ミポリオン   ",
	"year": "\n2021",
	"ranking": "#128   #239   #2921   #278   #6559   ",
	"reviewcount": "9 Reviews sorted by",
	"description": "At one point, in Japan, where monsters and dungeons appeared all over the world, Fuhito Satou registered as an explorer to make his high school debut. However, the aptitude test revealed that there was no level, skill, or ability score.\n\nAlthough he was a desperate ordinary person, he remembered that only the item of skill level was displayed in the status.\n\nA normal person who has no level, skill, or ability score and is embarrassed to be an explorer and cannot tell anyone, is nervous and fails to make his high school debut. Nevertheless, as high school life progresses, beautiful girls gather around him. He does not know the real reason.>"
}