{
	"url": "https://www.novelupdates.com/series/my-vegetative-partner-opened-his-eyes-in-anger-after-i-ran-away/",
	"title": "My Vegetative Partner Opened His Eyes in Anger After I Ran Away - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/05/20190428134928.jpg",
	"noveltype": "(CN)",
	"genre": "Romance   Sci-fi   Shounen Ai   ",
	"tags": "Amnesia   Animal Characteristics   Animal Rearing   Aristocracy   Arranged Marriage   Beastkin   Complex Family Relationships   Couple Growth   Dense Protagonist   Devoted Love Interests   Futuristic Setting   Handsome Male Lead   Love Interest Falls in Love First   Marriage   Nobles   Outer Space   Pets   Possessive Characters   Psychic Powers   Strong Love Interests   System Administrator   Transmigration   Werebeasts   ",
	"rating": "(4.2 / 5.0, 308 votes)",
	"author": "Hēi Māo Nì Nì   黑猫睨睨   ",
	"year": "\n2019",
	"ranking": "#5262   #2655   #1254   #1154   #906   ",
	"reviewcount": "56 Reviews sorted by",
	"description": "Pet shop owner Tang Wan was accidentally reborn into an interstellar world. When he opened his eyes, he found himself automatically married to a vegetable via the StarNetwork. A social status worth ten billion yuan; but with an unconscious husband, he was unable to withdraw any money. Tang Wan held the empty position of the First Gentleman, but was, in fact, a poor man.\n\nIn order to secure his future livelihood, Tang Wan was bound to the “Earth Pet System” and returned to his old business, with the goal of saving money, getting a divorce, and looking for a second spring!\n\nAfter thousands of years of evolution, Earth’s energy depletion had long been abandoned to the distant corners of the Milky Way. All of the animals in the galaxy had evolved tremendously, and little furry cute ones only lived in textbooks. When Tang Wan and his cute little ones appeared, they became the treasures of the whole universe! The pet shop soon became famous in the interstellar world, and the whole universe lined up to be cat slaves~\n\nFinally surviving past the compulsory marriage period, Tang Wan happily took off the diamond ring worth billions: he can finally sell it for money!\n\nHowever, Tang Wan could never have imagined that when he sat down at the dining table on a blind date with some fresh meat, the vegetative partner that he had come to an agreement with would suddenly open his eyes.\n\nGong: I heard you sold your wedding ring for one billion yuan?\n\nTang Wan reached out and pushed him down on the bed: Open what eyes, quickly close them. >"
}