{
	"url": "https://www.novelupdates.com/series/what-to-do-if-i-am-caught-by-a-paranoid-gong/",
	"title": "What to Do If I Am Caught by A Paranoid Gong - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/01/What-to-Do-If-I-Am-Caught-by-A-Paranoid-Gong.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Fantasy   Romance   Smut   Tragedy   Yaoi   ",
	"tags": "Acting   Ancient Times   Animal Characteristics   Artificial Intelligence   Beastkin   Clingy Lover   Co-Workers   Confinement   Cultivation   Guardian Relationship   Jealousy   Kidnappings   Love Interest Falls in Love First   Male Yandere   Masochistic Characters   Misunderstandings   Modern Day   Obsessive Love   Omegaverse   Persistent Love Interests   Perverted Protagonist   Possessive Characters   Protagonist Falls in Love First   R*pe   Senpai-Kouhai Relationship   Shameless Protagonist   Siblings Not Related by Blood   Strong Love Interests   System Administrator   Transmigration   World Hopping   Yandere   Younger Love Interests   ",
	"rating": "(3.6 / 5.0, 56 votes)",
	"author": "Hang Bai   杭白   ",
	"year": "\n2019",
	"ranking": "#3314   #2803   #7204   #4353   #5881   ",
	"reviewcount": "4 Reviews sorted by",
	"description": "Mi Dao is a game scriptwriter and a man who loves men.\n\nEvery time he writes a game, he will entrain private goods and put the persona of his crush on an important role, and add a variety of sexual thoughts.\n\nThese sexual thoughts include but are not limited to: blackening, jealousy, Shura Field, “beep——” and “beep——”.\n\nUntil one day, Mi Dao accidentally transmigrated and also accidentally increased the favorability of important characters.\n\nAs a result, he was unable to collapse. He could only pretend to be aggrieved and cry “no” while listening to all kinds of what his crush said to him:\n\n“Brother, I don’t allow you to leave me anymore.”\n\n“Everything about you is mine.”\n\n“I can give you everything except freedom.”\n\n…\n\nAh, Ah, Ah, what is this amazing joy that God has unfolded, ah, ah, ah!!!\n\nAfterward, Mi Dao groaned on the bedside with a lollipop dangling in his mouth:\n\n“Ask another. Asking is happiness.”>"
}