{
	"url": "https://www.novelupdates.com/series/the-counterattack-plan-of-a-villain-with-ten-thousand-fans/",
	"title": "The Counterattack Plan of A Villain With Ten Thousand Fans - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2018/10/cpvttf.png",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Comedy   Fantasy   Romance   Yaoi   ",
	"tags": "Acting   Apocalypse   Calm Protagonist   Cannibalism   Carefree Protagonist   Charming Protagonist   Clingy Lover   Confident Protagonist   Cross-dressing   Cultivation   Cunning Protagonist   Death   Depictions of Cruelty   Devoted Love Interests   Disabilities   Doting Love Interests   Eidetic Memory   Episodic   Futuristic Setting   Genius Protagonist   Gore   Handsome Male Lead   Interdimensional Travel   Jack of All Trades   Lazy Protagonist   Love Interest Falls in Love First   Lucky Protagonist   Magic   Male Yandere   Manipulative Characters   Modern Day   Multiple Transported Individuals   Music   Narcissistic Protagonist   Older Love Interests   Omegaverse   Past Trauma   Possessive Characters   Power Couple   Proactive Protagonist   Protagonist Strong from the Start   Ruthless Protagonist   Shameless Protagonist   Showbiz   Smart Couple   Special Abilities   Strong Love Interests   System Administrator   Transformation Ability   Vampires   Wealthy Characters   World Hopping   Yandere   ",
	"rating": "(4.4 / 5.0, 153 votes)",
	"author": "Never Ask   从来不问   ",
	"year": "\n2017",
	"ranking": "#4617   #6189   #2587   #5147   #1431   ",
	"reviewcount": "28 Reviews sorted by",
	"description": "Before the disfigurement, everyone loved Ling Chunan. After the disfigurement, Ling Chunan became a plague that everyone avoided. He was held on captive by his own agent afterwards because he was so ugly now, desecrating his love. Finally, Ling Chunan chewed himself to death because he was starving. After his death, a thing that claimed to be the counterattack system 098 found him.\n\nA long time after, a certain counterattack system of a host with a 100% success rate posted a message in the System Forums.\n\n《Emergency Help Request, my host is a masochist! He won’t be happy if every meals doesn’t have meat, and if he doesn’t have meat to eat, he will start to gnaw himself! How to treat this illness?!》\n\nGreat God : No need. I have a fast recovering ability. I will let him bite me.>"
}