{
	"url": "https://www.novelupdates.com/series/levelmaker/",
	"title": "Levelmaker - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/06/Levelmaker.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Fantasy   Gender Bender   Romance   Slice of Life   ",
	"tags": "Accelerated Growth   Adventurers   Age Regression   Alchemy   Androgynous Characters   Appearance Changes   Artifact Crafting   Beautiful Female Lead   Blacksmith   Charismatic Protagonist   Charming Protagonist   Childhood Friends   Cooking   Crafting   Cunning Protagonist   Cute Protagonist   Dungeons   Fantasy Creatures   Fast Learner   Female Protagonist   Game Elements   God-human Relationship   God Protagonist   Godly Powers   Gods   Grinding   Hard-Working Protagonist   Heroes   Kind Love Interests   Level System   Lovers Reunited   Magic Formations   Magical Technology   Male Protagonist   Male to Female   Multiple Reincarnated Individuals   Overpowered Protagonist   Poor to Rich   Quirky Characters   Reincarnated in Another World   Reincarnation   Second Chance   S*xual Abuse   Shoujo-Ai Subplot   Skill Assimilation   Skill Books   Skill Creation   Strong to Stronger   Sudden Wealth   Sword And Magic   Transported to Another World   Weak to Strong   Younger Love Interests   ",
	"rating": "(3.2 / 5.0, 231 votes)",
	"author": "SS Samurai   Ss侍   ",
	"year": "\n2016",
	"ranking": "#2917   #3197   #1050   #579   #1500   ",
	"reviewcount": "23 Reviews sorted by",
	"description": "The second year high school student and RPG game enthusiast, Narukami Yuu has an accident because of carelessness and dies before confessing his feelings to his childhood friend.\r\n\r\nHowever, thanks to the compassion of Jizou-sama in his neighborhood, he was sent to another world – Anazuma.\r\n\r\nHe tempered his heart and started raising his level, fighting monsters, obtaining many powerful skills…… crafting things…… and becoming a woman______!\r\n\r\nIn a slightly strange world, I became involved with various people, my faintly extraordinary life begins!\r\n\r\n(The first 2-3 arc's have shorter chapters)>"
}