{
	"url": "https://www.novelupdates.com/series/the-worlds-strongest-s-class-adventurer-known-as-the-thunder-emperor-shows-his-power-without-restraint-and-becomes-a-warrior-in-the-academy-of-magic/",
	"title": "The World’s Strongest S-Class Adventurer, Known as the Thunder Emperor, Shows His Power Without Restraint and Becomes a Warrior in the Academy of Magic - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/01/The-Worlds-Strongest-SClass-Adventurer-Known-as-the-Thunder-Emperor-Shows-His-Power-Without-Restraint-and-Becomes-a-Warrior-in-the-Academy-of-Magic.png",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Comedy   Fantasy   School Life   ",
	"tags": "Academy   Adapted to Manga   Magic   Male Protagonist   Monsters   Protagonist Strong from the Start   Sword And Magic   ",
	"rating": "(2.3 / 5.0, 25 votes)",
	"author": "Nurumayu   ぬるま湯   ",
	"year": "\n2020",
	"ranking": "#2000   #2000   #5852   #6881   #7967   ",
	"reviewcount": "3 Reviews sorted by",
	"description": "There are beings who have been determined to be the strongest from birth.\n\nHis innate talent has reduced the efforts of those around him to nothing, and his hard-working genius is unrivaled.\n\nHe is an unidentified S-class adventurer wearing a mask. He is the youngest S-class adventurer in history, and his mastery of thunder magic is so impressive that his nickname is “Thunder Emperor”. He is known as the strongest magician in the world of adventurers.\n\nHis true identity is Noah Akright, a boy who lives in the forest with a witch.\n\nNoah was picked up by the forest witch Shelah when he was a child.\n\nShelah noticed Noah’s extraordinary magical talent and gave Noah a gifted education in magic.\n\nAt the age of 15, he became the youngest ever to become an S-class adventurer.\n\nWith the alias “Van” and a mask of protective magic, Noah’s status as an adventurer was unassailable.\n\nThe day Noah became the youngest adventurer ever to be promoted to S-class adventurer, Sheila said to Noah, that he has another task.\n\n”It’s your next assignment. The adventurer phase of hiding your identity and gaining power is over. Next, go to the magic academy and flaunt it to your heart’s content.”\n\nThus, in order to accomplish Shelah’s task, S-class adventurer Noah Akright, a.k.a. “Thunder Emperor” Van, is enrolled in the King’s Capital’s elite academy of magic – the Regulus School of Witchcraft and Wizardry.\n\nFortunately or unfortunately for the other magic academy students, ……\n\nThey can also lightly rebel against discrimination from the nobility, and they are also able to lightly rebel against pressure from senior students, and in the end, they can lightly crush the evil organization.\n\nThis is the story of Noah, the strongest sorcerer of the lightning system, demonstrating his power without regret and achieving various legends in the magic academy.\n\nThe strongest sorcerer who does not know how to add to or subtract from his power is a warrior with his overwhelming power.>"
}