{
	"url": "https://www.novelupdates.com/series/oukoku-e-tsuzuku-michi/",
	"title": "Oukoku e Tsuzuku Michi - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/10/Oukoku-e-Tsuzuku-Michi.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adult   Adventure   Fantasy   Harem   Seinen   ",
	"tags": "An*l   Adapted to Manga   Adultery   Affair   Age Progression   Aristocracy   Army   Army Building   Betrayal   Calm Protagonist   Childcare   C*nnilingus   Coming of Age   Confident Protagonist   Cunning Protagonist   Devoted Love Interests   Domestic Affairs   Dragons   Dwarfs   Elves   Enemies Become Allies   Enemies Become Lovers   Evil Gods   Exhibitionism   Fantasy World   Fearless Protagonist   First-time Interc**rse   F*llatio   Futanari   Generals   Gore   Harem-seeking Protagonist   H*ndjob   Human-Nonhuman Relationship   Kingdom Building   Loli   Magic   Maids   Male Protagonist   Marriage   Master-Servant Relationship   Mature Protagonist   Mercenaries   Monster Girls   Monsters   Multiple POV   Naive Protagonist   Netori   Nobles   Older Love Interests   Or*y   Past Plays a Big Role   Perverted Protagonist   Politics   Polygamy   Pregnancy   Prostit**es   Protagonist Strong from the Start   R-18   R*pe Victim Becomes Lover   Royalty   R*pe   Ruthless Protagonist   Shameless Protagonist   S*aves   Strong Love Interests   Strong to Stronger   Sword And Magic   Threesome   Trap   Tsundere   Vampires   Wars   Yandere   ",
	"rating": "(4.1 / 5.0, 890 votes)",
	"author": "Ofuro Ashitsubo   Yumizu Kai   湯水 快   ",
	"year": "\n2014",
	"ranking": "#400   #602   #97   #703   #46   ",
	"reviewcount": "82 Reviews sorted by",
	"description": "This is the story of a young slave gladiator in an underground arena. He doesn’t know about his past or how he got to where he is, only that his name is Aegir, and that he is strong.\n\nOne day he kills the boss and escapes the arena, joining a band of mercenaries as a new recruit. During one mission, they encounter the vampire, Lucy, who slaughters the band with her inhuman strength. After learning that Aegir only knows how to kill, Lucy lets him stay at her house, educating and taking care of him.\n\nTwo years pass, and on the day of Aegir’s departure, they both exchange a promise that if Aegir becomes a king and owns the land of Erg forest, he can come and take her as his woman. Making this his life goal, Aegir set out on a journey to become a hero, a king, and found his own kingdom.>"
}