{
	"url": "https://www.novelupdates.com/series/tsundere-banana-mage/",
	"title": "Tsundere Banana Mage - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2015/11/ND0054001.jpg",
	"noveltype": "(JP)",
	"genre": "Comedy   Fantasy   ",
	"tags": "Demon Lord   Heroes   Male Protagonist   ",
	"rating": "(1.6 / 5.0, 25 votes)",
	"author": "",
	"year": "\nN/A",
	"ranking": "#2000   #2000   #9780   #13810   #12513   ",
	"reviewcount": "1 Review sorted by",
	"description": "The demon lord wanted to destroy all VEGES from the world! However, due to the demon lord's own reasoning, the demon lord has decided to consider BANANAS as VEGES as well! The hero, a BANANA lover, cannot accept this, and arises to fight against the demon lord, wielding a BANANA blade bearing the brilliance like that of the sun. The legendary dragon, VEGETARIAN dragon, assists in his quest and they eventually won the demon lord. But due to the poor story, other people have passed down the unreal version of the story.\r\n\r\nAfter much difficulties, they finally manage to reach the dungeon where the treasure of the legendary(VEGETARIAN) dragon is. However, they then found out that they have an extra companion, the demon lord himself tagging along! The guardian of the old and deceased (VEGETARIAN) dragon, a muscular man wearing only underwear, with the word 'Dragon' on his head, acting all feminine was easily defeated. The protagonist then was approached by the Demon Lord to not fight, and he easily agrees(Hey, its just VEGES! And the protagonist hates VEGES too!!). However, his childhood friend asks one very important question...\r\n\r\n'Are bananas also considered as a VEGE?'\r\n\r\nAnd so, as we all can guess, the battle begins. Upon seeing his childhood friend get beated up, he then arises to fight against the demon lord, with his new awakened powers!! THE POWER OF BANANAS!! He then wields BANANA blade, BANANA armor, BANANA headband (Just image a guy wearing banana all over him), and with hatred to the original user of BANANA magic, he manages to fight against the demon lord of 'Hatred for VEGES'. Upon winning, the demon lord made a declaration, 'So long as there is still children/people hating VEGES, I will always come back'. So he replies 'Every time you return, there will be heroes fighting you in the name of BANANAS!!'>"
}