{
	"url": "https://www.novelupdates.com/series/after-marrying-the-disabled-crown-prince-of-the-enemy-country/",
	"title": "After Marrying the Disabled Crown Prince of the Enemy Country - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/01/After-Marrying-the-Disabled-Crown-Prince-of-the-Enemy-Country.jpg",
	"noveltype": "(CN)",
	"genre": "Drama   Psychological   Romance   Tragedy   ",
	"tags": "Adapted to Manhua   Ancient China   Ancient Times   Arrogant Characters   Beautiful Female Lead   Cold Love Interests   Death of Loved Ones   Dense Protagonist   Devoted Love Interests   Disabilities   Doting Love Interests   Enemies Become Lovers   Female Protagonist   Handsome Male Lead   Jealousy   Love Rivals   Near-Death Experience   Power Struggle   Royalty   Schemes And Conspiracies   Sibling Rivalry   Slow Romance   Tragic Past   Tsundere   Wealthy Characters   ",
	"rating": "(4.3 / 5.0, 91 votes)",
	"author": "New Meow   新了个喵   ",
	"year": "\n2021",
	"ranking": "#803   #685   #3568   #1260   #4608   ",
	"reviewcount": "19 Reviews sorted by",
	"description": "Le Zhi, the little princess of country Li, is charming and beautiful, and she looked like a begonia.\n\nHowever, once her country was destroyed, she crawled out of the hell on earth by stepping on the bones of the dead and was brought back to the enemy’s country Qi by Huo Xu, a childhood sweetheart and a thankless wretch, who had entered the country Li as a prince sent to be held as a hostage from a young age.\n\nHuo Xu looked at her with affection, “Zhizhi, help me bring the Crown Prince down. You will be my only Empress in the future.”\n\nLe Zhi pretended to put down her blood feud and smiled to agree.\n\nHuo Du, the Crown Prince of the country Qi, looked like a banished immortal but has a disability in his right leg. He has a sly and ruthless personality with insanely evil behavior.\n\nOne day, his imperial father bestowed him a marriage and gave him the princess of the subjugated country. \n\nHuo Du sneered one after another. Huo Xu’s childhood sweetheart? Beauty trap? Tut-tutted, his imperial younger brother was really willing.\n\nHe raised his hand to stroke the white cat on his lap lightly, “Oh, you have a toy.”\n\n—\n\nHuo Xu was a person with a noble and benevolent character on the outside but with an insatiable greed for power, position, and beauty on the inside.\n\nThe position of the Crown Prince, his beloved childhood sweetheart… All these were within his grasp.\n\nHe was very satisfied.\n\n… Until he was tied to a prison post.\n\nAnd his imperial elder brother curled his lips and handed the knife to his sweetheart and said with a smile, “Kill him. You can stab as many knives as you want.”\n\nWhile he was frightened, he saw Huo Du turn the tip of the knife towards his heart and slowly said to Le Zhi, “Or do you want to kill me first? That’s fine too…”\n\nHuo Xu’s eyes trembled. Did he hear it wrong, or his imperial brother is crazy?>"
}