{
	"url": "https://www.novelupdates.com/series/soaring-the-heavens/",
	"title": "Soaring the Heavens - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2017/04/soaringtheheavens.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Fantasy   Harem   Martial Arts   Mature   Tragedy   Xianxia   ",
	"tags": "Adopted Protagonist   Aggressive Characters   Artifacts   Beast Companions   Beautiful Female Lead   Body Tempering   Cautious Protagonist   Charismatic Protagonist   Cruel Characters   Cultivation   Cunning Protagonist   Demons   Depictions of Cruelty   Determined Protagonist   Discrimination   Dragons   Enemies Become Allies   Famous Protagonist   First-time Interc**rse   Forced into a Relationship   Handsome Male Lead   Hard-Working Protagonist   Harsh Training   Honest Protagonist   Immortals   Kuudere   Long Separations   Lucky Protagonist   Magic Beasts   Male Protagonist   Misunderstandings   Naive Protagonist   Netori   Older Love Interests   Orphans   Phoenixes   Politics   Polygamy   Poor Protagonist   Possessive Characters   Revenge   Reverse R*pe   Romantic Subplot   Ruthless Protagonist   Shameless Protagonist   Sharp-tongued Characters   Siblings Not Related by Blood   Spear Wielder   Stoic Characters   Strategist   Strength-based Social Hierarchy   Strong Love Interests   Suicides   Threesome   Time Skip   Tsundere   Underestimated Protagonist   Unique Cultivation Technique   Wars   Weak to Strong   Younger Love Interests   ",
	"rating": "(3.3 / 5.0, 299 votes)",
	"author": "Traversing Thousand Sorrows   Yue Qianchou   跃千愁   ",
	"year": "\n2012",
	"ranking": "#2000   #6382   #778   #8980   #2608   ",
	"reviewcount": "18 Reviews sorted by",
	"description": "A striking man of mysterious origin and peerless talent, he looks back at the world, in all its entirety, with utter disdain. And yet, in the treacherous and unpredictable ultimate formation of the Boundless Secular World, he guards a breathtaking ancient qin with broken strings, waiting silently for the destined one to arrive!\n\nA boy encounters him, and knows for the first time that the world beneath the Heavens is a fickle place. Not even demons, devils, ghosts and monsters can match the frivolity of human nature!\n\nA slender physique, and jade-like beauty, but the sword that strikes between heaven and earth is not unlike a streaming rainbow!\n\nThe vastness of the starry sky, the seven emotions and six desires! Greed, anger and ignorance! The teachings of Buddha will grant you boundless strength!\n\nA sea of blood will come, at the cost of all mortal beings full of honest hope!\n\nThe ghosts wail as the gods roar, but the sea of blood has no end!\n\nWhere, pray tell, is the path I should take?\n\nSince there is no path, no matter how bitter and bloody the sea, even if my boat is made out of bones, I will soar to the heavens above!>"
}