{
	"url": "https://www.novelupdates.com/series/adorable-treasured-fox-divine-doctor-mother-overturning-the-heavens/",
	"title": "Adorable Treasured Fox: Divine Doctor Mother Overturning The Heavens! - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2017/10/1508762145266.jpg",
	"noveltype": "(CN)",
	"genre": "Drama   Romance   Slice of Life   Xuanhuan   ",
	"tags": "Alchemy   Arrogant Characters   Beautiful Female Lead   Black Belly   Broken Engagement   Calm Protagonist   Childcare   Cold Love Interests   Cold Protagonist   Complex Family Relationships   Cultivation   Cunning Protagonist   Cute Children   Demons   Devoted Love Interests   Doctors   Dragons   Female Protagonist   Genius Protagonist   Handsome Male Lead   Hard-Working Protagonist   Human-Nonhuman Relationship   Love Interest Falls in Love First   Multiple Realms   Mysterious Family Background   Nobles   Overpowered Protagonist   Persistent Love Interests   Pets   Possessive Characters   Pregnancy   R*pe Victim Becomes Lover   Revenge   Reverse R*pe   Strength-based Social Hierarchy   Strong Love Interests   Transmigration   Weak to Strong   ",
	"rating": "(3.9 / 5.0, 314 votes)",
	"author": "Xiao Qi Ye   萧七爷   ",
	"year": "\n2017",
	"ranking": "#6970   #4143   #156   #4569   #616   ",
	"reviewcount": "45 Reviews sorted by",
	"description": "She is a descendant of an Ancient Chinese Aristocratic family. Having just transmigrated into a young lady’s body filled with aphrodisiacs, she had no choice but to pounce at a random man upon arrival.\n\nUnexpectedly, not only did she get caught red handed, she’s also pregnant with child before marriage.\n\nIn the end, the baby she carried for ten months turned out to be a little fox, and it could cry “Mama” once born? Fortunately for her, the child is well-behaved, kind, and caringly protective of his mother.\n\nIn this world filled with both evil and good, this pair of mother and son will work together to destroy all their adversaries. As for the scumbag relatives who scorned them, they will make them pay dearly with regret in mind.\n\nBut then one day, baby fox’s father suddenly showed up, not only to steal the child, but to steal her too? How can there be such a good thing? This foolish father of his, didn’t even ask for little fox’s opinion?\n\nStabbing his hands to his hip, a certain little fox demands: “You want to be my father? First pay up then go behind the line. Mother, I think next door’s Uncle Wang is quite rich, you can just become Uncle Wang’s daughter-in-law.”>"
}