{
	"url": "https://www.novelupdates.com/series/i-dumped-the-male-lead-before-the-apocalypse/",
	"title": "I Dumped the Male Lead Before the Apocalypse - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/03/I-Dumped-the-Male-Lead-Before-the-Apocalypse.png",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Comedy   Romance   ",
	"tags": "Alternate World   Apocalypse   Beautiful Female Lead   Caring Protagonist   Couple Growth   Devoted Love Interests   Early Romance   Female Protagonist   Handsome Male Lead   Long Separations   Magical Space   Modern Day   Power Couple   Special Abilities   System Administrator   Transmigration   Weak to Strong   Zombies   ",
	"rating": "(3.9 / 5.0, 78 votes)",
	"author": "Bu Mian Zhuang   不眠妆   ",
	"year": "\n2019",
	"ranking": "#4617   #4764   #4198   #6343   #3822   ",
	"reviewcount": "13 Reviews sorted by",
	"description": "The system found Tang Tang and brought her to an apocalyptic novel where she became the male lead’s cannon fodder ex-girlfriend.\n\nBefore the apocalypse happened, this ex-girlfriend who, after he was betrayed and kicked out by his clan, cruelly humiliated him before their breakup.\n\nAfter the apocalypse, this ex-girlfriend couldn’t awaken her ability and was finally torn to pieces by the zombies.\n\nTang Tang worked hard with acting as his ex-girlfriend, after hearing the whole fate of this character from the system. She humiliated the male lead and brutally split up with him. Even if she feels guilty, she believes she shouldn’t get in his way of getting stronger once the apocalypse begins, it was for his own good.\n\nShe has completed all her tasks now, so she happily asked the system: Can we prepare the time machine to go home now?\n\nThe system, however, spluttered: … That, it’s that…\n\nTang Tang panicked: What is ‘that’?\n\nThe system: Report, host! I received the information that, that your original body is gone.\n\nGone, gone….\n\nTang Tang looked at the close by male lead and cried: Dalao! Wait for me!>"
}