{
	"url": "https://www.novelupdates.com/series/what-to-do-if-the-system-forces-you-to-exercise/",
	"title": "What To Do If The System Forces You To Exercise - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/02/Screenshot-18.png",
	"noveltype": "(CN)",
	"genre": "Action   Comedy   Drama   Martial Arts   Mature   Romance   Yuri   ",
	"tags": "Acting   Beautiful Female Lead   Carefree Protagonist   Celebrities   Co-Workers   Cold Love Interests   Determined Protagonist   Devoted Love Interests   Doting Love Interests   Doting Older Siblings   Doting Parents   Famous Protagonist   Female Protagonist   Genius Protagonist   Honest Protagonist   Love Interest Falls in Love First   Modern Day   Protagonist Strong from the Start   Showbiz   Sister Complex   Slow Romance   Strong to Stronger   System Administrator   Unconditional Love   ",
	"rating": "(4.2 / 5.0, 124 votes)",
	"author": "Qiān Lǐ Rì Hé   千里日和   ",
	"year": "\n2019",
	"ranking": "#4617   #3791   #2750   #2511   #3234   ",
	"reviewcount": "23 Reviews sorted by",
	"description": "The frail and sickly Wen Jiexi had always wanted one thing: a healthy body and like a dream come true, one day, she was selected by the system! \r\n\r\nSystem: The amazing me shall grant you a strong physique and divine strength! However, you have to maintain your health through monthly missions! If you fail to complete them~well, then you’ll stay as a female King Kong, forever~\r\n\r\nWen Jiexi: What?! Will I no longer be able to live my life freely again?!!\r\n\r\nMother with an alarmed expression: My frail daughter is actually trying to do the most sit-ups possible?!\r\n\r\nFather made a strange face: My delicate daughter ran on the treadmill for an hour?!\r\n\r\nBrother’s expression crumbled: Can anyone tell him how his cute little sister who is as precious as a delicate white flower...was actually able to use one punch to break a sandbag and smash a hole through the wall!!! \r\n\r\nThrough a series of unexpected circumstances, she was pulled into the entertainment industry and became a female martial artist! \r\n\r\nFemale Fan: Our darling Wen is the most awesome! She’s even more handsome than a man!\r\n\r\nMale Fan: The girls today are so domineering! To be able to throw away all of one’s shame, I want that feeling too!\r\n\r\nThe frozen expression after being hugged by the princess from behind: …..\r\n\r\nWen Jiexi held up a hand: No, no, no! It’s not like that!\r\n\r\n>"
}