{
	"url": "https://www.novelupdates.com/series/the-most-powerful-characters-in-the-world-are-obsessed-with-me/",
	"title": "The Most Powerful Characters In The World Are Obsessed With Me - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/08/The-Most-Powerful-Characters-In-The-World-Are-Obsessed-With-Me.jpg",
	"noveltype": "(KR)",
	"genre": "Drama   Fantasy   Harem   Romance   ",
	"tags": "Adapted to Manhwa   Aristocracy   Beautiful Female Lead   Caring Protagonist   Cute Protagonist   Empires   European Ambience   Female Protagonist   God Protagonist   Godly Powers   Handsome Male Lead   Hiding True Abilities   Love Interest Falls in Love First   Male Yandere   Mob Protagonist   Monster Tamer   Nobles   Obsessive Love   Otome Game   Popular Love Interests   Possessive Characters   Power Struggle   Reincarnated in a Game World   Reincarnation   Reverse Harem   Royalty   Siblings   Sister Complex   Special Abilities   Stoic Characters   Tsundere   Villainess Noble Girls   Younger Sisters   ",
	"rating": "(4.3 / 5.0, 153 votes)",
	"author": "김코끼리   ",
	"year": "\n2019",
	"ranking": "#322   #654   #1453   #611   #699   ",
	"reviewcount": "16 Reviews sorted by",
	"description": "One day when she was thirteen years old, while chewing bread as a snack, Dalia Pesteros suddenly remembered her past life. This is an impoverished otome game world where the main characters go crazy, and she was born as the sister of the worst villain in the future!\n\nThere is no solution at this rate. The family will be exterminated, and I will be thrown away. So, no matter what, I must get out of this family as soon as possible!\n\n‘Now that it’s like this, I need to lower their guard and run away.’\n\nIn order to get rid of the relatives who aim for the family and the sly emperor, it’s better to be in good favor with my brother-\n\n“I want to dance with Dalia. What’s the problem?” \n\n“I’m sorry, but my sister is shy.”\n\n“Dalia said I was her favorite!”\n\nSomehow, it’s not only my brother that I tamed, but all the strongest characters in this world are obsessed with me!>"
}