{
	"url": "https://www.novelupdates.com/series/the-legend-of-chu-qiao-division-11s-princess-agent/",
	"title": "The Legend of Chu Qiao: Division 11’s Princess Agent - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2016/09/s24975014.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Drama   Fantasy   Josei   Martial Arts   Mature   Psychological   Romance   ",
	"tags": "Adapted to Drama   Adapted to Manhua   Ancient China   Beautiful Female Lead   Child Abuse   Child Protagonist   Cunning Protagonist   Dark   Death of Loved Ones   Depictions of Cruelty   Female Protagonist   Handsome Male Lead   Love Triangles   Military   Revenge   Ruthless Protagonist   S*aves   Slow Romance   Transmigration   Weak to Strong   ",
	"rating": "(4.1 / 5.0, 153 votes)",
	"author": "Xiao Xiang Dong Er   潇湘冬儿   ",
	"year": "\n2009",
	"ranking": "#2000   #6233   #2607   #4722   #2186   ",
	"reviewcount": "23 Reviews sorted by",
	"description": "Chu Qiao was known as Agent 005 within the Secret Service's 11th Division in her former life. She was locked up in the Secret Service's prison as she was framed. After she successfully broke out from prison, she sacrificed her life bravely to preserve the Secret Service by defusing a bomb meant to wipe them out. \n\nAfter her demise, she was magically transported back in time to the Xia Dynasty to start a new life, where she assumed the identity of an 8-year-old female servant. In order to help Yan Xun, the Prince of Yan Bei, escape, she lived in the imperial palace for eight years along with him. In the process, they helped each other to become stronger such that they could rebel against the Xia Empire and return to the territory of Yan Bei. \n\nThe first half of the novel depicts vividly how the two characters go through thick and thin, hand in hand - Chu Qiao helping Yan Xun to achieve his dreams and Yan Xun's love towards Chu Qiao. However, the two of them start to drift apart due to their conflicting personalities - Chu Qiao having a kind hearted nature and Yan Xun having the airs of a prince: arrogant and boisterous. \n\nChu Qiao eventually leaves Yan Xun and ends up together with Zhuge Yue, who had always fancied her all along. The two of them eventually become recognised as the famous Queen of Beauty and the King of the Green Sea, establishing a prosperous, long-standing and stable dynasty. The old monarchy system was undoubtedly and easily scrapped; the new Xia Empire, helmed by the two of them, rose from the verge of its downfall like a phoenix from the ashes!>"
}