{
	"url": "https://www.novelupdates.com/series/because-pushing-didnt-work-i-decided-to-pull-away-wn/",
	"title": "Because Pushing Didn’t Work, I Decided to Pull Away - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/04/Because-Pushing-Didnt-Work-I-Decided-to-Pull-Away.jpeg",
	"noveltype": "(JP)",
	"genre": "Drama   Fantasy   Josei   Romance   Shoujo   Slice of Life   ",
	"tags": "Adapted to Manga   Determined Protagonist   Female Protagonist   Handsome Male Lead   Love at First Sight   Magic   Misunderstandings   Nobles   Possessive Characters   Protagonist Falls in Love First   Wizards   ",
	"rating": "(3.9 / 5.0, 37 votes)",
	"author": "Kotoko   琴子   ",
	"year": "\n2020",
	"ranking": "#5262   #2615   #5719   #3297   #6431   ",
	"reviewcount": "6 Reviews",
	"description": "The baron’s daughter, Sherry, had a crush on Noel, the eldest of a count’s family and also a knight—ever since they were students.\r\n\r\nEvery time they met, she’d profess her love to him without fail. Like that, six years went by without any signs of progress.\r\n\r\nIn the meantime, Sherry heard about a love technique from her friend, ‘If pushing is of no avail, you have to pull!’ and decided to put it into practice. Sherry didn’t want Noel to get overwhelmed by her feelings.\r\n\r\nAs a result, she decided to put herself under a restriction spell for three months —‘—Don’t confess, laugh, or act intimate with Noel!’\r\n\r\n“All those times you told me that I’m the only one for you in your life, I’ve always believed you. I will never let you retract those words.”\r\n\r\nImmediately afterwards, Noel suddenly blurted that out and applied for an engagement with her.\r\n\r\nSince then, not only had Noel been pampering Sherry, he would also be jealous and would often shower her with passionate words. On the other hand, Sherry continued to take a cold attitude towards Noel due to her restriction spell. Every day, she was in pain. Meanwhile, she also learned of Noel’s circumstances and of his past.>"
}