{
	"url": "https://www.novelupdates.com/series/i-have-a-mansion-in-the-post-apocalyptic-world/",
	"title": "I Have a Mansion in the Post-apocalyptic World - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2017/04/I-Have-a-Mansion-in-the-Post-apocalyptic-World.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Harem   Mature   Mystery   Sci-fi   ",
	"tags": "Adapted to Manhua   Aliens   Apocalypse   Army   Army Building   Artificial Intelligence   Business Management   Cheats   Cohabitation   Firearms   Genetic Modifications   Industrialization   Kingdom Building   Leadership   Loli   Male Protagonist   Military   Modern Day   Monsters   Mutated Creatures   Nationalism   Near-Death Experience   Outer Space   Parody   Polygamy   Poor to Rich   Post-apocalyptic   Racism   R*pe Victim Becomes Lover   Romantic Subplot   R*pe   Sadistic Characters   S*aves   Special Abilities   Sudden Wealth   Technological Gap   Time Skip   Transported to Another World   Weak to Strong   Wealthy Characters   World Travel   Zombies   ",
	"rating": "(3.7 / 5.0, 600 votes)",
	"author": "Morning Star LL   晨星LL   ",
	"year": "\n2014",
	"ranking": "#2000   #1018   #168   #8368   #806   ",
	"reviewcount": "93 Reviews sorted by",
	"description": "Ruins stretched across the landscape in the apocalypse after the nuclear war. \n\nIf you accidentally survived on the wasteland, then you must be ready to face the endless hunger, ceaseless dangers, the mad zombies at night, and the peculiar mutant creatures that are the aftermaths of the constant radiation. \n\nBut for Jiang Chen, this place was heaven. \n\nMansions stood tall, luxurious cars parked on the street, high tech products and gold abandoned everywhere. \n\nWhat? You were the president of a game development company before the war? You were responsible for the development of the 3D virtual reality online multiplayer game? Well, that’s great, why don’t you come work for me. The salary is two pieces of bread a day. \n\niPhone? Ultra thin design? Don’t you see that the phone I invented are thinner than condoms? \n\nAircraft carrier? Fighter jets? Oh, I have those things as well, but they are designed for space combat. \n\nWatch the story of Jiang Chen, who possessed the ability to travel through space and time, as he witness the creation of an empire stretched across space and time..>"
}