{
	"url": "https://www.novelupdates.com/series/transmigration-of-mysteries-and-songs/",
	"title": "Transmigration: Of Mysteries and Songs - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2018/03/Transmigration-Of-Mysteries-and-Songs-cover.jpg",
	"noveltype": "(CN)",
	"genre": "Drama   Fantasy   Historical   Romance   Shoujo   ",
	"tags": "Ancient China   Artifacts   Beautiful Female Lead   Business Management   Charismatic Protagonist   Clever Protagonist   Couple Growth   Death of Loved Ones   Determined Protagonist   Devoted Love Interests   Female Protagonist   Friendship   Handsome Male Lead   Love Interest Falls in Love First   Mystery Solving   Nobles   Politics   Reincarnated in Another World   Royalty   Strong Love Interests   Tragic Past   Transmigration   Transported to Another World   Wars   ",
	"rating": "(3.5 / 5.0, 95 votes)",
	"author": "青玉案否   ",
	"year": "\n2016",
	"ranking": "#2000   #2000   #2147   #2855   #3279   ",
	"reviewcount": "26 Reviews sorted by",
	"description": "What would you do if you were told that you could still go back after transmigrating?\nA car accident transports 21st-century Feng Luodi back in time to Chang’an. Initially devoid of hope, fiery determination burns in her when she learns that she still has a chance of going home if she completed a mission. \n\nAs she gradually adapts to her new life, she solves mysteries along the way and even establishes a business, but never once losing sight of her goal to return. However, she eventually realises that she was no longer a mere passer-by in this world. She had left an indelible mark on the people around her, including the two men who love her. Her heart is increasingly torn apart as she finds herself unintentionally hurting the people she cares about and her resolve wavering.\n\nWhat secret is being hidden from Feng Luodi? Should she continue to chase after the past or hold onto the present? \n\nJoin Feng Luodi in this heart-wrenching, yet heartwarming journey as she desperately tries to seek out her answers.>"
}