{
	"url": "https://www.novelupdates.com/series/absolute-redemption-book-transmigration/",
	"title": "Absolute Redemption [Book Transmigration] - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/08/Absolute-Redemption-Book-Transmigration.jpg",
	"noveltype": "(CN)",
	"genre": "Adult   Drama   Psychological   Romance   School Life   Tragedy   ",
	"tags": "Beautiful Female Lead   Caring Protagonist   Charming Protagonist   Clever Protagonist   Complex Family Relationships   Couple Growth   Doting Love Interests   Family   Female Protagonist   Handsome Male Lead   Heartwarming   Inferiority Complex   Jealousy   Love Interest Falls in Love First   Obsessive Love   Past Trauma   Possessive Characters   R*pe   Tragic Past   Transmigration   Ugly to Beautiful   ",
	"rating": "(3.3 / 5.0, 18 votes)",
	"author": "Jiang Luo Luo   江萝萝   ",
	"year": "\n2021",
	"ranking": "#2000   #2000   #9611   #10839   #8948   ",
	"reviewcount": "4 Reviews sorted by",
	"description": "1. Once transmigrated into the book, Ji Yi became the ugly and greedy female partner, who was ruthlessly killed by the villain.\n\nIn order to save her tragic fate, Ji Yi decided: send food and water every day, and try to prevent the boss from blackening!\n\nPeople who eat melons:\n\n　　”Ji Yi has no looks and talents. She is a straw bag and has a big temper.”\n\n　　”Xu Yue is gloomy and terrifying, and he is a lunatic. Don’t provoke him!”\n\nLater, the “Ji Yi” became a heavenly beauty. The gentle and beautiful school girl with top-notch grades, and the unblacked boss has become a respected scientist.\n\nThe people eating melons slapped their faces: I’m sorry, I was blind before!\n\n2. As everyone knows, Xu Yue is cold and gloomy; he is a genius lunatic, and everyone is afraid of him.\n\nSuddenly one day, the big guy who violated most of the school’s rules, put on his school uniform and became the number one student with Zheng Miaohong.　\n\nEveryone is incredulous.\n\nOnly Ji Yi blushed quietly, remembering the day before the villain boss changed from evil and returned to righteousness…\n\n“Xu Yue, you have to study hard every day!”\n　　\nThe cold boy pushed her against the wall and curled his lips, “Okay, I listen to you.”\n\nI was in the abyss of hell until I was 17 years old, and I met the only light in the world ——Xu Yue>"
}