{
	"url": "https://www.novelupdates.com/series/the-big-shots-girlfriend-is-a-demoness/",
	"title": "The Big Shot’s Girlfriend Is a Demoness - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/07/4878s.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Romance   Supernatural   ",
	"tags": "Beautiful Female Lead   Demons   Fantasy Creatures   Female Protagonist   Modern Day   Showbiz   Singers   Transmigration   Wealthy Characters   ",
	"rating": "(3.8 / 5.0, 21 votes)",
	"author": "爱吃鱼尾巴   ",
	"year": "\n2019",
	"ranking": "#2000   #2000   #8033   #2527   #7890   ",
	"reviewcount": "5 Reviews sorted by",
	"description": "The Siren Luo Xi was suddenly thrown to Earth. Apart from the drop-dead beautiful face and golden tail, she was as poor as a church mouse. When someone tricked her with “providing housing, food, and soaking in the water”, she immediately left with that person. \n\nLater, the melon-eating people found that something was off with that showbiz newbie who was as beautiful as a witch……s-s-she didn’t make sense at all! \n\n****\n\nThere were three most lively rumors in the capital city:\n\nReportedly, Lu Hao Zhi kept a pretty “mermaid” with a soft body and a fair skin. He spoilt her rotten and won’t allow outsiders to take a look at her.\n\n    2. Reportedly, that “mermaid” loved young master Lu to the marrow of her bones. Her emotions run so deep they were doomed to be evanescent. She had to sing a lullaby to young master Lu every night. \n\n    3. Reportedly, the mermaid who quietly sang to Lu Hao Zi has fled away. Moreover, she has fled away after dumping Lu Hao Zhi. \n\n****\n\nThe melon eating people: Young master Lu must have been heartless and done something contemptible to the other party. \n\nThen, one day, people suddenly found that young master Lu’s “mermaid” and that Luo Xi from showbiz who was as beautiful as a witch are the same person! \n\nEveryone mocked: Didn’t you say before that you don’t like her? Pah! Play. Just play. \n\nLu Hao Zhi: Uhm. It’s delicious.>"
}