{
	"url": "https://www.novelupdates.com/series/the-rebirth-of-an-ancient-cannon-fodder-girl/",
	"title": "The Rebirth of an Ancient Cannon Fodder Girl - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/04/The-rebirth-of-an-ancient-cannon-fodder-girl.jpg",
	"noveltype": "(CN)",
	"genre": "Historical   Romance   ",
	"tags": "Ancient China   Female Protagonist   Love Interest Falls in Love First   Nobles   Royalty   Second Chance   ",
	"rating": "(3.9 / 5.0, 16 votes)",
	"author": "临天   ",
	"year": "\n2021",
	"ranking": "#1473   #2000   #8288   #12113   #9288   ",
	"reviewcount": "5 Reviews",
	"description": "Sheng Xiyan was born again.\r\nIn the last life, she didn't know until after her death, that she had been living in a novel.\r\n\r\nThe protagonist of the novel is her fiancé Yongning Hou Shizi and his true love and his white moonlight Zhao Yuanrou, who is her cousin. Zhao Yuanrou is a noble and talented transgressive female, whereas she is a cannon fodder who frustrates them for life.\r\n\r\nIn order to stay together for a lifetime, they met to jump into the lake and try dying in the name love.\r\nThey did not die, but moved the queen mother. The queen mother made the decision for them, to let his True Love be with him and so both of them married into the Yongning Hou Mansion on the same day, but she fell 'seriously ill' before even seeing the husband's face.\r\n\r\nAfter a deep sadomasochistic relationship, the hero and heroine finally got together happily. In order to make way for them, Sheng Xiyan, who 'dominated' the position of his wife, 'died from illness' in the cold palace.\r\n\r\nIn this life, Sheng Xiyan was reborn on the day the hero and heroine eloped and died in love.\r\nFaced with the fiance whose face was deeply protective of Bai Yueguang and the queen mother who was moved by true emotions, Sheng Xiyan chose to marry the son of Zhenbei King Chu Yuanchen who had died on the battlefield.\r\n\r\nChu Yuanchen was a well-known and famous general in Dasheng, who had made great achievements in battle. In a battle with Beiyan, he defeated Beiyan and fled, but he himself was seriously injured and his whereabouts were unknown.\r\nSheng Xiyan became the eldest son of the imperial concubine of the Zhenbei Palace from the first wife of the Hou Mansion.\r\n\r\nI thought that this life could finally live comfortably, but I didn't expect that the man who died early in the novel would actually come back to life!>"
}