{
	"url": "https://www.novelupdates.com/series/the-protagonist-only-thinks-about-falling-in-love/",
	"title": "The Protagonist Only Thinks About Falling In Love - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/08/The-Protagonist-Only-Thinks-About-Falling-In-Love.jpg",
	"noveltype": "(CN)",
	"genre": "Fantasy   Romance   School Life   Supernatural   Xianxia   Yaoi   ",
	"tags": "Ancient Times   Apocalypse   Cultivation   Dragon Slayers   Dragons   Handsome Male Lead   Human-Nonhuman Relationship   Love Interest Falls in Love First   Modern Day   Multiple Protagonists   Older Love Interests   Playful Protagonist   Power Couple   Seme Protagonist   Strong Love Interests   System Administrator   Wealthy Characters   World Hopping   Zombies   ",
	"rating": "(4.6 / 5.0, 9 votes)",
	"author": "煮個甜粽   ",
	"year": "\n2022",
	"ranking": "#5262   #2000   #10070   #11075   #10523   ",
	"reviewcount": "2 Reviews sorted by",
	"description": "In each world derived from novels, there would be such a person; a protagonist, who although in name was no less than a proud son of heaven, had a destiny of neverending suffering, humiliation, betrayal, and abuse. The threads of these people’s fates were twisted in such a horrid way for one and only one simple reason; in the eyes of heaven, they were people whose temperaments should be honed and flaws smoothed akin to the surfaces of small pebbles fallen under running water, until the day came when they would finally be able to claim the seat at the pinnacle of the world that rightfully belonged to them.\n\nBut the harshness of such tempering was unbearable to the protagonists, and by the time they achieved their predestined glory, no residual goodness and kindness remained in their hearts. One by one, those people chose to walk the road of blackening, from which they were never to return.\n\nThen, some systems received a rather strange task; change the destiny of the protagonist, no matter what it takes. This was to be done by (including, but not limited to:) [acting as the protagonist’s golden finger], [becoming the protagonist’s mentor], [acting as the protagonist’s good brother]…\n\nThe systems were confident in their success: there should be no problem, we can solve anything.\n\nThe protagonists replied: don’t worry, we’ll take care of anything that goes wrong.\n\nSmall Theater.\n\n[Later–]\nThe system, taking up the form of a new character, led the protagonist to the pinnacle of life.\n\nProtagonist: with a heart of compassion, I wish nothing but peace to the world.\n\nThe system tasked with helping the protagonist find beauty and kindness in life: [comfortable.jpg]\n\nThen, the protagonist, who should have already blackened, said with a stammer: I… I want to fall in love with you.\n\nSystem: ???\n\nSystem: the two of us may not be compatible…\n\nThe protagonist took out his heavy sword, and the tree next to them fell to the ground. The blade exuded an air of absolute power, and it gleamed in the reflection of the protagonist’s clear eyes: What were you just saying?\n\nSystem: the two of us are a match made in heaven. A natural pair, perfect for each other.>"
}