{
	"url": "https://www.novelupdates.com/series/his-little-deer-wife-is-very-fierce/",
	"title": "His Little Deer Wife is Very Fierce - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/09/His-Little-Deer-Wife-is-Very-Fierce.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Fantasy   Horror   Mystery   Psychological   Romance   Shounen Ai   Supernatural   ",
	"tags": "Abandoned Children   Acting   Adopted Children   Bodyguards   Character Growth   Child Protagonist   Childhood Friends   Childhood Love   Childhood Promise   Cute Children   Cute Protagonist   Demons   Devoted Love Interests   Doting Love Interests   Early Romance   Evil Gods   Familial Love   First Love   Ghosts   Godly Powers   Gods   Hiding True Identity   Human-Nonhuman Relationship   Marriage   Modern Day   Mysterious Family Background   Non-humanoid Protagonist   Older Love Interests   Quirky Characters   Shapeshifters   Time Skip   Tragic Past   Wealthy Characters   ",
	"rating": "(4.2 / 5.0, 89 votes)",
	"author": "Little Baldy   秃子小贰   ",
	"year": "\n2021",
	"ranking": "#5262   #3742   #5025   #3373   #4440   ",
	"reviewcount": "18 Reviews sorted by",
	"description": "When Lu Rong was only four years old, he was kidnapped and taken to a small rural village to be sold to a family living there. After failing to find the buyer, the kidnapper left Lu Rong for dead. The village chief finds the little boy and cares for him like he is his own. But Lu Rong has a secret: he can turn into a small deer, with beautiful white fur and gentle eyes, and four clattering hooves.\r\n\r\n \r\n\r\nAt the age of eight, Lu Rong meets an eleven-year-old outsider by the name of Shen Jize. \r\n\r\n \r\n\r\nTogether, whether they understand at their young age or not, they go through many trials of life and death, caught between fantasy and reality, dreams and nightmares, demons and ghosts. \r\n\r\n \r\n\r\nWhen they must part after a single summer together, the two make a promise. \r\n\r\n'Rong Rong, I won't leave you, I will never leave you.'>"
}