{
	"url": "https://www.novelupdates.com/series/awakening-to-a-special-grade-explorer-a-young-man-who-has-been-cut-off-as-a-lizards-tail-becomes-the-king-of-hell-and-is-unmatched/",
	"title": "Awakening to a Special-Grade Explorer ~A Young Man Who Has Been Cut Off as a Lizard’s Tail Becomes the King of Hell and Is Unmatched~ - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/07/Awakening-to-a-SpecialGrade-Explorer-A-Young-Man-Who-Has-Been-Cut-Off-as-a-Lizards-Tail-Becomes-the-King-of-Hell-and-Is-Unmatched.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Drama   Fantasy   School Life   Supernatural   Tragedy   ",
	"tags": "Adapted to Manga   Betrayal   Demon Lord   Demons   Different Social Status   Dungeons   Goblins   Guilds   Hard-Working Protagonist   Harsh Training   Hell   Helpful Protagonist   Hiding True Abilities   Level System   Male Protagonist   Monster Tamer   Monsters   Naive Protagonist   Orphans   Poor Protagonist   Poor to Rich   R-15   Summoning Magic   Survival   Sword And Magic   Sword Wielder   Weak to Strong   Younger Sisters   ",
	"rating": "(3.9 / 5.0, 37 votes)",
	"author": "Kasanaki Kosame   笠鳴小雨   ",
	"year": "\n2020",
	"ranking": "#378   #491   #5613   #1245   #8175   ",
	"reviewcount": "1 Review sorted by",
	"description": "“I’m a loser, so I have to work harder. Harder than Ever.”\n\nIn this era where inherent powers were common, unknowingly the people were divided into the winners and losers.\n\nTenji Amagi, a 16-year-old boy who was born with the ability of such a loser, [Floating small objects], dreamed of being a professional explorer. An Explorer was a job that everyone envied as they were called the Heroes of the world, protecting civilians by fighting monsters in dungeons.\n\nThe boy always looked forward to become one, even though he was not gifted. And he was poor and an orphan.\n\nThis is a hero who grows up to be the best explorer in the world, a boy who had neither talent nor a bright future. \n\nThis is the story of the growth of a boy who received [Hell Beast Summoning]. He has to work hard every day to maintain his calling.>"
}