{
	"url": "https://www.novelupdates.com/series/come-to-my-side/",
	"title": "Come To My Side - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/02/Come-To-My-Side.jpg",
	"noveltype": "(CN)",
	"genre": "Romance   ",
	"tags": "Arranged Marriage   Beautiful Female Lead   Engagement   Family Conflict   Female Protagonist   Handsome Male Lead   Misunderstandings   Modern Day   Wealthy Characters   ",
	"rating": "(4.1 / 5.0, 34 votes)",
	"author": "Liu Mang Xing   六盲星   ",
	"year": "\n2020",
	"ranking": "#2463   #798   #7327   #7355   #8158   ",
	"reviewcount": "7 Reviews sorted by",
	"description": "Guan Xi, 26 years old, was suddenly informed that she’s not a biological child.\n\nThe real Miss Guan will soon be picked up from a corner of some small town.\n\nIn a flash, her world was turned upside down, her parents were going to divide their love, the property would have to be split, and even her current fiance might marry another person.\n\nAfter pondering overnight, Guan Xi decided to pull herself together and, against her conscience, confess her love to win her fiance’s favour: “Jiang Suizhou, I love you! I love you so much that I can’t live without you!”\n\nJiang Suizhou, who just came back from a business trip, slightly raised his eyebrows as he saw the flower petals on the floor,”Guan Xi, which limited edition bag did you fancy this time?”\n\n___\n\nThe eldest daughter of the Guan family, Guan Xi, has a handsome and wealthy fiance, however, everyone is well aware that Guan Xi and her fiance were just in a ‘speak money not love’ plastic relationship.\n\nFollowing the return of the real young lady, a lot of people insinuate that Guan Xi will lose everything. Until at a particular auction, everyone witnessed her fiance, Jiang Suizhou, spending lavishly to buy sets of luxury jewellery for Guan Xi.\n\nA friend hurriedly dissuaded him: “Are you insane, Guan Xi is not your fiance anymore.”\n\nHe found Jiang Suizhou smiling calmly,”She’s my spoiled fiance, who’s to say I should change.”>"
}