{
	"url": "https://www.novelupdates.com/series/reincarnated-in-a-game-world-how-could-i-do-something-like-a-tutorial-im-going-to-go-raise-my-level/",
	"title": "Reincarnated in a Game World ~How Could I Do Something Like a Tutorial, I’m Going to Go Raise My Level!~ - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/05/Reincarnated-in-a-Game-World-How-Could-I-Do-Something-Like-a-Tutorial-Im-Going-to-Go-Raise-My-Level.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Comedy   Fantasy   Harem   School Life   Shounen   Supernatural   ",
	"tags": "Academy   Adventurers   Battle Academy   Beast Companions   Beastkin   Beautiful Female Lead   Charismatic Protagonist   Charming Protagonist   Chat Rooms   Cheats   Childhood Friends   Clever Protagonist   Clumsy Love Interests   Dense Protagonist   Dungeons   Fast Learner   Game Elements   Game Ranking System   Grinding   Guilds   Handsome Male Lead   Hard-Working Protagonist   Harem-seeking Protagonist   Helpful Protagonist   Heroes   Hiding True Identity   Kind Love Interests   Lack of Common Sense   Level System   Loli   Love Interest Falls in Love First   Male Protagonist   Multiple POV   Mysterious Family Background   Mysterious Past   Nobles   Popular Love Interests   Protagonist Strong from the Start   R-15   Reincarnated in a Game World   Royalty   Saints   Secrets   Shy Characters   Special Abilities   Strong Love Interests   Strong to Stronger   Tsundere   ",
	"rating": "(3.7 / 5.0, 93 votes)",
	"author": "Nishikigi kaede   二シキギ・カエデ   ",
	"year": "\n2021",
	"ranking": "#467   #506   #1366   #747   #3463   ",
	"reviewcount": "13 Reviews sorted by",
	"description": "After putting in over 8000 hours into the game, he had achieved the status of being a true no-life god. Sadly, one day his save data disappeared and the shock of losing so many hours of effort killed him.\n\nHowever, this was not the end, for he awoke surrounded by the world that before now, he had only seen through a screen. This is the story of Zephyrus, who uses his gaming knowledge to enjoy his time in the new world.>"
}