{
	"url": "https://www.novelupdates.com/series/galactic-dark-net/",
	"title": "Galactic Dark Net - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2017/03/Galactic-Dark-Net.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Drama   Fantasy   Martial Arts   Sci-fi   Supernatural   Xuanhuan   ",
	"tags": "Aliens   Army Building   Artifacts   Artificial Intelligence   Beast Companions   Beautiful Female Lead   Bloodlines   Body Tempering   Clever Protagonist   Cultivation   Dark   Determined Protagonist   Dragons   Evolution   Fast Cultivation   Firearms   Futuristic Setting   Genius Protagonist   Hard-Working Protagonist   Male Protagonist   Merchants   Monsters   Mutated Creatures   Mysterious Family Background   Outer Space   Politics   Poor to Rich   Psychic Powers   Romantic Subplot   Ruthless Protagonist   Shameless Protagonist   Sharp-tongued Characters   S*aves   Special Abilities   Strategist   Strength-based Social Hierarchy   Time Skip   Unique Cultivation Technique   Wars   Weak to Strong   World Travel   ",
	"rating": "(4.0 / 5.0, 1186 votes)",
	"author": "9 lightyears per second   Sonic Nine Light Year   秒速九光年   ",
	"year": "\n2015",
	"ranking": "#2000   #3794   #220   #237   #416   ",
	"reviewcount": "136 Reviews sorted by",
	"description": "When the last prodigy level esper on Earth disappeared, Earth was in deep trouble of becoming another species' colony. The ordinary Han, with his intelligence and hardworking character, was able to make a fortune after “accidentally” stepping into the world of dark net, later purchasing an esper power crystal that brought him the ultimate power that changed the fate of the universe.\r\n\r\nDark net is a subset of the Deep Web that is not only not indexed by traditional search engines, but that also requires special tools like specific proxy or authentication to gain access. Dark net is not restricted by any law or morals, so the dark net market has everything that is prohibited by the law. Drugs, slaves, firearms, uranium, bioweapons, rare animals, human testing, assassination, and the list goes on. During the year of 2075 on Earth, Han Lang logged into the largest hyperspace dark net market, and our story begins.>"
}