{
	"url": "https://www.novelupdates.com/series/until-you-come/",
	"title": "Until You Come - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/08/Until-You-Come.jpeg",
	"noveltype": "(CN)",
	"genre": "Romance   School Life   Slice of Life   ",
	"tags": "Cute Story   Destiny   Devoted Love Interests   Fated Lovers   Female Protagonist   First Love   Handsome Male Lead   Heartwarming   Introverted Protagonist   Love at First Sight   Love Interest Falls in Love First   Misunderstandings   Modern Day   Persistent Love Interests   Secret Crush   Short Story   ",
	"rating": "(3.9 / 5.0, 17 votes)",
	"author": "Wu Yu Dou   雾与都   ",
	"year": "\n2020",
	"ranking": "#594   #6153   #9257   #8803   #10753   ",
	"reviewcount": "5 Reviews sorted by",
	"description": "In grade 10, Chen Qi continuously met the same male student every day she went to school.\r\n\r\nThe male student was very tall, especially with his beautiful eyes that were usually obscured by a contemplative look.\r\n\r\nStrangely, whenever Chen Qi went out, she always met that male student.\r\n\r\nThere were many people that she often encountered, but he was the only one who she could meet every day.\r\n\r\nChen Qi did not believe in fate, nor did she believe in the so-called fate, until the day he came.\r\n\r\nThen suddenly one day, she never saw that male student again.\r\n\r\nAt first, she did not think much of it, but every time Chen Qi passed Cornfield Road, she would subconsciously look for that familiar silhouette.\r\n\r\nJust one morning without seeing the male student, she would feel strange, and her heart would feel empty as if something was missing.\r\n\r\nHe was a stranger on the street, but also someone special in Chen Qi’s heart.\r\n\r\nThe yellowed cornfield leaves carried the bitter feelings of the young girl, fell to the ground and were blown away by the autumn wind.\r\n\r\nThe leaves had flown away, but her feelings were still there.\r\n\r\nWhen the two met again, Chen Qi stared blankly at the person in front of her, while listening to a song playing, and the lyrics were just sung:\r\n\r\n“I have never believed so, so sure, who will be my destiny\r\n\r\nUntil your light falls into my dark night.”\r\n\r\nChen Qi suddenly remembered a sentence:\r\n\r\n“If you don’t forget it, there will be a reply.”\r\n\r\n—Falling in love with a stranger at first sight—\r\n\r\nJiang Yan Yi X Chen Qi\r\n\r\n~I’ve never believed in fate until the day you came~>"
}