{
	"url": "https://www.novelupdates.com/series/the-legitimate-daughter-doesnt-care/",
	"title": "The Legitimate Daughter Doesn’t Care! - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/01/The-Legitimate-Daughter-Doesnt-Care.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Fantasy   Romance   School Life   ",
	"tags": "Beautiful Female Lead   Body Swap   Carefree Protagonist   Clever Protagonist   Complex Family Relationships   Couple Growth   Dense Protagonist   Doting Love Interests   Family Conflict   Female Protagonist   Friendship   Handsome Male Lead   Hard-Working Protagonist   Hiding True Abilities   Hiding True Identity   Kuudere   Models   Modern Day   Poor to Rich   Pregnancy   Protagonist Falls in Love First   Slow Romance   Tsundere   Twins   Wealthy Characters   ",
	"rating": "(4.3 / 5.0, 417 votes)",
	"author": "Mo Xi Ke   墨西柯   ",
	"year": "\n2019",
	"ranking": "#43   #86   #305   #168   #590   ",
	"reviewcount": "110 Reviews",
	"description": "There was a big scandal in the Mu family.\n\nThe real daughter of the Mu family was switched by the nanny since she was a child. The Mu family didn’t bring her back from countryside until 17 years later!\n\nAfter the true daughter returned – There was no affection, only sympathy.\n\nThe Mu family parents asked her, “We have a deep relationship with Yaoyao. We can’t let her lose face. We can only announce you as an adopted daughter to the outside world. You won’t blame us, right?”\n\nHer fiancé also said: “My fiancée can only be Yaoyao! Get out of here country bumpkin.”\n\nThe attitude of her older brother Mu Qingyi was even more complicated.\n\nYet despite all that, the real daughter, Xu Xinduo, said indifferently, “It doesn’t matter.”\n\n***\n\nFrom a young age Xu Xinduo could swap bodies with a certain teenager. That teenager would always exclaim in an annoyed tone, “Let’s switch bodies, I just don’t feel like taking piano lessons.”\n\nXu Xinduo helped the teenager to win various trophies, become a top student and honed his noble temperament and talent after taking over his body.\n\n***\n\nAt a banquet, everyone in the Mu family watched as a rich young master strode towards Xu Xinduo and said, “Be my girlfriend, although you are from a small family… you are very beautiful.”\n\nWith a smile Xu Xinduo replied, “I’m starting to miss my parents already.”\n\nSuch a quick change of attitude?!\n\nThe romantic story of the indifferent real daughter x a filthy rich despotic young master\n\nNote: Here “switching bodies” means swapping of souls. It’s temporary and doesn’t involve any physical changes.>"
}