{
	"url": "https://www.novelupdates.com/series/after-rebirth-the-scum-all-cry-for-forgiveness/",
	"title": "After Rebirth, the Scum All Cry for Forgiveness - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/02/After-Rebirth-the-Scum-All-Cry-for-Forgiveness_1614330646.png",
	"noveltype": "(CN)",
	"genre": "Comedy   Drama   Romance   School Life   Shoujo   ",
	"tags": "Calm Protagonist   Complex Family Relationships   Couple Growth   Devoted Love Interests   Doting Love Interests   Family   Family Conflict   Female Protagonist   Handsome Male Lead   Heartwarming   Modern Day   Multiple Reincarnated Individuals   Reincarnation   Revenge   Second Chance   Sister Complex   Tragic Past   Transmigration   Unconditional Love   Wealthy Characters   ",
	"rating": "(4.0 / 5.0, 86 votes)",
	"author": "明桂载酒   ",
	"year": "\n2021",
	"ranking": "#4080   #1282   #3956   #4680   #3429   ",
	"reviewcount": "29 Reviews sorted by",
	"description": "When she woke up, Zhong Youyou had become the vicious supporting female lead in an old, stereotypical romance story.\r\n\r\nThe supporting female lead was unpleasant; her parents, brother and fiance were actually partial to the delicate and pitiful heroine. After being robbed of everything by the heroine, the supporting female lead’s envy evolved into hate and her mind became twisted. She then finally met a tragic end on the street.\r\n\r\nWhen Zhong Youyou read it, she complained about the supporting female lead’s stupidity. She had the money and the looks, so why must she make it hard for the heroine and be so dead set on that fiancé — but then, she transmigrated and became the supporting female lead.\r\n\r\nShe had 90 million in her card, countless estates under her name and a beautiful face reflected back in the mirror.\r\n\r\n'......' She laid on the hospital bed, screaming silently under the covers. So rich! Who cares about some fiance, some scumbag father and scumbag brother? Who cares about fighting with the heroine?!\r\n\r\n*\r\n\r\nFather Zhong, Mother Zhong, younger brother Zhong and Zhong Youyou's fiancé, Shi Zhitang, were all reborn and deeply regretted their actions.\r\n\r\nWhy didn’t they treat Zhong Youyou better in the previous life, and all for the sake of an outsider? Zhong Youyou died a tragic death because of them, yet in the end, Zhong Youyou still disregarded past grudges and sacrificed her life to save theirs......\r\n\r\nIn this life, they vowed to treat Zhong Youyou well and give her all their love.\r\n\r\nHowever, while they were full of guilt and remorse and began to desperately try making it up to Zhong Youyou, she……Zhong Youyou happily went out shopping for bags, going to the spa, and eating luxuriously expensive dough stick pancakes. With greasy hands and shining eyes, her face was glowing with happiness.\r\n\r\n'...' Where did the Zhong Youyou, who went mad and became twisted in order to get their love, go?!>"
}