{
	"url": "https://www.novelupdates.com/series/a-mistaken-marriage-match-pursuit-of-murderer-in-liao-yue/",
	"title": "A Mistaken Marriage Match: Pursuit of Murderer in Liao Yue - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2016/12/20151201115431210.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Historical   Martial Arts   Mystery   Romance   Shoujo   ",
	"tags": "Apathetic Protagonist   Assassins   Beautiful Female Lead   Clever Protagonist   Cold Protagonist   Detectives   Doctors   Female Protagonist   Handsome Male Lead   Mysterious Past   Mystery Solving   Royalty   Schemes And Conspiracies   Sword Wielder   ",
	"rating": "(3.8 / 5.0, 52 votes)",
	"author": "Qian Lu   浅绿   ",
	"year": "\nN/A",
	"ranking": "#2000   #2000   #5783   #9319   #4591   ",
	"reviewcount": "3 Reviews sorted by",
	"description": "5th Book of the A Mistaken Marriage Match series. \n\nWhat would happen if you put together a thick-skinned bailiff who concealed his true self deeply with the cold and sharp beloved daughter of the Prime Minister’s manor who was currently ‘running away’ from home?\n\nOriginally, one was merely going along with an arranged bet and picked a country which one was a bit interested in – Liao Yue. One had planned to go on a scenic tour while looking for a rare treasure on the side for the “One Year Agreement”.\n\nUnexpectedly, one had just arrived at the border of Liao Yue when one encountered a murder case and in passing, also came across an interesting person who looked roguish, but was actually an incisive bailiff.\n\nWhat surprised her even more was that this bailiff’s history was so secretive and bizarre, and unexpectedly still had a connection to her pliable sword “Cang Feng” which had accompanied her for so many years.\n\nIt seemed that following her steps to the center of the capital of Liao Yue, those “vicious beasts” who originally hid beneath the layer after layer of thick fog began to mobilize their fierce pawns toward her…>"
}