{
	"url": "https://www.novelupdates.com/series/god-of-illusions/",
	"title": "God of Illusions - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/12/God-of-Illusions.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Comedy   Fantasy   Harem   Martial Arts   Mystery   Romance   School Life   Xuanhuan   ",
	"tags": "Academy   Adopted Protagonist   Battle Academy   Beautiful Female Lead   Carefree Protagonist   Caring Protagonist   Charismatic Protagonist   Clever Protagonist   Cultivation   Cunning Protagonist   Human-Nonhuman Relationship   Magic   Male Protagonist   Older Love Interests   Playful Protagonist   Polygamy   Poor to Rich   Puppeteers   R*pe Victim Becomes Lover   R*pe   Schemes And Conspiracies   S*xual Cultivation Technique   Shameless Protagonist   Student-Teacher Relationship   Trickster   Unique Cultivation Technique   Weak to Strong   ",
	"rating": "(3.2 / 5.0, 97 votes)",
	"author": "Seven Little Eagles   七只小鹰   ",
	"year": "\n2018",
	"ranking": "#6970   #2000   #2312   #9501   #4050   ",
	"reviewcount": "16 Reviews",
	"description": "Before he was a little over 10 years old, he was the nightmare of the Gorge of Heroes and the headache of countless people that had been abandoned by the world.\r\n\r\nAfter leaving the Gorge of Heroes, he became a legendary figure of the number one academy in the continent, and he alone brought numerous changes to it.\r\n\r\nThereafter he stepped foot onto the continent to become a legend, but the road to become a legend was far more difficult than he’d imagined….\r\n\r\nOn a continent where puppet masters reign supreme, using anything and everything as weapons: living creatures, shoes, daggers, pendants, clothes, shields, guns — which they call puppets, this is the story of Bai Xiaofei with his trusty sidekick, Huskie, on a quest to find out exactly what happened to his parents and become the greatest illusion stream puppet master the world has ever seen. This is a story of wit, plot twists, love, strategy, cultivation, humor, and the unknown.>"
}