{
	"url": "https://www.novelupdates.com/series/im-scattering-iq-to-the-protagonist/",
	"title": "I’m Scattering IQ to the Protagonist - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2017/12/Untitled-1.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Comedy   Drama   Fantasy   Psychological   Romance   Shounen Ai   Supernatural   ",
	"tags": "Acting   Ancient China   Apocalypse   Black Belly   Cold Protagonist   Confident Protagonist   Cunning Protagonist   Devoted Love Interests   Doting Love Interests   Fated Lovers   Genius Protagonist   Jack of All Trades   Love at First Sight   Love Interest Falls in Love First   Male Yandere   Manipulative Characters   Modern Day   Multiple Realms   Possessive Characters   Power Couple   Protagonist Strong from the Start   Royalty   Showbiz   Strong Love Interests   System Administrator   Wealthy Characters   World Hopping   Zombies   ",
	"rating": "(4.1 / 5.0, 376 votes)",
	"author": "Sòng Jūn Shí Lǐ   送君十里   ",
	"year": "\n2017",
	"ranking": "#1768   #1675   #479   #1641   #390   ",
	"reviewcount": "76 Reviews sorted by",
	"description": "System: You are the only human who meets the binding requirements of this system- please bind with me!\n\nSu Yu: I have money, good looks, power and influence, why should I bind myself to you?\n\nSystem: You haven’t fallen in love ye-\n\nSu Yu: Aiya! My stomach is hurting all of a sudden!\n\nSu Yu bound himself to a system; his only task is to scatter some IQ to the brainless male protagonists. The soft-headed male protagonist chases after the female protagonist, the male protagonist with some intellect chases after him. He feels that something is not quite right…\n\nSu Yu: System, is there something common between these male protagonists?\n\nSystem: Yes, they are all male protagonists.\n\nSu Yu: …Suddenly, I don’t feel like talking anymore.\n\nMale Protagonist who has been scattered with some IQ: Then don’t talk, just kiss me. \n\nSu Yu: …Suddenly, I don’t feel like doing the task anymore.>"
}