{
	"url": "https://www.novelupdates.com/series/i-am-not-fit-to-be-the-male-leads-first-love/",
	"title": "I Am Not Fit to Be the Male Lead’s First Love - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/09/007eoFhUgy1gf7wbz0bkwj30u0140hdt.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Mystery   Romance   School Life   Supernatural   ",
	"tags": "Absent Parents   Abusive Characters   Accelerated Growth   Beautiful Female Lead   Betrayal   Bullying   Calm Protagonist   Character Growth   Charismatic Protagonist   Cheats   Clever Protagonist   Complex Family Relationships   Confident Protagonist   Confinement   Cunning Protagonist   Doting Older Siblings   Fated Lovers   Female Protagonist   Genius Protagonist   Handsome Male Lead   Hard-Working Protagonist   Hiding True Abilities   Hiding True Identity   Love at First Sight   Love Interest Falls in Love First   Male Yandere   Misunderstandings   Modern Day   Obsessive Love   Past Plays a Big Role   Possessive Characters   Previous Life Talent   Revenge   Second Chance   S*xual Abuse   Shameless Protagonist   Sibling Rivalry   Siblings Not Related by Blood   Slow Romance   Smart Couple   Stockholm Syndrome   System Administrator   Time Travel   Tragic Past   Unconditional Love   Underestimated Protagonist   Unreliable Narrator   Wealthy Characters   Yandere   ",
	"rating": "(4.3 / 5.0, 298 votes)",
	"author": "赵史觉   ",
	"year": "\n2020",
	"ranking": "#2731   #2457   #1051   #3155   #914   ",
	"reviewcount": "89 Reviews",
	"description": "Only after Chu Yin died did she realize she was the first love (white moonlight) of the male lead in a novel.\n\nThe stubborn male lead fell in love with her at first sight when he was young, then took over the company when he was older.\n\nChu Yin was tortured by his crazy possessiveness and died a tragic early death.\n\nOpening her eyes again, she returned to the day before she transferred schools and met Lu Zhen.\n\n“Ding~ Bound to the learning system! Host can change the original script of the novel by learning!”\n\n【You can change a word from the original script after completing homework!】\n\n【If you place first in your grade, you can change one sentence in the original script!】\n\n【If you place first in the college entrance examination, you can create your own ending!\n\nGet rich! Be famous! Do whatever you want!】 \n\nThat night, Chu Yin finished her homework and obtain the reward to change a word in the original script: “On the day of their first encounter, Lu Zhen walked into the school as light rain poured down the sky.”\n\nThe next day, Lu Zhen walked into the school, and a knife suddenly fell from the sky.\n\nYoung Lu Zhen: ?\n\nSomeone wants my life.\n\n***\n\nThe whole school knew that the daughter of the Chu family from the countryside swept the entire grade and placed first, and also took the throne of the school’s flower.\n\nBut one day, the whole school went crazy, saying that she somehow provoke the big devil Lu Zhen.\n\n…\n\nAfter doing bad things to the male lead, Chu Yin was cornered, feeling a little guilty.\n\nThe young man in front of her was like a trapped beast, his dark eyes that was restrained for two lifetimes, showed madness: “Want my life?”\n\n“——Take it.”>"
}