{
	"url": "https://www.novelupdates.com/series/do-all-mothers-in-childcare-novels-have-to-die/",
	"title": "Do All Mothers in Childcare Novels have to Die? - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/05/Do-All-Mothers-in-Childcare-Novels-have-to-Die.jpg",
	"noveltype": "(KR)",
	"genre": "Drama   Fantasy   Romance   ",
	"tags": "Aristocracy   Beautiful Female Lead   European Ambience   Female Protagonist   Handsome Male Lead   Marriage of Convenience   Obsessive Love   Possession   R-15   Royalty   Transmigration   ",
	"rating": "(3.9 / 5.0, 32 votes)",
	"author": "토토타   ",
	"year": "\n2022",
	"ranking": "#5262   #6263   #8297   #4027   #8588   ",
	"reviewcount": "No Reviews",
	"description": "“I command King of Nieta to give the kingdom’s princess. I will return to the empire with the princess.”\n\nThe memory of my previous life came to my mind the moment I became a hostage to the empire, this is the world inside the imperial childcare novel, and I was the heroine’s mother.\n\nThe mother who died giving birth to the heroine according to the cliché law of childcare novel.\n\nI didn’t want to die, so I tried to run away, but I was caught as soon as I left the stables.\n\n“My hostage was trying to run away.”\n\nThat too, the emperor of the empire, the person responsible for it.\n\nThere was nothing I could do until I was dragged along and became an empress.\n\nThen I tried to become an empress who went unnoticed and abandoned.\n\n“Let’s always sleep in the same bed. You and me.”\n\nBut, why the hell is the emperor in my palace?! Does he have nothing to do?\n\nThe empress dowager only says that when she sees me, I remind her of when she was young and cries.\n\nThe emperor insists on not visiting the empress dowager.\n\nThe mother and the son seemed to have a bad relationship, so I reconciled them….\n\n“If Your Majesty is being mean, tell me secretly. Then I’ll help you somehow.”\n\nEven the empress dowager, who had regained her son’s love.\n\n“I have never been attached to anyone. But I kept my eyes on you.”\n\nWhy does this handsome emperor suddenly look at me with his twinkling eyes….\n\nI really want to run away.\n\nIf I had a baby with this man, everyone would be happy except me.\n\nBut why can’t I leave the man who whispers that he’s lonely?>"
}