{
	"url": "https://www.novelupdates.com/series/the-city-of-terror/",
	"title": "The City of Terror - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2016/10/TCOT.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Fantasy   Martial Arts   Mecha   Sci-fi   Supernatural   ",
	"tags": "Apocalypse   Appearance Changes   Evolution   Fantasy Creatures   Fantasy World   Game Elements   Level System   Male Protagonist   Modern Day   Nationalism   Poor to Rich   Post-apocalyptic   Racism   Romantic Subplot   Ruthless Protagonist   Spear Wielder   Special Abilities   Survival   Sword Wielder   Time Skip   Weak to Strong   World Travel   ",
	"rating": "(3.7 / 5.0, 143 votes)",
	"author": "Daoist Fierce Tiger   Měnghǔ Dàocháng   猛虎道长   ",
	"year": "\n2016",
	"ranking": "#6970   #6226   #1761   #12437   #5404   ",
	"reviewcount": "20 Reviews sorted by",
	"description": "What the hell is this? What the hell happened here?\n\nHow did my room become so ruined after a single night?\n\nThe floor and table were covered in dust, his new poster of Zhang Liang Ying that had just been posted on the wall a few days ago had already become yellow and tattered all over. Even Zhang Liang Ying’s beautiful face became monstrous, as if an old devil was looking at him with a terrifying smile.\n\nThe walls were covered by a mist of cobwebs and the fruits placed on top of the coffee table were withered and rotted to the point that the mold on them had turned black. The fruits below even seemed to have turned into mush. The aluminium framed window that the landlord had just installed not that long ago was now covered in a layer of white ash and the glass was filled with cracks and covered in dust.\n\nThe computer beside his bed was also covered by cobwebs and was accompanied by an empty water glass with a withered worm inside of it.\n\nDust filled the air making Wei Xiao Bei choke as he tried to breathe.\n\nEverything seemed to be ash gray without any light, as if looking at television static.\n\nAfter just one night, it seemed like everything in the room had aged for centuries or even millennia.\n\nMother… is this a dream?\n\nThis must be a dream!\n\n---\n\nOne day, Wei Xiao Bei gets dragged into The Dust World, a post-apocalyptic world ruled by monsters from myths, legends, games, etc. He also gains the power to travel between it and the real world, as well as the power called the ‘Status Panel’. With this power, he chooses to strengthen himself to explore the vast mysteries and terror of the other world. What mysteries await him? And what is The Dust World.>"
}