{
	"url": "https://www.novelupdates.com/series/the-strongest-clans-master-is-the-weakest-and-most-evil-support-class-even-with-a-fail-job%e3%80%8ctalker%e3%80%8d-with-my-brains-and-dependable-allies-abilities-im-the-worlds-strongest-see/",
	"title": "The Strongest Clan’s Master Is the Weakest and Most Evil Support Class ~Even with a Fail Job「Talker」, with My Brains and Dependable Allies’ Abilities, I’m the World’s Strongest Seeker~ - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/05/b59307fdacf7b2db12ec4bd5ca1caba8_1590723649_15ed08441d9578.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Comedy   Drama   Fantasy   Harem   Psychological   Seinen   Tragedy   ",
	"tags": "Adapted to Manga   Androgynous Characters   Antihero Protagonist   Betrayal   Clan Building   Clever Protagonist   Cunning Protagonist   Death of Loved Ones   Determined Protagonist   Dungeons   Elves   Fantasy World   Guilds   Handsome Male Lead   Hated Protagonist   Loyal Subordinates   Magical Technology   Male Protagonist   Manipulative Characters   Multiple POV   R-15   Ruthless Protagonist   Skill Books   Sword And Magic   Teamwork   Tsundere   Weak Protagonist   Yandere   ",
	"rating": "(3.8 / 5.0, 97 votes)",
	"author": "じゃき   ",
	"year": "\n2020",
	"ranking": "#5262   #6195   #2111   #1774   #2438   ",
	"reviewcount": "16 Reviews sorted by",
	"description": "Noel, a youth who admires his grandfather, who was hailed as a hero, and aspires to be the strongest Seeker.\r\n\r\nBut his Job that appeared in the appraisal, was the support class Talker.\r\n\r\nTalker is a peaky job with the weakest individual abilities. A job that could never become the strongest.\r\n\r\n「If I create the strongest clan and become the clan master, then I’ll essentially be the strongest」\r\n\r\nThinking that, Noel worked hard persistently to fulfill his ambition.\r\n\r\nOn the other hand, the merciless methods he employed for the sake of his ambition were acknowledged by everyone as the path of『evil』.\r\n\r\nHowever, Noel’s distinct talent attracted many powerful people and they began to gather under him……\r\n\r\nThis is the story of how the most evil Talker, who seeks to be the strongest, subdues his allies and creates the strongest clan in the world.>"
}