{
	"url": "https://www.novelupdates.com/series/return-of-mount-hua-sect/",
	"title": "Return of Mount Hua Sect - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/06/Return-of-Mount-Hua-Sect.jpeg",
	"noveltype": "(KR)",
	"genre": "Action   Adventure   Comedy   Fantasy   Martial Arts   Wuxia   ",
	"tags": "Adapted to Manhwa   Age Progression   Appearance Different from Actual Age   Character Growth   Clan Building   Cultivation   Cunning Protagonist   Friendship   Handsome Male Lead   Harsh Training   Hiding True Identity   Hot-blooded Protagonist   Lack of Common Sense   Leadership   Loyal Subordinates   Male Protagonist   Martial Spirits   Merchants   Money Grubber   Overpowered Protagonist   Past Plays a Big Role   Pill Based Cultivation   Proactive Protagonist   Protagonist Strong from the Start   Quirky Characters   Revenge   Ruthless Protagonist   Sect Development   Strong to Stronger   Sword Wielder   Time Skip   Transmigration   Weak to Strong   Wealthy Characters   ",
	"rating": "(4.6 / 5.0, 198 votes)",
	"author": "비가   ",
	"year": "\n2019",
	"ranking": "#34   #21   #971   #59   #1943   ",
	"reviewcount": "18 Reviews sorted by",
	"description": "The 13th disciple of the Great Mount Hua Sect. One of the Greatest Third-Generation Swordsmen. The Plum Blossom Sword Master, Chungmyung.\n\nAfter slicing the head of the peerless Heavenly Demon, who threw the world into chaos, he slept an eternal sleep on the peak of the Hundred Thousand Great Mountains. Jumping over a hundred years, he comes back in the body of a child.\n\nBut… what? Mount Hua declined? What the hell are you talking about!?\n\nIt’s only natural to want to live if you’re going broke.\n\n“Decline? Even though I’m here? Who would dare!”\n\nPlum blossoms eventually fall.\n\nBut when the cold winter passes and spring comes, plum blossoms shall bloom again.\n\n“But I’m gonna die first before Mount Hua gets revived! If you’re gonna go bust, might as well do it right, you bastards!”\n\nThe beginning of the Plum Blossom Sword Master, Chungmyung’s solitary struggle to save the thoroughly declining Mount Hua Sect.>"
}