{
	"url": "https://www.novelupdates.com/series/sekai-saikyou-no-maou-desuga-daremo-toubatsushinikitekurenainode-yuusha-ikusei-kikan-ni-sennyuusuru-koto-ni-shimashita/",
	"title": "Sekai Saikyou no Maou desuga Daremo Toubatsushinikitekurenainode, Yuusha Ikusei Kikan ni Sennyuusuru koto ni Shimashita - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/06/2yoAXVu.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Comedy   Drama   Fantasy   Harem   Mature   Mystery   Romance   Seinen   ",
	"tags": "Academy   Adapted to Drama CD   Adapted to Manga   Angels   Antihero Protagonist   Beastkin   Clingy Lover   Demi-Humans   Demon Lord   Demons   Depictions of Cruelty   Discrimination   Elves   Enemies Become Lovers   Fated Lovers   Handsome Male Lead   Hard-Working Protagonist   Harem-seeking Protagonist   Heroes   Hiding True Abilities   Hiding True Identity   Humanoid Protagonist   Kingdoms   Knights   Male Protagonist   Mysterious Past   Mystery Solving   Naive Protagonist   Obsessive Love   Overpowered Protagonist   Perverted Protagonist   Polygamy   Protagonist Strong from the Start   Romantic Subplot   Ruthless Protagonist   Strong Love Interests   Unconditional Love   Yandere   Younger Love Interests   ",
	"rating": "(3.8 / 5.0, 113 votes)",
	"author": "Ryoudou Wataru   両道 渡   ",
	"year": "\n2018",
	"ranking": "#3923   #4871   #1749   #3215   #1576   ",
	"reviewcount": "12 Reviews sorted by",
	"description": "Lucifer, the strongest Demon king has ruled the demon race with his overwhelming power.\n\nMaking a Harem with his dearest wife, he spent several hundred years eating, making love and sleeping.\n\nTired of sleeping, the Demon King began to seek for  a powerful enemy.\n\nWhy doesn’t the hero come to subdue him? Even though he’s been waiting for so long.\n\nLucifer then turned himself into a human, and decided to go and see the military academy, which is a training institution for the heroes.\n\nThe best way to know what’s inside is to enroll in the school.\n\nHe quickly passed the entrance exam and enrolled safely…!?\n\nThis is a story of the most powerful demon king that becomes the strongest hero by mistake.>"
}