{
	"url": "https://www.novelupdates.com/series/true-and-false-young-master/",
	"title": "True and False Young Master - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2018/10/trueandfalse1.jpg",
	"noveltype": "(CN)",
	"genre": "Adult   Drama   Fantasy   Gender Bender   Historical   Josei   Romance   Smut   ",
	"tags": "Abusive Characters   Ancient China   BDSM   Cross-dressing   Female Protagonist   Handsome Male Lead   Love Interest Falls in Love First   Male Yandere   Possessive Characters   R*pe   Sadistic Characters   S*xual Abuse   Siblings Not Related by Blood   Stockholm Syndrome   Transmigration   Weak Protagonist   ",
	"rating": "(3.1 / 5.0, 129 votes)",
	"author": "Yuan Yuan   元媛   ",
	"year": "\n2015",
	"ranking": "#2000   #2000   #3720   #2708   #3131   ",
	"reviewcount": "35 Reviews sorted by",
	"description": "3rd book in Yuan Yuan’s series 老梗也是梗系列之(AKA We were supposed to have died in a plane crash, instead we transmigrated). The stories consist of three modern settings and three historical.\n\n—\n\nThis was simply a live-action dog blood TV drama!\n\nShe did not die from the plane crash, but transmigrated into an ancient woman disguised as the worst black sheep of a man.\n\nShe also had an elder brother who wasn’t related to her by blood…\n\nHer innate anti-evil sensor told her that this ice-cold man was very dangerous.\n\nShe had to be very careful or she would be seen through.\n\nBut how could she imagine that ice cold man was not only watching her, but peeked at her taking a bath.\n\nShe is not only exposed as a woman, but also everything was seen!\n\nThis ancient man was really responsible and wanted to marry her?!\n\nMother! How could she escape now?\n\nCaught in a spiral of bad luck and getting ‘punished’ by the ice man.\n\nBut, they are nominally brothers!\n\nBesides he also had a fiance so she must hold on to her heart.\n\nIt was already miserable enough transmigrating to ancient times, but why would she want to be a third wheel…>"
}