{
	"url": "https://www.novelupdates.com/series/comeback-of-the-abandoned-wife/",
	"title": "Comeback of the Abandoned Wife - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/10/Comeback-of-the-Abandoned-Wife.png",
	"noveltype": "(CN)",
	"genre": "Adult   Romance   Xuanhuan   Yaoi   ",
	"tags": "Adapted to Manhua   Ancient China   Appearance Changes   Arranged Marriage   Cautious Protagonist   Character Growth   Cheats   Childcare   Clever Protagonist   Complex Family Relationships   Cultivation   Cunning Protagonist   Cute Children   Death   Dreams   Familial Love   Family Conflict   Fast Cultivation   Fat Protagonist   Fat to Fit   Handsome Male Lead   Healers   Hidden Abilities   Hiding True Abilities   Love Interest Falls in Love First   Multiple Realms   Mysterious Family Background   Parallel Worlds   Past Plays a Big Role   Previous Life Talent   Reincarnation   Revenge   Royalty   Ruthless Protagonist   Schemes And Conspiracies   Second Chance   Siblings   Special Abilities   Strong Love Interests   Tragic Past   Weak to Strong   Wealthy Characters   ",
	"rating": "(4.2 / 5.0, 151 votes)",
	"author": "Jin Yuanbao   金元宝   ",
	"year": "\n2017",
	"ranking": "#2240   #1406   #2040   #2942   #1304   ",
	"reviewcount": "22 Reviews sorted by",
	"description": "After Wu Ruo dies, he is reborn in those dark days when he was the most useless and the fattest that he hated the most.\n\nAnd in his new life, he not only has been married with a man, but also is a useless waste who can’t cultivate. He needs other’s support when he gets up, and would pant taking a few more steps, and even would get his butt stuck by the door when he tries to get out through it. You can say he has arrived to a new level of his wasteness, and meanwhile, reached a new fat level.\n\nBut…\n\nEven though he has already been this fat, he still wants him to serve him in bed???\n\nDamn it!\n\nFine! See how I crush you in bed!\n\nIn this life, when Wu Ruo decides to take revenge, he has erased all his past that’s even hard to tell…>"
}