{
	"url": "https://www.novelupdates.com/series/after-a-flash-marriage-with-the-disabled-tyrant/",
	"title": "After a Flash Marriage With the Disabled Tyrant - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/12/After-a-Flash-Marriage-With-the-Disabled-Tyrant.jpg",
	"noveltype": "(CN)",
	"genre": "Adult   Drama   Mature   Romance   Yaoi   ",
	"tags": "Business Management   Childcare   Clever Protagonist   Cohabitation   Cold Love Interests   Confident Protagonist   Contracts   Cute Children   Devoted Love Interests   Disabilities   Doting Love Interests   Doting Older Siblings   Dreams   Family Conflict   First Love   Heartwarming   Love Interest Falls in Love First   Marriage   Marriage of Convenience   Modern Day   Playful Protagonist   Power Couple   Secret Crush   Secretive Protagonist   Shameless Protagonist   Sibling's Care   Smart Couple   Strong Love Interests   ",
	"rating": "(4.4 / 5.0, 230 votes)",
	"author": "惗肆   ",
	"year": "\n2021",
	"ranking": "#223   #153   #1399   #348   #1402   ",
	"reviewcount": "43 Reviews sorted by",
	"description": "Shi Yunnan was sent out of the country by his parents since he was young, and lived like an unloved child, but he still played around wantonly and relied on his appearance to make trouble~\n\nAs a result, he was deceived by his elders into returning home and was informed that he was about to marry the young master of the Luo family.\n\n“What kind of feudalistic ideology is this? It’s outrageous!”\n\nShi Yunnan packed his luggage that night, planning to escape the next day, but when he fell asleep, he dreamed of a terrible scenario——\n\nHe dreamed that his life was just a supporting character in a book. Because he didn’t get along with the protagonist who transmigrated into the book, he eventually ended up in a situation of being forsaken by everyone.\n\nAll tragedies began with this willful escape from marriage.\n\nAfter waking up, Shi Yunnan hadn’t had the time to let everything sink in when he was blocked at the door of his own house——\n\n“Second young master Shi thinks that our Luo family is not worthy of you?”\n\nThe man in front of him had a heavenly face, his temperament was abstinent and outstanding. His whole body was wrapped in luxurious outfits. Even those long legs, which relied on wheelchairs, wildly shook second young master Shi’s aesthetic point.\n\nSigh, I’m a good boy who listens to his parents and matchmakers!\n\nShi Yunnan pretended to be reserved for three seconds, then nodded like a chicken pecking on rice, “Worthy, of course, you’re worthy! Is the wedding banquet ready? Husband~”\n\nThe man stared at his smiling face and answered subtly, “Let’s do it this evening.”>"
}