{
	"url": "https://www.novelupdates.com/series/after-being-transported-into-a-book-i-adopted-the-villain/",
	"title": "After Being Transported into a Book, I Adopted the Villain - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/07/0067qreMgy1g0zd9s93aij30b40fkwjs.jpg",
	"noveltype": "(CN)",
	"genre": "Drama   Romance   Yaoi   ",
	"tags": "Adopted Children   Age Progression   Black Belly   Business Management   Caring Protagonist   Clingy Lover   Disabilities   Guardian Relationship   Handsome Male Lead   Love Interest Falls in Love First   Male Yandere   Misunderstandings   Modern Day   Obsessive Love   Possessive Characters   Strong Love Interests   Time Skip   Transmigration   Wealthy Characters   Younger Love Interests   ",
	"rating": "(3.8 / 5.0, 253 votes)",
	"author": "Sweet And Greasy Millet Porridge   甜腻小米粥   ",
	"year": "\n2019",
	"ranking": "#5262   #2655   #1032   #5289   #595   ",
	"reviewcount": "53 Reviews sorted by",
	"description": "When Shen Yu woke up, he had accidentally gone into a ridiculous dog-blood novel.\n\nIn the novel, he is an unfortunate cannon fodder character:\n\n– dead father and mother\n\n– his fiancée had run away\n\n– he is disabled (in a wheelchair)\n\n– he lives a lonely life in a 20,000-square foot mansion.\n\nLater, in order to compete for the female lead, he died under the opposition.\n\nIn order to save his life, Shen Yu had to stay as far away as possible from the leading and supporting roles and concentrate on enjoying the luxury life. \n\nAs a result, one day, the servant brought a 10-year-old villain with bruised eyes: “Sir, this is the orphan of Tang’s family.”\n\nShen Yu: “…”\n\nShen Yu decided to adopt the small villains and change his fate. \n\nTen Years Later.\n\nThe villain pushed Shen Yu to the corner: “Who is that woman?”\n\nShen Yu: “… Who do you say?”\n\nThe villain: “The woman who seduced you at last night’s banquet!”\n\nShen Yu: “…”\n\nThe villain: “Hehe, I’m going to kill her.”\n\nShen Yu: “My son… That’s the female lead you forgot by the lake…”>"
}