{
	"url": "https://www.novelupdates.com/series/whered-my-delicate-little-wife-go/",
	"title": "Where’d My Delicate Little Wife Go? - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/05/Whered-My-Delicate-Little-Wife-Go_1653085086.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Fantasy   Romance   Yaoi   ",
	"tags": "Beast Companions   Beasts   Comedic Undertone   Cultivation   Early Romance   Hiding True Identity   Manly Gay Couple   Marriage   Misunderstandings   Pets   Reincarnation   Secret Identity   Transmigration   ",
	"rating": "(4.2 / 5.0, 35 votes)",
	"author": "Jué Jué   决绝   ",
	"year": "\n2021",
	"ranking": "#1444   #1237   #6203   #1595   #5967   ",
	"reviewcount": "6 Reviews sorted by",
	"description": "Xie Yunnan accidentally learned that he was a cannon fodder in someone else's love, and would lose his life because of it.\n\nWhat the hell is this? He doesn't want to die!\n\nAlso, he is clearly a top. His dream since childhood was to marry a beautiful and fair-skinned wife!\n\nAfter inadvertently saving a pitiful and frail beauty, Xie Yunnan bit down, and got the certificate with someone.\n\nHe married, and the scumbag left.\n\nAfter marriage, Xie Yunnan fed his little wife every day and vowed to be a considerate and good husband.\n\nAfter feeding and feeding, he gradually felt that something was wrong.\n\nGood little wife, why are you getting stronger?!\n\n------\n\nDuan Changqing, a body-refining madman, transmigrated into a pitiful little fellow with injuries all over his body, and found a Taoist companion who was in-line with his heart.\n\nHe is very satisfied.\n\nHe will definitely grow back his muscles as soon as possible, and beat down all those who dare to bully his Taoist companion!\n\nDuan Changqing worked hard to cultivate. After becoming strong, he suddenly found that he was also the most respected high priest in this world.\n\nDuan Changqing, who had just become the leader of the rebel army and is discussing with people how to kill all the priests including the high priest: '...'\n\nHow to hide his vest? Urgently waiting online!>"
}