{
	"url": "https://www.novelupdates.com/series/long-wind-crossing/",
	"title": "Long Wind Crossing - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/08/Long-Wind-Crossing.jpg",
	"noveltype": "(CN)",
	"genre": "Romance   ",
	"tags": "Adapted to Drama   Adapted to Drama CD   Ancient China   Bickering Couple   Female Protagonist   Marriage   Smart Couple   Weak to Strong   ",
	"rating": "(4.9 / 5.0, 13 votes)",
	"author": "Mo Shu Bai   墨书白   ",
	"year": "\n2019",
	"ranking": "#2000   #1029   #8453   #9319   #11322   ",
	"reviewcount": "7 Reviews sorted by",
	"description": "In order to marry a good husband, Liu Yuru had been a model lady for 15 years; but on the eve of her engagement, she was forced to marry Gu Jiusi, a well-known playboy from Yangzhou.\r\n\r\nTo marry such a person was to ruin one’s life.\r\n\r\nEspecially because after marriage, she learned that this person was also forced to marry her.\r\n\r\nLiu Yuru was heartbroken, and after locking herself in the room for three days, she came to a realization.\r\n\r\nMarrying such a dandy, why should she remain a perfect young lady?\r\n\r\nSo on the third day of marriage, the famously gentle lady shook her hands, carried a knife, and used all her courage to go to the brothel.\r\n\r\nTo the drunken Gu Jiusi, she said –\r\n\r\nGet up!\r\n\r\nAfter that, Gu Jiusi’s life was full of ups and downs.\r\n\r\nWhether he was a miserable dandy or a great official, this woman stood beside him.\r\n\r\nShe supported him with her weak and delicate body, and told him, “get up.”\r\n\r\nSo even if he was cut to pieces, he would struggle from the mud, grit his teeth, carry her on his back, and walk through this life.\r\n\r\nFor the first 15 years of Liu Yuru’s life, she thought she was living only to find a good man.\r\n\r\nIt wasn’t until she met Gu Jiusi that she understood that a good man would help you realize that you live only for yourself.\r\n\r\n— May this body of flesh and blood shield her from the wind and rain, protect her dress from dust, and protect her temples from frost.>"
}