{
	"url": "https://www.novelupdates.com/series/the-soft-and-adorable-host-was-picked-up-by-the-yandere-bigshot/",
	"title": "The Soft and Adorable Host was Picked Up by the Yandere Bigshot - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/07/The-Soft-and-Adorable-Host-was-Picked-Up-by-the-Yandere-Bigshot.jpeg",
	"noveltype": "(CN)",
	"genre": "Adult   Josei   Mature   Romance   Tragedy   ",
	"tags": "Ancient China   Cute Protagonist   Episodic   Female Protagonist   Handsome Male Lead   Lazy Protagonist   Male Yandere   R*pe Victim Becomes Lover   Reverse R*pe   R*pe   System Administrator   Tragic Past   Transmigration   Weak Protagonist   Wealthy Characters   World Hopping   ",
	"rating": "(3.2 / 5.0, 15 votes)",
	"author": "肎之   ",
	"year": "\nN/A",
	"ranking": "#2000   #2000   #9197   #8232   #8652   ",
	"reviewcount": "4 Reviews sorted by",
	"description": "Bai Sang, who only lived for 18 years, died from a heart disease and was bound to a system with the task of seducing the villain.\r\n\r\nThe villains had tragic life experiences, often physiologically distorted, cruel and heartless, and paranoid by nature.\r\n\r\n–\r\n\r\nBai Sang transmigrated into the body of a sickly and introverted young lady, and the villain had just recently become her little attendant.\r\n\r\n【Seduction Task One: Skin contact with the villain for ten seconds.】\r\n\r\nBai—thin-skinned—Sang’s face flushed, and she didn’t dare to look straight at him. Her voice was warm and soft: “I… Can I hold your hand?”\r\n\r\nEvil villain: “Good.”\r\n\r\n–\r\n\r\nBai Sang transmigrated into an oceanographer, and the villain was a blood-tailed mermaid who had just been caught ashore by her.\r\n\r\n【Seduction Task One: Touch the villain’s fishtail for ten seconds.】\r\n\r\nMermaids are cruel by nature, especially the blood-tailed mermaids, who are born to slaughter fiends.\r\n\r\nBai Sang looked pale and her dark eyes tinged with a touch of fear. She half-knelt in front of the mermaid and pitifully spoke: “I… May I touch your tail?”\r\n\r\nThe corner of the mermaid’s mouth hooked up into a malicious smile: “Yes.”\r\n>"
}