{
	"url": "https://www.novelupdates.com/series/i-became-the-younger-sister-of-a-regretful-obsessive-male-lead/",
	"title": "I Became the Younger Sister of a Regretful Obsessive Male Lead - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/02/I-Became-the-Younger-Sister-of-a-Regretful-Obsessive-Male-Lead_1613543919.jpg",
	"noveltype": "(KR)",
	"genre": "Fantasy   Romance   ",
	"tags": "Adapted to Manhwa   Adopted Protagonist   Age Progression   Aristocracy   Beautiful Female Lead   Cute Children   Dense Protagonist   European Ambience   Female Protagonist   Handsome Male Lead   Love Interest Falls in Love First   Male Yandere   Nobles   Obsessive Love   Possessive Characters   Reincarnated in Another World   Reincarnation   Siblings Not Related by Blood   ",
	"rating": "(4.1 / 5.0, 169 votes)",
	"author": "퍼플레몬   ",
	"year": "\n2020",
	"ranking": "#660   #757   #1748   #918   #823   ",
	"reviewcount": "13 Reviews sorted by",
	"description": "I’ve transmigrated into the world of the BL webtoon where I left my one and only spiteful comment. \n\nOn top of that, I became the adopted younger sister of my favorite character: the obsessive male lead who is later regretful for his actions, but still dies along with the duke in the end. \n\nSo, I became determined. \n\nSince I transmigrated into this world, I can’t just stand by and watch my favorite character die. Additionally, I also don’t want to die. That’s why, author, I’ll need to change the tags and the ending of this webtoon slightly! From to tragedy to happy ending.\n\n“Brother, please smile like that in front of others as well.” I said to Lucian, who doesn’t smile even a little bit in front of others.\n\n“…”\n\nWas that request too out of the blue?\n\nLucian looked at me with a peculiar expression.\n\n“If you do that, I will give you a gift.”\n\nI said that because I wanted to help him in any way I could.\n\nHe looked at me for a bit and hesitated before replying, “A gift… Is anything fine?”\n\n“Of course!”\n\nThe moment I gave that answer with certainty, his expression changed right at once to that of a starving predator… Did I make a mistake?\n\nThen, Lucian calmly replied with an expression full of expectation.\n\n“Give yourself to me, Rachel.”\n\nHuh? What did he say? What did he just ask for?>"
}