{
	"url": "https://www.novelupdates.com/series/song-of-adolescence/",
	"title": "Song of Adolescence - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/05/adoles2323.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Comedy   Drama   Martial Arts   Romance   Wuxia   ",
	"tags": "Adapted to Anime   Adapted to Drama   Adapted to Manhua   Ancient China   Arrogant Characters   Beautiful Female Lead   Bickering Couple   Buddhism   Calm Protagonist   Cultivation   Daoism   Fallen Nobility   Friendship   Genius Protagonist   Handsome Male Lead   Male Protagonist   Martial Spirits   Multiple Identities   Multiple Protagonists   Past Plays a Big Role   Power Struggle   Royalty   Schemes And Conspiracies   Sealed Power   Tragic Past   ",
	"rating": "(4.3 / 5.0, 59 votes)",
	"author": "Zhou Mu Nan   周木楠   ",
	"year": "\nN/A",
	"ranking": "#2000   #2000   #5032   #10478   #6711   ",
	"reviewcount": "11 Reviews sorted by",
	"description": "A broken prince, a shadowy scheme, all that amidst a bloody fight for a throne wrongly succeeded. Join a group of youngsters as they take their first steps into the martial world, towards the grandest adventure of their lives. It all begins in a certain inn, set against verdant mountains and facing a scenic lake.\r\n\r\n'Bring us your finest wine and best meat!' Yelled a hulking man who seemed to be the leader of the dozen strong group.\r\n\r\n'How much?' The waiter anxiously nodded his head.\r\n\r\n'As much as you have!' The hulking man yelled back.\r\n\r\n'That's...'\r\n\r\n'HUH?' The hulking man shot the waiter a furious glare.\r\n\r\n \r\n\r\n'Dear guests, our inn operates on the principle of 'pay first, dishes later'. As such, it will be better if you tell us exactly how much meat and wine you need.' Xiao Se returned their furious stares with a thin smile.\r\n\r\n'Who are you supposed to be?' The hulking man eyed him with bulging eyes.\r\n\r\n'This humble one is known as Xiao Se, the owner of this inn, the Fallen Snow Villa.' Xiao Se replied with the same smile and with a level of courtesy worth a solid 12/10.\r\n\r\n \r\n\r\n'Well, we have no money.' The hulking man stabbed his blade into one of the nearby tables.\r\n\r\n'Oh?'\r\n\r\n'But I'm sure you have some!' The man pointed his finger at Xiao Se.\r\n\r\nAt that, Xiao Se furiously shook his head. 'I'm sorry to break it to you but our little inn hasn't made a single sale in almost a month. I'm about to owe them salaries myself...'\r\n\r\n \r\n\r\n'Like hell if I care!' The hulking man smashed his palm down on the table. 'Even if you have no money, that fur coat of yours should at least be worth a hundred odd silvers.'\r\n\r\n'NONSENSE!' Yelled Xiao Se, eyes wide open and gaze as sharp as daggers.\r\n\r\nThe hulking man was stunned, his body even shivering involuntarily for that split second.\r\n\r\n'I, Xiao Se, ride only the finest horse and wear only the richest threads! This fur coat of mine was specially sewn by some of the finest seamstresses in the imperial capital in the August Threads. Just sewing it took three whole months, shipping it, another one. Hmph, a hundred silvers? That's not even enough to buy the sleeves of my coat!'>"
}