{
	"url": "https://www.novelupdates.com/series/reborn-girl-starting-a-new-life-in-another-world-as-a-seventh-daughter/",
	"title": "Reborn Girl Starting a New Life In Another World As a Seventh Daughter - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/02/Reborn-Girl-Starting-a-New-Life-In-Another-World-As-a-Seventh-Daughter.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Fantasy   Shoujo Ai   ",
	"tags": "Adapted to Manga   Aristocracy   Child Abuse   Cooking   Cute Protagonist   Elves   Female Protagonist   Hiding True Abilities   Lack of Common Sense   Loli   Magic   Naive Protagonist   Nobles   Overpowered Protagonist   Reincarnated in Another World   Reincarnation   Siblings   Sister Complex   Strong to Stronger   Sword And Magic   Underestimated Protagonist   ",
	"rating": "(3.9 / 5.0, 128 votes)",
	"author": "Yotsuba Yuto   四葉夕卜   ",
	"year": "\n2019",
	"ranking": "#93   #129   #966   #227   #2581   ",
	"reviewcount": "11 Reviews",
	"description": "A high school girl, Kanami Miria, reincarnated as the seventh daughter of an aristocrat.\n\nSince she had lived a miserable life, she dreamed of living peacefully in her second life.\n\nHowever, she reincarnated in a super-poor aristocratic family in the countryside.\n\nThe lord was a muscle-brain.\n\nThe lady was a pushover.\n\nThe eldest daughter was a depressed woman.\n\nThe second daughter was a hussy who divorced after she cheated on her husband.\n\nThe son-in-law was a lolicon.\n\nMoreover, she was forced to become engaged to a poor merchant.\n\nThe situation was even worse than her previous life.\n\n「I swear I will get out of this house and live a peaceful life!」\n\nIn order to achieve her goal, she practiced magic and secretly went to the Royal Girls Academy.\n\n「Now my second life has begun! I’ll make friends with cute girls and have a yakiniku party!」\n\nBut, thanks to her omnipotent magical power, her evaluation became ridiculous.\n\n「Giving me a title? I don’t need a title!」\n\n「An audience with me? Please, no!」\n\nThe easygoing Miria decided to ignore them and aimed for a relaxing and peaceful life with her omnipotent magical power.>"
}