{
	"url": "https://www.novelupdates.com/series/the-untouchable-president/",
	"title": "The Untouchable President - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2018/06/37390s.jpg",
	"noveltype": "(CN)",
	"genre": "Drama   Josei   Mature   Romance   Slice of Life   ",
	"tags": "Absent Parents   Aristocracy   Arrogant Characters   Artists   Beautiful Female Lead   Betrayal   Black Belly   Blackmail   Broken Engagement   Butlers   Celebrities   Character Growth   Charismatic Protagonist   Charming Protagonist   Childcare   Cold Love Interests   Complex Family Relationships   Couple Growth   Cute Children   Death of Loved Ones   Determined Protagonist   Different Social Status   Family   Female Protagonist   Handsome Male Lead   Jealousy   Marriage   Misunderstandings   Modern Day   Past Plays a Big Role   Possessive Characters   Pregnancy   R*pe Victim Becomes Lover   R*pe   Sharp-tongued Characters   Sibling Rivalry   Siblings   Single Parent   Wealthy Characters   ",
	"rating": "(3.7 / 5.0, 72 votes)",
	"author": "Shangguan Rao   上官娆   ",
	"year": "\nN/A",
	"ranking": "#2000   #2000   #2869   #8372   #3169   ",
	"reviewcount": "11 Reviews sorted by",
	"description": "After a vacation, when she returned to her country she caught her fiancé cheating. She angrily left and disappeared. \n\nFive years later she returned with her talented kid. Afterwards, her son participated in the piano competition. Unexpectedly her son actually came looking for his father. \n\n“The camera on this side, take me to take a look! My name is Xiaoxi my mommy is called Tang Siyu and she’s very pretty! I’m four and a half years old this year. I’m looking for my father, you probably look like me, please be sure to contact me, oh!” \n\nAfter that, he was gone from the front of the camera again and said, “Oh, I’ll wait for you!” \n\nIn the background, a woman became mad. A few days later, a mysterious man came to their doorstep and claimed to be Little Xi's father. \n\nTang Siyu looked at this tall and handsome man, who her son was a carbon copy of, and then became angry. \n\nFive years ago, the bastard who pinned her down was him?>"
}