{
	"url": "https://www.novelupdates.com/series/transmigrating-to-become-the-bosss-little-fairy/",
	"title": "Transmigrating To Become The Boss’s Little Fairy - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/02/HTB16Gmie7WE3KVjSZSyq6xocXXa8.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Drama   Josei   Romance   School Life   Slice of Life   ",
	"tags": "Age Progression   Beautiful Female Lead   Caring Protagonist   Charming Protagonist   Cold Love Interests   Couple Growth   Cute Protagonist   Cute Story   Death of Loved Ones   Delinquents   Devoted Love Interests   Disabilities   Doting Love Interests   Early Romance   Familial Love   Family Conflict   Fated Lovers   Female Protagonist   Flashbacks   Generals   Handsome Male Lead   Heartwarming   Modern Day   Mute Character   Past Plays a Big Role   Past Trauma   Popular Love Interests   Pregnancy   Protagonist Falls in Love First   Suicides   Tragic Past   Transmigration   Tsundere   Unconditional Love   ",
	"rating": "(4.6 / 5.0, 484 votes)",
	"author": "Chun Dao Han   春刀寒   ",
	"year": "\n2019",
	"ranking": "#953   #1192   #700   #390   #565   ",
	"reviewcount": "120 Reviews sorted by",
	"description": "In her previous life, Qi Ying had been saved from the bandits’ cave by the General, and subsequently became the General’s concubine. The General never lost a single battle, and songs praising him spread far and wide. In the end, however, the General was mortally wounded, and died on the battlefield. When news of the General’s death reached Qi Ying’s ears, she hung herself from the beams without a moment’s hesitation — only to discover, upon waking up, that she has transmigrated to become a 17-year-old deaf and mute Qi Ying.\n\nThe youthful girl is neither able to hear any sound, nor is she able to speak; and yet, her eyes were as beautiful as the pure, white moonlight, and her character was extremely easygoing. One day, she met a cold and aloof male youth, whom everybody was afraid and wary of — her General.\n\nThe Ji Rang in everybody’s eyes:\n\nHorridly short tempered! Extremely rich! It’s best not to cross paths with him!\n\nThe Ji Rang in Qi Ying’s eyes:\n\nThe General is simply executing Heaven’s will and punishing the evildoers! The General is simply robbing the rich to feed the poor! The General is superb and amazing!\n\nJi Rang pressed Qi Ying against the wall:-\n\nQi Ying: “Oh, when a boy presses a girl against the wall, he has every intention of kissing her, mua~!”\n\nJi Rang: ???\n\n“Ji Rang, did you really bring your girlfriend along to spectate our fight? Are you looking down on me right now?”\n\n“I’m not looking down on you. I just want to let my little fairy observe how I punish evildoers and reward kind people.”\n\nEveryone’s afraid of Ji Rang;\n\nNobody loves Ji Rang, except for Qi Ying.>"
}