{
	"url": "https://www.novelupdates.com/series/son-mom-will-back-you/",
	"title": "Son, “Mom” Will Back You - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/12/Son-Mom-Will-Back-You-A-love-story-between-a-fan-mom-and-her-idol-son.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Drama   Romance   ",
	"tags": "Acting   Artists   Beautiful Female Lead   Black Belly   Carefree Protagonist   Celebrities   Clumsy Love Interests   Confident Protagonist   Dense Protagonist   Devoted Love Interests   Dishonest Protagonist   Doting Love Interests   Female Protagonist   Glasses-wearing Love Interests   Handsome Male Lead   Hard-Working Protagonist   Kind Love Interests   Misunderstandings   Modern Day   Past Plays a Big Role   Persistent Love Interests   Popular Love Interests   Sharp-tongued Characters   Showbiz   Strong Love Interests   Writers   ",
	"rating": "(4.2 / 5.0, 138 votes)",
	"author": "Qū Xiǎo Qū   Small Song Cricket   曲小蛐   ",
	"year": "\n2020",
	"ranking": "#2002   #3244   #945   #693   #1367   ",
	"reviewcount": "34 Reviews sorted by",
	"description": "Little screenwriter Gu Nian has a secret. She was a big fan of an 18th-tier actor by the name of Luo Xiu.\r\n\r\nLuo Xiu was good looking but his acting was god awful. He had no work for 2 years, the one time that he was on a show, he was mocked to the point that even his own mother wouldn’t admit that he was her son.\r\n\r\nAs such, he dropped straight to 180th-tier.\r\n\r\nGu Nian, on the other hand, was determined to become a gold medal screenwriter and had him be her dedicated male supporting character.\r\n\r\n___\r\n\r\nLuo Xiu had a loyal fan. Ever since his debut, she did everything that a fan would — wait for him at airports, vote for him online, and wave banners of his. Other fans would waver back and forth but this girl remained his loyal fan for two straight years.\r\n\r\nOnce she was drunk after they have met each other, she patted him on his shoulder, cried and said, “Son, its okay that you are not backed by big bosses! When Mommy become a gold-medal screenwriter, I will back you!”\r\n\r\nLuo Xiu: “……”\r\n\r\n___\r\n\r\nAfter Gu Nian became a gold-medal screenwriter and signed her contract with a up-and-coming media company, she was summoned to a meeting at their office.\r\n\r\nShe texted Luo Xiu outside of the conference room, “Son! Mommy can back you now! Just you wait!”\r\n\r\nSoon after she sent the message, she heard a notification chime coming from in front of her.\r\n\r\nGu Nian looked up, puzzled, and saw a very familiar handsome face.\r\n\r\nThe secretary introduced the two of them, “Miss Gu, this is our CEO, Luo Xiu.”\r\n\r\nGu Nian: …..?\r\n\r\nSecretary: “Boss Luo, this is….”\r\n\r\n“No need for introduction, I know her.” Luo Xiu looked up after he finished reading the text. His eyes a dark black color. “This is the boss who has been backing me behind the scene.”\r\n\r\nEveryone: ….? ? ?>"
}