{
	"url": "https://www.novelupdates.com/series/what-if-my-brother-is-too-good/",
	"title": "What if My Brother is Too Good? - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/10/212086s.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Drama   Fantasy   Romance   ",
	"tags": "Acting   Beautiful Female Lead   Cold Love Interests   Devoted Love Interests   Doting Love Interests   Doting Older Siblings   Familial Love   Female Protagonist   Handsome Male Lead   Heartwarming   Love Triangles   Modern Day   Naive Protagonist   Overprotective Siblings   Possessive Characters   Showbiz   Siblings   Siblings Not Related by Blood   Slow Romance   Strong Love Interests   Transmigration   Wealthy Characters   ",
	"rating": "(3.6 / 5.0, 291 votes)",
	"author": "Shi Liu Yue Xi Gua   十六月西瓜   ",
	"year": "\n2017",
	"ranking": "#479   #2026   #561   #645   #858   ",
	"reviewcount": "89 Reviews",
	"description": "In the novel “Forced Love”, the female supporting character Huo Wu was a fake princess who had occupied someone else’s position for 18 years. \n\nAnd everything she possessed should have belonged to the female lead. \n\nAfter an accident, Huo Wu’s real identity was completely exposed. \n\nShe and the female lead returned to their respective places but she was still regarded by the female lead as a nail in her eye and a thorn in her flesh and ultimately came to a miserable end. \n\nAfter Huo Wu, a small 18th line celebrity transmigrated into the character of the same name in the book, she shivered. \n\nThe female lead’s fighting abilities are too strong, she really can’t afford to offend her. \n\nIn order to avoid the ending in the book, she held on tightly to her “brother’s” thigh in order to seek protection. \n\nHis golden thighs were exceptionally strong and this top rated “brother” was powerful to the point where there was nothing he couldn’t do. \n\nBut… \n\nHow come she isn’t allowed to let go after holding onto him? \n\nQAQ \n\nHuo Wu blinked her eyes, “Wouldn’t it be good if you were really my brother?” \n\nHuo Yu Sen faintly refused, “No, I just want to be your man.” \n\nMy brother is too good to me, what should I do? \n\nWhat else can you do? Of course you should be together.>"
}