{
	"url": "https://www.novelupdates.com/series/royal-marriage/",
	"title": "Royal Marriage - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/07/Royal-Marriage.jpeg",
	"noveltype": "(KR)",
	"genre": "Fantasy   Romance   ",
	"tags": "Adapted to Manhwa   Aristocracy   Beautiful Female Lead   Cold Love Interests   Contracts   Empires   European Ambience   Female Protagonist   Handsome Male Lead   Marriage   Marriage of Convenience   Nobles   R-15   Strong Love Interests   ",
	"rating": "(4.0 / 5.0, 7 votes)",
	"author": "Portofino   포르토피노   ",
	"year": "\n2021",
	"ranking": "#3567   #6221   #12334   #11907   #11163   ",
	"reviewcount": "No Reviews",
	"description": "A symbol of money and beauty, Tatiana Cartien, the most eligible bachelorette of the Freya Empire. With the overflowing love of her absolute power mother and her four beautiful sisters, all that remained for her was the position of the duchess, who was anyone envious of.\n\nA thunderbolt had struck just before she announced the engagement, which will finally be the pinnacle of her life.\n\nThe despair of the betrayal of her trusted fiancé would come as such a shock only lasted for a few moments. \n\nThe person who loved Tatiana the most, her mother, first turned her back on her when she insisted that she would never marry. \n\nThe time she has left is one week.\n\n'I would be left on the street with nothing if I couldn’t find a husband in a week. But all of the groomsmen candidates who had been so desperate to me only looked at my mother’s face.'\n\nThe last person who came to mind when she thought it was all over! Cainell Townsend, a red-eyed reaper and the illegitimate child who was hated by everyone, returned with the title as war hero of Freya in three years .\n\nAfter meeting such a dead-end, she decided to give it a go. In order to survive in this harsh world, she has to hold the devil’s hand. \n\nA contract marriage between a woman, who fell from the queen of high society to the abyss in an instant, and a man who still lives in hell.\n\nThey said he doesn’t have money, he is indifferent, and he doesn’t like her.\n\nSincerity, secrets, and other emotions of this man are revealed to her one at a time. She made up her mind to never trust anyone again; this relationship was purely a contract marriage. \n\n....But does heart beat like this?>"
}