{
	"url": "https://www.novelupdates.com/series/puffed-up-after-giving-birth-to-a-wealthy-mans-heir/",
	"title": "Puffed-up after Giving Birth to a Wealthy Man’s Heir - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/11/Puffed-up-after-Giving-Birth-to-a-Wealthy-Mans-Heir.jpg",
	"noveltype": "(CN)",
	"genre": "Drama   Psychological   Romance   Slice of Life   Yaoi   ",
	"tags": "Adopted Children   Adopted Protagonist   Androgynous Characters   Betrayal   Broken Engagement   Business Management   Businessmen   Complex Family Relationships   Contracts   Cross-dressing   Doting Love Interests   Family Conflict   Genius Protagonist   Handsome Male Lead   Kidnappings   Love Interest Falls in Love First   Marriage   Marriage of Convenience   Mpreg   Multiple Personalities   Older Love Interests   Overpowered Protagonist   Past Trauma   Reincarnation   Revenge   Schemes And Conspiracies   Second Chance   Secret Identity   Sharp-tongued Characters   Smart Couple   Strong Love Interests   Wealthy Characters   ",
	"rating": "(4.0 / 5.0, 122 votes)",
	"author": "Tangerine Boat   橘子舟   ",
	"year": "\n2020",
	"ranking": "#1614   #1071   #2269   #2870   #1735   ",
	"reviewcount": "33 Reviews",
	"description": "In the fifteenth year after he was mixed up at birth by a mistake, Yi Wei was taken back by his biological parents.\n\nBut the title of being the treasure of his parents, his eldest brother’s younger brother, even the white moonlight of his fiancé was not him.\n\nAs long as he didn’t care, he could live well. But he couldn’t help but care for these things, which lead to his miserable ending.\n\nOnly after his death did he know that he was just a cannon fodder in a book who was only there to be repeatedly cast down.\n\nUnder the shining aura of the protagonist, no matter how hard he tried to make himself excellent, it wouldn’t work.\n\nAfter rebirth, he was not concerned about family love. If no one loves him, then he would love himself even more.\n\nThis life, he would enjoy life at ease, watching the battle between heirs, waiting for a good opportunity to avenge himself.\n\nSadly, even though he wanted to stay away from this battle, it’s deemed to be impossible. As the only decent heir of this wealthy family was actually born to him.\n\nTN: Writing this as there were so many people misunderstanding. The reason for the mistake by birth was due to both families being surnamed ‘Yi’ so for why Yi Wei has not changed his name, please refer to TN notes on the Second chapter where I will explain this.>"
}