{
	"url": "https://www.novelupdates.com/series/golden-stage/",
	"title": "Golden Stage - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2018/12/J0XOkt.jpg",
	"noveltype": "(CN)",
	"genre": "Drama   Historical   Romance   Shounen Ai   Yaoi   ",
	"tags": "Adapted to Drama CD   Ancient China   Arranged Marriage   Betrayal   Bickering Couple   Calm Protagonist   Clever Protagonist   Cohabitation   Confident Protagonist   Couple Growth   Court Official   Cunning Protagonist   Death of Loved Ones   Devoted Love Interests   Different Social Status   Disabilities   Distrustful Protagonist   Enemies Become Lovers   Family Conflict   Famous Parents   Famous Protagonist   Flashbacks   Generals   Handsome Male Lead   Hiding True Abilities   Investigations   Love Interest Falls in Love First   Loyal Subordinates   Manly Gay Couple   Military   Murders   Mystery Solving   Near-Death Experience   Nobles   Past Plays a Big Role   Past Trauma   Politics   Possessive Characters   Power Couple   Power Struggle   Proactive Protagonist   Protagonist Strong from the Start   Rebellion   Royalty   Schemes And Conspiracies   Sharp-tongued Characters   Smart Couple   Soldiers   Spies   Strong Love Interests   ",
	"rating": "(4.7 / 5.0, 794 votes)",
	"author": "Cang Wu Bin Bai   苍梧宾白   ",
	"year": "\n2018",
	"ranking": "#2731   #1953   #1029   #1394   #244   ",
	"reviewcount": "181 Reviews sorted by",
	"description": "The notorious imperial court lackey and the meritorious military general were well-known for their mutual dislike, a pair of arch-enemies set in stone. Who could have foreseen the unexpected change in the winds of heaven: the general injured on the battlefield, both legs disabled, and even forced by the emperor to marry his nemesis.  \r\n\r\nWith one marriage edict, two people with mutual hostility are forced to marry and live under the same roof. Yet after these long days together, they come to the realization that this fellow is not truly devoid of any saving grace/unattainable and high out of reach.>"
}