{
	"url": "https://www.novelupdates.com/series/looking-for-my-lost-sister/",
	"title": "Looking For My Lost Sister - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/04/Looking-for-my-Lost-Sister.jpg",
	"noveltype": "(KR)",
	"genre": "Adult   Drama   Fantasy   Mature   Psychological   Romance   Smut   ",
	"tags": "Acting   Aristocracy   C*nnilingus   Cohabitation   Complex Family Relationships   Different Social Status   Dishonest Protagonist   Dreams   Drugs   European Ambience   Familial Love   Female Protagonist   First-time Interc**rse   F*llatio   Glasses-wearing Love Interests   Handsome Male Lead   Hiding True Identity   Inheritance   Magical Technology   Male Yandere   Manipulative Characters   M*sturbation   Nudity   Poor Protagonist   Possessive Characters   Prostit**es   R-18   R*pe Victim Becomes Lover   R*pe   Secret Identity   Seduction   Short Story   Siblings Not Related by Blood   Sleeping   Trickster   Twisted Personality   Wealthy Characters   Yandere   Younger Sisters   ",
	"rating": "(4.1 / 5.0, 129 votes)",
	"author": "DeokAh   덕아   ",
	"year": "\n2021",
	"ranking": "#770   #1785   #4072   #1387   #3395   ",
	"reviewcount": "12 Reviews sorted by",
	"description": "“Welcome back. My dear sister, Roxy.”\n\nRoxy has been a street thief, pickpocket, and con artist. She happens to see a flyer from the Count Chazelle’s house saying that he is looking for the Count’s lost sister.\n\nShe plays boldly, claiming that she is the Count’s lost sister, Ariel Chazelle.\n\nEverything goes as planned, but Roxy realizes that she something is strange one day. The fact that the brother’s love for his younger sister was nothing short of the extreme. Knocking on Roxy’s door every night isn’t enough, he gets to the point where he washes his sister’s body himself……..\n\n* * *\n\n“Open your mouth. Good girl.”\n\nHe grasped and caressed Roxy’s breasts, then pierced his genitals deep inside her mouth again. Roxy instinctively coughed as if it had touched her throat.\n\nAt that moment, Edward poured all the semen into his sister’s mouth. A hot, thick liquid filled his sister’s mouth. Then, if anything dripped out of her mouth, he shoved it back into her mouth. Finally, a satisfying smile appeared on Edward’s lips when he heard the sound of gulping and swallowing semen.\n\n“Does it taste that good?”\n\nEdward hugged Roxy tightly. He whispered lowly as he gently wiped the corners of his sister’s lips that were glistening with cum.\n\n“Don’t leave anything behind, eat it all, baby.”>"
}