{
	"url": "https://www.novelupdates.com/series/rebirth-of-the-strongest-female-emperor/",
	"title": "Rebirth of the Strongest Female Emperor - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2018/01/8c1bce662f825a51abd6324fec6793d3.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Drama   Josei   Romance   Xuanhuan   ",
	"tags": "Beast Companions   Beasts   Beautiful Female Lead   Black Belly   Bloodlines   Broken Engagement   Cautious Protagonist   Clever Protagonist   Cultivation   Cunning Protagonist   Cute Children   Death   Demons   Depictions of Cruelty   Determined Protagonist   Doctors   Evil Organizations   Female Protagonist   Genius Protagonist   Ghosts   Gore   Handsome Male Lead   Hiding True Identity   Late Romance   Lost Civilizations   Love Interest Falls in Love First   Monsters   Multiple Identities   Multiple Realms   Mysterious Family Background   Mystery Solving   Pets   Power Couple   Pragmatic Protagonist   Previous Life Talent   Reincarnation   Resurrection   Revenge   Ruthless Protagonist   Schemes And Conspiracies   Sealed Power   Second Chance   Slow Romance   Strength-based Social Hierarchy   Survival   Time Skip   Time Travel   Weak to Strong   World Travel   ",
	"rating": "(3.9 / 5.0, 184 votes)",
	"author": "North Night   夜北   ",
	"year": "\n2017",
	"ranking": "#3133   #939   #1320   #2503   #1478   ",
	"reviewcount": "38 Reviews sorted by",
	"description": "Past life, her spirit root was dug out from her body. She had wholeheartedly dedicated herself to the just path, but she was sentenced as an evil demonic cultivator.\r\n\r\nReturning back to her juvenile years, she turns the tide. Against natural order, she had been reborn. Those who had deceived and humiliated her, she would return it to them a hundredfold with additional thanks.\r\n\r\nStudying her own blood vessels, she recasts the best quality spirit roots. She destroys those rascal clansmen and returned home with glory!\r\n\r\nThe rules of the world do not hold her down; this time around she kills through the righteous path.\r\n\r\nHe is the universally admired spirit emperor, high above others, cold, proud and aloof. But every night he sneaks into her room and takes liberties. “Little runt, won’t you think it over?”\r\n\r\n“Do I have a choice?”\r\n\r\n“You can choose from giving birth once or giving birth twice.”\r\n\r\n“Why must I?!”\r\n\r\n“Because you stole my heart.”>"
}