{
	"url": "https://www.novelupdates.com/series/she-decided-not-to-get-revenge/",
	"title": "She Decided Not To Get Revenge - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/11/She-decided-not-to-get-revenge.jpg",
	"noveltype": "(KR)",
	"genre": "Fantasy   Romance   Supernatural   ",
	"tags": "Aristocracy   Beautiful Female Lead   European Ambience   Female Protagonist   Handsome Male Lead   Nobles   Revenge   Unrequited Love   ",
	"rating": "(3.0 / 5.0, 15 votes)",
	"author": "Yanna   유안나   ",
	"year": "\n2021",
	"ranking": "#2000   #2000   #11501   #9891   #9233   ",
	"reviewcount": "No Reviews",
	"description": "The sky continent of Camamita and the four specialities of the human state of the Roschodur Empire.\n\nThe Nettle bread that you couldn’t forget the taste, once you eat it.\n\nRosetta, the Sage of the East Forest.\nPrince Inborgia, the 400-year-old High Elf who has been naturalized in the human Empire.\n\nAnd, the dark flame mage, the Great Sage, Duke Katlena Agreta. \nThe cold and ruthless life of this woman, who doesn’t know the heart of a person, was dotted with modifiers such as ‘youngest’, ‘iron-blooded’,or ‘scary’.\n\nSo, when she personally recommended to the Emperor to let Prince Inborgia return to the capital, the one who had ruined her family, the world naturally thought of this:\n\n‘Ah! At last, Duke Agreta will cut Prince Inborgia’s head!’\n\nWhen she dared to summon the family’s head to the capital where her secret assassination group took control. How thorough the revenge of this ruthless Duke was designed.\n\nBut at the first encounter in fifteen years, Katlena Agreta said to him:\n\n“Contrary to the hasty thoughts of the world, I have no intention of retaliating against you, Your Excellency. But you wouldn’t be naive to say that I’ve forgiven you, right? You’re a smart person after all.”\n\nEnding the conversation halfheartedly, Katlena Agreta pulled her chin out curiously. Looking down at Schaurillin Inborgia with a gaze that seemed to contain contempt for a person.\n\n“I have decided not to take revenge on you. Please consider the true meaning of these words…” \n\n‘Yes, I decided not to take revenge.’\n\nBecause she knew it would be the wisest way.>"
}