{
	"url": "https://www.novelupdates.com/series/risou-no-himo-seikatsu/",
	"title": "Risou no Himo Seikatsu - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/11/Risou-no-Himo-Seikatsu.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Comedy   Ecchi   Fantasy   Harem   Seinen   ",
	"tags": "Adapted to Drama CD   Adapted to Manga   Adopted Protagonist   Aristocracy   Arranged Marriage   Beautiful Female Lead   Bloodlines   Caring Protagonist   Complex Family Relationships   Cooking   Cousins   Domestic Affairs   Dragons   Early Romance   Economics   European Ambience   Family Conflict   Fantasy World   Farming   Forced Living Arrangements   Forced Marriage   Gate to Another World   Imperial Harem   Jealousy   Kingdom Building   Kingdoms   Leadership   Magic   Maids   Male Protagonist   Management   Manipulative Characters   Marriage   Marriage of Convenience   Modern Knowledge   Monsters   Nobles   Older Love Interests   Polite Protagonist   Politics   Power Struggle   Pregnancy   Royalty   Schemes And Conspiracies   Strategic Battles   Technological Gap   Transported to Another World   Wars   Weak Protagonist   ",
	"rating": "(4.1 / 5.0, 567 votes)",
	"author": "Watanabe Tsunehiko   渡辺恒彦   ",
	"year": "\n2011\r\n",
	"ranking": "#6970   #6143   #699   #4186   #280   ",
	"reviewcount": "79 Reviews sorted by",
	"description": "Yamai Zenjirou is your everyday office worker in modern Japan. One morning, he suddenly finds himself summoned to a tropical world where dinosaurs roam the land. \n\nHe is told that this is the kingdom of Capua and the person who summoned him - its monarch, Queen Aura - wants him to marry her and leave his old life behind for a life of carefree extravagance as her prince consort. \n\nThe reasons for her offer are many and varied, but she needs an heir, and she wants him to be the one to provide it! If he accepts, he’ll never have to work again, lazing around in luxury with no worries other than securing the kingdom its next monarch. \n\nCertainly, sleeping with the buxom beauty is far from a hardship, but is everything really as it seems? He’ll also need to give up everything he knows on Earth. \n\nIs he ready to drop it all at a moment’s notice for her sake? And how well will he be able to navigate the politics, people and culture of this new world if he does?>"
}