{
	"url": "https://www.novelupdates.com/series/his-royal-highness-wants-a-divorce/",
	"title": "His Royal Highness, Wants a Divorce! - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/05/His-Royal-Highness-Wants-a-Divorce-Book-Image-2.png",
	"noveltype": "(CN)",
	"genre": "Comedy   Romance   Shounen Ai   ",
	"tags": "Ancient China   Arranged Marriage   Cooking   First Love   Handsome Male Lead   Misunderstandings   Royalty   Shameless Protagonist   Sickly Characters   Straight Uke   Transmigration   Transported to Another World   Ugly to Beautiful   ",
	"rating": "(4.2 / 5.0, 119 votes)",
	"author": "Bai Cha Qing Huan   白茶青欢   ",
	"year": "\n2019",
	"ranking": "#1380   #2000   #2439   #5957   #1712   ",
	"reviewcount": "21 Reviews sorted by",
	"description": "After his death, Yan Ke transmigrated and became a prince. He had yet to get himself an imperial harem and enjoy life with the (imaginary) concubines when he was married off in a marriage alliance.\r\n\r\nOn the day of the wedding, he was shut out by Meng You.\r\n\r\nHalf a month later after the wedding, when he had just recovered from his illness, Meng You was sent out to the battlefront. He was gone for three years.\r\n\r\nYan Ke felt that, he was probably the most tragic, abandoned husband of the highest (epic) level.\r\n\r\nSince you are heartless, don’t blame me for being unrighteous!\r\n\r\nTherefore, the most forsaken husband reached his hand out towards the Crown Prince’s residence.\r\n\r\n—\r\n\r\nMeng You has just returned after he went out to war three years ago shortly after his marriage. For these three years, he had regularly received letters from the Crown Princess back home. His subordinates all extolled the deep love between husband and husband, but only Meng You knew that those were all attempts by the Crown Princess to ask for a peaceful separation (aka. divorce).\r\n\r\nHe came back from battle only to see his Crown Prince residence turned into a mahjong house, swarming with all sorts of people – men and women, young and old.\r\n\r\nAnd that Crown Princess of his whom he had not seen for three years had kept himself fair and delicate, his every movement and action exceedingly coquettish and charming.\r\n\r\nAnd then, his Crown Princess walked towards him.\r\n\r\nYan Ke, “Handsome, new face here? Do you want to play? It costs one tael of silver for a whole day and 25 taels of silver for a month. The boss will play with you, but the price is calculated separately. You will get more discount if you buy more~”\r\n\r\nMeng You, “……”>"
}