{
	"url": "https://www.novelupdates.com/series/after-the-vicious-cannon-fodder-was-reborn/",
	"title": "After The Vicious Cannon Fodder Was Reborn - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/02/After-The-Vicious-Cannon-Fodder-Was-Reborn.jpg",
	"noveltype": "(CN)",
	"genre": "Drama   Romance   Shounen Ai   ",
	"tags": "Acting   Adopted Protagonist   Betrayal   Black Belly   Business Management   Charismatic Protagonist   Cheats   Clubs   Complex Family Relationships   Cooking   Cruel Characters   Determined Protagonist   Devoted Love Interests   Doting Love Interests   Economics   Family Conflict   Friendship   Handsome Male Lead   Hard-Working Protagonist   Harsh Training   Long Separations   Love Interest Falls in Love First   Marriage   Modern Day   Multiple Reincarnated Individuals   Orphans   Overpowered Protagonist   Past Plays a Big Role   Past Trauma   Politics   Poor to Rich   Revenge   Romantic Subplot   Schemes And Conspiracies   Second Chance   Sharp-tongued Characters   Showbiz   Slow Romance   Smart Couple   Stoic Characters   Suicides   Time Travel   Tragic Past   Twisted Personality   Wealthy Characters   ",
	"rating": "(4.1 / 5.0, 202 votes)",
	"author": "BaYeDang   八爷党   ",
	"year": "\n2018",
	"ranking": "#63   #33   #1080   #124   #1236   ",
	"reviewcount": "64 Reviews sorted by",
	"description": "Growing up in an orphanage since he was a child, Tao Mu, who had suffered so much, never thought that his life was actually a result of picking up the wrong script.\n\nEighteen years ago, two children were born at the same time, but due to the negligence of the medical staff their name tags were switched. Tao Mu, who was supposed to be born in a wealthy family, was sent to an orphanage instead.\n\nEighteen years later, the mistake was discovered. Tao Mu originally thought everything could go back on track. However, his parents and siblings who were supposed to be the closest family disliked him deeply, lovers and friends also turned their backs on him.\n\nReceiving such a shock, Tao Mu completely revealed his dark side, becoming a vicious cannon fodder that everyone hated. In the end he found himself utterly isolated and committed suicide by jumping off a building.\n\nAfter being reborn, Tao Mu was surprised to find that he actually lived in a book. The male protagonist in the book was the Silly White Sweet** who was the other baby that he had mistakenly switched identities with. As for him, he was just the vicious cannon fodder encountered by the Silly White Sweet in his sweet and pampered life.\n\nTao Mu: f*ck this plot, and f*ck this stereotypical routine. I won’t be playing along in this life!\n\nIn other words, this is a dog blood story of a highly provoked cannon fodder no longer mistreating himself to please anyone after being reborn. Instead he will be relying on himself to build an entertainment empire that will catapult him to the top.\n\n** person who is s*upid but in a sweet way>"
}