{
	"url": "https://www.novelupdates.com/series/please-be-patient-grand-duke/",
	"title": "Please Be Patient, Grand Duke - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/12/please-be-patient-grand-duke.jpeg",
	"noveltype": "(KR)",
	"genre": "Fantasy   Gender Bender   Romance   ",
	"tags": "Adapted to Manhwa   Aristocracy   Beautiful Female Lead   Clingy Lover   Cold Love Interests   Cross-dressing   European Ambience   Fated Lovers   Female Protagonist   First Love   Handsome Male Lead   Hiding True Identity   Magic   Male Yandere   Nobles   Obsessive Love   Older Love Interests   Possessive Characters   R-15   Secret Identity   Strong Love Interests   ",
	"rating": "(3.8 / 5.0, 92 votes)",
	"author": "Jin Soye   진소예   ",
	"year": "\n2020",
	"ranking": "#2261   #1523   #3285   #2216   #2538   ",
	"reviewcount": "3 Reviews sorted by",
	"description": "A replica of Marquis Kieran Vale, the son of the Marchioness of Vale, who she deemed a failure. That was all she was. No, she was now referred to as “he.” At least until she met Claude Del Ihar.\n\n*\n\nClaude stared silently at the sleeping Canillian. His gold lashes created a soft shadow on a white face. No matter how much he despised outdoor activities, he was still too white and thin. No trace of puberty was evident on him, and above all, his scent was different from the usual smell of men’s sweat. Was it the scent of lavender blooming all over the Marquis’s work or the scent of poppies blooming in the river?\n\nCanillian's soft cheeks brushed the tip of his nose, and instinctively, he bowed his head as if to savor the scent more. Canillian’s shallow breaths tickled his temple. His pulse began to race. Claude leaned further without thought. He wanted to enjoy it more. No, he really wanted to taste it. He was curious about what he’d taste if his tongue were to graze his skin. \n\nI must be crazy… or going crazy, he thought. Claude sighed. He stared at Canillian once more, and heat started to invade his entire body, captivated by Canillian's lips which looked like it was glazed with honey. \n\nPerhaps it was the hot atmosphere that caused such reaction from him, he reasoned out. If not, by no means… he wouldn’t have thought of wanting to kiss this guy.>"
}