{
	"url": "https://www.novelupdates.com/series/my-desertion-would-be-faster-than-heros-obsession/",
	"title": "My Desertion Would Be Faster Than Heros’ Obsession - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/12/My-Desertion-Would-Be-Faster-Than-Heros-Obsession.jpg",
	"noveltype": "(KR)",
	"genre": "Action   Drama   Fantasy   Romance   ",
	"tags": "Apocalypse   Beautiful Female Lead   Character Growth   Charismatic Protagonist   Comedic Undertone   Contracts   European Ambience   Fated Lovers   Female Protagonist   Forced Living Arrangements   Military   Monsters   Mystery Solving   Quirky Characters   Reincarnated in Another World   Reincarnation   Reverse Harem   Strong Love Interests   Tragic Past   Transmigration   Transplanted Memories   Weak to Strong   ",
	"rating": "(4.6 / 5.0, 47 votes)",
	"author": "아듀   ",
	"year": "\n2021",
	"ranking": "#3314   #4061   #7343   #8226   #6404   ",
	"reviewcount": "6 Reviews sorted by",
	"description": "I possessed the role of ‘that person’ from “you look so much like that person who died a long time ago.”\n\nReverse harem romantic fantasy set in the military.\n\nA novel about the heroes who are obsessed with the heroine after the death of their first love and former colleague.\n\n, or also referred as, .\n\nBut there is also the privilege of being a possessor, so do I die?\n\nIt should be a romance story where I survive and get obsessed over instead of the heroine.\n\nPersonally, it’s a pity that obsessive men are not my taste.\n\nHowever…\n\n“Hey, hit your head.”\n\n“The bastard who falls behind will be left behind!”\n\n“Take these out! Aren’t you out of your mind?!”\n\nThere is no romance, and what awaited me was the real K-military, XX!\n\nBefore I desert, I wished the heroes would rather have been obsessed with me, but this apocalyptic world repeatedly breaks my expectations.\n\nTo make matters worse, it seems that the heroes are gradually going crazy in the devastating situation.\n\nWhat is the only way to break the bondage of this absurd exploitation?\n\nOf course, only revolution! Evil Empire!>"
}