{
	"url": "https://www.novelupdates.com/series/maou-gakuin-no-futekigousha-ln/",
	"title": "Maou Gakuin No Futekigousha (LN) - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/10/Maou-Gakuin-No-Futekigousha-LN.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Comedy   Drama   Fantasy   Harem   Mystery   School Life   Shounen   ",
	"tags": "Academy   Adapted to Anime   Adapted to Manga   Apathetic Protagonist   Appearance Different from Actual Age   Arrogant Characters   Battle Academy   Blood Manipulation   Bloodlines   Calm Protagonist   Cheats   Clever Protagonist   Cold Protagonist   Confident Protagonist   Demon Lord   Demons   Dragons   Eye Powers   Fearless Protagonist   Genius Protagonist   Goddesses   Godly Powers   Gods   Handsome Male Lead   Heroes   Human Experimentation   Human Weapon   Humanoid Protagonist   Immortals   Leadership   Love Interest Falls in Love First   Loyal Subordinates   Magic   Male Protagonist   Multiple Identities   Multiple Reincarnated Individuals   Mysterious Past   Necromancer   Nobles   Overpowered Protagonist   Protagonist Strong from the Start   Reincarnation   Romantic Subplot   Royalty   Ruthless Protagonist   Schemes And Conspiracies   Soul Power   Souls   Special Abilities   Spirits   Sword And Magic   Sword Wielder   Time Manipulation   Time Skip   Transplanted Memories   Unique Weapon User   ",
	"rating": "(3.7 / 5.0, 24 votes)",
	"author": "Shuu   秋   ",
	"year": "\n2018",
	"ranking": "#1380   #6269   #9468   #10476   #8824   ",
	"reviewcount": "3 Reviews sorted by",
	"description": "After 2000 years has passed, the ruthless demon lord has just been reincarnated! But his aptitude at an academy for nurturing candidates for demon lords is, “Inept”!?\n\nHaving the capability to destroy humans, elementals, and gods, after a long period of countless wars and strife, Arnos the demon lord became sick and tired of all that and longed for a peaceful world, so he decided to reincarnate to the future.\n\nHowever, what awaited him after his reincarnation is a world too used to peace that his descendants became too weak due to a huge weakening in magical powers.\n\nArnos enrolled in the Maou Academy established to find any students that might be the demon lord’s reincarnation, but his powers are too extraordinary that those in the academy couldn’t properly judge his powers, so he’s regarded as an “Inept student”. Being underestimated and avoided by most people there, he recruited a girl friendly to him, Misha, as his subordinate and comrade, and strives to climb to the top of the demon race hierarchy to one day reclaim his former title and status.>"
}