{
	"url": "https://www.novelupdates.com/series/since-ive-entered-the-world-of-romantic-comedy-manga-ill-do-my-best-to-make-the-heroine-who-doesnt-stick-with-the-hero-happy/",
	"title": "Since I’ve Entered the World of Romantic Comedy Manga, I’ll Do My Best to Make the Heroine Who Doesn’t Stick With the Hero Happy. - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/01/Since-Ive-Entered-the-World-of-Romantic-Comedy-Manga-Ill-Do-My-Best-to-Make-the-Heroine-Who-Doesnt-Stick-With-the-Hero-Happy.jpeg",
	"noveltype": "(JP)",
	"genre": "Comedy   Romance   School Life   Shounen   Slice of Life   ",
	"tags": "Adapted to Manga   Beautiful Female Lead   Brother Complex   Childhood Friends   Clever Protagonist   Early Romance   Kind Love Interests   Love Triangles   Male Protagonist   Multiple POV   Popular Love Interests   Protagonist Falls in Love First   Transmigration   Transported to Another World   Younger Sisters   ",
	"rating": "(4.5 / 5.0, 222 votes)",
	"author": "Shiryu   ",
	"year": "\n2021",
	"ranking": "#117   #156   #1548   #173   #1681   ",
	"reviewcount": "29 Reviews sorted by",
	"description": "I love romantic comedy mangas.\n\nHowever........ my favorite heroine is a sub-heroine, a loser heroine who will never be able to connect with the protagonist.\n\nOne day I was hit by a truck and woke up to find myself playing the role of the hero's best friend in a romantic comedy manga.\n\nYeah, this is probably a dream. I'm dreaming about being hit by a truck.\n\nIn the scene where the hero's best friend is talking alone with my favorite heroine, I possessed that best friend.\n\nIn the classroom alone with my favorite heroine......... All I have to do is to say it.\n\n'I like you.'\n\n'What? What are you suddenly saying........?!'\n\n'I'll make you happy. I want you to go out with me.'\n\n'Huh?!'\n\nBecause I was dreaming, I casually told her.\n\nIf this wakes me up from my dream, I won't have any regrets.......\n\n......Hey, I can't wake up from my dream? It's usually the next day, you know?\n\nWhat, am I reincarnated as this character by any chance?\n\nThis is the story of how I make sure my favourite heroine is happy.\n>"
}