{
	"url": "https://www.novelupdates.com/series/villainess-wants-to-turn-over-a-new-leaf/",
	"title": "Villainess Wants To Turn Over A New Leaf - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/08/20200429160807.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Fantasy   Martial Arts   Romance   ",
	"tags": "Adapted to Manhua   Age Progression   Ancient China   Beautiful Female Lead   Calm Protagonist   Child Protagonist   Childhood Friends   Clever Protagonist   Cunning Protagonist   Cute Children   Cute Protagonist   Devoted Love Interests   Doting Love Interests   Doting Older Siblings   Doting Parents   Familial Love   Family   Female Protagonist   Handsome Male Lead   Heartwarming   Late Romance   Love Interest Falls in Love First   Older Love Interests   Pets   Politics   Possessive Characters   Power Couple   Pregnancy   Royalty   Sibling's Care   Smart Couple   Strong Love Interests   Transmigration   Villainess Noble Girls   ",
	"rating": "(4.6 / 5.0, 483 votes)",
	"author": "Chun Dao Han   春刀寒   ",
	"year": "\n2020",
	"ranking": "#85   #89   #311   #107   #464   ",
	"reviewcount": "128 Reviews",
	"description": "Lin Feilu, or better known by her nickname—Green Tea Princess, was the best of all the scheming b*tches that the world had ever seen. She was the Oscar-winning actress among the masses with real life as her stage. Acting coy, slandering, feigning innocence, or playing the saint, she aced it all. Simply put, she was the proverbial villainess.\n\nAh, but retribution came way too early for this malicious personage and she died on her 27th birthday.\n\nIn death, Lin Feilu reflected on her career of 20 years as the Green Tea Princess. She was full of regret and remorse over the life she once led. She vowed, if there was an afterlife, she would atone for her misdeeds and be a good person.\n\nShe transmigrated into a five-year-old princess of the Dalin Dynasty. In the name of family, she had a sickly mother disfavoured by the emperor, a mentally challenged and daft older brother.\n\nHer life was constantly in danger, with having little to eat and trying to stay warm.\n\nThe living environment was very harsh.\n\nLin Feilu, who wanted to be a good person: … You forced me! Sorry, I can only activate my unique skill.\n\nHarem fight? Striving for favor? Climbing the ranks?\n\nApologies, but let me show you what it means to be slaughtered by a maxed out player.\n\nNote: “Green Tea” is a woman who presents herself as innocent, sweet, and kind but is very scheming and calculative in reality.>"
}