{
	"url": "https://www.novelupdates.com/series/i-adopted-a-villainous-dad/",
	"title": "I Adopted A Villainous Dad - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/01/I-Adopted-A-Villainous-Dad.jpg",
	"noveltype": "(KR)",
	"genre": "Adventure   Comedy   Drama   Fantasy   Romance   ",
	"tags": "Abandoned Children   Adopted Children   Adopted Protagonist   Age Progression   Appearance Different from Actual Age   Aristocracy   Beautiful Female Lead   Bodyguards   Caring Protagonist   Character Growth   Charismatic Protagonist   Child Protagonist   Childcare   Coming of Age   Complex Family Relationships   Confident Protagonist   Cruel Characters   Cunning Protagonist   Curious Protagonist   Cute Children   Cute Protagonist   Destiny   Determined Protagonist   Divination   Doting Parents   Dreams   European Ambience   Evil Organizations   Evil Religions   Familial Love   Family   Female Protagonist   Friendship   Handsome Male Lead   Heartwarming   Kingdoms   Knights   Love Interest Falls in Love First   Loyal Subordinates   Magic   Manipulative Characters   Master-Servant Relationship   Naive Protagonist   Nobles   Personality Changes   Power Struggle   Priestesses   Priests   Prophecies   Saints   Servants   Shameless Protagonist   Soldiers   Transmigration   Wealthy Characters   ",
	"rating": "(4.0 / 5.0, 85 votes)",
	"author": "Yunsul   윤슬   ",
	"year": "\n2020",
	"ranking": "#6970   #2409   #3294   #3088   #1143   ",
	"reviewcount": "8 Reviews sorted by",
	"description": "The heroine entered a novel as the saintess that walked a thorny path. However, she did not desire the bleak road, instead opting to walk on a flowery path by abandoning the frustrating original timeline and adopting a father.\n\n“You, be my daddy!”\n\nTurns out he’s the final boss and villain which worked out just as well.\n\n“Daddy, why is your name daddy? So cute. What did you eat for breakfast? Handsomeness?”\n\nAs she dreamt of a happy ending with her daddy, a huge obstacle stood in her path: the existence of the hero destined to annihilate the final boss. Since it’s come to this, the heroine decided to save her father and the hero. Maybe the world, too, if she had the time. But her daddy is being a pain…he keeps raising death flags and now the hero’s obsessed over her, asking to take responsibility for taming him.\n\nJust what is going on?>"
}