{
	"url": "https://www.novelupdates.com/series/i-ran-away-after-flirting-with-the-paranoid-male-protagonist/",
	"title": "I Ran Away After Flirting with the Paranoid Male Protagonist - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/07/I-Ran-Away-After-Flirting-with-the-Paranoid-Male-Protagonist.jpg",
	"noveltype": "(CN)",
	"genre": "Romance   Yaoi   ",
	"tags": "Cute Protagonist   Enemies Become Lovers   Handsome Male Lead   Male Yandere   Masochistic Characters   Modern Day   Multiple Reincarnated Individuals   Naive Protagonist   Transmigration   Weak Protagonist   Wealthy Characters   ",
	"rating": "(3.3 / 5.0, 18 votes)",
	"author": "橙言喵   ",
	"year": "\n2022",
	"ranking": "#4617   #3737   #9801   #4779   #9595   ",
	"reviewcount": "2 Reviews sorted by",
	"description": "Jiang Chuyan became the vicious wife who abused and humiliated the male lead Yu Yuan in the novel and ended up dying from excessive blood loss.\n\nBecause the male protagonist drained his blood to save his White Moonlight.\n\nWhen Jiang Chuyan appeared, he was holding a long whip in his hand and his feet stomped on the male lead’s back.\n\nJiang Chuyan’s legs were weak and he said with a shaky voice:\n\n“Hey, Husband QAQ”\n\nIn order not to collapse, Jiang Chuyan worked hard to be a cruel villain. He tortured the protagonist, making him study day and night, and he could only sleep five hours a day.\n\nThe male protagonist receives a special bag. Jiang Chuyan insulted him and made him his personal servant, forcing him to dress him and help him shower.\n\nThe protagonist looked at the white jade body in front of him, and delusions surged through his heart.\n\nTo further torture the male lead, Jiang Chuyan intends to say something disgusting to the male lead. Jiang Chuyan’s eyes were red with embarrassment, and his peach blossom eyes were glowing:\n\n“Oh you annoying goblin, come and please me.”\n\nYu Yuan knelt on one knee, his eyes were pitying:\n\n“Yea.”\n\nJiang Chuyan : …?\n\nJiang Chuyan’s earlobes were red:\n\n“Ten million for one night!”\n\nYu Yuan’s eyes were fascinated:\n\n“Okay, if the money isn’t enough, I’ll do it for free.”\n\nJiang Chuyan: …?>"
}