{
	"url": "https://www.novelupdates.com/series/love-experiment/",
	"title": "Love Experiment - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/05/LoveExp.jpg",
	"noveltype": "(MY)",
	"genre": "Comedy   Drama   Romance   ",
	"tags": "Adapted to Drama   Determined Protagonist   Enemies Become Lovers   Narcissistic Protagonist   Slow Romance   ",
	"rating": "(2.3 / 5.0, 4 votes)",
	"author": "ANJELL   ",
	"year": "\n2013",
	"ranking": "#2000   #2000   #13129   #6971   #13097   ",
	"reviewcount": "No Reviews",
	"description": "The first time they met each other eye-to-eye. Each of them had their own view.\n\nThe creature from which planet is this? Soo weird! Wow, his hair looks like a kilo of curry spilled on it. He has earrings on his ears. The silver chain around the neck. That’s so indecent! Young and… handsome. Handsome or not, I will blacklist him from becoming my husband. – DAMIA FARISHA\n\nHmmm… looks kind of pretty. Rosy white skin-face. Neutral without makeup. Her split chin and lips should attract many men. But, this girl looks old-fashioned. – TENGKU AARON SHAH\n\nSurprisingly, Tengku Aaron was really a crazy guy. His behavior was very unexpected. If not crazy, what would be the most appropriate word to describe to someone who suddenly proposed to get married when they know each other for less than two hours?\n\nFor her company, Damia made a crazy decision too! There was no way out but to say, “I agree!” Damia set the terms in hopes that Tengku Aaron would cancel his intention.\n\n“You cannot regret marrying me. Because I’m a razor [1]…”\n\n“Oh, yeah?! I really like it if it’s a Gillete Mach3 Turbo brand. Shave my property as much as you like. I don’t mind. My wealth is boundless… ”\n\nFailure after failure. Finally, they are united! For Tengku Aaron, it was nothing more than an experiment. There’s a reason he got married. Because he was not a loser! And for Damia, as long as the divorce was not pronounced, the Tengku Aaron’s dignity shall be preserved. Will Tengku Aaron Shah succeed in continuing his love experiment?\n\n{ TN: [1] Razor is a direct translation of Pisau Cukur. Pisau Cukur is an idiom means Gold Digger – A person who cultivates a personal relationship in order to attain money and/or material goods, power}>"
}