{
	"url": "https://www.novelupdates.com/series/nano-mashin/",
	"title": "Nano Mashin - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/11/Nano-Mashin.jpg",
	"noveltype": "(KR)",
	"genre": "Action   Fantasy   Harem   Martial Arts   Mature   Sci-fi   Seinen   Supernatural   Wuxia   ",
	"tags": "Absent Parents   Academy   Adapted to Manhwa   Antihero Protagonist   Artificial Intelligence   Battle Academy   Biochip   Bullying   Calm Protagonist   Cheats   Clever Protagonist   Cold Protagonist   Cultivation   Cunning Protagonist   Death of Loved Ones   Determined Protagonist   Enlightenment   Famous Parents   Famous Protagonist   Fast Cultivation   Fast Learner   First-time Interc**rse   Game Elements   Leadership   Male Protagonist   Misunderstandings   Near-Death Experience   Overpowered Protagonist   Revenge   Romantic Subplot   R*pe   Schemes And Conspiracies   Skill Assimilation   Strength-based Social Hierarchy   Sudden Strength Gain   Sword Wielder   Teachers   Technological Gap   Time Travel   Torture   Underestimated Protagonist   Weak to Strong   ",
	"rating": "(3.5 / 5.0, 204 votes)",
	"author": "한중월야   ",
	"year": "\n2017",
	"ranking": "#528   #2873   #2382   #1451   #2615   ",
	"reviewcount": "56 Reviews sorted by",
	"description": "Until he became the lowest-ranked master, his lonely and luckless life never changed.\n\nSuddenly one day, a descendant injected him with a nanomachine, and the machine started ‘speaking’ to him.\n\n[I am the seventh generation Nanomachine manufactured by Sky Cooperation, and I am operating as a central nerve connected to your brain.]\n\n“What? What are you talking about?”\n\nThis was beyond the boy’s knowledge, he turned pale.\n\nThe Nanomachine linked to his cerebrum realized the User was not understanding a single word it said.\n\n“Who are you, and why are you doing this to me?”\n\n[“I am the seventh generation Nanomachine.]\n\n“Nano Machine?”\n\n[Yes, Nanomachine.]\n\nThe boy’s face hardened.\n\nMashin was the deity the Mashin Religion worshipped, along with the Sacred Fire.\n\nThe religions’ Master communicated with Mashin.\n\n“Um, are you really Mashin?”\n\nThe boy knelt down and asked with a trembling voice. At this, the Nanomachine attached to his cerebrum realized it had been misunderstood.>"
}