{
	"url": "https://www.novelupdates.com/series/being-a-supporting-female-character-at-an-all-boys-high-school-transmigration/",
	"title": "Being a Supporting Female Character at An All Boy’s High School (Transmigration) - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/07/novel.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Fantasy   Romance   School Life   ",
	"tags": "Cohabitation   Cross-dressing   Devoted Love Interests   Female Protagonist   Handsome Male Lead   Love Interest Falls in Love First   Modern Day   Transmigration   ",
	"rating": "(4.1 / 5.0, 150 votes)",
	"author": "Sixteen Month Old Watermelon   十六月西瓜   ",
	"year": "\n2019",
	"ranking": "#3923   #2227   #2545   #7591   #4000   ",
	"reviewcount": "42 Reviews sorted by",
	"description": "When Pei Jin awoke, she discovered that she had transmigrated into the novel she had been reading just before she fell asleep, “All Handsome Men’s Highschool.”\n\nWhile the female lead had justifiably attended the all boy’s school in place of her sickly and weak older brother, her infiltration as a supporting female labeled her as a pervert.\n\nIn order to not ruin her reputation, Pei Jin tightly wrapped up her female figure and cautiously waited for graduation. \n\nHowever, on the road of disguising herself as a boy, her roommate, the demon king, constantly made trouble for her.\n\nIf the demon king wasn’t yelling, “Peipei, I forgot to grab my briefs, help me get them”, then he was teasing her, “Peipei, how come your body smells so nice, just like a girl’s.”\n\nWhen talking about unpleasant topics at the boy’s dormitory, in order to appear more friendly, Peipei could only persevere and speak obscenely with the big demon king.\n\nIt was all perfect.\n\nPeipei had always thought that her disguise was flawless, but after a conversation one night, her demon king of a roommate suddenly got onto her bed and tightly grabbed her wrist, smiling casually, “Peipei, you’re really treating me as if I’m blind?”\n\nPeipei, “(⊙o⊙)…Meow Meow Meow？”\n\n“Teasing me every day, are you acting like I’m dead?”\n\nPeipei: “I’m not, I didn’t, I just want to get along well, don’t talk nonsense!”\n\nThe demon king’s lips lifted into a smile, “You were too young before, so I was reluctant to touch you, but now…… I will never let you go.”>"
}