{
	"url": "https://www.novelupdates.com/series/carrying-a-hoe-to-cultivate/",
	"title": "Carrying a Hoe to Cultivate - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/09/Carrying-a-Hoe-to-Cultivate.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Romance   Xianxia   Yaoi   ",
	"tags": "Alternate World   Ancient Times   Childcare   Cultivation   Devoted Love Interests   Doting Love Interests   Family   Farming   Fated Lovers   Handsome Male Lead   Human-Nonhuman Relationship   Lovers Reunited   Magical Space   Marriage   Misunderstandings   Mpreg   Multiple Realms   Multiple Transported Individuals   Mythical Beasts   Past Plays a Big Role   Pets   Straight Uke   System Administrator   Tragic Past   Transmigration   ",
	"rating": "(4.3 / 5.0, 132 votes)",
	"author": "Little Baldy   秃子小贰   ",
	"year": "\n2019",
	"ranking": "#2318   #3274   #3398   #1096   #3340   ",
	"reviewcount": "34 Reviews sorted by",
	"description": "Xia Yi had transmigrated, with a cultivation system into a farming novel. Orz \r\n\r\nMission: Becoming an apprentice in the Qi Shan Sect to obtain a mythical beast. \r\n\r\nWith his hoe on his shoulder, Xia Yi gazed at the large area of farmland in front of him, he almost blacked out: How am I going to complete cultivation missions in a farming novel? \r\n\r\nSystem: It’s fine. There is always a fix to a problem… \r\n\r\nAnd so, Xia Yi was forced to go between the two worlds, farmed a bit here, cultivated a bit there. \r\n\r\nAlthough the rubbish missions were torturing him to death, there was always a loyal doggie beside him… \r\n\r\nXia Yi: Cultivating is so hard. \r\n\r\nGu Wen Zhu: I’ll teach you. \r\n\r\nXia Yi: Farming is so exhausting. \r\n\r\nGu Wen Zhu: I’ll help. \r\n\r\nXia Yi: I don’t want to have a child. \r\n\r\nGu Wen Zhu: Yes, you want to. \r\n\r\nAs the worlds mixed up, the characters in the cultivation novel frequently appeared beside him. \r\n\r\nThe whole thing was a mess, traveling between two worlds. Claiming to be relatives with people, arranging a marriage, becoming sworn brothers with others… \r\n\r\nWhy not let his dog at home join the party too! >"
}