{
	"url": "https://www.novelupdates.com/series/salted-fish-become-viral-after-ignoring-the-love-system/",
	"title": "Salted Fish Become Viral After Ignoring the Love System! - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/07/Salted-Fish-Become-Viral-After-Ignoring-the-Love-System.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Drama   Fantasy   Romance   Slice of Life   ",
	"tags": "Beautiful Female Lead   Coma   Divorce   Female Protagonist   Handsome Male Lead   Lack of Common Sense   Lazy Protagonist   Modern Day   Poor Protagonist   Poor to Rich   Rich to Poor   Showbiz   System Administrator   ",
	"rating": "(4.0 / 5.0, 33 votes)",
	"author": "十六月西瓜   ",
	"year": "\n2021",
	"ranking": "#2686   #2044   #5883   #2950   #6897   ",
	"reviewcount": "6 Reviews sorted by",
	"description": "When Ning Xiaoyu, an 18th Line star, participated in a variety show, she happened to meet a popular actor who was taking a nap in the lounge.\n\nThe man leaned against the wide floor-to-ceiling windows, his long legs stretched freely. The afternoon sun shines through the glass windows and falls on him unscrupulously. His profile face was illuminated by the morning light, so handsome that he did not look like a real person.\n\nWhen Ning Xiaoyu was about to politely back away, a line of characters suddenly appeared in front of her\n[ Girl, do you want to be popular? Want to enjoy the sensation of being in the limelight? As long as you get the favor of the actor, you can have all of this. At the moment, the actor is resting in the room, you can;\nA: steal a kiss from the actor\nB: secretly take a photo of the actor’s handsome sleeping posture\nC: accompany the actor tenderly for ten minutes ]\n\nNing Xiaoyu waited for a while and found that she had to choose an option. After that, she reluctantly chose the letter C option.\nThe love system was so excited that it rubbed its hands together: Come on, girl!\n\nThen it watched Ning Xiaoyu sit down beside the actor, took out the melon seeds that she carried with her, and began knocking melon seeds.\nThe love system that is waiting for the sugar hit: Something seems not right? ? ?>"
}