{
	"url": "https://www.novelupdates.com/series/stimulating-to-be-raised-by-a-virtual-lover/",
	"title": "Stimulating To Be Raised By A Virtual Lover - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/09/BSBAVL.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Drama   Romance   Yaoi   ",
	"tags": "Abandoned Children   Acting   Amnesia   Androgynous Characters   Animal Rearing   Artificial Intelligence   Celebrities   Child Abuse   Devoted Love Interests   Different Social Status   Doting Love Interests   Family Conflict   Famous Protagonist   Futuristic Setting   Game Elements   Handsome Male Lead   Love Interest Falls in Love First   Male Yandere   Misunderstandings   Mysterious Past   Obsessive Love   Poor Protagonist   Possessive Characters   Showbiz   Wealthy Characters   ",
	"rating": "(3.9 / 5.0, 63 votes)",
	"author": "咬猫耳朵   ",
	"year": "\n2019",
	"ranking": "#852   #1381   #3964   #2160   #3541   ",
	"reviewcount": "9 Reviews sorted by",
	"description": "People need kryptonite to support virtual lovers. But the virtual lover in his game, liked raising him and spoiling him.\n\nWhen Zhu Qingan was driven out of his small shanty by his stepmother, he was homeless.\n\nThe virtual lover gave him a large, luxurious villa.\n\nStepmom: “?”\n\nZhu Qing ‘an was left out in the talent show because of a villain.\n\nThe virtual lover calls in an empire of people and nearly crowds the audience.\n\nVillain: “…”\n\nZhu Qing’an was ridiculed by Hei Zi when he had no money and was poor.\n\nThe virtual lover had a fleet of luxury cars worth millions of dollars to pick up Zhu Qing An in front of Hei Zi…to go to the bathroom.\n\nThe whole empire thought that Zhu Qing’an had talked about a powerful lover.\n\n“Your lover’s assets have reached hundreds of billions? Is he the richest man in the empire? ”\n\n“Is your lover’s status higher than that of the emperor?”\n\nZhu Qing ‘an: “I don’t, I don’t. I just have a piece of paper man. ”\n\n\n\nI don’t want us to be separated by a world-like cold screen.\n\nI want to touch him, kiss him, hug him and keep him in captivity. The desire and possessiveness born every day can drive me crazy.\n\nHe is my whole world.>"
}