{
	"url": "https://www.novelupdates.com/series/the-dungeons-s-class-time-limited-lady/",
	"title": "The Dungeon’s S-Class Time-limited Lady - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/11/The-Dungeons-SClass-Time-Limited-Lady.jpeg",
	"noveltype": "(KR)",
	"genre": "Adventure   Comedy   Fantasy   Romance   ",
	"tags": "Beautiful Female Lead   Childhood Friends   Dungeons   Female Protagonist   Guilds   Handsome Male Lead   Hunters   Teamwork   ",
	"rating": "(4.3 / 5.0, 7 votes)",
	"author": "67층의   ",
	"year": "\n2021",
	"ranking": "#6970   #6348   #12724   #11743   #9577   ",
	"reviewcount": "No Reviews",
	"description": "Shin Yuri was a dealer from the S-Class Hunter team who became possessed by the RP dungeon along with the rest of the team.\r\n\r\nThis dungeon, often known as the RP dungeon (role-playing dungeon), is a dungeon that imitates a person in the dungeon’s worldview. A place where I can’t clear with my existing abilities, but give a huge reward. Everything is good, but I, who used to break knives with my bare hands, become a frail noble Lady whose wrist breaks when picks up a knife?\r\n\r\nAre you kidding me?\r\n\r\nAnd the three team members who came in together,\r\nOne is the Emperor,\r\nOne is the Pope,\r\nOne is the Lord of Magic Tower?\r\nWhy am I the only one looking like this? While I was asking, my own abilities were unlocked.\r\n\r\n[God’s Store : You can purchase anything for a price]\r\n\r\nI thought it was amazing, but there is only one thing I can buy now.\r\nAre you kidding me?\r\n\r\n[God’s Store Level Up!]\r\n\r\nBut is it the item that improves as it levels up?\r\nBesides,\r\n“I told you. When the opportunity comes, I’ll die for you.”\r\n\r\nFrom the guy who I thought was just a naughty childhood friend,\r\n“—Joo Yian-ssi, do you know what’s strange today?”\r\n“Yes, I know.”\r\n\r\nEven a man who makes a strange illusion.\r\n\r\n[Four members of Shin Yuri Hunter Team enter the L-class Dungeon, “I’m possessed by a weak time-limited Lady”]\r\n\r\n[Dungeon goal: Prevent the end of the continent (1 year)]\r\nWill they be able to break this dungeon and get out of it?>"
}