{
	"url": "https://www.novelupdates.com/series/prestigious-family-marriage-uncle-vs-young-wife/",
	"title": "Prestigious Family Marriage: Uncle vs Young Wife - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/02/0087E86D-DAB1-4C5D-88C4-769BADD00055.jpeg",
	"noveltype": "(CN)",
	"genre": "Josei   Romance   Tragedy   ",
	"tags": "Beautiful Female Lead   Blackmail   Childcare   Complex Family Relationships   Doting Love Interests   Female Protagonist   Handsome Male Lead   Modern Day   Older Love Interests   Pregnancy   Schemes And Conspiracies   Wealthy Characters   ",
	"rating": "(3.7 / 5.0, 73 votes)",
	"author": "Ai Yi Yao   艾依瑶   ",
	"year": "\nN/A",
	"ranking": "#2000   #2000   #1487   #5885   #3344   ",
	"reviewcount": "20 Reviews sorted by",
	"description": "People say that when a man becomes middle aged, their appearance and energy will become weak. Ye Qing Xin doesn’t feel that way. At least Jing Bo Yuan is not, his appearance and energy is still really great.\n\nJing Bo Yuan refuted: I am just thirty five years old, it’s still a long time untiI I reach middle age.\n\n…\n\nJing Bo Yuan, born in a rich family, he establishes Bo Wei company, he is a great one in the business world.\n\nEveryone thinks he is: mature, serious, strict, and fathomless.\n\nThat kind of strict, serious, and successful man, suddenly does romance with a younger woman. He marries a young wife, who is younger by fourteen years old compared to him.\n\nYe Qing Xin, is a little girl that leads a wandering life. She suddenly married to  an old and well-known family and becomes the object of jealousy of everyone.\n\n…\n\nAccording to the gossip, Mrs Jing is a vixen that hooks with her pure of heart and few desires. She makes the strict Mr Jing falls in love with her.\n\nAnother gossip, Mr Jing spoils his young wife without any limit.\n\nDuring an interview.\n\nInterviewer: “It’s known that Mr Jing at first to marry Mrs Jing because of her young age and beautiful face, is that right? Except her beauty, is there any good point about her?”\n\nJing Bo Yuan: “I love her. I don’t care whether she is beautiful or not. I married her. She doesn’t need to have any good point. Falling in love with me is her greatest good point.”\n\nThe interviewer is surprised and asks: “Mr Jing and Mrs Jing, when was your first meeting? How did you get to know each other?”\n\nJing Bo Yuan: “Our first time meeting was fifteen years ago…”\n\nInterviewer: “….”\n\nFifteen years ago, he saved her. Fifteen years after, he gives her a life.>"
}