{
	"url": "https://www.novelupdates.com/series/the-raven-dark-hero-i-longed-to-be-a-hero-but-due-to-this-and-that-i-became-the-last-boss/",
	"title": "The Raven Dark Hero ~I Longed to Be a Hero but Due to This and That I Became the Last Boss?!~ - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/03/The-Raven-Dark-Hero-I-Longed-to-Be-a-Hero-but-Due-to-This-and-That-I-Became-the-Last-Boss.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Fantasy   Harem   Martial Arts   School Life   Seinen   Supernatural   ",
	"tags": "Ability Steal   Adapted to Manga   Aggressive Characters   Antihero Protagonist   Arrogant Characters   Beautiful Female Lead   Betrayal   Charismatic Protagonist   Childhood Friends   Cruel Characters   Cunning Protagonist   Dark   Death   Dense Protagonist   Depictions of Cruelty   Fantasy Creatures   Hidden Abilities   Hiding True Abilities   Hiding True Identity   Male Protagonist   Modern Day   Naive Protagonist   Overpowered Protagonist   Personality Changes   Resurrection   Revenge   Romantic Subplot   Secret Identity   Secret Organizations   Skill Assimilation   Special Abilities   Sudden Strength Gain   Twisted Personality   Weak to Strong   Yandere   ",
	"rating": "(3.4 / 5.0, 49 votes)",
	"author": "Tonkye   ",
	"year": "\n2019",
	"ranking": "#6970   #2000   #2860   #3262   #5235   ",
	"reviewcount": "8 Reviews sorted by",
	"description": "Since I was a child, my dream was to become a 'hero'. In order to become a hero, I worked very hard and always took the initiative to help anyone that was in trouble. I didn't have any doubts about becoming a hero but... God didn't grant me any 'gift' ability...\r\n\r\nOr so I though but, when I was in a moment of complete despair, I suddenly gained an ability.\r\n\r\nWith this, I can finally be a hero!\r\n\r\nBut ironically, my dream crumbled on the same moment that I awakened my gift...\r\n\r\nThis is the story of a boy that acquired a huge power and will become an evil boss before he realizes it...>"
}