{
	"url": "https://www.novelupdates.com/series/when-the-nemesis-eats-the-wicked-woman/",
	"title": "When the Nemesis Eats the Wicked Woman - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/12/When-the-Nemesis-Eats-the-Wicked-Woman_1638855733.jpg",
	"noveltype": "(KR)",
	"genre": "Drama   Fantasy   Romance   ",
	"tags": "Aristocracy   Beautiful Female Lead   Calm Protagonist   Child Abuse   Empires   Enemies Become Lovers   European Ambience   Female Protagonist   First Love   Handsome Male Lead   Hated Protagonist   Heterochromia   Love Interest Falls in Love First   Nobles   Protagonist Strong from the Start   Reincarnated in Another World   Second Chance   Time Loop   Tragic Past   Villainess Noble Girls   ",
	"rating": "(4.0 / 5.0, 42 votes)",
	"author": "Shin Saebyeok   신새벽   ",
	"year": "\n2020",
	"ranking": "#1563   #1503   #3835   #1950   #4231   ",
	"reviewcount": "11 Reviews sorted by",
	"description": "I possessed the most evil woman in a mass-produced fantasy novel.\n\nReceived an oracle to destroy the world, and killed by the Munchkin male lead…\n\nBut one day, I picked up the little male lead? After treating and taking care of the injured and blind boy, the child became a bit strange.\n\n“I’ll be responsible for you later.”\n\n“…….What?”\n\n“If you become the wife of the Crown Prince, you can even become an Empress. What do you think? It’s an honor, right?”\n\n…You’re still a kid…? \n\nAnd we’re enemies. \n\nYou’ll come to defeat me later! \n\nHowever, rather than coming to defeat, the male lead, who became an adult, came to propose.\n\n– – –\n\nFirst night with the male lead…\n\nI was hesitant to get in, standing in front of the bedroom for 30 minutes. It felt like my heart was about to explode from the tension.\n\nBut then, he slowly opened the door and leaned against the door.\n\n“Are you trying to kill me?”\n\nThe red and blue eyes like dawn, for a moment, he felt as if they were binding him and sucking him in. He slowly grabbed my arm and pulled me into the room.\n\n“Don’t relax all night tonight, Queen.”\n\nHe made eye contact with me, twisted his lips strangely and whispered.\n\n“Because I’m going to eat you.”\n\nBadump. Badump. Badump.\n\nMy heart thumped onto the floor.>"
}