{
	"url": "https://www.novelupdates.com/series/after-the-abyss-dragon-woke-up/",
	"title": "After The Abyss Dragon Woke Up - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/10/After-The-Abyss-Dragon-Woke-Up.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Comedy   Fantasy   School Life   Yaoi   ",
	"tags": "Academy   Calm Protagonist   Carefree Protagonist   Cold Love Interests   Comedic Undertone   Cute Protagonist   Cute Story   Determined Protagonist   Devoted Love Interests   Doting Love Interests   Dragon Slayers   Dragons   Family Conflict   Fantasy Creatures   Fantasy World   Futuristic Setting   Gate to Another World   Handsome Male Lead   Hidden Abilities   Hiding True Abilities   Hiding True Identity   Human-Nonhuman Relationship   Hunters   Lazy Protagonist   Love Interest Falls in Love First   Loyal Subordinates   Magic   Magic Beasts   Mismatched Couple   Misunderstandings   Money Grubber   Mysterious Family Background   Naive Protagonist   Non-humanoid Protagonist   Obsessive Love   Overpowered Protagonist   Possessive Characters   Protagonist Strong from the Start   Ruthless Protagonist   Secrets   Slow Growth at Start   Slow Romance   Strong Love Interests   Stubborn Protagonist   Sword And Magic   Younger Love Interests   ",
	"rating": "(4.5 / 5.0, 123 votes)",
	"author": "Tang Ốc   桑沃   ",
	"year": "\n2021",
	"ranking": "#289   #343   #2229   #650   #1658   ",
	"reviewcount": "20 Reviews sorted by",
	"description": "Shi An is the last Abyss Dragon in the world. Since he was bored, he decided to go into a deep sleep while hugging his treasures. After fifty thousand years of satisfying slumber, Shi An opened his eyes only to discover that he had become a weak human with short hands and legs.\r\n\r\nHe glanced down at his mysteriously downsized body and then lifted his head to look around his empty cave. “……” Where is my powerful and majestic body? My big tail? Most importantly, where are my treasures?!\r\n\r\nAfter thousands of years of hard work, sleeping just once has sent me to square one.\r\n\r\n***\r\n\r\nIn the year 2202, the conflicts between humans and monsters are becoming more and more intense. Although the monsters are strong, the fantastical species that used to rule the continent have all but disappeared.\r\n\r\nShi An, the Shi family’s youngest son, is Mage Academy’s infamous mage who has no magic power. Each student’s magic power is measured at the beginning of the school year. Shi An looked at the three destroyed magic detection equipment and innocently asked, “Eh? Are these equipment’s quality not very good?”\r\n\r\nDuring actual combat training, low-ranked monsters fled before Shi An could get close. Shi An looked at their fleeing figures and innocently exclaimed, “Yay, lucky!”\r\n\r\nEveryone else was speechless. “……?” I believe I am dreaming.\r\n\r\n***\r\n\r\nMu Heng——human species’ strongest mage——is the only remaining human who bears the noble dragon slayer bloodline.\r\n\r\nHe coldly and arrogantly said, “Dragons? Extinction is their best outcome.”\r\n\r\nA long time later, Mu Heng turned his head back to look at the dragon cub reclining on the piles of treasure. Mu Heng withdrew his gaze and leisurely asked, “Are there any other jobs? I want a well-paid one.”\r\n\r\nExtinction is out of the question now. As a matter of fact, I can only earn more money so that I won’t get kicked out of bed at night.>"
}