{
	"url": "https://www.novelupdates.com/series/the-tyrant-wont-let-me-go/",
	"title": "The Tyrant Won’t Let Me Go - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/04/The-Tyrant-Wont-Let-Me-Go.jpg",
	"noveltype": "(KR)",
	"genre": "Fantasy   Romance   ",
	"tags": "Absent Parents   Abusive Characters   Age Progression   Aristocracy   Beautiful Female Lead   Child Abuse   Child Protagonist   European Ambience   Fantasy World   Female Protagonist   Handsome Male Lead   Hiding True Abilities   Love Interest Falls in Love First   Male Yandere   Nobles   Obsessive Love   R-15   Reincarnation   Royalty   Sword And Magic   Transmigration   Yandere   ",
	"rating": "(3.8 / 5.0, 71 votes)",
	"author": "거기치킨좀   ",
	"year": "\n2020",
	"ranking": "#4617   #4680   #3140   #6880   #2746   ",
	"reviewcount": "9 Reviews sorted by",
	"description": "One day after I endured the hellish days of being a nameless extra that was abandoned by my parents, the  people who attacked the orphanage took me to the Imperial Palace.\r\n\r\n“Every day, at least ten minutes or more hold the prince's hand, but on the days of classes, please hold at least twenty minutes.'\r\n\r\nThen a man called the Emperor suddenly sees me and asks me to hold the hand of a prince who would grow up as a cruel tyrant in the future.\r\n\r\nI thought I would maintain a thorough business-like relationship with the Crown Prince in order to prevent the death of the tyrant who was struggling in war.\r\n\r\n'Your Majesty, I will retire in 3 years'\r\n\r\n**Crack**\r\n\r\nThe teacup in Cedric's hand shattered, unable to withstand the terrifying grip.\r\n\r\n“Yes, Cie? I'm sorry, but I didn't hear that well.'\r\n\r\nIt seems like this crazy tyrant has no intention of letting me go\r\n\r\n'The doctor said that it was not enough to hold hands anymore.'\r\n\r\nWhat? It could happen, but why are you in my bed?\r\n\r\n'He said that we should spend a night together.'\r\n\r\nHey! Your Majesty, didn't the doctor say that I just need to hold your hand?\r\n>"
}