{
	"url": "https://www.novelupdates.com/series/munou-to-yobareta-ore-yottsu-no-chikara-wo-eru/",
	"title": "Munou To Yobareta Ore, Yottsu No Chikara Wo Eru - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2017/10/Munou-To-Yobareta-Ore.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Fantasy   Harem   Romance   Supernatural   ",
	"tags": "Adventurers   Artifacts   Assassins   Beautiful Female Lead   Brainwashing   Bullying   Carefree Protagonist   Character Growth   Demon Lord   Demons   Devoted Love Interests   Discrimination   Dragons   Emotionally Weak Protagonist   Evil Organizations   Fantasy World   Guilds   Handsome Male Lead   Hidden Abilities   Honest Protagonist   Human-Nonhuman Relationship   Kidnappings   Level System   Maids   Male Protagonist   Manipulative Characters   Multiple POV   Older Love Interests   Pacifist Protagonist   Saving the World   Secret Organizations   Social Outcasts   Summoning Magic   Sword And Magic   Terrorists   Tragic Past   Weak to Strong   ",
	"rating": "(2.7 / 5.0, 54 votes)",
	"author": "Matsumura Michihiko   松村道彦   ",
	"year": "\n2017",
	"ranking": "#2000   #2208   #3439   #4564   #4185   ",
	"reviewcount": "1 Review sorted by",
	"description": "I’m aware of despair, however forgiveness saved meー!\n\n“Incompetent”ーーWhen God bestows you “Magic” but you can’t use it, you’ll be the object of contempt and the outlet of malice. The family-less youth Rhode was called “Incompetent”, and for some reason he chose to end his life by his own hands.\n\nBut from the bottom of that despair, he had a fateful meeting with the Ancient King “Crown” and the demon girl “Levi”, Rhode then learns of the real “Magic” given to him. And by conversing with the two who had lived for a long time, the concept for “Incompetent” was really nonexistent and he noticed that someone may have planted the hatred for the “Incompetent”.\n\nAfter separating from Crown, Rhode advances to his new life with Levi.\n\nHe had decided to fight the malice that is objected to the “Incompetent” without shedding any blood.It was gentle but long ragged method, to make the people understand by themselves that each and everyone of themselves are also “Incompetent”.\n\nA young lad who was called “Incompetent” challenges the world, the heroic tale of forgiveness and salvation now beginsー!>"
}