{
	"url": "https://www.novelupdates.com/series/delicate-female-supporting-role-a-and-tyrant-male-protagonist-o/",
	"title": "Delicate Female Supporting Role A and Tyrant Male Protagonist O - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/04/Delicate-Female-Supporting-Role-A-and-Tyrant-Male-Protagonist-O.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Drama   Fantasy   Mature   Romance   ",
	"tags": "Beautiful Female Lead   Calm Protagonist   Clever Protagonist   Clingy Lover   Cold Love Interests   Early Romance   Family Business   Female Master   Female Protagonist   Handsome Male Lead   Love Interest Falls in Love First   Marriage   Modern Day   Mpreg   Older Love Interests   Omegaverse   Power Couple   System Administrator   Transmigration   Wealthy Characters   ",
	"rating": "(4.2 / 5.0, 75 votes)",
	"author": "松花酿   ",
	"year": "\n2022",
	"ranking": "#584   #1670   #4938   #1219   #5775   ",
	"reviewcount": "9 Reviews sorted by",
	"description": "     \n     Forever dedicated to the laboratory, Qiao Mo, who had exhausted her mental power and died, transmigrated into the female supporting role of a sadomasochistic novel. That female supporting role is vain, superficial and stupid, whom everyone hates.\n\n    \n   The female supporting role counterattack system that got bounded to Qiao Mo encouraged her, “Host, it’s time to prove that you have the legendary transmigrator halo, become a successful female supporting role in your career and love, and reach the pinnacle of your life. You can do it.”\n\n  \n     Lying on the luxurious big bed, counting the several months salary while eating seafood freshly transported by air, Qiao Mo said, “I don’t want to work hard anymore. People get teeth problems when they are old, and soft rice is still the most delicious.”\n\n\n       Seeing that Bai Yueguang was about to return to China, the system urged Qiao Mo, “Host, using the training volume ‘Little Three Substitute Training Volume' will allow you to crush Bai Yueguang in all directions and become Mrs. Jian who is envied by everyone.”\n\n\n      Qiao Mo, “I am a very delicate person, so you should enjoy this training volume yourself.”\n\n  \n     Bai Yueguang finally returned to China, and Qiao Mo planned to take the opportunity to ask for a sum of hush money, so that she could happily retire.\n\n\n      Unexpectedly, when the door of Jian Luozhi’s room was pushed open, a strong fragrance assaulted her face, and Qiao Mo was immediately stunned.\n\n\n    Something seems wrong???\n\n\n    This turned out to be a world of abo. The boss, Jian Luozhi was actually a weak omega, and she was actually an alpha!\n\n\n    Jian Luozhi always acted resolutely and was steadfast. He was indifferent towards everything, and everyone in the business world was afraid of him. He did not match the image of an omega at all, so no one ever doubted his identity.\n\n\n    Until that day when his pheromones got out of control, and Qiao Mo rashly pushed open the door.\n\n\n    Looking at the alpha who pretended to be a pure, innocent, docile and well-behaved omega at the door, Jian Luozhi closed his eyes and sneered, he had miscalculated.\n\n\n    No matter what the intention of this alpha disguised as a omega is, Jian Luozhi had the confidence to control the other party.\n\n\n    Jian Luozhi never imagined that a long time later, he would take omega bridal courses for Qiao Mo and learn how to grow flowers and even cook.\n\n\n    In order to please Qiao Mo, he will secretly ask other omega wives for tricks.\n\n\n    Because he was worried that he was not a good omega, he tried to learn each and every art that a omega should know, trying to become the perfect omega that could attract Qiao Mo.\n\n\n[A delicate and beautiful salted fish FL X A fake gaoling flower ML yearning for love]\n\n    Ps:  Female A, Male O, no counterattack, no female attacking boys\n\nEating soft rice means that person is relying on someone to feed him/ in short a kept person\n\nA salted fish is a metaphor for a person who has no intension of doing anything.\n\nA gaoling flower is a metaphor for a cool handsome/ pretty guy out of reach to ordinary/most people.>"
}