{
	"url": "https://www.novelupdates.com/series/crossing-to-the-future-its-not-easy-to-be-a-man/",
	"title": "Crossing to the Future, it’s Not Easy to Be a Man - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/02/Crossing-to-the-Future-its-Not-Easy-to-Be-a-Man.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Comedy   Gender Bender   Josei   Martial Arts   Mecha   Sci-fi   ",
	"tags": "Accelerated Growth   Adapted to Manhua   Age Progression   Androgynous Characters   Army   Army Building   Artificial Intelligence   Battle Academy   Beautiful Female Lead   Body Tempering   Brotherhood   Calm Protagonist   Caring Protagonist   Cautious Protagonist   Character Growth   Charismatic Protagonist   Cheats   Clever Protagonist   Cold Protagonist   Cosmic Wars   Cross-dressing   Cultivation   Cunning Protagonist   Dense Protagonist   Determined Protagonist   Doting Parents   Evil Organizations   Fast Cultivation   Fast Learner   Female Protagonist   Forced Living Arrangements   Friendship   Futuristic Setting   Genius Protagonist   Handsome Male Lead   Hard-Working Protagonist   Harsh Training   Heroes   Hiding True Abilities   Late Romance   Love Interest Falls in Love First   Loyal Subordinates   Male Yandere   Military   Misunderstandings   Nationalism   Near-Death Experience   Outer Space   Personality Changes   Politics   Possessive Characters   Protagonist Strong from the Start   Reincarnation   Romantic Subplot   Ruthless Protagonist   Shounen-Ai Subplot   Slow Romance   Soldiers   Special Abilities   Strong to Stronger   Time Skip   Underestimated Protagonist   ",
	"rating": "(4.5 / 5.0, 948 votes)",
	"author": "Madam Ru   汝夫人   ",
	"year": "\n2013",
	"ranking": "#1108   #416   #256   #5147   #657   ",
	"reviewcount": "132 Reviews sorted by",
	"description": "After dying from a strange terminal illness, Ling Lan was reborn into a world 10,000 years into the future. Although she dearly wished she could just live a peaceful and uneventful life in her new healthy body, fate had other plans…\n\nForced to disguise herself as a boy just so she could inherit her deceased father’s premium military benefits, Ling Lan’s journey to adulthood was full of challenges. After much difficulty, she finally turned sixteen when she could drop the charade. But before she could grasp her newfound freedom to get married and start her own family, a twist of fate results in her being thrown into the Federation’s top military boys’ school.\n\nWith these twists of fate, Ling Lan had little choice but to walk further and further down a path of no return, one of cold and aloof dominance...>"
}