{
	"url": "https://www.novelupdates.com/series/the-daily-life-of-being-the-campus-idols-fake-boyfriend/",
	"title": "The Daily Life of Being the Campus Idol’s Fake Boyfriend - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2017/09/cifb1.jpg",
	"noveltype": "(CN)",
	"genre": "Romance   School Life   Yaoi   ",
	"tags": "Adapted to Drama CD   Cold Protagonist   College/University   Doting Love Interests   First-time Interc**rse   Handsome Male Lead   Heartwarming   Misunderstandings   Modern Day   Multiple POV   Music   Possessive Characters   Pretend Lovers   Protagonist Falls in Love First   Roommates   Schemes And Conspiracies   Twins   ",
	"rating": "(4.4 / 5.0, 325 votes)",
	"author": "Xi He Qing Ling   羲和清零   ",
	"year": "\n2017",
	"ranking": "#4617   #4189   #1669   #1703   #664   ",
	"reviewcount": "57 Reviews sorted by",
	"description": "The year he was fifteen, Ling Ke realized he was gay, and that he fell in love with a hot guy the same gender he was! Ling Ke spied on the other’s online friend group, paid attention to that person’s every move, and privately, started his fanatical fan-boying actions. Unfortunately, the hot guy he liked was someone who changed girlfriends like he changed clothes, a pretentious and straight male.\n\nA few years later, Ling Ke and the hot guy he was secretly in love with got into the same university and became good friends. In order to prevent his beloved from hating him, Ling Ke repressed his true feelings and forced himself to pretend to be a 24k, pure gold straight guy.\n\n……\n\nHaving high-spec looks, Qi Feng was a networking expert, but in order to preserve his all-around shining and popular heartthrob image, he always hid his true sexuality, that he was gay. He got himself (fake) girlfriends all throughout school, literally playing himself into being branded as a skirt-chaser.\n\nUntil one day, he met his true love. The other looked delicate and gentle, cold and out-of-reach, as if the ideal lover he’d dreamed of in his heart.\n\nExcept, there was just one thing. That guy also looked completely straight……\n\n In short, this is the love story of two scared, in-the-closet gay guys pretending to be straight while mutually trying to feel the other out.>"
}