{
	"url": "https://www.novelupdates.com/series/rebirth-of-an-idle-noblewoman/",
	"title": "Rebirth of an Idle Noblewoman - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/01/Rebirth-of-an-Idle-Noblewoman.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Comedy   Drama   Fantasy   Josei   Martial Arts   Romance   School Life   Sci-fi   Xuanhuan   ",
	"tags": "Artists   Beautiful Female Lead   Business Management   Celebrities   Cheats   Cold Love Interests   Cultivation   Cunning Protagonist   Daoism   Devoted Love Interests   Female Protagonist   Friendship   Genius Protagonist   Love Interest Falls in Love First   Pets   Protagonist Strong from the Start   Revenge   Second Chance   Slow Romance   Smart Couple   System Administrator   ",
	"rating": "(3.7 / 5.0, 53 votes)",
	"author": "Road of Flowers   Yīlù Fán Huā   一路烦花   ",
	"year": "\nN/A",
	"ranking": "#6970   #6203   #5945   #13807   #7136   ",
	"reviewcount": "15 Reviews sorted by",
	"description": "She was the illegitimate daughter of the Gu family from N City, and a gloomy coward in everyone’s eyes. \r\n\r\nShe was an unparalleled genius in the finance world, controlling the market as if she could foresee the future. \r\n\r\nShe was an inheritor of ancient medical arts, healing wounds and growing flesh on bones with a single golden needle. \r\n\r\nA legend in the ancient martial artist world, the goddess of the entertainment industry, a master of Chinese arts… \r\n\r\nShe was dazzling and talented, but also cool, calculating and aloof! \r\n\r\nHer origins were a mystery… \r\n\r\nAs her origins are slowly uncovered, see how she takes up responsibility, and writes a brilliant page in history! \r\n\r\nIn her past life, she was reduced to an abandoned daughter by her family, and now that she was reborn, she’ll do all she can to change the fate of her and the ones she cares about, showing off and dealing with her enemies like flies on the way. \r\n\r\n--- \r\n\r\nHe was mysterious and dignified, an enigma who was the strongest in the ancient martial arts world. \r\n\r\nHe was the leader of a mysterious organization in China, killing cold-bloodedly without batting an eyelash. \r\n\r\nWhen the cool and enigmatic meets the cold-blooded, watch the show unfold! \r\n\r\n--- \r\n\r\n“Miss, I see there is a shadow on your forehead, and there shall be misfortune in your future.” \r\n\r\n“...Let me tell you now, that is my mommy and not yours, so you better not appear in front of her! It’s extremely easy for me to make a person disappear in this city….” \r\n\r\nNot soon after, a certain beautiful Miss Gu stood in front of her with a smile. “I’ve never even looked that family of yours in the eye, but...This Imperial Capital is my territory!” \r\n\r\n--- \r\n\r\nMr. Jiang’s quotes: \r\n\r\nYou’re in charge of being pretty and having a good time, I’m in charge of providing for the family. \r\n\r\nI like her, not someone that looks like her, nor someone that acts like her. I won’t like anyone if it’s not her! \r\n\r\nIf you bully her, I will...Destroy this world… \r\n\r\n--- \r\n\r\nTLDR: The female lead’s road to greatness after getting a system by accident. \r\n\r\n>"
}