{
	"url": "https://www.novelupdates.com/series/top-tier-providence-secretly-cultivate-for-a-thousand-years/",
	"title": "Top Tier Providence, Secretly Cultivate for a Thousand Years - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/08/Top-Tier-Providence-Secretly-Cultivate-for-a-Thousand-Years.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Comedy   Harem   Martial Arts   Romance   Xianxia   ",
	"tags": "Adapted to Manhua   Age Progression   Animal Rearing   Apathetic Protagonist   Buddhism   Calm Protagonist   Cautious Protagonist   Character Growth   Charming Protagonist   Cosmic Wars   Cultivation   Cunning Protagonist   Curses   Dao Companion   Dao Comprehension   Demons   Determined Protagonist   Enemies Become Allies   Fast Cultivation   Fast Learner   Ghosts   God Protagonist   Handsome Male Lead   Heaven   Heavenly Tribulation   Hell   Hiding True Abilities   Hiding True Identity   Immortals   Level System   Low-key Protagonist   Magic Formations   Male Protagonist   Master-Disciple Relationship   Multiple Identities   Multiple POV   Multiple Realms   Multiple Reincarnated Individuals   Overpowered Protagonist   Polygamy   Pragmatic Protagonist   Pregnancy   Proactive Protagonist   Romantic Subplot   Ruthless Protagonist   Saints   Schemes And Conspiracies   Slow Romance   Strong to Stronger   Summoning Magic   Sword Wielder   System Administrator   Time Skip   Timid Protagonist   Underestimated Protagonist   Weak to Strong   ",
	"rating": "(4.0 / 5.0, 168 votes)",
	"author": "Let me laugh   Ren Wo Xiao   任我笑   ",
	"year": "\n2021",
	"ranking": "#549   #974   #3374   #6189   #5402   ",
	"reviewcount": "56 Reviews sorted by",
	"description": "Being reincarnated in a cultivation world, Han Jue realizes that he can live his life like a video game. He can reroll his cultivation potential and connate providence.\n\nSo, he spends 11 years rerolling for a good one…\n\n[Unparalleled: Immortal beauty, top-notch charm]\n\n[Destined Sword Fanatic: Top-notch Sword Dao aptitude, top-notch Sword Dao comprehension]\n\n[Unparalleled Movement Technique: Top-notch movement technique aptitude]\n\n[Descendant of the Immortal Emperor: You will receive an unparalleled cultivation technique and 1,000 superior-grade spirit stones]\n\nIn pursuit of longevity, Han Jue decides to cultivate in a low-profile manner.\n\nA thousand years later, generations of cultivators have become history.\n\nThat is when the Immortal Realm decides to clean up the mortal world. So, Han Jue finally has no choice but to take action.\n\nThen he realizes, deities and gods aren’t that powerful after all!>"
}