{
	"url": "https://www.novelupdates.com/series/i-like-the-man-who-is-said-to-be-the-villain/",
	"title": "I Like The Man Who Is Said To Be The Villain - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/10/I-Like-The-Man-Who-Is-Said-To-Be-The-Villain.jpg",
	"noveltype": "(CN)",
	"genre": "Adult   Adventure   Comedy   Romance   Shounen Ai   ",
	"tags": "Animal Rearing   Apocalypse   Calm Protagonist   Cold Love Interests   Cute Protagonist   Doctors   Family Conflict   Farming   Handsome Male Lead   Healers   Love at First Sight   Magical Space   Manly Gay Couple   Mob Protagonist   Modern Day   Proactive Protagonist   Protagonist Falls in Love First   Shameless Protagonist   Slow Romance   Soldiers   Special Abilities   Straight Seme   Survival   Transmigration   Weak to Strong   Zombies   ",
	"rating": "(3.9 / 5.0, 42 votes)",
	"author": "一曲日水吉   ",
	"year": "\n2020",
	"ranking": "#3633   #2493   #6146   #4537   #5971   ",
	"reviewcount": "10 Reviews sorted by",
	"description": "Su Yunxi read a post-apocalyptic novel, and fell in love with the super invincible villain named Yu Bai. The poor villain was the one who defended his family and the country, but he was the one whose reputation got dirty, the one who was beaten by the pig’s feet (the protagonists in the book). It was him who made a room for the pig’s feet, and he was also the one who was almost killed. In short, he only moved the bricks in the full text (only need to work). The pig’s feet were like two leeches biting on him, sucking his blood and eating his meat and wanting to kill him.\n\nSu Yunxi’s whole person was in chaos, what about the good villain, what about the bad protagonist?.\n\nHe opened Du Niang (aka Baidu) and searched the definition of villain, “refers to those who are opposed to the positive characters, representatives of evil images, or incompatible with the protagonist in the story”. \n\n    Seeing the last sentence, Su Yunxi felt like he had realized something, “I’m falling, so the so-called villain just because it doesn’t deal with the protagonist, he has a reputation as a villain”.\n\nSu Yunxi, who was distressed, grabbed his heart and pressed his mouth flatly, and then a long theoretical comment would put him down, sent him to the world of the book. He just opened his eyes and Yu Bai was standing in front of him. The man he loved was now in front of him,” How can I get the other party’s attention and get a good impression”.>"
}