{
	"url": "https://www.novelupdates.com/series/transmigrated-into-a-beast-tribe/",
	"title": "Transmigrated into a Beast Tribe - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/03/Transmigrated-into-a-Beast-Tribe.jpg",
	"noveltype": "(CN)",
	"genre": "Adventure   Fantasy   Romance   Slice of Life   Supernatural   Yaoi   ",
	"tags": "Animal Characteristics   Beastkin   Beasts   Calm Protagonist   Caring Protagonist   Childcare   Clan Building   Cooking   Devoted Love Interests   Doting Love Interests   Early Romance   Gods   Heartwarming   Love at First Sight   Love Interest Falls in Love First   Modern Knowledge   Mpreg   Multiple Transported Individuals   Pragmatic Protagonist   Shapeshifters   Strong Love Interests   Transmigration   Transported to Another World   Tribal Society   Tsundere   Weak Protagonist   World Travel   ",
	"rating": "(4.0 / 5.0, 231 votes)",
	"author": "Purple Thorns   紫色荆棘   ",
	"year": "\n2012",
	"ranking": "#3133   #2926   #1250   #1421   #1119   ",
	"reviewcount": "55 Reviews sorted by",
	"description": "Lin Mu was pushed down the cliff, but he did not die and arrived in a magical world instead.\n \nA huge python with wings and the ability to fly. Alright, just think of it as the legendary Mayan Snake God;\n \nA gigantic centipede that can fly in the sky, alright, he's kinda seen it before in 'Journey to the West';\n \nA mighty big wolf with a body as humongous as an elephant, en, just think of it as a mutant;\n \n..\n \nAlthough the animals in front of him were a little strange, they were still animals. Why did all of you suddenly turn into humans? Coming across wild beasts, Lin Mu could still accept it, but coming across ‘*yāojing’, Lin Mu became.... excited instead. What? You guys are the infamous drifter beastmen. I don’t know anything about that. Did you guys commit a lot of heinous crimes? I don’t see that either.\n \nAnd so, Lin Mu began a hard but satisfying life of building a home in another world.\n \n*Yāojing/妖精 doesn’t have a proper English equivalent word. The nearest meaning would be 'supernatural being' or 'Yokai' (Japanese).>"
}