{
	"url": "https://www.novelupdates.com/series/transmigrating-i-married-the-male-protagonists-uncle/",
	"title": "Transmigrating: I Married the Male Protagonist’s Uncle - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/09/Transmigrating-I-Married-the-Male-Protagonist39s-Uncle.jpg",
	"noveltype": "(CN)",
	"genre": "Drama   Fantasy   Josei   Romance   Supernatural   ",
	"tags": "Abandoned Children   Acting   Adopted Protagonist   Amnesia   Beautiful Female Lead   Celebrities   Childcare   Cohabitation   Cultivation   Cute Children   Devoted Love Interests   Doting Love Interests   Familial Love   Family Conflict   Famous Parents   Fated Lovers   Female Protagonist   Ghosts   Handsome Male Lead   Heavenly Tribulation   Lovers Reunited   Marriage   Misunderstandings   Modern Day   Multiple Timelines   Multiple Transported Individuals   Mysterious Past   Older Love Interests   Parallel Worlds   Past Plays a Big Role   Power Couple   Pregnancy   Previous Life Talent   Schemes And Conspiracies   Showbiz   Sister Complex   Special Abilities   Spirits   Strong Love Interests   Time Manipulation   Transmigration   Wealthy Characters   ",
	"rating": "(3.2 / 5.0, 21 votes)",
	"author": "Tian Qiqi   甜七柒   ",
	"year": "\n2019",
	"ranking": "#6970   #2000   #7593   #5457   #8118   ",
	"reviewcount": "8 Reviews sorted by",
	"description": "The headlines bring shocking and mind-boggling news. \r\n\r\n'Ling Sheng boarded Movie King Huo Ci's sports car, and the duo are suspected to be dating!' \r\n\r\n'Huo Ci and Ling Sheng entered and left the same condominium. They are confirmed to be staying together.' \r\n\r\n'Screw off, these blind bastards. He's my biological father!' \r\n\r\nThird Master Jun, likewise, reacts with a similar reaction. He spits. 'Whoever posted these will be blacklisted, never to be seen again in the media industry! I shall see who else has the guts to spread rumors about my wife and father-in-law.' \r\n\r\nThird Master Jun is the most affluent man on earth and this places him at the apex of the world order. However, he is troubled by the fact that the Movie King Huo Ci, despite only being a few years older than him, is his father-in-law.>"
}