{
	"url": "https://www.novelupdates.com/series/they-said-my-status-stayed-the-same-even-though-i-reincarnated-in-another-world/",
	"title": "They Said My Status Stayed the Same Even Though I Reincarnated in Another World!? - Novel Updates",
	"image": "https://www.novelupdates.com/img/noimagefound.jpg",
	"noveltype": "(JP)",
	"genre": "Adventure   Comedy   Fantasy   Gender Bender   Harem   School Life   Yuri   ",
	"tags": "Academy   Age Progression   Beast Companions   Beastkin   Beautiful Female Lead   Doting Older Siblings   Elemental Magic   Female Protagonist   Game Elements   God-human Relationship   Goddesses   Godly Powers   Gods   Lack of Common Sense   Loli   Magic Beasts   Magical Technology   Male to Female   Multiple Reincarnated Individuals   Nobles   Overpowered Protagonist   Protagonist Strong from the Start   Reincarnated in Another World   Reincarnation   Siblings   Strong Love Interests   Strong to Stronger   Sword And Magic   Sword Wielder   Vampires   ",
	"rating": "(3.3 / 5.0, 116 votes)",
	"author": "Roumu Kohaku   桜霧琥珀   ",
	"year": "\n2018",
	"ranking": "#2000   #6376   #1372   #1410   #2513   ",
	"reviewcount": "12 Reviews sorted by",
	"description": "One day, a 10-year-old girl, named Fari von Dazzwell remembered that she was once a man named “Nanjou Yukiho” from Japan.\n\nAlthough they said, “The status will stay the same even though you’ll reincarnate in another world.” Fari actually has an exceptional magical gift. On top of that, she was a noble’s daughter. They said nothing would change, but just about everything was different!\n\nBecause of her talent, her father made her take the Royal Academy's assessment test.\n\nDuring her entrance exam, she made friends with a mysterious blonde girl named Rigurett.\n\nHowever, as soon as she got into the school, her life got much more hectic.\n\nFari just wanted a normal life, but every day she is just too busy!\n\nThis is the story of a girl named Fari who used to be Nanjou Yukiho living in a world filled with swords and magic, called Phantasm.>"
}