{
	"url": "https://www.novelupdates.com/series/im-a-neet-but-when-i-went-to-hello-work-i-got-taken-to-another-world/",
	"title": "I’m a NEET but When I Went to Hello Work I Got Taken to Another World (LN) - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/12/hellowork.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Comedy   Fantasy   Harem   Martial Arts   Mature   Romance   Shounen   Slice of Life   ",
	"tags": "Adapted to Manga   Adventurers   Average-looking Protagonist   Battle Competition   Beastkin   Cautious Protagonist   Cheats   Cooking   Cowardly Protagonist   Dragons   Elemental Magic   Elves   Fantasy World   First-time Interc**rse   Game Elements   Gods   Harem-seeking Protagonist   Healers   Heterochromia   Hidden Abilities   Hiding True Abilities   Hiding True Identity   Human-Nonhuman Relationship   Kind Love Interests   Level System   Love Interest Falls in Love First   Male Protagonist   Marriage   Multiple POV   Older Love Interests   Polygamy   R-15   Righteous Protagonist   S*aves   Special Abilities   Sword And Magic   Threesome   Transported to Another World   Wars   Weak to Strong   Younger Love Interests   ",
	"rating": "(3.8 / 5.0, 483 votes)",
	"author": "Katsura Kasuga   ",
	"year": "\n2013\r\n",
	"ranking": "#5262   #3524   #319   #1089   #158   ",
	"reviewcount": "48 Reviews sorted by",
	"description": "The NEET Yamano Masaru (23 years old) went to Hello Work and found an interesting job offer. [A sword and sorcery fantasy, test play for Miniature Garden of Razgrad. Extended period of time, preferred to be able to live on site. Monthly salary of 250,000+]. He immediately went to the interview and signed a contract.\r\n\r\nHowever, the place of employment is in another world. Because of the contract, he’s taken there, and in order to survive, Masaru received a cheat but is told the shocking truth.\r\n\r\n“This world will be destroyed in 20 years.”\r\n\r\nCan a simple NEET prevent the destruction of the world!?>"
}