{
	"url": "https://www.novelupdates.com/series/even-though-im-a-former-noble-and-a-single-mother-my-daughters-are-too-cute-and-working-as-an-adventurer-isnt-too-much-of-a-hassle/",
	"title": "Even Though I’m a Former Noble and a Single Mother, My Daughters Are Too Cute and Working as an Adventurer Isn’t Too Much of a Hassle - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/03/My-Daughters-Are-Too-Cute-and-Working-as-an-Adventurer.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Comedy   Drama   Fantasy   Slice of Life   ",
	"tags": "Adapted to Manga   Adventurers   Beautiful Female Lead   Betrayal   Broken Engagement   Childcare   Dense Protagonist   Depictions of Cruelty   Doting Parents   Dragons   Empires   Eye Powers   Fallen Nobility   Famous Protagonist   Female Protagonist   Heterochromia   Immortals   Magical Space   Manipulative Characters   Mature Protagonist   Nobles   Overpowered Protagonist   Pregnancy   R-15   Royalty   Single Parent   Special Abilities   Sword And Magic   Sword Wielder   Twins   Villainess Noble Girls   ",
	"rating": "(3.6 / 5.0, 256 votes)",
	"author": "Taikoban   大小判   ",
	"year": "\n2017",
	"ranking": "#4617   #4113   #604   #1397   #504   ",
	"reviewcount": "31 Reviews sorted by",
	"description": "The noble class that treats those born with white hair or heterochromia as treacherous snakes, Shirley was born into the family of the most powerful duke in the land adorned with stunning hair the colour of snow, and non-matching red and blue eyes.\r\n\r\nHated by her own family, and having the only man who she ever loved snatched away by a jealous younger sister on her wedding night, she is imprisoned on false charges.\r\n\r\nEnduring torture and humiliation, she vowed to take revenge against those who wronged her. But, even though she escaped, in her belly there was the child of her former fiancée.\r\n\r\nEven if the man himself is hateful, an unborn child is without sin. After giving birth to healthy twins, she thought to leave them at an orphanage for safekeeping, but…\r\n\r\n“Ah, what to do, my daughters are just too cute.”\r\n\r\nShirley was floored by the feelings she held for the two girls she had brought into the world. Choosing motherhood over revenge, she fled the Empire and settled in a remote town in the neighbouring Kingdom. In order to support her children, she found herself entering through the doors of the Adventurers Guild. It would be nice if they could live a nice quiet life out here, where the empire won’t think to look for them…\r\n\r\n“Miss Shirley! Calamity-class monsters are appearing in the Kingdom! Can you help us!?”\r\n\r\n“I’m very sorry, but I have to decline. I’m helping my daughters with their homework today.”\r\n\r\nAfter ten years, she had somehow become known around the world over as “The Demonic White Sword”.>"
}