{
	"url": "https://www.novelupdates.com/series/the-righteous-players/",
	"title": "The Righteous Player(s) - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/01/The-Righteous-Players_1611401979.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Drama   Fantasy   Horror   Mystery   Supernatural   ",
	"tags": "Apathetic Protagonist   Calm Protagonist   Cold Protagonist   Cunning Protagonist   Curses   Depictions of Cruelty   Evil Gods   Game Elements   Game Ranking System   Gamers   Gods   Gore   Male Protagonist   Medieval   Monsters   Mystery Solving   Nobles   Overpowered Protagonist   Religions   Ruthless Protagonist   Sword And Magic   Sword Wielder   Transmigration   Transported into a Game World   Transported to Another World   Weak to Strong   ",
	"rating": "(3.9 / 5.0, 90 votes)",
	"author": "不祈十弦   ",
	"year": "\n2019",
	"ranking": "#604   #1193   #2658   #1653   #4875   ",
	"reviewcount": "14 Reviews sorted by",
	"description": "Annan transmigrated to a new world - the Land of Dense Fog. He had become a rare elite NPC who possessed the player’s system.\r\n\r\nHowever, he had the heart of a player.\r\n\r\nI like to stir up matters, and unbridled. But, I’m a kind player. The ally of justice who is favored by this world.\r\n\r\nI’m on a main mission. As the righteous player, I’m following my destiny to eradicate you, the evil NPC!\r\n\r\nDear player, I’d recommend you to stop running away. The mission is completed. I’m the righteous NPC now to punish you, the evil players...\r\n\r\n---\r\n\r\nIn the long dark night, the crimson moon hangs high in the sky.\r\n\r\nHoarse whisper patrols the streets. The brass steam engine is emitting blood mist.\r\n\r\nYour brain is in ecstasy; your eyes are enchanted.\r\n\r\nWith cracked skins, it sprouts new flesh.\r\n\r\nIn the gray mists, shirek cries come from the flesh wall that consumes thousands of corpses...\r\n\r\n“Stop crying, our players don’t bite. They just want to play with you.”\r\n\r\nThe Solitary Schemer, Number 1 Player, Land of Dense Fog’s Savior, Leader of 13 Saints, Friend of 12 Upright Deity, Pioneer King, “The Righteous One,” Gatekeeper of Forth Disaster, Crownless Deity, the great Annan advised kindly.>"
}