{
	"url": "https://www.novelupdates.com/series/im-in-marvel-my-wife-is-godking-hela/",
	"title": "I’m in Marvel, My Wife Is Godking Hela - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/05/Im-in-Marvel-my-wife-is-Godking-Hela.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Comedy   Fantasy   Romance   Sci-fi   ",
	"tags": "Antihero Protagonist   Based on a Movie   Beautiful Female Lead   Cheats   Clingy Lover   Complex Family Relationships   Doting Love Interests   Evil Gods   Evil Organizations   Fanfiction   Game Elements   God-human Relationship   God Protagonist   Goddesses   Godly Powers   Gods   Heroes   Lack of Common Sense   Love at First Sight   Male Protagonist   Marriage   Money Grubber   Mutated Creatures   Mutations   Nationalism   Outer Space   Overpowered Protagonist   Parallel Worlds   Playful Protagonist   Power Couple   Reincarnation   Romantic Subplot   Saving the World   Strength-based Social Hierarchy   Strong Love Interests   Unconditional Love   Villainess Noble Girls   Weak to Strong   ",
	"rating": "(3.4 / 5.0, 59 votes)",
	"author": "Eat the soil for a thousand years   吃土千年   ",
	"year": "\n2018",
	"ranking": "#1380   #2000   #3020   #8227   #7233   ",
	"reviewcount": "13 Reviews sorted by",
	"description": "Reborn in the Marvel world, Ye Bai just wanted to be a quiet copywriter at first. I just want to spend my life with my lovely wife Hela every day, but there are always troublesome troubles that keep coming to the door.\r\n\r\nSince Ye Bai had a sign-in system, he would get special rewards every day.\r\n\r\n'Kryptonion General Zod’s body template.'\r\n\r\n'Shenzhou Tablet, Cunjin Kaitian.'\r\n\r\n'Silver rank, The god of the world.'\r\n\r\n'Infinite power, the heart of the universe.'\r\n\r\n....\r\n\r\n'Odin, I'll give you another chance. Do you agree with Hela's and my marriage?.'\r\n\r\n'Thanos, are you coming to the earth to do something?'\r\n\r\n'Galactus. The shame of the five great gods. You quickly get lost for this Lord .'\r\n\r\n'Life Court, you are not qualified to judge me.'>"
}