{
	"url": "https://www.novelupdates.com/series/warriors-promise/",
	"title": "Warrior’s Promise - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2018/10/promise3.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Harem   Martial Arts   Xuanhuan   ",
	"tags": "Arrogant Characters   Artifact Crafting   Artifacts   Beast Companions   Beautiful Female Lead   Betrayal   Bloodlines   Body Tempering   Calm Protagonist   Cultivation   Dao Comprehension   Demonic Cultivation Technique   Demons   Devoted Love Interests   Dragons   Early Romance   Enlightenment   Famous Protagonist   Fast Cultivation   First-time Interc**rse   Genius Protagonist   Gods   Handsome Male Lead   Hard-Working Protagonist   Inheritance   Long Separations   Magic Formations   Magical Space   Male Protagonist   Marriage   Martial Spirits   Multiple Realms   Older Love Interests   Polygamy   Popular Love Interests   R*pe Victim Becomes Lover   Reincarnated in Another World   Resurrection   Revenge   Romantic Subplot   R*pe   Ruthless Protagonist   Sentient Objects   S*xual Cultivation Technique   Slow Romance   Strength-based Social Hierarchy   Strong Love Interests   Transplanted Memories   Underestimated Protagonist   Unique Cultivation Technique   Wars   Weak to Strong   ",
	"rating": "(2.4 / 5.0, 63 votes)",
	"author": "Baili Longxia   百里龙虾   ",
	"year": "\n2016",
	"ranking": "#2000   #2000   #4030   #1457   #9787   ",
	"reviewcount": "10 Reviews sorted by",
	"description": "The course of commitments never did run smooth.\n\nAfter dying on Earth, the King of Mercenaries is reborn as Su Mo in the Firmament and Continent. In this brand-new world, Martial Art is the way of life, and the strong set the rules.\n\nHaving awakened a Martial Soul of the lowest rank, possibly meaning he will never go far as a Martial Artist, Su Mo is determined to rise to the top again nonetheless.\n\nHowever, misfortunes never come singly. The love of his life is soon taken by one of the most powerful forces in the world. With no time to spare, watch as Su Mo overcomes all odds and struggle on the verge of death countless times, in order to meet his love again.\n\nAs the protagonist reaches the top in that world, he has to take on more responsibilities and face new challenges.\n\nFollow Su Mo on his relentless journey to become stronger for the sake of those important to him, and uncover the deep, dark secrets and plots in the vast universe.>"
}