{
	"url": "https://www.novelupdates.com/series/i-rely-on-poverty-to-sweep-through-survival-games/",
	"title": "I Rely On Poverty To Sweep Through Survival Games - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/06/D3A81212-B235-4494-BF03-A6E811610995.jpeg",
	"noveltype": "(CN)",
	"genre": "Action   Comedy   Drama   Mature   Mystery   Psychological   Supernatural   Yaoi   ",
	"tags": "Amnesia   Calm Protagonist   Clever Protagonist   Dense Protagonist   Devoted Love Interests   Doting Love Interests   Game Elements   Game Ranking System   Gore   Handsome Male Lead   Human-Nonhuman Relationship   Love Interest Falls in Love First   Lucky Protagonist   Male Yandere   Manly Gay Couple   Master-Servant Relationship   Modern Day   Multiple POV   Multiple Realms   Multiple Transported Individuals   Past Plays a Big Role   Poor Protagonist   Possessive Characters   Power Couple   Pragmatic Protagonist   Protagonist Strong from the Start   Saving the World   Schemes And Conspiracies   Shameless Protagonist   Slow Romance   Smart Couple   Straight Uke   Strong Love Interests   Strong to Stronger   Survival Game   Teamwork   Transported into a Game World   Unlimited Flow   Unlucky Protagonist   World Travel   ",
	"rating": "(4.5 / 5.0, 184 votes)",
	"author": "柏瑭   ",
	"year": "\nN/A",
	"ranking": "#2731   #2649   #942   #5295   #826   ",
	"reviewcount": "31 Reviews sorted by",
	"description": "Xiao Lan was a pauper who couldn’t do anything that required money.\n\nOn the road after work, he was engulfed by darkness and opened his eyes to a frightening and dangerous survival game.\n\nThe app that can’t be deleted; the people it locked on to were unable to escape except through death.\n\nOrdinary players: Save me, I don’t want to die!!!\n\nXiao Lan: Sorry, the phone is too broken and it froze. Can you wait a little longer?\n\nA hand reached out from inside an old-fashioned television; the people caught would enter its world.\n\nOrdinary players: Ahhhhhhh! What to do?!\n\nXiao Lan: According to my many years of experience repairing old household appliances, it seems that this model can be opened like this…\n\nFinally, the bosses gathered around Xiao Lan one day, prepared to deal with this (game) bug.\n\nBut they saw him roll up his sleeves and stride forward on long legs, and he beat up the bosses until they doubted their ghostly births.\n\nXiao Lan: Do you think an overtime worker’s night travels are for nothing?\n\nLuo: Sir is always this cute.\n\nPasser-by (shivering): Isn’t your definition of cute a little strange…>"
}