{
	"url": "https://www.novelupdates.com/series/sairin-yuusha-no-fukushuu-hanashi/",
	"title": "Sairin Yuusha no Fukushuu Hanashi - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2017/04/CxRm6F6UQAAkC-z.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Drama   Ecchi   Fantasy   Psychological   Romance   Seinen   Tragedy   ",
	"tags": "Adapted to Manga   Beautiful Female Lead   Betrayal   Death of Loved Ones   Demon Lord   Depictions of Cruelty   Dungeons   Enemies Become Allies   Former Hero   Friends Become Enemies   Game Elements   Human-Nonhuman Relationship   Late Romance   Male Protagonist   Personality Changes   Protagonist Strong from the Start   R-15   Revenge   R*pe   Ruthless Protagonist   Schemes And Conspiracies   Sword And Magic   Time Travel   Transported to Another World   ",
	"rating": "(3.6 / 5.0, 271 votes)",
	"author": "Usaki Usagi   Yoru No Usagi   夜之兎   羽咲うさぎ   ",
	"year": "\n2015",
	"ranking": "#2318   #3825   #1166   #5505   #344   ",
	"reviewcount": "41 Reviews sorted by",
	"description": "High school student Amatsuki Iori was summoned to a different world to fight as a brave of salvation, but whilst he was trying to save the world, he ends up being killed by the companions whom he wholeheartly believed in.\n\nIt was then, when Iori thought that he already died, he came to his senses only to find that he was re-summoned to the same world, but in the future.\n\nBack again as a brave to subjugate the demon king which his former self had failed to defeat previously...\n\nThen, he noticed, that among the guys who ordered him to fight as a brave, the figure of one of his former comrades could be seen.\n\n「……I will make you regret having betrayed me.」\n\nA girl then appears before him as he is consumed by hatred, but not any ordinary girl - she is the former demon king who is also aiming to take revenge.\n\nThe brave man who abandoned his heroic ideals, exchanging them for a burning desire to take revenge and the former demon king who seems ready to join him in his new-found quest. >"
}