{
	"url": "https://www.novelupdates.com/series/destiny-unchain-online-i-became-a-vampire-girl-and-eventually-became-known-as-the-demon-king-of-blood/",
	"title": "Destiny Unchain Online ~I Became a Vampire Girl and Eventually Became Known as the “Demon King of Blood”~ - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/07/Destiny-Unchain-Online-I-became-a-vampire-girl-and-eventually-became-known-as-the-Demon-King-of-Blood.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Fantasy   Gender Bender   Sci-fi   ",
	"tags": "Adapted to Manga   Artificial Intelligence   Beastkin   Chuunibyou   Demon Lord   Dwarfs   Elves   Fantasy World   Female Protagonist   Guilds   Magic   Magic Beasts   Male to Female   MMORPG   Race Change   Unique Weapon User   Vampires   Virtual Reality   ",
	"rating": "(3.8 / 5.0, 23 votes)",
	"author": "Resn   ",
	"year": "\n2021",
	"ranking": "#1288   #2584   #10036   #6511   #8573   ",
	"reviewcount": "No Reviews",
	"description": "In the near future, full-dive VR technology is widely used in everyday life.\r\n\r\nVRMMORPG 'Destiny Unchain Online' ―― A perfect skill system without a leveling system, with an emphasis on player skill, and PvP. It is the release day of such a new VR game.\r\n\r\nAt the request of his father, the developer of the project, Mitsuki Kou descends into the world as a tester of a new human interface device.\r\nHowever, the next thing you know, he's a vampire girl...\r\n\r\nIn addition, he is unable to log out, and due to a glitch, he finds himself not in the first town, but in a remote forest...\r\nBelieving his father's words that his life is not in danger, he steps out to enjoy the game for the time being.\r\n\r\nHe trains himself, recruits friends to join his guild, and for some unknown reason, he ends up role-playing as a 'Noja Loli,' gaining popularity among viewers through the streaming function... Before long, Kou became famous as Crim-Luersheia, the 'Demon King of Blood.'\r\n\r\nAnd the effect of this on Kou's body in the real world――...>"
}