{
	"url": "https://www.novelupdates.com/series/transmigrated-back-into-the-female-lead-of-an-abusive-novel-and-have-a-he-with-the-villain/",
	"title": "Transmigrated Back Into the Female Lead of an Abusive Novel and Have a HE with the Villain - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/07/Transmigrated-Back-Into-the-Female-Lead-of-an-Abusive-Novel-and-Have-a-HE-with-the-Villain.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Fantasy   Romance   School Life   Sports   ",
	"tags": "Abandoned Children   Academy   Appearance Changes   Aristocracy   Beautiful Female Lead   Broken Engagement   Calm Protagonist   Charming Protagonist   College/University   Cooking   Cute Protagonist   Dense Protagonist   Devoted Love Interests   Female Protagonist   Handsome Male Lead   Love Interest Falls in Love First   Popular Love Interests   Slow Romance   Strong Love Interests   System Administrator   Tragic Past   Transmigration   Ugly to Beautiful   Wealthy Characters   ",
	"rating": "(3.5 / 5.0, 12 votes)",
	"author": "赵史觉   ",
	"year": "\n2021",
	"ranking": "#6970   #6382   #10083   #7150   #8100   ",
	"reviewcount": "2 Reviews sorted by",
	"description": "What should the experienced talent do when they transmigrate back into the female lead of an old, abusive, and dog blood novel?\n\nXie Zhiyi: Thanks for the invitation.\n\nOf course, the former greasy boss and the white lotus female pair were abused out of the sky.\n\nBesides the aforementioned operations, in order to gather enough system regulations of the million blackened value, you can also use the villain as a signal tower to absorb the experience value.\n\nThus, Xie Zhiyi found the big villain who had a terrible relationship with her in the past life, the crown prince of the Chi family.\n\nThe big villain had a fierce face: “What is it.”\n\nXie Zhiyi stretched out her hand: “Reconcile, right?”\n\nThe man who was still Bking last second instantly had reddened ears: “Who said you could touch my hand?”\n\n–\n\nIt is known that when in physical contact with the villain, the absorption flow rate can be as high as +10/sec.\n\nXie Zhiyi pondered: Wouldn’t it be faster to hug a little?\n\nSince Chi Lin does not allow any contact, she will go find someone else.\n\nLater, someone saw that the crown prince stopped the college’s newest goddess.\n\nChi Lin’s facial expression was fierce, but he lowered his head in front of her: “Still, there are faster ones…want one?”\n\n[An unemotional, sand carved beauty x an explosive tsundere who is jealous every day, secretly in love, and extremely supporting the biking]\nBking: a person who does cool things effortlessly, or everything they do is unusually cool>"
}