{
	"url": "https://www.novelupdates.com/series/my-outside-expression-is-different-from-my-inner-expression/",
	"title": "My Outside Expression Is Different From My Inner Expression - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/05/My-outside-expression-is-different-from-my-inner-expression.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Romance   Shounen Ai   Yaoi   ",
	"tags": "Businessmen   Charismatic Protagonist   Charming Protagonist   Childish Protagonist   Cold Love Interests   Cold Protagonist   Cunning Protagonist   Cute Protagonist   Devoted Love Interests   Disabilities   Doting Love Interests   Genius Protagonist   Handsome Male Lead   Love Interest Falls in Love First   Older Love Interests   Racism   Special Abilities   Tragic Past   Transmigration   Wealthy Characters   ",
	"rating": "(4.2 / 5.0, 72 votes)",
	"author": "弓青瀚   ",
	"year": "\n2019",
	"ranking": "#156   #275   #3969   #427   #4189   ",
	"reviewcount": "16 Reviews sorted by",
	"description": "\n\nLi Qingzhou, who had been sick for many years, died and was systematically bound to an old romance novel, where he became the villain.\n\nThis villain was beautiful, but had a gloomy personality and was wheelchair-bound with leg problems….\n\nLi Qingzhou bursts into tears and rolled on the ground crying, “I won’t do it! I refuse!”\n\nSystem: “Your leg will be fine as soon as you complete the mission.”\n\nLi Qingzhou sat back up: “What mission? I’ll take it!”\n\nThe task: Find a lover for the male protagonist’s uncle Liu Bohuai to prevent him from ending up alone.\n\nThen the system sent him into the book and left, but before leaving it threw a gold finger to Li Qingzhou, however it fell on the wrong person…..\n\nSince then, Liu Bohuai has been able to hear the voice in Li Qingzhou’s heart and see the mood bubbles rising from the top of his head.\n\n[A cold and beautiful demon lord with a heart of gold who is crazy but sick X a cultivated, elegant and noble man who no one dares to mess with and who believes in buddha like indifference]>"
}