{
	"url": "https://www.novelupdates.com/series/need-to-propose-to-seven-men-what-to-do/",
	"title": "Need to Propose to Seven Men What to Do! - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2018/04/af5a8cafjw1f4yjbouc1rj205k07sdg6.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adult   Adventure   Comedy   Drama   Harem   Martial Arts   Mature   Mystery   Psychological   Romance   Smut   Wuxia   Xianxia   Xuanhuan   Yaoi   ",
	"tags": "Acting   Adapted to Drama CD   Alchemy   Appearance Changes   Appearance Different from Actual Age   Beasts   Betrayal   Black Belly   Body Swap   Calm Protagonist   Charming Protagonist   Child Abuse   Childcare   Clever Protagonist   Cold Protagonist   Cruel Characters   Cultivation   Cunning Protagonist   Curses   Eidetic Memory   Episodic   God Protagonist   Godly Powers   Handsome Male Lead   Immortals   Interconnected Storylines   Love Interest Falls in Love First   Magic Formations   Male Yandere   Manipulative Characters   Multiple Timelines   Non-linear Storytelling   Obsessive Love   Playful Protagonist   Possessive Characters   Race Change   Reincarnation   Schemes And Conspiracies   Seduction   Selfish Protagonist   Seven Deadly Sins   Souls   Stoic Characters   Sword And Magic   System Administrator   Time Loop   Time Paradox   Time Skip   Time Travel   Transmigration   Transported to Another World   Twisted Personality   Yandere   ",
	"rating": "(4.6 / 5.0, 361 votes)",
	"author": "Long Qi   龙柒   ",
	"year": "\n2017",
	"ranking": "#789   #1232   #840   #942   #397   ",
	"reviewcount": "54 Reviews sorted by",
	"description": "Chu Mu Yun relied on his story of 《Demon Realm》 to become a one-hit-wonder in JJWXC, but he never expected that he, after writing out seven mental cases and abusing seven mental cases to death, would transmigrate into this shitty novel!\n\nWhat the hell was this system on the bracelet?\n\nAnd what the hell was this “either propose to seven men or suffer the taste of a tragic death under the hands of these seven people”?\n\nI had just wanted to write a novel to satisfy my bad interests, who would actually want to get tangled up with a bunch of mad dog sad*st crazies?>"
}