{
	"url": "https://www.novelupdates.com/series/abandoned-saintess-and-demon-slave/",
	"title": "Abandoned Saintess and Demon S*ave - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/11/Abandoned-Saintess-and-Demon-Slave.jpg",
	"noveltype": "(KR)",
	"genre": "Adult   Fantasy   Josei   Romance   Smut   ",
	"tags": "Alternate World   Calm Protagonist   Caring Protagonist   Charismatic Protagonist   Charming Protagonist   Cohabitation   Demons   Enemies Become Lovers   Fantasy Creatures   Fantasy World   Female Protagonist   First-time Interc**rse   Love Interest Falls in Love First   R-18   Saints   S*aves   Transported to Another World   Vampires   ",
	"rating": "(4.0 / 5.0, 21 votes)",
	"author": "Apt   앱트   ",
	"year": "\n2018",
	"ranking": "#2686   #3311   #8209   #6791   #5826   ",
	"reviewcount": "4 Reviews sorted by",
	"description": "Saintess Yoo Jinah, who came from another world, brought victory in the war against the demons.\r\n\r\nHer joy of being able to return home was short-lived; Jinah collapsed after being struck by the demon king's final blow\r\n\r\nAfter waking up from a death-like agony, she had no more divine power left and was abandoned after fulfilling her purpose.\r\n\r\nA year later, Jinah who was completely ignored and unable to return home, secluded herself in a lonesome place.\r\n\r\nShe learned that slavery, which she had abolished long ago, had been revived; demons were being secretly bought and sold as slaves. Yoo Jinah, who secretly participated in a slave auction, was reunited with the former demon general Varat Baal.\r\n\r\nEven if the world had abandoned her, Jinah still decided to bid on him for their sake—  the heinous demon Varat Baal could not be released.\r\n\r\nThe thought of living with Varat, who was infamous for his cruelty, made her worried sick.\r\n\r\nDespite Jinah's concerns, Varat, exuding a strangely sexy aura, approached her….\r\n\r\nLike this, the cohabitation life with a demon slave who was far too sexy for the saintess had begun.\r\n>"
}