{
	"url": "https://www.novelupdates.com/series/spring-trees-and-sunset-clouds/",
	"title": "Spring Trees and Sunset Clouds - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2017/09/stsc1.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Fantasy   Mystery   Romance   Shounen Ai   Slice of Life   ",
	"tags": "Ancient Times   Betrayal   Bickering Couple   Boss-Subordinate Relationship   Calm Protagonist   Carefree Protagonist   Caring Protagonist   Character Growth   Clever Protagonist   Complex Family Relationships   Depression   Disfigurement   Doting Love Interests   First-time Interc**rse   Handsome Male Lead   Hard-Working Protagonist   Heartwarming   Helpful Protagonist   Love Interest Falls in Love First   Male Yandere   Near-Death Experience   Older Love Interests   Past Plays a Big Role   Past Trauma   Pragmatic Protagonist   Royalty   Sickly Characters   Slow Romance   Strong Love Interests   Tragic Past   Transmigration   Transported to Another World   Ugly Protagonist   Weak Protagonist   ",
	"rating": "(4.5 / 5.0, 818 votes)",
	"author": "Wei Liang   未良   ",
	"year": "\n2011",
	"ranking": "#2283   #2272   #915   #693   #349   ",
	"reviewcount": "129 Reviews sorted by",
	"description": "An average, normal university student transmigrates into the royal family in another world, where he becomes one of the successors of the throne. Life in the palace is inevitably difficult though, what with all the scheming enemies around him. This man’s only wish in this world is to be able to protect his “younger brother,” and for that, he’ll do anything–whether by hook or by crook–to ensure his brother’s safety and have him succeed the throne.\n\nThe man never once expected, though, that the person whom he swears to protect would be the one to stab him in the back. He got locked in a dungeon where he was tortured for three years. And when he was on the brink of death, his body was thrown away into the river.\n\nWhen he wakes up, he finds himself in an eccentric and peaceful place, where everyone is suspiciously more than what they seem…\n\n[This is a story about recovery from trauma and finding happiness.]>"
}