{
	"url": "https://www.novelupdates.com/series/isekai-de-maou-wo-taoshite-nihon-ni-kaettekitara-chijou-ni-dungeon-ga-shutsugenshimashita/",
	"title": "Isekai de Maou wo Taoshite Nihon ni Kaettekitara, Chijou ni Dungeon ga Shutsugenshimashita - Novel Updates",
	"image": "https://www.novelupdates.com/img/noimagefound.jpg",
	"noveltype": "(JP)",
	"genre": "Fantasy   Romance   Shounen   ",
	"tags": "Dungeons   Former Hero   Magic   Male Protagonist   Modern Day   Returning from Another World   Younger Sisters   ",
	"rating": "(3.9 / 5.0, 13 votes)",
	"author": "Taki   ",
	"year": "\n2021",
	"ranking": "#590   #1595   #9415   #1840   #10076   ",
	"reviewcount": "1 Review sorted by",
	"description": "Andou Shougo, a normal high school student you can find anywhere, had one day died after a falling meteorite hit and destroyed his skull.\n\nWhen he came to, he was in a completely white world.\n\nThere, he met a girl claiming herself to be God, ordering him to go and defeat a Demon Lord in another world.\n\n“There’s no way I’d be able to do that.”\n\n“If you are able to defeat the Demon Lord, I will grant you whatever you desire.”\n\n“…!”\n\nIn order to get the Goddess to grant him a certain wish, Andou decided to accept and defeat the Demon Lord. After 10 years, he finally won the decisive battle against such an adversary on an isolated island at the furthest ends of the world.\n\n“Come, Goddess! I have defeated the Demon Lord as promised! Now, it’s your turn to fulfill the other side of the bargain and grant me my wish!”\n\n“You have done well in defeating the Demon Lord, Shougo-san. Now, tell me what it is that you wish, I will make it come true whatever it may be.”\n\nAfter having his wish conveyed to the Goddess, Andou finds himself back in Japan, at the time just before he was reincarnated.\n\nMoreover, the power he had acquired as a hero in the other world remained.\n\n“Isn’t the current me just like superman…?”\n\nHolding a power that could destroy the whole world if he so desired, Andou goes about living his daily life as usual.\n\nHowever, one day, dungeons had suddenly appeared in the peaceful nation of Japan.\n\n“Dungeons have appeared above grounds, and the country has begun running an adventurer’s guild in order to excavate resources found within… If that’s the case, then I might be able to use my power as a hero.”\n\nIn Modern Japan where dungeons have started appearing, Andou, the sole human who can use ancient magic, finds himself living to his heart’s content and satisfaction with his acquired money and fame.>"
}