{
	"url": "https://www.novelupdates.com/series/the-adventures-of-my-all-rounder-wife/",
	"title": "The Adventures of My All-Rounder Wife - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/11/The-Adventures-of-My-AllRounder-Wife.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Drama   Josei   Mystery   Psychological   Romance   School Life   ",
	"tags": "Beautiful Female Lead   Cold Protagonist   Complex Family Relationships   Doting Love Interests   Female Protagonist   Genius Protagonist   Handsome Male Lead   Hidden Abilities   Hiding True Abilities   Hiding True Identity   Love Interest Falls in Love First   Modern Day   Multiple Identities   Overpowered Protagonist   Power Couple   Proactive Protagonist   Protagonist Strong from the Start   Secret Identity   Secret Organizations   Secretive Protagonist   Smart Couple   Strong to Stronger   Wealthy Characters   ",
	"rating": "(4.0 / 5.0, 8 votes)",
	"author": "Bronze Coins In Pocket   ",
	"year": "\nN/A",
	"ranking": "#2000   #6352   #10485   #12622   #10767   ",
	"reviewcount": "3 Reviews sorted by",
	"description": "The all-powerful boss is stripped of his identity again! \r\n\r\nOne is handsome while the other is proud; the two-faced refined rascal versus a cynical girl with hidden identities. \r\n\r\nEveryone secretly jokei that Master Mo’s wife is an ignorant and incompetent little tyrant. \r\n\r\nBad at her studies? Lu Mian emergei as the top student for science at her college entrance examination. \r\n\r\nNo talent? Lu Mian shows everyone how competent she is at multitasking by playing the piano with one hand, and painting with the other during a live performance. \r\n\r\nA prodigal? She makes a small fortune in just two days with her limited knowledge. \r\n\r\nBoxing, Go chess, appraising treasures, car racing… Bring it on! She can do them all. \r\n\r\nThe soft-spoken Xiao Qimo adjusts his glasses with pride. “Who else has something to say?” \r\n\r\nOne of his subordinates raises his hand cautiously. “Master Mo, your wife seems to be the one who single-handedly destroyed the illegal laboratory.” \r\n\r\nXiao Qimo looks at his wife who is quietly practicing calligraphy. “That’s impossible!” \r\n\r\nIt isn’t until… \r\n\r\nDuring the general meeting for the International Elite Organization, both Xiao Qimo and Lu Mian wear a mask. They take the stage and succeed as the organization’s Chief and Deputy Chief, respectively. \r\n\r\nThe Deputy Chief beside me looks like my wife. This is Xiao Qimo’s thought. \r\n\r\nThe Chief looks like someone I know. Lu Mian is thinking the same thing, too. \r\n\r\nSoon, the newly appointed Chief is seen blocking his deputy at the ladies’ room. \r\n\r\nWhat happens when two strong and uncorrupted individuals fall for each other?>"
}