{
	"url": "https://www.novelupdates.com/series/the-nerd-turned-out-to-be-the-tyrant/",
	"title": "The Nerd Turned Out To Be The Tyrant - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/03/The-Nerd-Turned-Out-To-Be-The-Tyrant.jpeg",
	"noveltype": "(KR)",
	"genre": "Drama   Fantasy   Romance   ",
	"tags": "Age Progression   Beautiful Female Lead   European Ambience   Female Protagonist   Glasses-wearing Love Interests   Handsome Male Lead   Hiding True Identity   Male Yandere   Reincarnated in Another World   Reincarnation   Royalty   Single Parent   Yandere   Younger Brothers   ",
	"rating": "(4.1 / 5.0, 43 votes)",
	"author": "Hwanghween   황흰   ",
	"year": "\n2021",
	"ranking": "#2158   #2142   #6892   #3096   #5509   ",
	"reviewcount": "1 Review",
	"description": "I possessed an R19 devastating novel where a tyrant went mad and killed all the characters in the story.\r\n\r\nThe problem is that I only looked at the scenes and didn’t know the contents properly!\r\n\r\nIn any case, there is only one person to avoid, and it’s no other than the emperor.\r\n\r\nBut as a commoner, will I even have the chance to meet him?\r\n\r\nWhile living in a village on the far end of the continent which was very distant from the imperial palace, I only have one interest!\r\n\r\n“I’m Lucette. You can call me Luce.”\r\n\r\n“Me too… call me Rev.”\r\n\r\nOne day, a mysterious boy, Rev, suddenly appeared in the village.\r\n\r\n“Really, what are you going to do without me?”\r\n\r\n“Yeah, how can I live without you?”\r\n\r\nI’m worried because he’s so kind and naïve, so I have to take care of him and protect him!\r\n\r\n…… That’s what I thought.\r\n\r\n“…The other places are fine, but you should not come to the second floor.”\r\n\r\n“Please, you must not drink this.”\r\n\r\n“It’s nothing.”\r\n\r\nWhy do you have so many secrets?\r\n\r\n“Report immediately who she meets, what she does, and who she smiles at.”\r\n\r\nMy friend, who disappeared for a while, came back even more suspicious.\r\n\r\n“I told you, Luce. I cannot live without you.”\r\n\r\nWho are you?>"
}