{
	"url": "https://www.novelupdates.com/series/lantern-reflection-of-the-peach-blossoms/",
	"title": "Lantern: Reflection of the Peach Blossoms - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2018/08/201852f9f2z92u7f7e7m66.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adult   Comedy   Drama   Mystery   Supernatural   Xuanhuan   Yaoi   ",
	"tags": "Adapted to Drama CD   Apathetic Protagonist   Buddhism   Calm Protagonist   Complex Family Relationships   Couple Growth   Cultivation   Demon Lord   Demons   Devoted Love Interests   Divorce   Evil Gods   Family Conflict   Flashbacks   Fox Spirits   Godly Powers   Gods   Handsome Male Lead   Heaven   Humanoid Protagonist   Jiangshi   Marriage   Modern Day   Mpreg   Mysterious Past   Nationalism   Past Plays a Big Role   Phoenixes   Power Couple   Reincarnation   Second Chance   Siblings   Strong Love Interests   Tragic Past   Wealthy Characters   ",
	"rating": "(4.5 / 5.0, 72 votes)",
	"author": "Huai Shang   淮上   ",
	"year": "\n2016",
	"ranking": "#2000   #3690   #5216   #7365   #2065   ",
	"reviewcount": "7 Reviews sorted by",
	"description": "This is the story of Phoenix Wisdom King and a Grand Demon just awakened from Hell.\n\n***\n\nOn an ancient battlefield, two armies stood in a stalemate. On one side were the Arhats, Gods, and Buddhas from the Heavenly Realm. On the other side were the monsters and demons from the Blood Sea of the Hell Realm.\n\nThe personification of that Grand Demon leaped forward, holding a long sword across his chest. He flew across the battlefield, brazenly cutting in half eleven Phoenix Bone Arrows, each of which was enough to destroy the world.\n\nThen, he arrived in front of Phoenix Wisdom King, standing high above the masses:\n\n“Your Highness, please don’t move—”\n\n“I didn’t come to wage war. I came to propose to you.”\n\nPhoenix was the Buddha’s inescapable Tribulation for thirty-thousand years, whereas Zhou Hui was Phoenix’s redemption that could free him from the fate of his eternal life.\n\nAfter hundreds of thousands of years of endless light and shadow, this handsome yet devilish man finally emerged from Hell—\n\nTo bring Phoenix Wisdom King away from the transcendent Buddhist Kingdom and the boundless Lotus Sea.\n\n“Let me follow you to that world. For you, I’ll be invincible forever—”\n\nYou’re my shore after swimming across hundreds of miles of water. You’re my destination after traveling through thousands of miles of land.>"
}