{
	"url": "https://www.novelupdates.com/series/the-villain-setting-collapse/",
	"title": "The Villain Setting Collapse - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/04/The-Villain-Setting-Collapse.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Romance   Supernatural   ",
	"tags": "Artists   Beautiful Female Lead   Cold Love Interests   Couple Growth   Devoted Love Interests   Female Protagonist   Forced into a Relationship   Handsome Male Lead   Love Interest Falls in Love First   Marriage   Misunderstandings   Modern Day   System Administrator   Transmigration   ",
	"rating": "(3.4 / 5.0, 35 votes)",
	"author": "何釉   ",
	"year": "\n2021",
	"ranking": "#1710   #1156   #5428   #3869   #6166   ",
	"reviewcount": "5 Reviews",
	"description": "Su Shu transmigrated into a novel and became a beautiful villain. Just when she was ready to ignore the male and female leads and enjoy her life, the system told her that within three years, if she acted like a villain, she could go back to her original world. So she played the role diligently, thinking that when the time came, she could go home. But she didn't expect that after the year passed, she would be told that there was a system failure, and she would continue to stay in that world for two years. \r\n\r\nSu Shu: Huh! What should I do when facing the offended male lead? Of course, I can only bite the bullet and hold on.\r\n\r\nSu Shu stalked Gu Siyan for 3 years, and everyone thought she loved him miserably. Only Gu Siyan knew that this woman was a playwright.\r\n\r\n'A Yan, I haven't seen you for a day, I can't even eat.'\r\n\r\nOne second he received Su Shu's message, the next second he saw her weibo where an attractive cake photo was posted, “It tasted very good.”\r\n\r\n“A Yan, please don't be angry. It's all my fault.' \r\n\r\nOne second she was apologizing, the next, he found a picture she posted on Weibo, with the words, 'I just like the way you are angry and can't do anything about it.'\r\n\r\nOne day, he finally couldn't help but block her in a corner, his eyes were narrow and his voice was low, 'Have you played enough?' \r\n\r\nSu Shu:??? \r\n>"
}