{
	"url": "https://www.novelupdates.com/series/praying-for-fate/",
	"title": "Praying for Fate - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/05/book-cover.jpg",
	"noveltype": "(CN)",
	"genre": "Drama   Romance   Smut   Tragedy   Yaoi   ",
	"tags": "Abandoned Children   Celebrities   Childcare   Complex Family Relationships   Doctors   Family   Fated Lovers   Genius Protagonist   Handsome Male Lead   Heartwarming   Hospital   Love at First Sight   Marriage   Misunderstandings   Models   Modern Day   Mpreg   Orphans   Short Story   Twins   Wealthy Characters   Younger Love Interests   ",
	"rating": "(3.9 / 5.0, 78 votes)",
	"author": "Shi Shi   Thập Thế   十世   ",
	"year": "\n2010",
	"ranking": "#2000   #2000   #5381   #4318   #4214   ",
	"reviewcount": "15 Reviews sorted by",
	"description": "BeiTang MinQian:\n\nHe is a world class super model and is the only son and heir to a prestigious aristocratic family.\n\nBecause of the pressure as the family’s sole successor, he must face the norms of an expected societal marriage.\n\nSu YuanHeng:\n\nHe is a talented neurosurgeon and was an orphan abandoned at an orphanage.\n\nA chance encounter during a surgery led him to fall in love at first sight with the then 14 years old, BeiTang MinQian.\n\nBut the childhood trauma of being abandoned by his father had cast a dark shadow in his heart that is impossible to be erased.\n\nThese factors caused their ambiguous relationship to be even more unsettled. Before everything even became clear, an even bigger ‘random incident’ unexpectedly occurred —\n\nFacing a relationship that is full of cracks, the ‘fate’ that God bestowed upon them… is it actually deep or shallow?\n\nAt night, when Su YuanHeng is lying on the big cold bed by himself, the blistering heated air obstructed his breathing.\n\nHe turned on the air conditioner to high. Wrapped in a thin blanket, he tossed and turned in bed. The days without BeiTang MinQian by his side, he thought that he was already used to it. But when this person came back for just one night, his pathetic body still longed for his embrace.\n\nSu YuanHeng slowly closed his eyes and dazily reminisced about his very distant past. His father had once held him in his arms, mumbling tenderly, “Xiao Li, FeiLi…the meaning of this name is ‘never to leave forever.’ You must remember…”\n\n“Remember…”\n\n“Daddy, I remember, but what about you? You still left me…”\n\n Even the person that is by his side, there is going to be that day when he will also leave him …>"
}