{
	"url": "https://www.novelupdates.com/series/pampered-by-millions/",
	"title": "Pampered by Millions - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/03/Pampered-by-Millions.jpg",
	"noveltype": "(CN)",
	"genre": "Adult   Romance   School Life   Smut   Xianxia   Yaoi   ",
	"tags": "Ancient China   Clingy Lover   Confinement   Cruel Characters   Episodic   First-time Interc**rse   Handsome Male Lead   Jealousy   Male Yandere   Manipulative Characters   Obsessive Love   Possessive Characters   R*pe   Shameless Protagonist   Strong Love Interests   Time Travel   Transmigration   Twisted Personality   World Hopping   World Travel   Zombies   ",
	"rating": "(4.2 / 5.0, 22 votes)",
	"author": "Yin Lu Xing   引路星   ",
	"year": "\n2017",
	"ranking": "#2000   #2000   #8376   #7724   #8503   ",
	"reviewcount": "4 Reviews sorted by",
	"description": "「You are gorgeous.」\n\n「You are amazing.」\n\n「Your nature is as fickle as flowing water and as erratic as a flower drifting in the wind.」\n\n「...」\n\n「You will make everyone fall madly in love with you. They will not stop until your entire being is under their possession; until you are trapped and caged; until your limbs are no more. Until you are but a cold body locked away in a freezer—only then will they finally be content.」\n\n「...」\n\n「You will not die. You will revive endlessly.」\n\nAfter an accident, Chao Deng was forced into binding with a system. The task allocated to him was to enter various worlds to collect fragments of personality. \n\nChao Deng went after the personification of indifference first, then frivolity, tyranny, paranoia, arrogance… In the end, Chao Deng discovered that these fragments had all come from the same person.\n\nIndulging in love, muddling through life, having your name spread far and wide, or having an existence worth no more notice than a mere speck of dust—these are all the glorious songs dedicated to the life of one truly great.\n\nYou were born to be pampered by millions.>"
}