{
	"url": "https://www.novelupdates.com/series/the-healer-is-fine-so-go-save-the-world/",
	"title": "The Healer is Fine, so Go Save the World! - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/09/The-Healer-is-Fine-so-Go-Save-the-World.jpg",
	"noveltype": "(KR)",
	"genre": "Adventure   Fantasy   Harem   Romance   Shounen Ai   ",
	"tags": "Dense Protagonist   Devoted Love Interests   Doting Love Interests   Fantasy World   Game Elements   Level System   Magic   Misunderstandings   Past Trauma   System Administrator   ",
	"rating": "(4.1 / 5.0, 29 votes)",
	"author": "이아이아   ",
	"year": "\n2022",
	"ranking": "#1543   #1239   #9204   #1867   #8758   ",
	"reviewcount": "No Reviews",
	"description": "「 Immunity to pain! You won’t feel any physical pain.\n\nImmortal Body! You won’t die until you usher in a peaceful world.」\n\nLacking both mana and divine power: the temple’s half-wit Sun Yihan. Thanks to the system, he became the only healer in a party of warriors.\n\nHowever, failure to complete the quest will worsen his health, and excessive use of his ability will lead to him vomiting blood.\n\n--      “I’m not hurt anywhere.”\n\n--      “You’re throwing up blood–there’s no way you’re telling the truth.”\n\nHe was simply trying to cure others to the best of his recently received ability.\n\n--     “Yihan. Was your situation difficult enough that you would throw away your life?”\n\n--     ‘Wait a minute, he’s definitely misunderstood something.’\n\nThe warriors, working under a misunderstanding, refused to be treated. Meanwhile, the cracks in the world are getting gnarled and increasing in size. Abnormalities that only Yihan can see appeared.\n\n--      “I won’t disturb you guys. You don’t have to concern yourself with my well-being either. It’s alright if I get injured, so let me go with you.”\n\n--     “…Yihan-ah. Do you really think that? You’re truly fine with getting hurt?”\n\nA healer who wants to heal his warriors, and the warriors who want to protect their healer. Will Yihan be able to heal those that refuse his treatment and successfully clear all the quests?>"
}