{
	"url": "https://www.novelupdates.com/series/a-ladys-tranquility/",
	"title": "A Lady’s Tranquility - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/01/A-Ladys-Tranquility.jpg",
	"noveltype": "(CN)",
	"genre": "Drama   Fantasy   Harem   Historical   Mature   Psychological   Romance   ",
	"tags": "Adapted to Drama   Ancient China   Death of Loved Ones   Devoted Love Interests   Female Protagonist   Handsome Male Lead   Love Interest Falls in Love First   Multiple Reincarnated Individuals   Mysterious Past   Older Love Interests   Past Trauma   Politics   Reincarnation   Royalty   R*pe   Schemes And Conspiracies   Second Chance   Slow Romance   ",
	"rating": "(4.1 / 5.0, 24 votes)",
	"author": "Mirror Of Time   Shi Jing   时镜   ",
	"year": "\n2019",
	"ranking": "#2261   #2000   #9093   #7359   #8824   ",
	"reviewcount": "3 Reviews",
	"description": "In the previous life, Jiang Xuening was the benchmark of a Mary Su. For the throne of the Empress, she hooked up and messed around with men.\r\n\r\n\r\nWhen she was dating the Emperor, the rebel is her spare tire;\r\n\r\nWhen she was dating the student, the teacher is her spare tire;\r\n\r\nWhen she was dating the boss, the subordinate is her spare tire;\r\n\r\nWhen she was dating a woman, a man is her spare tire……？\r\n\r\n\r\nEvery day is a Shura Field! (Hiks)\r\n\r\n\r\nAnyway, no matter who the Emperor is, she wants to be the Empress!\r\n\r\n\r\nThe men all thought that they had walked into the silly and sweet innocent girl’s heart, but they unexpectedly had walked into the fish pond of the scum girl, and the girl also worked as a part-time King of the Sea.\r\n\r\n\r\nThen the Palace changed.\r\n\r\n\r\nShe died.\r\n\r\n\r\nHeaven gave her a chance to start again.\r\n\r\n\r\nShe vowed to earnestly repent and mend her ways.\r\n\r\n\r\nShe absolutely did not expect that, she was just rebirthed at the time she [already] started messing around and it’s too late to change!!!\r\n\r\n\r\nJiang Xuening was angry: The crooked Heaven was just playing with a human’s life! Your Great Aunt, me, was born with eight legs! Believe it or not, when my temper comes up [BEEP――]\r\n\r\n\r\nThe Heaven's heart attack is more severe: What if the ship capsized again?\r\n\r\n\r\nJiang Xuening with a cold and indifferent face: Helpless.\r\n\r\n\r\nAll right, it's all a talk only.\r\n\r\n\r\nHow to break up safely without offending the big guys?\r\n\r\n\r\nSo difficult QAQ>"
}