{
	"url": "https://www.novelupdates.com/series/80s-wife-is-sweet-and-sassy/",
	"title": "80s Wife Is Sweet and Sassy - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/09/s-Wife-is-sweet-and-sassy.jpeg",
	"noveltype": "(CN)",
	"genre": "Comedy   Drama   Fantasy   Romance   Slice of Life   ",
	"tags": "Adopted Children   Beautiful Female Lead   Betrayal   Business Management   Character Growth   Charming Protagonist   Cheats   Child Abuse   Childcare   Couple Growth   Cute Children   Family   Female Protagonist   First Love   Handsome Male Lead   Heartwarming   Love at First Sight   Love Interest Falls in Love First   Marriage   Marriage of Convenience   Poor to Rich   Pretend Lovers   Reincarnation   Second Chance   S*xual Abuse   Sibling's Care   Tragic Past   ",
	"rating": "(3.9 / 5.0, 10 votes)",
	"author": "老羊爱吃鱼   ",
	"year": "\n2022",
	"ranking": "#1583   #1281   #9861   #1359   #10684   ",
	"reviewcount": "2 Reviews sorted by",
	"description": "In the previous life, Chu Qiao had been obeying her father at home and her husband after she was married. She worked hard and never complained. She was lying on the operating table when she had difficult labor. Her mother-in-law, her husband, and her stepchildren all gave up on her, one body with two lives.\n\nBack at the age of 21, she had not married the selfish and vicious ex husband. But her stepmother tried every means to force her to marry for benefits. Chu Qiao wanted to be independent, so she had to register her hukou in the city. But her stepmother kept forcing her to marry. When she was desperate, Gu Ye, the hot-tempered uncle of her ex-husband, jumped out to propose marriage. \n\n“Marry me, and let that dead calf call you aunt!”\n\nChu Qiao’s heart was moved. When she thought that her ex-husband was a generation younger than her, and would never be able to raise his head in front of her. She was inexplicably happy, she thought it was okay to get married.\n\nGu Ye had been a bully since he was a child. Others said that he was not close with women. It was estimated that he would be a bachelor his whole life. But no one knows that Gu Ye had three good requirements— slender waist,  delicate feet, and baby voice.\n\nEvery cell of Chu Qiao grew into his heart. She was a tailor-made wife for him by God. Whatever you say, you have to turn home. Other men can go as far as possible!>"
}