{
	"url": "https://www.novelupdates.com/series/transmigrated-as-the-cannon-fodder-abandoned-by-the-movie-star/",
	"title": "Transmigrated as the Cannon Fodder Abandoned by the Movie Star - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/04/Transmigrated-as-the-Cannon-Fodder-Abandoned-by-the-Movie-Star.jpg",
	"noveltype": "(CN)",
	"genre": "Fantasy   Psychological   Romance   Yaoi   ",
	"tags": "Absent Parents   Acting   Amnesia   Apathetic Protagonist   Brother Complex   Bullying   Calm Protagonist   Celebrities   Character Growth   Charming Protagonist   Cold Protagonist   Complex Family Relationships   Depression   Devoted Love Interests   Divorce   Doting Love Interests   Doting Older Siblings   Doting Parents   Familial Love   Family   Forced Marriage   Handsome Male Lead   Loneliness   Love Interest Falls in Love First   Marriage   Mind Break   Misunderstandings   Mob Protagonist   Models   Modern Day   Near-Death Experience   Parallel Worlds   Past Trauma   Pets   Quiet Characters   Second Chance   Showbiz   Smart Couple   Suicides   Transmigration   Wealthy Characters   ",
	"rating": "(4.2 / 5.0, 129 votes)",
	"author": "有点困   ",
	"year": "\n2019",
	"ranking": "#416   #647   #2333   #688   #2132   ",
	"reviewcount": "36 Reviews sorted by",
	"description": "Gu Qingchi transmigrated into an insignificant cannon fodder. The author didn’t set any of the details of the cannon fodder’s character settings, so everything was randomly generated.\n\nThen, somehow, he ended up becoming the most beautiful person in the entire novel.\n\nHowever, it didn’t matter. Once a cannon fodder, always a cannon fodder. His existence was insignificant, and he was treated like a background character by everyone. A single glance and he would be forgotten.\n\nNow, the story had come to an end. Gu Qingchi would finally be abandoned by the rich and successful movie star.\n\nGu Qingchi was in tears: Finally, this day had come.\n\nA novel about regret.\n\nGorgeous beyond measure, after finishing the cannon fodder storyline, Gu Qingchi could debut by relying on his face alone.\n\nThe well-known movie star’s love affair was exposed. His fans were furious and ready to take this guy down, but ended up being captivated by his beauty.>"
}