{
	"url": "https://www.novelupdates.com/series/chronicles-of-the-kilner-family/",
	"title": "Chronicles of the Kilner Family - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/02/Chronicles-of-the-Kilner-Family.jpg",
	"noveltype": "(KR)",
	"genre": "Adult   Drama   Mature   Romance   Smut   ",
	"tags": "Aristocracy   Beautiful Female Lead   Books   Calm Protagonist   Caring Protagonist   Character Growth   Charismatic Protagonist   Clumsy Love Interests   Comedic Undertone   Complex Family Relationships   Couple Growth   Different Social Status   Doting Love Interests   Early Romance   Enemies Become Lovers   European Ambience   Familial Love   Family   Family Conflict   Famous Parents   Famous Protagonist   First Love   First-time Interc**rse   F*llatio   Handsome Male Lead   Heartwarming   H*ndjob   Jealousy   Kind Love Interests   Library   Maids   Male Protagonist   Marriage   Marriage of Convenience   Master-Servant Relationship   Misunderstandings   Nobles   Past Plays a Big Role   R-18   Secret Crush   Short Story   Unconditional Love   Unrequited Love   Wealthy Characters   ",
	"rating": "(3.5 / 5.0, 54 votes)",
	"author": "Leah   르아   ",
	"year": "\n2018",
	"ranking": "#6970   #4728   #5578   #2249   #5315   ",
	"reviewcount": "12 Reviews sorted by",
	"description": "Dylan returns to his family’s home after leaving the house three years ago in an attempt to quell his romantic infatuation with his older brother’s wife.\n\n When he comes back home, he finds his throbbing heart longing for her deeply once more.\n\nThrough his bitter struggle, he hears rumors of his older brother’s close relationship with the housemaid Anna, which enrages him into vowing to do everything in his power to kick the housemaid out of the household for his sister-in-law’s sake, thus beginning the constant harassment toward Anna.\n\nAs their relationship tangles, it evolves into a deeper bond—one that he didn’t expect. \n\nThen, Anna finds out his reasoning for approaching her in the first place…>"
}