{
	"url": "https://www.novelupdates.com/series/heavenly-jewel-change/",
	"title": "Heavenly Jewel Change - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2016/04/Heavenly-Jewel-Change.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Comedy   Drama   Ecchi   Fantasy   Harem   Martial Arts   Mature   Xuanhuan   ",
	"tags": "Academy   Adapted to Manhua   Appearance Different from Actual Age   Archery   Aristocracy   Army   Army Building   Arranged Marriage   Arrogant Characters   Artifact Crafting   Artifacts   Assassins   Battle Competition   Beast Companions   Beasts   Beautiful Female Lead   Black Belly   Bloodlines   Body Tempering   Broken Engagement   Charismatic Protagonist   Crafting   Cultivation   Cunning Protagonist   Determined Protagonist   Dragons   Early Romance   Elemental Magic   Elves   Fast Cultivation   Generals   Hard-Working Protagonist   Harem-seeking Protagonist   Hidden Abilities   Human-Nonhuman Relationship   Inscriptions   Leadership   Long Separations   Lucky Protagonist   Male Protagonist   Military   Misunderstandings   Monsters   Narcissistic Protagonist   Nobles   Perverted Protagonist   Polygamy   Pregnancy   Protagonist Falls in Love First   R*pe Victim Becomes Lover   Revenge   Romantic Subplot   Royalty   Shameless Protagonist   Sharp-tongued Characters   Strength-based Social Hierarchy   Strong Love Interests   Sudden Strength Gain   Time Skip   Unique Cultivation Technique   Wars   Weak to Strong   ",
	"rating": "(4.0 / 5.0, 1512 votes)",
	"author": "Tang Jia San Shao   唐家三少   ",
	"year": "\n2011",
	"ranking": "#4265   #2000   #32   #431   #67   ",
	"reviewcount": "153 Reviews sorted by",
	"description": "Every human has their Personal Jewel of power, when awakened it can either be an Elemental Jewel or Physical Jewel. They circle the right and left wrists like bracelets of power.\n\nHeavenly Jewels are like the twins born, meaning when both Elemental and Physical Jewels are Awakened for the same person, the pair is known as Heavenly Jewels.\n\nThose who have the Physical Jewels are known as Physical Jewel Masters, those with Elemental Jewels are Elemental Jewel Masters, and those who train with Heavenly Jewels are naturally called Heavenly Jewel Masters.\n\nHeavenly Jewel Masters have a highest level of 12 pairs of jewels, as such their training progress is known as Heavenly Jewels 12 Changes.\n\nOur MC here is an archer who has such a pair of Heavenly Jewels.>"
}