{
	"url": "https://www.novelupdates.com/series/after-reverse-transmigration-i-became-the-four-arch-enemies-white-moonlight/",
	"title": "After Reverse Transmigration, I Became the Four Arch-Enemies’ White Moonlight - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/08/I-became-the-white-moonlight-of-the-villain.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Drama   Fantasy   Mystery   Romance   Shounen Ai   Supernatural   ",
	"tags": "Acting   Arrogant Characters   Brother Complex   Celebrities   Character Growth   Charismatic Protagonist   Charming Protagonist   Enemies Become Lovers   Fanaticism   Handsome Male Lead   Love Interest Falls in Love First   Male Yandere   Modern Day   Obsessive Love   Psychopaths   Rivalry   Sadistic Characters   Second Chance   Showbiz   Siblings   Sickly Characters   Stoic Characters   System Administrator   Transmigration   Twisted Personality   Unrequited Love   Wealthy Characters   Yandere   Younger Brothers   ",
	"rating": "(4.4 / 5.0, 49 votes)",
	"author": "Gong Zi Yu Ge   公子于歌   ",
	"year": "\n2020",
	"ranking": "#5262   #4731   #5991   #5244   #3383   ",
	"reviewcount": "7 Reviews sorted by",
	"description": "Jin Yanliu, the man with divine facial features, mega-rich, is viral at the age of twenty.\n\nOne day, he finds out that he is actually living in a book called “Taking Turns to Dote on.” In the book, his body is the one that someone else’s soul will transmigrate into.\n\nAccording to the plot, the soul will spend his money, enjoy his fame, and use his beauty—to seduce the four big shots within the story.\n\nHa!\n\nIt wouldn’t matter if he didn’t know, but he’s got to fight back since he knows already!\n\nAs a result, Jin Yanliu set his eyes on the four big shots from the text.\n\nThe first big shot: His step brother who looks mellow and calm on the outside but is actually sick and dark with paranoid and fanatical deviations.\n\nThe second big shot: his well-known archrival in the showbiz world.\n\nThe third big shot: The cautious leader of his anti-fans and has extreme fighting strength.\n\nThe fourth big shot: The tyrannical, cold blooded disabled bigshot who never experienced any warmth.\n\nJin Yanliu personally groomed them all to be his worst enemies.\n\nAfter doing so, he set free his inner self, became unbridled with arrogance and squandered money. Soon, he went from the legend of the entertainment industry to the joke. Finally, he jumped into the river, just as the novel had foretold.\n\nTransmigrate! Transmigrate! Better transmigrate fast so that you could receive this mess and be oppressed by these big shots!\n\nBut…\n\nWhy isn’t he transmigrating?! Why?!\n\nBefuddled, Jin Yanliu was quickly surrounded by the big shots.\n\nThey stared at him with red eyes filled with hatred, yet they couldn’t help but yearn for him.\n\nF*ck. A bit too exciting, this is.>"
}