{
	"url": "https://www.novelupdates.com/series/i-am-the-monarch/",
	"title": "I am the Monarch - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/11/FB06CC31-B6B9-40DB-87D3-FCA4C0B3A658.jpeg",
	"noveltype": "(KR)",
	"genre": "Action   Fantasy   Seinen   ",
	"tags": "Aristocracy   Army   Army Building   Artifacts   Beautiful Female Lead   Caring Protagonist   Character Growth   Charismatic Protagonist   Confident Protagonist   Cunning Protagonist   Demons   Dragons   Elves   Famous Protagonist   Fantasy World   Friendship   Generals   Goblins   Gods   Handsome Male Lead   Hard-Working Protagonist   Kind Love Interests   Kingdom Building   Kingdoms   Late Romance   Leadership   Love at First Sight   Loyal Subordinates   Magic   Male Protagonist   Mature Protagonist   Military   Monsters   Necromancer   Nobles   Orcs   Overpowered Protagonist   Politics   Power Couple   Previous Life Talent   Religions   Righteous Protagonist   Romantic Subplot   Schemes And Conspiracies   Second Chance   Spear Wielder   Spies   Spirits   Strategic Battles   Strategist   Strong to Stronger   Sword And Magic   Time Skip   Time Travel   Underestimated Protagonist   Wars   Weak to Strong   ",
	"rating": "(4.2 / 5.0, 1090 votes)",
	"author": "Cheol Jonggeum   철종금   ",
	"year": "\n2016",
	"ranking": "#1192   #1139   #102   #875   #49   ",
	"reviewcount": "141 Reviews sorted by",
	"description": "Roan ran away 20 years ago from his rural village in the aim of becoming a Great General. However, all he got 20 years later was just a handful of money and the lowly position of squad commander of the First Legion’s.\n\nIn the end, he became a cold corpse in the battlefield… but somehow, he came back in the past.\n\n“Alright. This time, I won’t become a Great General but a Monarch.”\n\nHis previous life’s aim was becoming a Great General, but, he only became a spearman squad commander.\n\nThis time, his life’s aim is becoming the Monarch.\n\n“Then I guess I’d become at least a General, right?”\n\nRoan, who remembers 20 years of his future, now starts his unstoppable march.>"
}