{
	"url": "https://www.novelupdates.com/series/the-richest-girl-just-started-kindergarten/",
	"title": "The Richest Girl Just Started Kindergarten - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/03/The-Richest-Girl-Just-Started-Kindergarten.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   School Life   Slice of Life   ",
	"tags": "Abandoned Children   Acting   Adopted Children   Beautiful Female Lead   Child Protagonist   Childcare   Childhood Friends   Childhood Love   Childhood Promise   Clever Protagonist   Cute Children   Cute Protagonist   Cute Story   Death of Loved Ones   Familial Love   Female Protagonist   Heartwarming   Poor to Rich   Scientists   Showbiz   Wealthy Characters   ",
	"rating": "(4.2 / 5.0, 49 votes)",
	"author": "三生思量   ",
	"year": "\n2020",
	"ranking": "#6970   #3825   #3468   #7991   #3903   ",
	"reviewcount": "16 Reviews sorted by",
	"description": "Before Lu Lu was three years old, everyone believed that the poor orphan’s future would be very challenging. \r\n \r\nUntil one day when everyone found out... \r\n \r\nOne of the biggest scientists in the research community was Lu Lu’s first uncle.\r\n \r\nThe president of a Fortune 500 company turned out to be Lu Lu's second uncle. \r\n \r\nThe most popular actor in the entertainment industry turned out to be Lu Lu's little uncle. \r\n \r\nFirst uncle: Because I have devoted all my life to researching science, I have never married, so I will leave all the prize money I won to Lu Lu. \r\n \r\nSecond uncle: Except for my company, I won't give a penny to my son. All of my assets will go towards Lu Lu. \r\n \r\nThird uncle: My wife and I both are rich and have no kids, so all my assets will be given to Lu Lu as well. \r\n \r\nEveryone became curious about the type of magical powers the uncles mentioned about Lu Lu, with her easily receiving over several hundred million dollars worth of assets. \r\n \r\nAfter a background check, they found: Lu Lu, Female, 3 years old, Imperial International kindergarten, junior class. >"
}