{
	"url": "https://www.novelupdates.com/series/the-whole-empire-raises-me/",
	"title": "The Whole Empire Raises Me - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/05/The-Whole-Empire-Raises-Me.jpg",
	"noveltype": "(CN)",
	"genre": "Romance   Yaoi   ",
	"tags": "Acting   Biochip   Caring Protagonist   Cohabitation   Comedic Undertone   Devoted Love Interests   Doting Love Interests   Doting Parents   Dragons   Dwarfs   Elves   Familial Love   Fantasy Creatures   Fantasy World   Game Elements   Gods   Handsome Male Lead   Heartwarming   Human-Nonhuman Relationship   Interdimensional Travel   Kingdom Building   Magical Technology   Poor to Rich   Scientists   Shapeshifters   Showbiz   Transformation Ability   Transmigration   Vampires   Wealthy Characters   ",
	"rating": "(4.2 / 5.0, 37 votes)",
	"author": "As Reckless As Meow   Wèi Miāo Zuò Chāng   为喵作伥   ",
	"year": "\nN/A",
	"ranking": "#4080   #3431   #6287   #5459   #4601   ",
	"reviewcount": "7 Reviews sorted by",
	"description": "Wen Xingze transmigrates into a book and becomes the beautiful and poor cannon fodder in “Large Koi is Super Rich”.\n\nAccording to the plot of the original book, he would act as a cannon fodder for the wealthy protagonist, destitute and eventually reduced to a car repairman- kneeling down to thank the protagonist for a hundred dollars.\n\nWen Xingze decided to avoid the plot and be a happy poor man.\n\nHe was addicted to games and spent three years putting an infrastructure strategy on hand to get through the game. In the game, as the ‘king’ of the cosmic age, he built his own empire from zero and dominated the universe.\n\nOne day, the game introduced new features….\n\nIn the age of the universe, the Empire of Muses is synonymous with power. The citizens are strong, rich, and all of them are worthy of force.\n\nMoreover, they are extremely protective.\n\nThey have their proud Majesty the King, who is their reverse scale.\n\nThey were willing to dedicate everything they possessed to the king, to pile up their endless treasures under the throne, and to pave the way ahead of him with the most expensive and soft fabrics.\n\nBut since dominating the universe, king has not appeared for a long time.\n\nIt wasn’t until one day that they finally saw the king again through the screen.\n\nWhat? The king actually lived in a narrow leaky rental house?? Eating two dollar instant noodles, still reluctant to put in the seasoning packet?? It’s hot in summer and don’t even have money to buy a fan??!\n\n“….”\n\nAll the people were furious!!>"
}