{
	"url": "https://www.novelupdates.com/series/the-young-lady-who-broke-her-engagement-is-only-obsessed-with-the-ending/",
	"title": "The Young Lady Who Broke Her Engagement Is Only Obsessed With The Ending - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/10/The-Young-Lady-Who-Broke-Her-Engagement-Is-Only-Obsessed-With-The-Ending.jpg",
	"noveltype": "(KR)",
	"genre": "Drama   Fantasy   Harem   Romance   ",
	"tags": "Aristocracy   Beautiful Female Lead   Broken Engagement   European Ambience   Familial Love   Family Business   Female Protagonist   Love Interest Falls in Love First   Nobles   Otome Game   Reincarnated in a Game World   Reverse Harem   Second Chance   Sibling's Care   Slow Romance   Tragic Past   Transported into a Game World   Underestimated Protagonist   Villainess Noble Girls   ",
	"rating": "(3.9 / 5.0, 68 votes)",
	"author": "뽀짝햄스터   ",
	"year": "\n2021",
	"ranking": "#1944   #1554   #3270   #3300   #3659   ",
	"reviewcount": "8 Reviews sorted by",
	"description": "[You didn’t make it all the way to the ending]\n\nPossessing a dating simulation game,\n\nSerdel, whose fiancee had an affair, felt the bitter of ending failure.\n\nReset to the original starting point,\n\nShe swears she’ll never live the way she used to.\n\nFirst of all, let’s start everything with dealing with this man!\n\n“Young lady, let’s break up. I will deliver the letter of cancellation of engagement to your family as soon as possible.”\n\n“Why do you only say what you want to say and leave out the most important thing? You have to return what you received in advance as compensation.”\n\nDon’t be sloppy!\n\nLet go of a stock that has gone bankrupt without any regrets\n\nAt some point in her life, the male character becomes obsessed with her!\n\n“The Lady saved me and my sibling. Please keep me by your side.”\n\nIn addition, the man who died in the original book,\n\nBut who was saved by her to live a new life, only look at her.\n\nIndeed, Serdel succeeded in completing the ending safely.\n\nCan I get out of the game?>"
}