{
	"url": "https://www.novelupdates.com/series/i-woke-up-and-was-pregnant/",
	"title": "I Woke up and Was Pregnant - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/11/20200519111323.jpg",
	"noveltype": "(CN)",
	"genre": "Drama   Romance   Slice of Life   Tragedy   Yaoi   ",
	"tags": "Abusive Characters   Artists   Calm Protagonist   Character Growth   Cold Love Interests   Complex Family Relationships   Cruel Characters   Cute Protagonist   Depictions of Cruelty   Determined Protagonist   Devoted Love Interests   Disabilities   Disfigurement   Doting Love Interests   Early Romance   Family Conflict   Famous Protagonist   Futanari   Handsome Male Lead   Hard-Working Protagonist   Hated Protagonist   Hiding True Identity   Kidnappings   Manipulative Characters   Misunderstandings   Modern Day   Mpreg   Older Love Interests   Poor Protagonist   Poor to Rich   Protagonist Falls in Love First   Revenge   Showbiz   Sickly Characters   Tragic Past   Unlucky Protagonist   Weak Protagonist   Wealthy Characters   ",
	"rating": "(4.0 / 5.0, 149 votes)",
	"author": "楼不危   ",
	"year": "\n2019",
	"ranking": "#2731   #1647   #1296   #4540   #1571   ",
	"reviewcount": "51 Reviews sorted by",
	"description": "At the age of eighteen, Fu Zhen’s father brought an illegitimate daughter from outside.\r\n\r\nThe father and elder brother who loved him so much since childhood seemed to have changed from then on. For the sake of an illegitimate daughter, his elder brother rebuked him for being an inters*x monster. His father even drove him out of the house after breaking his leg.\r\n\r\nIn order to avoid offending the illegitimate daughter, Fu Zhen lived a miserable life in the outskirts of Pinghai city for two years. He had a hard life and after being secretly plotted, got drunk and slept with a strange man.\r\n\r\nAnd he had just gotten accustomed to living this way.\r\n\r\nOne day, his father and elder brother came to his door, and he thought that they were going to drive him further away.\r\n\r\n​Instead, they told him that they regretted it.>"
}