{
	"url": "https://www.novelupdates.com/series/i-tried-to-be-her-loyal-sword/",
	"title": "I Tried To Be Her Loyal Sword - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/12/I-Tried-To-Be-Her-Loyal-Sword.jpg",
	"noveltype": "(KR)",
	"genre": "Fantasy   Harem   Romance   Shoujo   ",
	"tags": "Adapted to Manhwa   Aristocracy   Charismatic Protagonist   Clumsy Love Interests   Cold Protagonist   Determined Protagonist   Devoted Love Interests   Doting Older Siblings   European Ambience   Familial Love   Family   Famous Protagonist   Female Protagonist   Gods   Handsome Male Lead   Hard-Working Protagonist   Knights   Love Interest Falls in Love First   Love Rivals   Mercenaries   Nobles   Overpowered Protagonist   Overprotective Siblings   Past Plays a Big Role   Poor Protagonist   Previous Life Talent   Protagonist Strong from the Start   Reincarnated in Another World   Reincarnation   Religions   Reverse Harem   Royalty   Shy Characters   Siblings   Sibling's Care   Strong Love Interests   Sword And Magic   Sword Wielder   Tomboyish Female Lead   Tragic Past   Villainess Noble Girls   Wealthy Characters   ",
	"rating": "(3.4 / 5.0, 71 votes)",
	"author": "시이온   ",
	"year": "\n2020",
	"ranking": "#6970   #2000   #7362   #8981   #5992   ",
	"reviewcount": "No Reviews",
	"description": "One day, I fell down and remembered my past life.\r\n\r\nIt’s actually a reverse harem novel where my sister is the main character, and I was the daughter of the mad blood-devil Duke Chrysis. I didn’t mean to get involved with Duke Chrysis, but my sister’s illness deteriorated rapidly and I was forced to visit him as his daughter…\r\n\r\n“My daughter doesn’t have to kneel for anyone. Even if this was the Emperor of the Empire, you wouldn’t need to bend your knees.”\r\nDuke Chrysis, who had no blood, no tears, was a little strange.\r\n\r\n“If you cry before my sister’s eyes, you’ll only die.”\r\nMy angel-like sister, Aria, also blackened for some reason.\r\n\r\n“You’re the one who saved my life, and you’re responsible. Have you forgotten the night you spent with me?”\r\n\r\n“I’ve admired you for a long time. Can’t you give me a part of you?”\r\n\r\n“You don’t want to be Queen? Then you will be the King. I’ll be your husband.”\r\n\r\n“People think I’m the Pope who serves the Sun God, but do you know that God is you to me?”\r\nThey were the fishes of my sister’s fishing grounds.\r\nWas the world crazy?>"
}