{
	"url": "https://www.novelupdates.com/series/the-romance-of-tiger-and-rose/",
	"title": "The Romance of Tiger and Rose - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/06/rumoredthirdprincess.jpg",
	"noveltype": "(CN)",
	"genre": "Adventure   Drama   Fantasy   Harem   Romance   Shoujo   ",
	"tags": "Acting   Adapted to Drama   Ancient Times   Based on a TV Show   Beautiful Female Lead   Betrayal   Bickering Couple   Black Belly   Character Growth   Clever Protagonist   Clumsy Love Interests   Complex Family Relationships   Confident Protagonist   Conflicting Loyalties   Cunning Protagonist   Cute Protagonist   Dense Protagonist   Devoted Love Interests   Doting Love Interests   Doting Parents   Enemies Become Lovers   Family Conflict   Female Protagonist   Friends Become Enemies   Handsome Male Lead   Hard-Working Protagonist   Hot-blooded Protagonist   Love Interest Falls in Love First   Love Rivals   Love Triangles   Magic   Misunderstandings   Playful Protagonist   Schemes And Conspiracies   Sibling Rivalry   Smart Couple   Strong Love Interests   Sword And Magic   Sword Wielder   Transmigration   Weak Protagonist   Wealthy Characters   ",
	"rating": "(4.4 / 5.0, 35 votes)",
	"author": "棒棒冰   ",
	"year": "\n2020",
	"ranking": "#2000   #2000   #9365   #9498   #8709   ",
	"reviewcount": "1 Review sorted by",
	"description": "Chen Xiao Qian is a seventh-rate screenwriter who has worked hard to create a large production female-led costume drama. It could have been successfully filmed but failed because of actor Han Ming Xing’s reservations about the script.\r\n\r\nFeeling resentful, Chen Xiao Qian vows to prove the strength of her script and accidentally gets stuck in a parallel world living out her script. She becomes the 3rd Princess Chen Qian Qian of Hua Yuan City.\r\n\r\nOriginally a princess who is an insignificant side character with a bad reputation that could not live further than three episodes, she changes her fate to survive. In order to live, she takes matters into her own hand to change her fate.\r\n\r\nShe gets caught in between the arrogant and black-bellied prince Han Shuo and the practically perfect Pei Heng. Along the way, she finally grows up and learns to love.>"
}