{
	"url": "https://www.novelupdates.com/series/daughters-fool-was-the-concept-wasnt-it-duke/",
	"title": "‘Daughter’s Fool’ Was the Concept, Wasn’t It, Duke! - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/03/Daughters-Fool-Was-the-Concept-Wasnt-It-Duke.jpeg",
	"noveltype": "(KR)",
	"genre": "Fantasy   Romance   ",
	"tags": "Aristocracy   Cute Children   Cute Story   Doting Older Siblings   Doting Parents   European Ambience   Female Protagonist   Possession   Reincarnated in Another World   Transmigration   ",
	"rating": "(4.2 / 5.0, 14 votes)",
	"author": "강력한도라지   ",
	"year": "\n2022",
	"ranking": "#2000   #2000   #10171   #11527   #7361   ",
	"reviewcount": "No Reviews",
	"description": "I possessed ‘Extra 1’ in the romance-fantasy.\r\nThe problem is that this extra is the adopted daughter of the main villain in the novel.\r\nThe even worse problem is that, years later, that villain sacrificed his daughter!\r\nBecause of that, I found a way to become an essential person in this family.\r\n\r\n“Duke! With this kind of way, the Duke of Schlager family can’t last long. We have to change the image!”\r\n“Ha, is it trying to start a charity work like others?”\r\n“Ey, if it’s like that, then the image surely has already been ruined. There is only one thing you guys can do! It’s the ‘daughter’s fool’ concept!”\r\n'...What?'\r\n\r\nDuke Schlager, with the daughter’s fool concept.\r\nThe two older brothers above, with the younger sister’s fool concept. They began to transform.\r\n\r\nThen the villain duke family's reputation changed little by little!\r\n\r\n- I heard he’s so kind to his adopted daughter?\r\n- I definitely thought he had a plot in mind since he adopted an orphan, though.\r\n\r\nThanks to this, even it seems to be easier for the villainous duke to do business.\r\nDuke, you know my worth, right? So, please don't kill me!\r\n\r\n…It was good up to here, however.\r\n\r\nEven at home, the Duke does the concept.\r\n\r\n“I’ll read you a fairytale book, Sol. Hmm? Why am I reading it to you, you ask? So that I can brag about it to people during the day.”\r\n\r\nThe malicious older brother, who was ordered to do the sister’s fool concept, is also friendly at home.\r\n\r\n“Even if someone bothers you, don’t take revenge recklessly. After getting the right timing for you to get out of the suspect line, I’ll take care of it.'\r\n\r\nAnd also.\r\n\r\n“Sol, something like you is totally not cut… cu, cu... I mean, it's cute! I hate tsundere concept!”\r\n\r\nThe youngest older brother who was ordered to do the tsundere concept… is overly in pain.\r\n\r\nThey say it’s a villain family.\r\nJust why the hell, is this house like this?\r\n>"
}