{
	"url": "https://www.novelupdates.com/series/ive-returned-but-my-first-love-is-suspicious/",
	"title": "I’ve Returned But My First Love Is Suspicious - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/11/I’ve-Returned-But-My-First-Love-Is-Suspicious.jpg",
	"noveltype": "(KR)",
	"genre": "Drama   Fantasy   Romance   Shoujo   ",
	"tags": "Female Protagonist   Reincarnation   ",
	"rating": "(4.0 / 5.0, 6 votes)",
	"author": "박깃털   ",
	"year": "\n2020",
	"ranking": "#2000   #6349   #12297   #9150   #7512   ",
	"reviewcount": "No Reviews",
	"description": "Chloe, who was happily married to the young prince of the neighboring country for the sake of the empire, suddenly returned to five years ago.\r\n\r\nIt wasn’t because of her death, neither was it because her past life had been painful enough for her to harbor any regrets.\r\n\r\nOn the first day of her return, her first-love, Demetrian, came to her at dawn.\r\n\r\n‘I can hold this hand again…’\r\n\r\nShe was happy and excited to meet him again because she didn’t hear from him for so long.\r\n\r\n“You can’t even imagine how thrilled I am right now.”\r\n“I’d love to listen to anything you say, but…”\r\n\r\nHe acted like a completely different person as if he couldn’t hide his passion for her.\r\n\r\nHe spoke affectionately, his complexion was always delighted, and he acted like a person who wanted to spend more time with her…\r\n\r\nHe acted like a person who showed his love wholeheartedly.\r\n\r\nIt was unusual of him.\r\n\r\n‘Perhaps…he went through the same thing as me?’\r\n\r\nHowever, Demetrian was tied to an engagement promise made between families, and Chloe was pushed into a political marriage with the neighboring country for the sake of the empire two years later.\r\n\r\n‘Well…our future is fixed anyway.’\r\n\r\nBut when she saw his affectionate eyes, his delicate lips, and sweet voice,\r\n\r\nChloe kept thinking differently.\r\n\r\nShe felt like their future was yet to be determined….\r\n\r\n“I- I have a secret. I was….married to that prince.”>"
}