{
	"url": "https://www.novelupdates.com/series/mythical-creatures-series-1-ah-jiang/",
	"title": "Mythical Creatures Series 1: Ah-Jiang - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/05/ahjiang1.jpg",
	"noveltype": "(CN)",
	"genre": "Drama   Historical   Romance   Supernatural   Xuanhuan   Yaoi   ",
	"tags": "Ancient China   Betrayal   Devoted Love Interests   First-time Interc**rse   Ghosts   Handsome Male Lead   Human-Nonhuman Relationship   Modern Day   Obsessive Love   Past Plays a Big Role   Reincarnation   Souls   Time Skip   ",
	"rating": "(4.2 / 5.0, 80 votes)",
	"author": "WingYing   ",
	"year": "\n2017",
	"ranking": "#2000   #6382   #5154   #4832   #4058   ",
	"reviewcount": "13 Reviews sorted by",
	"description": "Constable Shi Tou of An Ling District is a tall, strong, and handsome young lad with good martial skills. But ever since he’d been ordered to exorcise a ghost at Pu River, he became the well-known “nemesis”, of wives within the entire district! Any bride that was about to go through the wedding ceremony with him would either die from an accident or go missing with no evidence of whether they were still alive or not.\n\nAnd so, Shi Tou could only obediently go pay his apologies and implore the high and mighty River Lord to not cut off his line of generation!\n\nSo as he wished, Shi Tou got a first-class, ferociously beautiful──man! The beauty had wide shoulders and large hands, he also seemed to be taller than him.\n\nHis skin was as white as cold snow as if he was some kind of demon or ghost. The gorgeous looks of the beauty that would make one awed seemed to lure Shi Tou…in love…\n\nAs the saying goes, wildflowers from the side of the road should not be picked.\n\nWhen the beauty came up to his door again, Shi Tou realized the deep affection he received was a ferocious one where no one within thousands of hundred of years could receive!\n\n“──For the safety of other’s lives, this benefactor, please…just obediently marry him!”>"
}