{
	"url": "https://www.novelupdates.com/series/i-mistook-the-hidden-identity-of-the-sub-male-lead/",
	"title": "I Mistook the Hidden Identity of the Sub Male Lead - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/02/I-Mistook-the-Hidden-Identity-of-the-Sub-Male-Lead.jpeg",
	"noveltype": "(KR)",
	"genre": "Drama   Fantasy   Romance   ",
	"tags": "Aristocracy   Contracts   European Ambience   Female Protagonist   Hiding True Abilities   Hiding True Identity   Mob Protagonist   Nobles   Reincarnation   Royalty   Villainess Noble Girls   ",
	"rating": "(3.8 / 5.0, 62 votes)",
	"author": "시록보다푸른   ",
	"year": "\n2021",
	"ranking": "#5262   #4189   #4735   #6260   #3522   ",
	"reviewcount": "2 Reviews sorted by",
	"description": "On the first day of the New Year’s party, Mayerie realizes that she is an extra villain in the novel.\n\n‘What was so important about the novel? I should’ve read it.’\n\nMayerie tried not to get involved with the original for a smooth life.\n\nBut unintentionally, she discovered a huge secret that was not explained in the novel!\n\n“Ah… I thought there were no people because the curtain wasn’t down.”\n\nWith this foolish prince, Grandiel.\n\n“I didn’t know much about the directions here. I suddenly ended up coming here.”\n\nNephendes, the most popular second male lead in the story, are they the same person?\n\n° ° ° ° °\n\n“Miss Mayerie, you haven’t forgotten your promise not to talk to Ellex, right?”\n\nGrandiel bent his eyes and laughed harshly.\n\n(No way, are you jealous…?)\n\nHe’s just afraid I’ll tell the original male lead who he really is.\n\n“Wasn’t I the one you followed because you liked me? Why are you with the Crown Prince?”\n\nNo, Ellex, what’s wrong with you again? You told me not to follow you around, but what are you saying now?\n\n“Everyone is mistaken about something. Merie is my exclusive maid. So get out of here.”\n\nBesides, why does the original villainess like me so much?\n\nThe original story was about the characters of the novel who want to run away from each other, but things keep on getting twisted.\n\nSomething’s really wrong!>"
}