{
	"url": "https://www.novelupdates.com/series/magical-device-craftsman-dahlia-wont-hang-her-head-down-anymore/",
	"title": "Magical Device Craftsman Dahlia Won’t Hang Her Head Down Anymore - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/05/nxO2uJ2.jpg",
	"noveltype": "(JP)",
	"genre": "Comedy   Fantasy   Romance   Shoujo   ",
	"tags": "Adapted to Manga   Artifact Crafting   Broken Engagement   Cooking   Crafting   Death of Loved Ones   European Ambience   Female Protagonist   Handsome Male Lead   Hard-Working Protagonist   Knights   Love Interest Falls in Love First   Magic   Magical Technology   Modern Knowledge   Reincarnated in Another World   Slow Romance   Sword And Magic   ",
	"rating": "(4.1 / 5.0, 98 votes)",
	"author": "Amagishi Hisaya   甘岸久弥   ",
	"year": "\n2018",
	"ranking": "#2132   #1689   #1200   #2057   #1067   ",
	"reviewcount": "9 Reviews sorted by",
	"description": "“I’m sorry, Dahlia. I want to break off our engagement.”\n\nThat was what Dahlia’s fiance said in front of her.\n\nIn Dahlia’s former life, she endured hard work, and she died from heart attack as she hung her head down.\n\nIn this new world, when she wanted to be a good wife and quietly hang her head down, her engagement was cancelled.\n\nDahlia swore she will stop hanging her head down.\n\nWork hard, go where you want to go, eat what you want to eat, drink what you want to drink.\n\nLive as I want to live as much as possible.\n\nSuch a Dahlia met a knight from the demon subjugation unit. Dahlia who liked magical tools and Wolf who liked magic swords.\n\nEveryday they were involved in drinking and eating while passionately making magical devices and magic swords.\n\nIf it was for a convenient life, the magical devices craftswoman who wouldn’t hesitate no matter the difficulty was, and the fearless knight of the demon subjugation unit who single mindedly cut his way forward.\n\nThe two people who wanted to turn their back from love, will they one day fall in love?>"
}