{
	"url": "https://www.novelupdates.com/series/i-love-you-the-most-in-the-world-entertainment-circle/",
	"title": "I Love You the Most in the World [Entertainment Circle] - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/07/I-Love-You-the-Most-in-the-World-Entertainment-Circle.jpg",
	"noveltype": "(CN)",
	"genre": "Drama   Mature   Romance   Yaoi   ",
	"tags": "Acting   Amnesia   Calm Protagonist   Celebrities   Charming Protagonist   Devoted Love Interests   Doting Love Interests   First Love   Handsome Male Lead   Heartwarming   Love Interest Falls in Love First   Manipulative Characters   Obsessive Love   Persistent Love Interests   Secret Crush   Showbiz   Unconditional Love   Unrequited Love   ",
	"rating": "(4.3 / 5.0, 68 votes)",
	"author": "Lin Ang Si   林盎司   ",
	"year": "\n2018",
	"ranking": "#629   #516   #3897   #2282   #2636   ",
	"reviewcount": "14 Reviews sorted by",
	"description": "Lin An Lan has lost his memory, but luckily, his boyfriend doesn't mind and still treats him with tenderness, pampering him, and doting on him. \r\n\r\nLin An Lan was relieved until one day he found a photo album in the house where he lived together, full of single photos of him, from his student days to his current status as a popular celebrity. \r\n\r\nOn the back of the last photo, written in black neutral pen - I want him. \r\n\r\n* Cheng Yu has liked Lin An Lan and has done so for eight years. He wants him, but is afraid to make a rash move.\r\n\r\n* \r\nUntil that day, when he heard someone knocking on the door as the wind and rain hit his window. He went out and saw that Lin An Lan's clothes were soaked through, his ink-like hair was soaked with moisture, which made his lips look even more delicate, like a rose in the dark night.\r\n\r\n'Do I stay here?' He asked. \r\n \r\nCheng Yu didn't speak. \r\n\r\nLin An Lan frowned, looking both puzzled and innocent: 'Sorry, I can't remember some things. May I ask, are you my boyfriend? Do I live here?' \r\n\r\nCheng Yu was shocked in his heart, but he smiled slightly as he reached out and led Lin An Lan inside, his tone gentle, as if they were a real pair of lovers.\r\n\r\n'Yes.' He said, 'You're back too late, wife.' \r\n \r\nI love you the most in the whole world, past, present and future.>"
}