{
	"url": "https://www.novelupdates.com/series/eldest-sister-why-havent-you-married-yet/",
	"title": "Eldest Sister, Why Haven’t You Married Yet - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/05/YouMarriedYet2b.jpg",
	"noveltype": "(CN)",
	"genre": "Fantasy   Historical   Romance   Slice of Life   ",
	"tags": "Abusive Characters   Ancient China   Business Management   Character Growth   Clever Protagonist   Determined Protagonist   Familial Love   Female Protagonist   Handsome Male Lead   Hard-Working Protagonist   Heartwarming   Late Romance   Love Interest Falls in Love First   Merchants   Older Love Interests   Poor Protagonist   Poor to Rich   Slow Romance   Smart Couple   Transmigration   Younger Sisters   ",
	"rating": "(4.4 / 5.0, 71 votes)",
	"author": "Xian Jiu Qing Shan   闲就青山   ",
	"year": "\nN/A",
	"ranking": "#599   #1807   #4067   #1964   #3667   ",
	"reviewcount": "23 Reviews sorted by",
	"description": "Once transmigrated, she entered a fire pit. Yue You Jin, as the eldest daughter of the second branch, was adorned with a bunch of younger sisters. Her strong soul, however, didn’t have a strong physique. So she could only swallow her anger until she was twelve years old.\r\n\r\nA scum Dad, who can’t give birth to a son, cheated while married and brought home the third wheel with him. A grandmother, who places more importance to son over daughters, doesn’t treat her granddaughter as a human being. And also cousin sisters, who want to climb high branches, looked down rural people and a ‘superbrain’ cousin brother, who emptied the family wealth to bribe examiners …\r\n\r\nFortunately, she finally found a chance to escape from Yue Family, this bunch of oddballs. Yue You Jin had to shoulder the heavy burden of supporting the family of ten, She can only to empty her brain for money-making ideas. Finally raised her sisters. Initially, she thought she could retire in honor. What? You guys are starting to rush marriage?\r\n\r\nThe little sisters: “Eldest Sister, you and your brother-in-law have been in a nameless relationship for so many years, just short a ceremony. There’s no time like the present, so let’s do it today?”\r\n\r\nThe brother-in-law who never got the chance to get formal/legal status was moved to tears. “Sisters, add oil (go for it or Korean’s fighting)! Brother-in-law wants to buy you a big house!”\r\n\r\nThe female lead’s family surname was Yue in the early stage and changed to Su in the middle period.>"
}