{
	"url": "https://www.novelupdates.com/series/im-not-shouldering-this-blame/",
	"title": "I’m Not Shouldering This Blame - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2018/01/d8a245b4gw1f0r01wn7toj205k07s0t4.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Mystery   Romance   Supernatural   Yaoi   ",
	"tags": "Acting   Alternate World   Celebrities   Charismatic Protagonist   Clever Protagonist   Devoted Love Interests   Doting Love Interests   Game Elements   Handsome Male Lead   Hidden Abilities   Honest Protagonist   Love at First Sight   Manly Gay Couple   Modern Day   Multiple POV   Multiple Realms   Multiple Transported Individuals   Murders   Parallel Worlds   Popular Love Interests   Power Couple   Psychic Powers   Saving the World   Secret Organizations   Showbiz   Slow Romance   Special Abilities   Strong Love Interests   Sudden Strength Gain   Terrorists   Transmigration   ",
	"rating": "(4.4 / 5.0, 463 votes)",
	"author": "Tian Tang Fang Zhu Zhe   天堂放逐者   ",
	"year": "\n2016",
	"ranking": "#6970   #2063   #931   #1050   #458   ",
	"reviewcount": "88 Reviews sorted by",
	"description": "One day, the stuntman found that acquaintances and unfamiliar people were looking for him through various channels. Even someone from a certain department of the country came—\r\n\r\nTeam Leader of an abilities group: Comrade Jian Hua, on behalf of the nation, I want to tell you about a newly discovered world secret.\r\n\r\nProtagonist: What?\r\n\r\nTeam Leader of an abilities group: In fact, our world is a book.\r\n\r\nProtagonist: WTF?\r\n\r\nTeam Leader of an abilities group: And you will be the last villain of the seven volume novel series.\r\n\r\nProtagonist: …\r\n\r\nSee title for the protagonist’s mood.\r\n\r\nBook Character A: You and I are good childhood friends. Shouldn’t I be the white moonlight in your heart?\r\n\r\nProtagonist: …\r\n\r\nBook Character B: I treated you kindly, so shouldn’t you trust me completely?\r\n\r\nProtagonist: …\r\n\r\nBook Character C: I’m so considerate while busy. As good friends, shouldn’t we be rolling around on first base?\r\n\r\nProtagonist: …\r\n\r\nSee title for the protagonist’s mood.>"
}