{
	"url": "https://www.novelupdates.com/series/chuan-qi/",
	"title": "Chuan Qi - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/01/Chuan-Qi.jpg",
	"noveltype": "(CN)",
	"genre": "Drama   Gender Bender   Historical   Josei   Romance   Tragedy   ",
	"tags": "Ancient China   Betrayal   Cross-dressing   Cruel Characters   Female Protagonist   Handsome Male Lead   Imperial Harem   Second Chance   ",
	"rating": "(3.9 / 5.0, 25 votes)",
	"author": "Mo Wu Bi Ge   墨舞碧歌   ",
	"year": "\n2013",
	"ranking": "#2000   #2000   #9260   #11907   #9787   ",
	"reviewcount": "1 Review sorted by",
	"description": "That year, he came in first in the Imperial Examinations; the Emperor, Lian Yu, personally conferred his title, praising him virtuous and benevolent.\r\n\r\nThat year, he became drunk after the imperial banquets and fell asleep next to the Emperor, his head resting on the Emperor’s robes; the next morning, the Emperor chose to cut his sleeves in order to go to Court rather than disturb his rest.\r\n\r\nThat year, he was revealed to be the descendant of a traitor; defying the entreaties of all his ministers, the Emperor chose to spare his life.\r\n\r\nLater, the woman, Gu Shuangcheng, disguised herself as a man to take part in the Imperial Examinations, becoming the next scholar to rank first place.\r\n\r\nLater, Gu Shuangcheng was conferred the title of an imperial consort, her beauty stunning the world.\r\n\r\nLater, he was accused of poisoning the Emperor’s favoured consort, Gu Shuangcheng; though he did not succeed, the Emperor, in his wrath, ordered for him to be flogged to his death.\r\n\r\nLater, four of the highest-ranking palace servants were secretly summoned to the Emperor’s Jinluan Hall, and their task was to castrate and bury him. Yet, to their horror, they discovered only a female corpse, a jade stone within her mouth, her body covered with the Emperor’s dragon-embroidered robes.\r\n\r\n‘He’ was actually a woman, and what was most shocking was that ‘he’ was not a virgin…>"
}