{
	"url": "https://www.novelupdates.com/series/after-rebirth-i-decided-to-inherit-the-family-property/",
	"title": "After Rebirth, I Decided To Inherit the Family Property - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/08/After-rebirth-I-decided-to-inherit-the-family-property.jpeg",
	"noveltype": "(CN)",
	"genre": "Comedy   Romance   Yaoi   ",
	"tags": "Acting   Boss-Subordinate Relationship   Dense Protagonist   Doting Love Interests   Doting Parents   Family Business   Handsome Male Lead   Mismatched Couple   Misunderstandings   Multiple Reincarnated Individuals   Naive Protagonist   Protagonist Falls in Love First   Second Chance   Showbiz   Slow Romance   Tsundere   Wealthy Characters   ",
	"rating": "(4.1 / 5.0, 68 votes)",
	"author": "Cattail Tea   猫尾茶   ",
	"year": "\n2021",
	"ranking": "#1125   #6266   #4415   #2920   #4107   ",
	"reviewcount": "14 Reviews sorted by",
	"description": "From the beginning of his debut, Song Yiran and Qin Ke became bitter enemies. They could not see each other properly and had been fighting for years. Until one day, Song Yiran had a dream.\n\nHe dreamed that he was originally a cannon fodder of a novel, and that, no matter how hard he tried, he was bound to be a miserable cannon fodder to set off Qin Ke, the hero.\n\nBut fortunately, when he woke up, he was reborn again. 　\n\nLooking back in the past, Song Yunran looked at his family’s luxury mansion, counted his assets and suddenly realized— 　\n\nWhat entertainment circle?　\n\nHe wants to inherit the family property, be a domineering president who calls for wind and rain, and then take his money to humiliate Qin Ke. He must let Qin Ke kneel down and call him Lord Gold Daddy!\n\nEver since then,\n\nWhen Qin Ke accepted a new play, Song Yunran hurried to invest: “Do you like this play? Call me Daddy.”　Qin Ke gave him a cold look and turned away. 　\n\nWhen Qin Ke signed the endorsement of the Song family product, Song Yunran personally went to the spot of the advertisement shooting: “Do you like the endorsement? Call me Daddy.” Qin Ke stared at him meaningfully, without speaking.\n\nWhen Qin Ke needs to go to Variety show with people, Song Yunran takes the initiative: “Want to find a partner? Call me Daddy.” Qin Ke gave a deep thought and chuckled. 　\n\nEverything went very well, but one day…… 　\n\nSong Yunran watched as Qin Ke lower his head and whisper in his ear;”You want me to let you go?Come on, call me Daddy, I want to hear it.”>"
}