{
	"url": "https://www.novelupdates.com/series/dragon-blooded-war-god/",
	"title": "Dragon-Blooded War God - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2015/10/dragon-blood-god-of-war.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Fantasy   Harem   Martial Arts   Xuanhuan   ",
	"tags": "Beasts   Beautiful Female Lead   Betrayal   Black Belly   Bloodlines   Body Tempering   Comedic Undertone   Cultivation   Cunning Protagonist   Determined Protagonist   Dragons   Family   Fast Cultivation   Fast Learner   Handsome Male Lead   Hiding True Abilities   Hot-blooded Protagonist   Male Protagonist   Romantic Subplot   Spirits   Strength-based Social Hierarchy   Underestimated Protagonist   Weak to Strong   ",
	"rating": "(3.9 / 5.0, 296 votes)",
	"author": "风青阳   ",
	"year": "\n2012",
	"ranking": "#2000   #2000   #1475   #1806   #2065   ",
	"reviewcount": "38 Reviews sorted by",
	"description": "In the ancient centuries of the yonder past, the heavens and the earth was rent, and in Long Ji Continent a tribe of dragons ruled supreme. But now, the dragons are extinct, and with a mysterious catastrophe descending, the fate of the world is at stake!\n\nA teenager named Long Chen takes on the legacy of his father, chases after the mystery behind the sudden extinction of the dragons. In a lucky coincidence, he becomes the first ancient dragon warrior in an eon, with the responsibility to uphold the dragon tribe’s honor and the command of all dragons under heaven.\n\nWith the most passionate battles, heart-moving tender scenes, brutal slaughters, and filled with the majesty of dragons. On the advent of the catastrophe, millions upon millions of dragons descend upon the world again, bringing the world to the brink of an era of war.\n\nFor he of the ancient dragon tribe, is willing to paint the sky with blood, if only for the bonds of brotherhood; with a wave of the hand to reverse the flow of the galaxy, for a goddess worthy of praise; will pull the gods down from their celestial pedestal, sunder the heavens, for the good of all living things under the sky!>"
}