{
	"url": "https://www.novelupdates.com/series/the-sweetest-fake-couple/",
	"title": "The Sweetest ‘Fake’ Couple - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/11/sweetest-fake-couple.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Romance   Slice of Life   ",
	"tags": "Arranged Marriage   Beautiful Female Lead   Clingy Lover   Cute Protagonist   Devoted Love Interests   Doting Love Interests   Female Protagonist   Handsome Male Lead   Love Interest Falls in Love First   Marriage   Marriage of Convenience   Misunderstandings   Modern Day   Power Couple   Pregnancy   Wealthy Characters   ",
	"rating": "(3.9 / 5.0, 116 votes)",
	"author": "魔安   ",
	"year": "\n2020",
	"ranking": "#2352   #3191   #2606   #1921   #3135   ",
	"reviewcount": "16 Reviews sorted by",
	"description": "The wealthy Chi Chenyan and the golden daughter Lu Li have been married for three years. Whether it is a public event or a private matter, the couple looks cold and detached. They are always being elected as the number one fake couple with overwhelming votes.\n\nAfter three years, Chi Chenyan felt that this marriage was really lackluster, and was about to bring out a divorce agreement when Lu Li suddenly got into a car accident and hit her head.\n\nIt was not a dire situation, but Lu Li suddenly seemed to have changed after the car accident…\n\nAt the hospital, Chi Chenyan was about to say polite words to comfort Lu Li, who was covered with gauze, when she suddenly became red. Lu Li raised her eyes, like a poor little rabbit, and stretched out her hands, looking aggrieved, and crying: “My husband, it hurts. Give me a hug~”\n\nChi Chenyan: “…”\n\n***\n\nAfter the accident, Lu Li suffered from a head trauma and thought that she and Chi Chenyan’s relationship is very good and romantic. What the outside world says about their relationship is nonsense.\n\nSo recently, the wife of the famous ‘fake’ couple behaved abnormally.\n\nWhen Chi Chenyan attended a business trip, Lu Li sent a passionate post on Weibo: My husband is busy making money to support his family.\n\nDuring Chi Chenyan’s company’s new product launch conference, Lu Li stared at the man on the stage and said: Husband, come home and eat tofu with me!\n\nEveryone: ???\n\nJust when everyone doubted whether the Lu family’s company was about to go bankrupt, they thought that the daughter of the Lu family could only rely on this method to keep this wealthy marriage. Then a reporter took a picture of a nightclub, Chi Chenyan’s cold face, his arms were holding a drunk Lu Li, and then kissed her while talking about eating tofu after going home.>"
}