{
	"url": "https://www.novelupdates.com/series/dancer-in-the-shadow/",
	"title": "Dancer In The Shadow - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2018/11/53019.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Fantasy   Martial Arts   Mature   ",
	"tags": "Male Protagonist   ",
	"rating": "(2.3 / 5.0, 3 votes)",
	"author": "Qiu Mu   秋沐   ",
	"year": "\n2009",
	"ranking": "#2000   #2000   #13223   #10476   #12888   ",
	"reviewcount": "No Reviews",
	"description": "The Hick town was situated at the north of the Kingdom of Reynolds. It was a prosperous town although very remote. What was outside of the Hick town, less than a few miles away, was another country of the Teruland Continent – the “Neo” Kingdom. Although the war between the Kingdom of Reynolds and the Neo Kingdom had continued over the past 100 years, this remote town managed to remain quiet. As the battlefield was too far away, people living in Hick town had never even realized that the confrontation between the two states could disrupt their lives. \r\n\r\nIn the evening, the Hick town was shrouded in a faint golden color. A middle-aged man in a light blue robes and elegant manner stood quietly on a meadow not far from the town. He was pondering. A man in a black costume appeared in front of him, his whole body was wrapped in a black tight-fitting suit, and even his face was covered by a black mask. His eyes were flashing, and they looked quite scary. Now the man in black was standing respectfully in front of him, slightly lowering his head and not looking straightly at the man's eyes.\r\n       \r\n“Thirteen, is there any news from Pope the Majesty?” The man asked in a low voice.\r\n\r\n'My Lord, His Majesty gave me an order to inform you, that according to the Shadows’ news, there have been something strange going on over the Grassland of the Dead, and His Majesty is very worried. If my Lord has finished your business, the Majesty wants you to go back as soon as possible.” The man in black who was called Thirteen replied respectfully.  \r\n\r\n'Understood, I will go back as soon as possible.' The man waved. Soon enough, the man in black faded while walking away. \r\n\r\nThe Grassland of the Dead... It’s been so long, and the man could not stand it anymore. He looked up and stared at the fiercely red sun. He gave a long sigh, decided that he had to finish something eventually…\r\n>"
}