{
	"url": "https://www.novelupdates.com/series/jorge-joestar/",
	"title": "Jorge Joestar - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/05/71CfDuCROZL.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Martial Arts   Psychological   Shounen   Supernatural   Tragedy   ",
	"tags": "Adapted from Manga   Adopted Protagonist   Alternate World   Cruel Characters   Genius Protagonist   Lack of Common Sense   Male Protagonist   Modern Day   Saving the World   Unique Weapon User   ",
	"rating": "(3.9 / 5.0, 15 votes)",
	"author": "Otaro Maijo   舞城 王太郎   ",
	"year": "\n2012",
	"ranking": "#2000   #2000   #11221   #7858   #11685   ",
	"reviewcount": "1 Review sorted by",
	"description": "The odd-numbered chapters of the story tell of how Jorge, Elizabeth, and another girl named Penelope de la Rosa grew up together, eventually leading to Jorge joining the Royal Air Force and marrying Elizabeth. However, this time around, their wedding is threatened by a zombie invasion. Along the way he makes new friends, such as Tsukumojuku Kato and Steven Motorize, and gets framed for a murder.\r\n\r\nThe other chapters, however, are another story altogether and considered the true story of the novel. Set in the 20th century after Made In Heaven resets the world exactly thirty-six times, it focuses on kid detective Joji Joestar who, while investigating a recent string of incidents, comes across a boy detective named Tsukumojuku Kato, who has somehow travelled between universes. After he is found dead in Morioh, seemingly by Yoshikage Kira’s hands, Joji heads to investigate, and after a strange series of events meets up with the original Giorno Giovanna and Rohan Kishibe. Giorno has survived due to his Stand Gold Experience Requiem nullifying the effects, while Rohan survives by being too preoccupied with his manga to realize Made In Heaven was activated. Along the way, Joji eventually reaches outer space, and meets 36 versions of Kars, each from a different universe, one of which accompanies him back to Earth, all ending in a massive fistfight with Dio Brando as he attempts to become the Holy Corpse and gain unlimited power.>"
}