{
	"url": "https://www.novelupdates.com/series/lady-cultivator/",
	"title": "Lady Cultivator - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2018/11/Lady-Cultivator.jpg",
	"noveltype": "(CN)",
	"genre": "Adventure   Fantasy   Gender Bender   Josei   Romance   Xianxia   ",
	"tags": "Age Progression   Beast Companions   Beautiful Female Lead   Betrayal   Calm Protagonist   Cultivation   Death of Loved Ones   Fast Cultivation   Female Protagonist   Handsome Male Lead   Hard-Working Protagonist   Hiding True Identity   Inheritance   Late Romance   Magic Formations   Magical Space   Multiple Identities   Older Love Interests   Orphans   Pill Concocting   Poor to Rich   Slow Romance   Strength-based Social Hierarchy   Strong Love Interests   Transformation Ability   Unique Cultivation Technique   Weak to Strong   ",
	"rating": "(4.0 / 5.0, 92 votes)",
	"author": "Yun Ji   云芨   ",
	"year": "\n2010",
	"ranking": "#3314   #2914   #3720   #4427   #5897   ",
	"reviewcount": "19 Reviews sorted by",
	"description": "The challenges a female cultivator has to overcome on her life journey are countless.\n\nShe mustn’t be lacking in talent, cultivation techniques, medicinal pills, and magic weapons. Otherwise, her cultivation would progress too slowly.\n\nShe also mustn’t have too many emotions, weaknesses, kindness, and greed. If she has too much of them, she would soon greet death.\n\nMoreover, she must look neither too pretty nor too ugly. Although she mustn’t be stupid, she also couldn’t be too intelligent.\n\nBeing a female cultivator, Mo Tiange naturally has to face those challenges. Nevertheless, being orphaned from a young age had toughened her tenacity and resilience. Neither having what were deemed as waste spiritual roots nor limited resources could deter her spirit. Staying as inconspicuous as possible but never letting an opportunity go was her daily life. Follow Mo Tiange as she embarkes on a journey to survive and achieve immortality in the harsh and merciless cultivation world …>"
}