{
	"url": "https://www.novelupdates.com/series/the-duchess-who-sees-ghosts/",
	"title": "The Duchess Who Sees Ghosts - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/08/The-Duchess-Who-Sees-Ghosts.jpg",
	"noveltype": "(KR)",
	"genre": "Fantasy   Romance   Shoujo   Supernatural   ",
	"tags": "Adapted to Manhwa   Aristocracy   Beautiful Female Lead   Confident Protagonist   European Ambience   Female Protagonist   Ghosts   Gods   Handsome Male Lead   Nobles   Psychic Powers   Transmigration   Transported to Another World   ",
	"rating": "(3.5 / 5.0, 29 votes)",
	"author": "Garamdal   가람달   ",
	"year": "\n2018",
	"ranking": "#6970   #2000   #7106   #11742   #4098   ",
	"reviewcount": "1 Review sorted by",
	"description": "Y​eonhee lived as a shaman who served God since she was young.\r\n\r\nIt was a life where she drew amulets and swung her fan when she was dealing with people.\r\n\r\n​But death came in an instant.\r\n\r\nShe was born as ‘Julia Robinheartz’ and started a new life.\r\n\r\nWould she be able to get out of the bridle called shamanism now?\r\n\r\nIf only she can live a normal life…….\r\n\r\n[Huhu, please release my grudge.]\r\n\r\n“Please go to the temple for that.”\r\n\r\n[It’s so unfair! I can’t believe I was struck by lightning while I was in the street and died….!]\r\n\r\n“That’s what life is.”\r\n\r\nBut even in this life, there are endless ghosts ​who asked for a release to their revenge.\r\n\r\n“My name is Rio Sirius Ephesia.\r\n\r\nI am the Duke in Ephesia Dukedom and the current commander-in-chief of Proren Kingdom.”\r\n\r\nA man suddenly came into Julia’s tiring life.​\r\n\r\n“Will you marry me?”\r\n\r\nHe seduced Julia by showing off his wealth and possessions.\r\n\r\nI already have letters of proposals piling up like a mountain, but let alone marriage, I am busy as hell dealing with ghosts!\r\n\r\n“Then let’s have a deal.”\r\n\r\n​As soon as she rejected him, he gave her business as if he had been expecting it.\r\n\r\nIt was indeed uncomfortable, but because blank cheque had been going back and forth in front of her she couldn’t get herself together.\r\n\r\n​”…Okay. What is it?”\r\n\r\n​First of all, let’s earn some money.>"
}