{
	"url": "https://www.novelupdates.com/series/becoming-the-villains-family/",
	"title": "Becoming the Villain’s Family - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/12/Becoming-the-Villains-Family.jpg",
	"noveltype": "(KR)",
	"genre": "Drama   Fantasy   Romance   ",
	"tags": "Abusive Characters   Adapted to Manhwa   Aristocracy   Beautiful Female Lead   Charming Protagonist   Child Abuse   Child Protagonist   Contracts   Cruel Characters   Curses   Cute Children   Cute Protagonist   Demi-Humans   Depictions of Cruelty   Doting Love Interests   Doting Parents   European Ambience   Family   Fantasy Creatures   Female Protagonist   Godly Powers   Gods   Half-human Protagonist   Handsome Male Lead   Hidden Abilities   Hiding True Abilities   Hiding True Identity   Magic   Maids   Marriage   Marriage of Convenience   Music   Mysterious Family Background   Mythology   Nobles   Pregnancy   Priestesses   Priests   Reincarnation   Religions   Saints   Second Chance   Singers   Special Abilities   Tragic Past   Younger Love Interests   ",
	"rating": "(4.5 / 5.0, 222 votes)",
	"author": "설이수   ",
	"year": "\n2020",
	"ranking": "#338   #155   #884   #417   #276   ",
	"reviewcount": "26 Reviews",
	"description": "Sirens: a name derived from an ancient creature, used to describe those who could charm, lure, control, and heal others by singing.\n\nSubjected to live the life of a siren, Aria had experienced, seen, and heard many horrific things. Broken beyond repair, Aria resigned herself to death, when suddenly…\n\nThe Grand Duke, Lloyd Cardence Valentine, arrived and whispered, “Should I kill everyone here?”\n\n“If you need me, just call me. Your song will always reach me, wherever you are.”\n\nIn the end, Aria called the devil, bringing death to all those present, along with herself.\n\n“Let’s fall down to hell together.”\n\nAnd with that, Aria breathed her last and died… only to return to her 10-year-old self.\n\nNow that she had a second chance at her life, Aria was determined to change her fate, as well as the cruel fate of her saviour, Grand Duke Valentine.\n\nAnd so… Aria proposed to him with a marriage contract.\n\nShe sold her soul to the devil and vowed to protect him.\n\n[Marry me.] Aria extended her hand and gave him the contract. [Let’s get divorced in 10 years…]\n\nThe young duke took the contract from her hand.\n\n“So, where should I stamp the seal?”\n\n* * *\n\n“You said you’d divorce me within 10 years.”\n\nThe grown-up villain leaned in, hovering his head before he kissed her tenderly over her crown.\n\n“Now that we’re adults, we should sign another contract.”>"
}