{
	"url": "https://www.novelupdates.com/series/kokugensou-wo-item-cheat-de-ikinuku-ln/",
	"title": "Kokugensou wo Item Cheat de Ikinuku (LN) - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2016/07/Kokugensou-wo-Item-Cheat-de-Ikinuku.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Comedy   Fantasy   Harem   Romance   ",
	"tags": "Adapted to Manga   Animal Characteristics   Beastkin   Business Management   Carefree Protagonist   Firearms   Industrialization   Loli   Maids   Male Protagonist   Monsters   Polygamy   R-15   S*ave Harem   S*aves   Sword And Magic   Transported to Another World   Wars   Weak Protagonist   Younger Love Interests   ",
	"rating": "(3.6 / 5.0, 47 votes)",
	"author": "Fuuraisan   風来山   ",
	"year": "\n2015",
	"ranking": "#2000   #2000   #9120   #6189   #4152   ",
	"reviewcount": "2 Reviews sorted by",
	"description": "Sawatari Takeru was suddenly teleported to a remote village in a different world. He immediately shouted with joy, “Hyahaa! Another World Teleportation! I’m the Hero!”, he then went to the nearest store, sold all his belongings and purchased an iron sword, then to the Adventurers' Guild and took a Crazy Dog Subjugation Quest. He stormed out of the village and fought the dogs… and got pwned in return… easily. Just as he was about to die, a female Adventurer saved him. She introduced him to a safer job as a laborer for a farmer. The dream of being a Hero is over on day one.\n\nAfter a week of work cleaning cow dung, he discovered that Japanese letters is considered sacred text in this world and used in official documents. Thus he applied for a job in the local government office and was made an assistant secretary. As he worked in the office, he tried to reproduce modern inventions in this world. He found that in the surrounding area there were the resources to create Gunpowder. Thus, with the help of his superior he began developing explosives for mines, then muskets and cannons. Eventually he started up a company with slave girls as employees selling soap and crepes.\n\nAt the same time, the kingdom was threatened by the rising activities of monsters and Takeru’s superior suggested to the capital to use their firearms to fight back, but the knights just laughed at them. To prove them wrong, Takeru raised a volunteer army from slaves and farmers to exterminate the threat.>"
}