{
	"url": "https://www.novelupdates.com/series/i-want-to-become-the-emperor-so-i-need-a-divorce/",
	"title": "I Want To Become The Emperor, So I Need A Divorce - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/01/I-Want-To-Become-The-Emperor-So-I-Need-A-Divorce.jpg",
	"noveltype": "(KR)",
	"genre": "Fantasy   Romance   Shoujo   ",
	"tags": "Beautiful Female Lead   Divorce   Female Protagonist   Handsome Male Lead   Revenge   Schemes And Conspiracies   Wizards   ",
	"rating": "(3.8 / 5.0, 29 votes)",
	"author": "Ryu Juyeon   류주연   ",
	"year": "\n2020",
	"ranking": "#5262   #6244   #8032   #7991   #5730   ",
	"reviewcount": "2 Reviews sorted by",
	"description": "\nBorn as an imperial princess, Arnoa married a pathetic king of a bordering territory. Her eldest brother, whom she doesn’t get along with, was the emperor. She had no choice but to do what she was ordered. \n\n“I love you, Larissa.”\n“Larissa is so happy.”\n\nWhether her husband was having an affair with her lady-in-waiting or not, she quietly stayed and waited for her death. \nHer eldest brother was dead. \nHer second brother was dead, too?\n\nThen the next emperor was Arnoa… no, it’s her worthless husband. \nAll titles that she would inherit while under a marriage contract would be vested to her husband. She couldn’t let that happen even if she died, and so she decided. \n\n“I’ll get a divorce. I’ll be the Emperor.”\n\nHer husband, who was late to hear the news, knew nothing yet. For that reason, she decided to become a crazy queen. \n\n“Looking at you closely, you look ugly.”\n\nShe would say what she wanted to say to her husband. \n\n“Do you know how to swim? You need to if you can’t.”\n\nShe watched her husband and cheating maid fall into the pond.\nThe goal was to divorce her husband and become the ruler of the continent.\n\n“If you only waited for one more day, the continent would have been yours.”\n\nWhen he realized the truth, it was after everything was over. \nShe said to her foolish ex-husband with his mouth wide open. \n\n“I’m telling you to lower your head. Didn’t you hear me?”>"
}