{
	"url": "https://www.novelupdates.com/series/the-god-slaying-hero-and-the-seven-covenants/",
	"title": "The God Slaying Hero and the Seven Covenants - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2015/08/kamigoroshi.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Comedy   Fantasy   Romance   Shounen   Slice of Life   ",
	"tags": "Beastkin   Beautiful Female Lead   Death of Loved Ones   Demon Lord   Demons   Dragons   Elves   Former Hero   Gods   Hard-Working Protagonist   Heroes   Kingdoms   Male Protagonist   Misunderstandings   Monsters   Multiple Transported Individuals   Past Plays a Big Role   R-15   Sentient Objects   Special Abilities   Summoned Hero   Sword And Magic   Transported to Another World   ",
	"rating": "(4.0 / 5.0, 314 votes)",
	"author": "Umetane   ",
	"year": "\n2014",
	"ranking": "#2000   #2000   #1785   #1566   #492   ",
	"reviewcount": "23 Reviews sorted by",
	"description": "Three years ago, to defeat the Demon God who was trying to destroy this world, thirteen Braves were summoned from another world. Each of them had varied ages and gender. Each of them was bestowed with cheat like powers not normal in this world.\r\n\r\n\r\nOne asked for indomitable will against any adversity.\r\nOne asked for god-like magic power.\r\nOne asked for a power to heal everyone.\r\nOne asked for a power to cook foods that will bring smiles to everyone.\r\n\r\n\r\nAnd so forth, each of them conveyed their wish and were granted what they asked for so that they could complete their quest. They then departed, on an adventure to defeat the demon god. For two years, they journeyed together and survived many hardships in this world, through joy, sadness, and discord; they persevered and in the end brilliantly defeated the demon god, brought peace to this world and then decided to live there. Among those thirteen is one man that hid his whereabouts and disappeared after defeating the Demon God, but everyone would say:\r\n\r\nIt is he, the center of the thirteen braves, who is far more heroic than others.\r\n\r\nIt is he, who valiantly stands on the foremost line, protecting the others behind him.\r\n\r\nIt is he, the strongest man that killed the demon god.\r\n\r\nAnd it is he, the only one who is blessed and loved the most by the goddess.>"
}