{
	"url": "https://www.novelupdates.com/series/accompanying-the-phoenix/",
	"title": "Accompanying the Phoenix - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2017/04/1427882028-3937802714.jpg",
	"noveltype": "(CN)",
	"genre": "Adventure   Comedy   Romance   Xianxia   ",
	"tags": "Adapted to Drama   Aristocracy   Beautiful Female Lead   Betrayal   Broken Engagement   Confident Protagonist   Cultivation   Demons   Devoted Love Interests   Female Protagonist   Generals   Gods   Handsome Male Lead   Heartwarming   Hot-blooded Protagonist   Immortals   Magic   Multiple Realms   Phoenixes   Power Couple   Protagonist Strong from the Start   Sharp-tongued Characters   Slow Romance   Strong Love Interests   Tomboyish Female Lead   Wars   ",
	"rating": "(4.5 / 5.0, 176 votes)",
	"author": "Jiu Lu Fei Xiang   九鹭非香   ",
	"year": "\n2013",
	"ranking": "#3802   #4142   #2241   #9503   #1427   ",
	"reviewcount": "16 Reviews sorted by",
	"description": "Of the ancient gods, only one remained in the world. This god lived alone for thousands of years and no longer had any desires. Legend has it that—during the great war between the worlds—he used his powers to turn the tide, managing to seal the cataclysmic rift and bring order back into the three realms. Time flew by and hundreds of years passed in the blink of an eye. \n\nIn this time, Shen Li was born into the demon world. Known as the Azure Sky King, she was used to living a bright and dazzling life full of successes. Little did she know that her 1000th birthday would bring misfortune to her doorstep—a politically arranged marriage with her name on it. The Azure Sky King would henceforth marry the thirty-third grandson of the Heavenly Emperor, Fu Rongjun. This arranged marriage was meant to unite the Heavenly realm with the Demonic Realm, bringing the two together. Most would consider it good fortune to be related to the Emperor.\n\nUnfortunately, Fu Rongjun was infamous throughout the two realms for his Casanova personality. As the King who called the shots in the Demonic Realm, she had the ability to quell uprisings and end wars with a swing of her silver spear—there was absolutely no way she would marry such a flirtatious idiot. She had to escape from this marriage somehow even if it meant death!\n\nIn her escape, Shen Li never expected to meet a man that didn’t belong to any of the three realms. This oddball was truly strange!>"
}