{
	"url": "https://www.novelupdates.com/series/i-was-reincarnated-on-an-island-where-the-strongest-species-live-so-i-will-enjoy-a-slow-life-on-this-island/",
	"title": "I Was Reincarnated on an Island Where the Strongest Species Live So I Will Enjoy a Slow Life on This Island - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/09/I-Was-Reincarnated-on-an-Island-Where-the-Strongest-Species-Live-So-I-Will-Enjoy-a-Slow-Life-on-This-Island.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Comedy   Ecchi   Fantasy   Harem   Romance   Slice of Life   ",
	"tags": "Beautiful Female Lead   Carefree Protagonist   Chefs   Cooking   Dragons   Heartwarming   Male Protagonist   Medical Knowledge   Mythical Beasts   Overpowered Protagonist   Vampires   ",
	"rating": "(2.8 / 5.0, 9 votes)",
	"author": "Heisei Owari   ",
	"year": "\n2021",
	"ranking": "#2000   #2000   #10738   #8372   #10055   ",
	"reviewcount": "No Reviews",
	"description": "Arata Todo, a company employee, dies due to a God's mistake.\r\n\r\nAs an apology, he is reincarnated into another world, and as a bonus, he is given a strong body that is immune to disease and injury, and the power to copy the magic and skills of others just by looking at them.\r\n\r\nThe place where Arata was reincarnated with his new body in another world was an island inhabited by the 『Strongest Species』 of mythology and folklore, such as the Divine Beasts, High Elves, Demons, Ancient Dragons, and True Ancestor Vampires.\r\n\r\nThis island is supposed to be dangerous, but Arata's body, given to him by the gods, is stronger than the strongest of them, and no matter what the danger, it doesn't matter to him.\r\n\r\nEven a giant boar is just one punch away from being delicious prey. The ancient dragon's breath is very comfortable to receive. There is no one who can harm his invincible body.\r\n\r\nSo Arata, along with the girls he meets on the island and the strongest species, eats delicious food, makes noise, relaxes, and enjoys his second life given to him by God to the fullest.\r\n>"
}