{
	"url": "https://www.novelupdates.com/series/its-better-to-be-the-empress-dowager/",
	"title": "It’s Better to be the Empress Dowager - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/07/Its-Better-to-be-the-Empress-Dowager.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Comedy   Drama   Romance   Shoujo   ",
	"tags": "Ancient China   Aristocracy   Arrogant Characters   Beautiful Female Lead   Bickering Couple   Books   Carefree Protagonist   Charming Protagonist   Cold Love Interests   Confident Protagonist   Cute Protagonist   Dense Protagonist   Determined Protagonist   Devoted Love Interests   Doting Love Interests   Drugs   Empires   Family Conflict   Female Protagonist   Handsome Male Lead   Hard-Working Protagonist   Jealousy   Kind Love Interests   Love Interest Falls in Love First   Love Rivals   Lucky Protagonist   Misunderstandings   Mob Protagonist   Multiple POV   Naive Protagonist   Nobles   Older Love Interests   Parallel Worlds   Parody   Politics   Power Struggle   Precognition   Pregnancy   Proactive Protagonist   Quirky Characters   Royalty   R*pe   Schemes And Conspiracies   Shameless Protagonist   Slow Romance   Spies   Strong Love Interests   Tragic Past   Tsundere   Unconditional Love   Villainess Noble Girls   Wealthy Characters   ",
	"rating": "(4.4 / 5.0, 294 votes)",
	"author": "September Flowing Fire   九月流火   ",
	"year": "\n2021",
	"ranking": "#2132   #2750   #1578   #950   #2108   ",
	"reviewcount": "88 Reviews sorted by",
	"description": "Tang Shishi was the number one beauty in the court. She was arrogant, domineering and aggressive. She accidentally picked up a book and learned that she was just a vicious female second lead in a palace struggle. Later, she would fight for favor with the female lead, and eventually she was ruined and died miserably. \r\n\r\nNow, they have just entered the fief of Jing Wang, and the first meeting of the male and female leads has not happened yet. There are two paths before Tang Shishi. The first is to hold the heroine's thighs tightly and join the female lead camp early; the second is to please the male lead and steal the favor of the female lead.\r\n\r\nTang Shishi chooses the third way.\r\n\r\nTang Shishi knew that the male lead's adoptive father Jing Wang seemed to be low profile, but in fact he was overly ambitious. In the near future, he will invade the capital and proclaim the emperor before the imperial court, but it is a pity that he passed away before passing the throne to the male lead.\r\n\r\nThis year, Jing Wang is twenty-four years old, still young, and has yet to marry a wife.\r\nAnyway, she already in the Forbidden City. Instead of being the concubine of the male lead, it is better to be his adopted mother, the empress dowager in one step.\r\n\r\n--------------\r\n\r\nZhao Chengjun had no intention to get married, so he adopted his subordinate son as his heir. He thought he would be with his army in his whole life.\r\n\r\nLater, the imperial family sent a team of beauties to Prince Jing, and the leader was named Tang Shishi. \r\n\r\nHis young, adopted son and his subordinates also persuaded: Your Highness, this is a beauty trap. \r\nJing Wang: I know.\r\n\r\nThe so-called beauty trap was merely a bait for those who wish.\r\n>"
}