{
	"url": "https://www.novelupdates.com/series/immortal-path-to-heaven/",
	"title": "Immortal Path to Heaven - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/07/ImmortalPathtoHeaven5.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Fantasy   Harem   Martial Arts   Xuanhuan   ",
	"tags": "Alchemy   Artifact Crafting   Artifacts   Beast Companions   Beasts   Beautiful Female Lead   Blacksmith   Calm Protagonist   Caring Protagonist   Cautious Protagonist   Character Growth   Cheats   Comedic Undertone   Crafting   Cultivation   Dao Comprehension   Daoism   Demons   Dragons   Fast Learner   Friendship   Game Elements   Genius Protagonist   Hard-Working Protagonist   Heavenly Tribulation   Hiding True Abilities   Hiding True Identity   Insects   Kidnappings   Kingdoms   Legends   Long Separations   Lucky Protagonist   Magic Beasts   Magic Formations   Male Protagonist   Master-Disciple Relationship   Mature Protagonist   Military   Multiple Realms   Nobles   Orphans   Phoenixes   Pill Concocting   Poisons   Pragmatic Protagonist   Romantic Subplot   Royalty   Ruthless Protagonist   Schemes And Conspiracies   Skill Assimilation   Slow Growth at Start   Soul Power   Spear Wielder   Special Abilities   Spirits   Strength-based Social Hierarchy   System Administrator   Underestimated Protagonist   Unique Cultivation Technique   Unique Weapons   Wars   Weak to Strong   ",
	"rating": "(3.1 / 5.0, 34 votes)",
	"author": "Cang Tian Bai He   Heaven's White Crane   苍天白鹤   ",
	"year": "\n2016",
	"ranking": "#2000   #2000   #7681   #13807   #10577   ",
	"reviewcount": "10 Reviews sorted by",
	"description": "“Master Ouyang, please smith a divine weapon for me!”\r\n\r\n“Master Ouyang, you’re the only person who can forge a weapon with seven attributes. Please make my dream come true!”\r\n\r\n“Master Ouyang, could you…”\r\n\r\n“Ouyang my *ss! My surname is Ou!”\r\n\r\nOu Yangming was an orphan who was adopted by a reputable old blacksmith from a military camp. After working as a helper under the old man for years, he was given a chance to acquire the Military Fire—a trait allowing him to smith and restore equipment with the Military Fire produced from his hands.\r\n\r\nGifted with mental power, Ou Yangming controlled his Military Fire unusually well and was also strangely talented in martial arts. On top of it, he could also attach Unique Attributes into weapons with a hundred-percent success rate. Those who belittled Ou Yangming because of his background and age eventually honored him so much that they would do anything to get their hands on his equipment.\r\n\r\nLittle did Ou Yangming know that as he slowly unfolded the mysteries of the Military Fire and his mental power, he was advancing step by step on the immortal path to Heaven!>"
}