{
	"url": "https://www.novelupdates.com/series/amorous-short-stories/",
	"title": "Amorous Short Stories - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/09/Amorous-Short-Stories.png",
	"noveltype": "(CN)",
	"genre": "Adult   Mature   Romance   Smut   ",
	"tags": "Beautiful Female Lead   Celebrities   Collection of Short Stories   Exhibitionism   Female Protagonist   First-time Interc**rse   Reverse Harem   R*pe   ",
	"rating": "(3.4 / 5.0, 63 votes)",
	"author": "Meng Dong   萌动   ",
	"year": "\nN/A",
	"ranking": "#2283   #925   #3091   #1989   #4941   ",
	"reviewcount": "3 Reviews sorted by",
	"description": "Story 1: Stripping to Fame\n\nAfter three unsuccessful years in the entertainment industry, Shen Xunyuan finally decides to act in an er*tic movie. She thought the filming would be proper despite having to take it all off, since it was a major production with a famous director and rich investors. However, why did the award winning male lead really thrust his stick into her?! And the internationally renowned director wanted to run through the scenes with her?! Wait! Director! Where are you touching?!  \n\nStory 2: The Confession of the Floral Lips\n\nIt’s a breathtaking sight when the peach blossoms bloom at the Peach Blossoms Valley. A young man about the age of twelve or thirteen loosens his pants, and spurts thick and white s*men onto a large stalk of flower by the riverbank. After that, he mumbles to that faint petite figure in the stalk, “My wife … I want to get married to you quickly…” \n\nStory 3: The Princess’ Ecstasy\n\nIt’s rumoured that the princess of Xuan, Jiang Si, is a graceful and ethereal beauty. In Jin, Feng Zhen looks at the n*ked beauty in the sandalwood trunk. There are ripples under his eyes, as he looks down. The Ambassador from Xuan hastily reports, “Your Majesty, this is Xuan’s treasure. We’re presenting this to Your Majesty to show our country’s allegiance!” \n\nEvery second of the wedding night is important. Under the illumination of the red candles, the am*rous panting and the slapping of bodies continued for an entire night….\n\nStory 4: Childhood Companion\n\nIn Shengjing, everyone knows that the eldest son of the Duke of Ningguo, Xie Xun is an outstanding and talented man. However, he married the Marquis of Yongan’s only daughter Song Ruwan, breaking the hearts of every woman in the capital.  “That second young mistress of the Song family has the face of a seductress. She conveniently used her identity as the young master’s childhood companion to stick to him from a young age. Otherwise, how could she marry into the Duke’s family with her background?” \n\nAfter her rebirth, this type of gossip was what Song Ruwan heard the most. So, she decided to make this vixen accusation the truth! \n\nStory 5: Locking the Beauty in the Palace\n\nIt’s wet between her legs… It was so itchy that Ji Huayao rubbed her legs and fidgeted around on the bed. She knows that she’s fallen into a trap, but deep within the palace, who could save her? \n\nIn her faint view, she saw a yellow well-built figure walking slowly towards her. She couldn’t see his face clearly, but she knew who this yellow figure was. “Your Majesty… No…”>"
}