{
	"url": "https://www.novelupdates.com/series/failed-to-abandon-the-villain/",
	"title": "Failed To Abandon the Villain - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/05/Failed-To-Abandon-the-Villain.jpg",
	"noveltype": "(KR)",
	"genre": "Drama   Fantasy   Mystery   Psychological   Romance   Tragedy   ",
	"tags": "Adapted to Manhwa   Age Progression   Alchemy   Apathetic Protagonist   Aristocracy   Beautiful Female Lead   Calm Protagonist   Cautious Protagonist   Character Growth   Child Abuse   Clever Protagonist   Cold Protagonist   Cruel Characters   Dark   Depictions of Cruelty   Devoted Love Interests   Female Protagonist   Handsome Male Lead   Love Interest Falls in Love First   Magic   Male Yandere   Master-Servant Relationship   Multiple POV   Nobles   Obsessive Love   Past Trauma   Pragmatic Protagonist   Reincarnated in Another World   Reincarnation   S*aves   Strong Love Interests   Summoning Magic   Twisted Personality   ",
	"rating": "(4.2 / 5.0, 140 votes)",
	"author": "Eunhyang Ja   자은향   ",
	"year": "\n2019",
	"ranking": "#6970   #2000   #2228   #868   #1858   ",
	"reviewcount": "38 Reviews sorted by",
	"description": "One day, her father gave her a sl*ve boy. He said he saved him from the battlefield because of his good looks.\n\n “He has a seal engraved on his heart. As long as you have this bead, he won’t be able to disobey you. So you can order him to do anything.” \n\n“Sit down.”\n\nThe boy looked rather grim after hearing what she ordered. \n\n“Ah, was I treating him too much like a dog?” As her father squeezed the bead, the boy then knelt at her feet.\n\n “Master” \n\nHis red eyes flashed, illuminating his eerie gaze while smiling madly. \n\nHe was the darkest of the darkest one. The future grand wizard and final boss of this world. \n\n“Well, you’re all that’s left now, Master.”\n\n And then, at the age of 22, he awoke as the Master of the Magic Tower and took revenge by killing her entire house.\n\n “Do you want to live? Then sit down, Master.”\n\nThe eerie red eyes turned to her. \n\n‘Why is he like this to me?! I tried my best to treat him properly!’>"
}