{
	"url": "https://www.novelupdates.com/series/in-this-life-i-will-be-the-lord/",
	"title": "In This Life, I Will Be The Lord - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/08/In-This-Life-I-Will-Be-The-Lord.jpg",
	"noveltype": "(KR)",
	"genre": "Drama   Fantasy   Romance   ",
	"tags": "Abusive Characters   Adapted to Manhwa   Age Progression   Age Regression   Aristocracy   Beautiful Female Lead   Business Management   Businessmen   Character Growth   Child Protagonist   Childcare   Clever Protagonist   Complex Family Relationships   Cunning Protagonist   Cute Children   Cute Protagonist   Dense Protagonist   Determined Protagonist   Devoted Love Interests   Doting Love Interests   Doting Parents   European Ambience   Familial Love   Family   Family Business   Family Conflict   Female Protagonist   Handsome Male Lead   Hard-Working Protagonist   Hiding True Abilities   Kingdoms   Late Romance   Love Interest Falls in Love First   Manipulative Characters   Marriage   Marriage of Convenience   Merchants   Nobles   Past Plays a Big Role   Past Trauma   Politics   Reincarnated in Another World   Reincarnation   Revenge   Royalty   Schemes And Conspiracies   Second Chance   Slow Romance   Smart Couple   Strong Love Interests   Time Skip   Tragic Past   ",
	"rating": "(4.1 / 5.0, 241 votes)",
	"author": "Kim Ro Ah   ",
	"year": "\n2019",
	"ranking": "#1144   #527   #2031   #1728   #904   ",
	"reviewcount": "20 Reviews",
	"description": "Florentia was reincarnated as the illegitimate child of the richest family in the empire.\n\nShe had thought that everything would go well in the future.\n\nBut her father had passed away, her relatives left her at the doorsteps, and the honorable family she was so proud of was completely ruined….\n\nBut is this real?\n\nShe drank a little (a lot) and was hit by a carriage,\n\nWhen she opened her eyes again, she was seven years old?\n\nMoreover, the Second Prince, who was the enemy of her family in her previous life is following her around like a dog!\n\n“Tia, you’re prettier than me.”\n\n“….Are you kidding me right now?”\n\n“No. I mean it.”\n\nAlright, both the Second Prince and the family are mine!\n\nIn this life, I’ll have to become the Overlord.>"
}