{
	"url": "https://www.novelupdates.com/series/indulging-in-carnal-desire/",
	"title": "Indulging in Carnal Desire - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/08/aaaaacsIL.jpg",
	"noveltype": "(CN)",
	"genre": "Adult   Fantasy   Mature   Mecha   Romance   Sci-fi   Smut   ",
	"tags": "Age Regression   Animal Characteristics   Appearance Changes   Appearance Different from Actual Age   Beautiful Female Lead   Clever Protagonist   C*nnilingus   Cold Love Interests   Cunning Protagonist   Cute Protagonist   Devoted Love Interests   Doting Love Interests   Family Conflict   Female Protagonist   First-time Interc**rse   F*llatio   Handsome Male Lead   Human-Nonhuman Relationship   Incest   Kind Love Interests   Loli   Master-Disciple Relationship   Multiple Identities   Multiple Realms   Older Love Interests   Persistent Love Interests   Popular Love Interests   Strong Love Interests   System Administrator   Transmigration   Transplanted Memories   World Hopping   ",
	"rating": "(4.2 / 5.0, 214 votes)",
	"author": "Qing Huan   清欢   ",
	"year": "\n2018",
	"ranking": "#1217   #369   #567   #919   #795   ",
	"reviewcount": "49 Reviews",
	"description": "Chu Jiao had always suffered from the quick changing nature of human relationships since little and had never tasted the feeling of being doted on. She was suddenly informed that her existence was only a few strokes of a pen in a novel. All her suffering was set by the author in order to make the male and female leads succeed.\n\nShe wasn’t willing nor could she accept the truth.\n\nFor vengeance, she bound herself to the “Supporting Female Carnal Desire System”. In order to survive and go back to the original world, she needed to kick down the female lead and take on the mission of catching the male lead and to clear the conditions, she needed——bo-body fluids?\n\nOriginally, she only planned to use her body without the intention of losing her heart but she never imagined that she would over and over again meet people that would carefully place her in the palm of their hand and spoiled her dearly.\n\nThey paid her with sincerity so she might as well return it with deep feelings.\n\nUltimately, she discovered that everything was actually love.\n\nAs the stars move and the time turns, you’ll like me no matter what I look like.>"
}