{
	"url": "https://www.novelupdates.com/series/pixiu-restaurant-no-way-out/",
	"title": "Pixiu Restaurant, No Way Out - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/06/Pixiu-Restaurant-No-Way-Out.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Romance   Slice of Life   Supernatural   Yaoi   ",
	"tags": "Adapted to Manhua   Comedic Undertone   Ghosts   Handsome Male Lead   Money Grubber   Mythical Beasts   Non-humanoid Protagonist   Protagonist Strong from the Start   Seme Protagonist   ",
	"rating": "(4.8 / 5.0, 26 votes)",
	"author": "Hai Jingluo   海鶄落   ",
	"year": "\n2019",
	"ranking": "#1288   #6380   #7479   #7149   #7191   ",
	"reviewcount": "4 Reviews sorted by",
	"description": "When the old beast Pixiu went out to throw away the garbage, a male ghost fell into his arms just after he finished categorizing the garbage.\n\nThis male ghost was named Wen Xi, and he was as beautiful as a flower. Not only that, but he was also soft and cool to the touch, which meant he was perfect for Pixiu to use as an ice pillow. After all, Pixiu had been punished by the Heavens, and was doomed to endure insufferable hotness surging inside his body. \n\nAlthough Pixiu swore to the Heavens that he was only using the ghost as an ice pillow, no one believed him.\n\nPixiu: “Even if the red thread of fate holds my body, my heart is that of a bachelor!”\n\nWen Xi, who was sealed in a fermentation jar for hundreds of years, was finally released to the world…..only to find himself turned into a child-bride to pay off his debts.\n\nHowever, this “Husband” of his was also a self-employed beast, who had to pay taxes and repay loans every month. \n\nWen Xi: “Is the other Pixiu as miserable as you are?”\n\nAlthough those two were a mess, they turned out to be a good match in the end. Even Yue Lao gave them a marriage interview.\n\nThe only thing Pixiu knew to say was that finding a beautiful wife was fairly easy. You just have to be good at sorting through garbage.\n\nIn other words: I picked up my wife in the garbage can.>"
}