{
	"url": "https://www.novelupdates.com/series/toaru-majutsu-no-index-sp/",
	"title": "Toaru Majutsu no Index SP - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2015/08/toarumajutsu2.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Sci-fi   Shounen   Supernatural   ",
	"tags": "",
	"rating": "(4.1 / 5.0, 18 votes)",
	"author": "Kamachi Kazuma   鎌池和馬   ",
	"year": "\n2011\r\n",
	"ranking": "#2000   #2000   #10280   #13808   #10898   ",
	"reviewcount": "No Reviews",
	"description": "A collection of four short stories and manga from Toaru Majutsu no Index & Toaru Kagaku no Railgun, previously only seen limited release. Because it has manga illustrations, the width and height of the light novel is greater than a regular light novel, using B6 paper instead of the usual A6 paper.\r\n\r\nThe light novel marks for the first time that both Haimura Kiyotaka and Fuyukawa Motoi are credited as illustrators on the same light novel.\r\n\r\nStories include:\r\n\r\n* Stiyl Magnus - A single mission is given to Stiyl by the Anglican Church's Necessarius. When Stiyl arrives in Academy City once more, his way is blocked by Theodosia Electra, a fellow member of Necessarius. The reason she is fighting with Stiyl lies with a girl named Patricia Birdway. A battle between magicians over the techniques of the Dvergr from Norse mythology begins.\r\n\r\n* Mark Space - Mark, a magician from the British magic cabal the Dawn-Colored Sunlight, has been instructed to save his boss' little sister. Mark managed to safely make contact with his boss' sister aboard a survey ship, the Blue Research, but a magician who seems to be from a different cabal attacks. Mark plans to rescue his boss' sister using his personal magic that uses tarot cards.\r\n\r\n* Kamijou Touma - While walking through District 21 of Academy City, Kamijou Touma and Index run into a magician named Fleiss. Due to Kamijou's usual misfortune, he somehow ends up on the run from Academy City along with Fleiss. In the process, Kamijou hears of some ridiculous information from Fleiss about an unknown lifeform on Mars.\r\n\r\n* Uiharu Kazari - A carjacking occurs in Academy City. A member of Judgment, Uiharu Kazari ends up helping resolve the situation. The ultimate goal of the carjacking is a large scale terrorist attack on Academy City. In order to stop a large special vehicle roaring along at 120kph, Uiharu struggles alongside Yomikawa of Anti-Skill.>"
}