{
	"url": "https://www.novelupdates.com/series/reikos-manners-shes-referred-to-as-a-villainess-but-actually-shes-just-penniless/",
	"title": "Reiko’s Manners – She’s Referred To As A Villainess, But Actually She’s Just Penniless - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/10/321908000142.jpg",
	"noveltype": "(JP)",
	"genre": "Comedy   Drama   Romance   School Life   Shoujo   Slice of Life   ",
	"tags": "Absent Parents   Academy   Adapted to Manga   Beautiful Female Lead   Bullying   Calm Protagonist   Cooking   Delusions   Dense Protagonist   Family Conflict   Female Protagonist   Living Alone   Misunderstandings   Otome Game   Poor Protagonist   Proactive Protagonist   Shoujo-Ai Subplot   Villainess Noble Girls   Wealthy Characters   ",
	"rating": "(4.0 / 5.0, 71 votes)",
	"author": "Bekio   ベキオ   ",
	"year": "\n2019",
	"ranking": "#413   #355   #3538   #725   #2986   ",
	"reviewcount": "9 Reviews sorted by",
	"description": "I am Kujouin Reiko, a poor lady living without my parents. My Grandmother, who died 2 months ago was a self-indulgent Ojou-sama, who actually has no ability to look after herself. My Father left the infant me after having led the Kujouin family to ruin, and is still missing. It was my Grandmother's maid, Fuki-san, who brought me up. Thanks to Fuki-san, I was able to acquire the ability to look after myself. Meanwhile, my Grandmother, whose pride was tall enough to tower over Mt. Everest, instilled in me disciplines that the daughter of the Kujouin family ought to have. She sat up a piano in our modest rented house and gave me strict guidance. She did the same for dance, manners, and language too. My Grandmother had been studying piano in Europe for a long time.\r\n\r\nI decided to enroll in the high school of the prestigious Meisei Private Academy, which has a special scholarship system, but was tackled from behind on the day of the entrance ceremony, and was tackled by Sakurada Yuria, who called me, 'Villainess young lady' apparently believes that this world is that of an Otome Game. She makes sure I stay away from her childhood friends (whom she called, 'capture targets'), and makes great effort to stick the heroine, Yuuki Miu, and the capture target, Takanashi Ryou, together.\r\n\r\nI don't have the time to be bothered about that though, because of the state of poverty I am in. Meanwhile, it turns out that the house where our maid, Fuki-san, finds retirement is the house of the very same Takanashi Ryou, the capture target. Fuki-san was apparently the great-grandmother of Takanashi Ryou. He accuses me of pushing Fuki-san around but I just want to see her again. At such a time, I lose my home to a landslide. Do your best, dear Me! Don't give up, dear Me!>"
}