{
	"url": "https://www.novelupdates.com/series/vicious-male-counterpart-isnt-competing-anymore/",
	"title": "Vicious Male Counterpart Isn’t Competing Anymore - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/12/Vicious-male-counterpart-isnt-competing-anymore-Rebirth.jpg",
	"noveltype": "(CN)",
	"genre": "Drama   Fantasy   Mecha   Romance   School Life   Shounen Ai   ",
	"tags": "Absent Parents   Artificial Intelligence   Character Growth   Charming Protagonist   Clever Protagonist   Couple Growth   Cute Protagonist   Dense Protagonist   Devoted Love Interests   Doting Love Interests   Family Conflict   Futuristic Setting   Genius Protagonist   Handsome Male Lead   Hard-Working Protagonist   Love Interest Falls in Love First   Manipulative Characters   Naive Protagonist   Second Chance   Slow Romance   Tragic Past   ",
	"rating": "(4.2 / 5.0, 118 votes)",
	"author": "吾七画   ",
	"year": "\n2019",
	"ranking": "#229   #104   #2829   #504   #2869   ",
	"reviewcount": "33 Reviews",
	"description": "Before he died, Yan Hao could never understand why his parents had always favored his younger brother. They spoiled his brother, and wouldn’t pay any attention to himself, no matter what he did.\n\nThe more this happened, the more indignant and upset Yan Hao became, so he began to compete with his brother in everything. As long as it was something his brother wanted to do, he would do it too, and outperform him.\n\nHe was obviously the one who was more talented, but from beginning to end he was never acknowledged by the people around him. His parents, teachers, and classmates all looked at him with disdain, claiming he was jealous and selfish, and liked to steal from others.\n\nIt wasn’t until his death that Yan Hao realized that he had been stealing from the protagonist. He was just a vicious male counterpart in a book to set up the kind hearted protagonist shou. A cannon fodder who existed to let the protagonist gong appear and to slap him in the face, so he could look good in front of the protagonist shou.\n\nAfter he was reborn, Yan Hao kicked the protagonist away. Who the hell wants to compete with you? If laozi turned around, you wouldn’t be able to catch me even if you cried.\n\nHe wouldn’t fight anymore, and he wasn’t jealous. He just wanted to peacefully be himself, and let his light shine on the people who care about him.\n\n—\n\nMany years later, someone asked Yan Hao, who had become a master mecha engineer, “How did you get into mecha manufacturing?”\n\n“Because I met someone.” Yan Hao.>"
}