{
	"url": "https://www.novelupdates.com/series/in-this-world-of-beasts-i-am-the-biggest-boss/",
	"title": "In This World of Beasts, I Am The Biggest BOSS! - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/02/In-This-World-of-Beasts-I-Am-The-Biggest-BOSS.jpeg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Fantasy   Harem   Supernatural   Xuanhuan   ",
	"tags": "Absent Parents   Accelerated Growth   Beast Companions   Beasts   Cheats   Fantasy World   Handsome Male Lead   Hidden Abilities   Human-Nonhuman Relationship   Kingdom Building   Male Protagonist   Master-Servant Relationship   Monster Tamer   Romantic Subplot   Special Abilities   Transmigration   Unique Cultivation Technique   Weak to Strong   ",
	"rating": "(3.4 / 5.0, 19 votes)",
	"author": "二两肥五花   ",
	"year": "\n2021",
	"ranking": "#1874   #1879   #6767   #2215   #9207   ",
	"reviewcount": "2 Reviews sorted by",
	"description": "When he woke up, the world has changed.\r\nThrough astral projection of his soul, Wei Feng found himself in a world of beasts.\r\nEveryone here has the ability to tame beasts – that means everyone here is a beastmaster!\r\nBut beastmasters have clear strengths and weaknesses. Some people can control wild beasts and stand at the peak of this world, while some can only control cattle, sheep, and livestock, and they are at the bottom of this beast-taming food chain.\r\nTo begin a new life in this strange world, Wei Feng summoned a stone man, but he had unexpectedly awakened the ability to extract the core abilities of beasts he encounters.\r\nMoreover, the more the growth of the beasts, the stronger these abilities get.\r\nDing!\r\n【NOTICE: You have unlocked the [Armored Skin] ability of the beast-guarding [Stone Man]!】\r\n……\r\nDing!\r\n【NOTICE: You have unlocked the [Strength Enhancement] ability of the Royal Beast [Dragon Ape]!】\r\n……\r\nDing!\r\n【NOTICE: You have unlocked the [Speed Enhancement] ability of the beast [Blue-scaled Eagle]!】\r\n……\r\nHence, with all the core abilities that he has extracted from these beasts, Wei Feng has transformed into a living human beast!\r\nWhenever the enemy thinks they have successfully defeated all of Wei Feng’s beasts, the corner of Wei Feng’s mouth would raise, revealing an innocent smile, “No, no, no! The battle has just begun – I am the biggest boss here!”>"
}