{
	"url": "https://www.novelupdates.com/series/i-became-the-master-of-the-villain/",
	"title": "I Became the Master of the Villain - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/10/BecameMasteroftheVillain3.jpg",
	"noveltype": "(KR)",
	"genre": "Drama   Fantasy   Psychological   Romance   ",
	"tags": "Abusive Characters   Aristocracy   Broken Engagement   Business Management   Clever Protagonist   Confident Protagonist   Couple Growth   European Ambience   Family Business   Family Conflict   Female Master   Female Protagonist   Handsome Male Lead   Love Interest Falls in Love First   Magic   Male Yandere   Master-Servant Relationship   Money Grubber   Nobles   Politics   Power Couple   Protagonist Strong from the Start   S*xual Abuse   S*aves   Slow Romance   Transmigration   Wealthy Characters   Yandere   ",
	"rating": "(3.8 / 5.0, 118 votes)",
	"author": "페로슈   ",
	"year": "\n2020",
	"ranking": "#4617   #3816   #2004   #1853   #1387   ",
	"reviewcount": "13 Reviews sorted by",
	"description": "The main character of a novel, Kian, blackens and destroys the empire after 20 years of s*avery.\n\nAfter transmigrating into an extra that will die at the hands of the villain, Olivia decides she must stop Kian from going down the wrong path in order to survive.\n\nWith so much money that it was rotting, I put the money to good use and bought the main character from the auction.\n\n“I am Kian. From now on, I will serve you faithfully.”\n\nIn fact, the main character I came to know was a far cry from a bloody killer. I lived because I was a good person before the impending storm.\n\nUntil the main character wakes up as a wizard.\n\nI thought my care and sincerity were successful in stopping his villainous route…\n\n****\n\n“Master, why are you trying to abandon me?” Kian said when I tried to burn his s*ave deed.\n\nMy heart shook at his pleading look and imploring voice. Strengthening my resolve soon, I said, “I’m just trying to set you free.”\n\n“Master says she doesn’t need me anymore.”\n\n“No, I didn’t–“\n\nI couldn’t finish my thought. Kian narrowed the distance between us, bowing his head deeply. His face was so close, it was as if our lips were touching.\n\nMy heart unconsciously started to beat wildly. He whispered softly, burying his face on my shoulder, “I am yours, Master, so you may order anything…”\n\nThe certificate of sale flew into the air and fell into Kian’s hand. A moment ago, he, who had lowered his eyes bitterly, growled as low as a beast: “Just don’t tell me to leave. That order cannot be followed.”\n\nWhat should I do?\n\nIt seems that the main character has turned into a yandere.>"
}