{
	"url": "https://www.novelupdates.com/series/reincarnated-as-an-emperor-will-the-emperor-at-birth-survive/",
	"title": "Reincarnated as an Emperor ~ Will the Emperor at Birth Survive? - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/10/Reincarnated-as-an-Emperor-Will-the-Emperor-at-Birth-Survive.jpg",
	"noveltype": "(JP)",
	"genre": "Fantasy   Shounen   ",
	"tags": "Age Progression   Aristocracy   Beautiful Female Lead   Child Protagonist   Corruption   Determined Protagonist   Empires   Engagement   Episodic   Famous Protagonist   Fantasy World   Fast Learner   Hard-Working Protagonist   Hidden Abilities   Hiding True Abilities   Kingdom Building   Kingdoms   Leadership   Low-key Protagonist   Loyal Subordinates   Magic   Magical Technology   Maids   Male Protagonist   Manipulative Characters   Medieval   Modern Knowledge   Multiple POV   Nobles   Poisons   Politics   Power Struggle   Proactive Protagonist   Reincarnated in Another World   Reincarnation   Religions   Royalty   Schemes And Conspiracies   Secretive Protagonist   Strategist   Survival   Sword And Magic   Underestimated Protagonist   Wealthy Characters   ",
	"rating": "(4.7 / 5.0, 69 votes)",
	"author": "Maseki no Katasa   魔石の硬さ   ",
	"year": "\n2020",
	"ranking": "#631   #2953   #3615   #1222   #4554   ",
	"reviewcount": "7 Reviews sorted by",
	"description": "Being born as an emperor may seem like a jackpot. There is only one person who could call themselves ‘Emperor’ in the Eastern Continent. He, who was born on this supreme seat, would not have a smooth sailing life.\n\nThe previous Emperor, his grandfather, and the person who should have succeeded the throne, his father, were assassinated by the aristocrats. The eighth emperor of Bungdalto, Carmine is a convenient puppet for the aristocrats, and a palanquin who can be killed at any time when no longer needed.\n\nWith the emperor not having received a proper education and the empire collapsing due to political strife among the nobility. The empire teeters on the brink of financial collapse, unable to deal with interventions by neighboring countries, and has no choice but to allow the independence of its frontier areas. The precarious state of the empire is clear to everyone.>"
}