{
	"url": "https://www.novelupdates.com/series/womens-dormitory-manager/",
	"title": "Women’s Dormitory Manager - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2018/03/Womens-Dormitory-Manager.jpeg",
	"noveltype": "(JP)",
	"genre": "Action   Adult   Drama   Harem   Romance   ",
	"tags": "An*l   Adultery   Aristocracy   Arranged Marriage   BDSM   Beautiful Female Lead   Bestiality   Blackmail   Broken Engagement   Bullying   Caring Protagonist   C*nnilingus   Cosplay   Crime   Criminals   Cunning Protagonist   Death   Divorce   Drugs   Enemies Become Allies   Exhibitionism   First-time Interc**rse   F*llatio   Incest   Inheritance   Kidnappings   Loli   Male Protagonist   Marriage   Masochistic Characters   Master-Servant Relationship   M*sturbation   Military   Modern Day   Multiple POV   Netorase   Nobles   Nudity   Older Love Interests   Or*y   Outdoor Interc**rse   Past Plays a Big Role   Past Trauma   Perverted Protagonist   Polygamy   Prostit**es   R-18   Royalty   R*pe   S*x S*aves   S*xual Abuse   Siblings   S*ave Harem   S*aves   Stalkers   Threesome   Time Skip   Voyeurism   Wealthy Characters   Younger Love Interests   ",
	"rating": "(2.5 / 5.0, 71 votes)",
	"author": "黒影たかし   ",
	"year": "\n2016",
	"ranking": "#2000   #2000   #6279   #7470   #5059   ",
	"reviewcount": "1 Review sorted by",
	"description": "Private St. Marielle Girls' Academy \n\nA young lady's school that provides integrated education with junior high school, high school, and university. Three years ago, the 'Saint Girls' Hall' was built 10 minutes on foot from such a school. This is a dormitory exclusively for students attending Marielle Girls' Academy.\n\nTaku Sudo, who renewed his grandfather's rental condominium and built the Seigakuin Kaikan, will install voyeur cameras in all rooms.\n\nWhile snooping on the embarrassing daily life of the girls, Sudo seized the weaknesses of the girls and threatened them to become sexual slaves every day. A table that tries to make a harem in modern society by a girl student who became a sex slave. Please enjoy the many\n\nactivities of the girls and the caretaker, such as the love struggle of the slave girls, the power struggle at the school, the pure love, the conflict, and the farewell .\n\n(MTL)>"
}