{
	"url": "https://www.novelupdates.com/series/quick-transmigration-the-second-female-lead-is-poisonous/",
	"title": "Quick Transmigration: The Second Female Lead is Poisonous - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/07/184792.jpg",
	"noveltype": "(CN)",
	"genre": "Fantasy   Historical   Josei   Mature   Psychological   Romance   Supernatural   Tragedy   ",
	"tags": "Apocalypse   Aristocracy   Arrogant Characters   Beautiful Female Lead   Broken Engagement   Cold Love Interests   Cultivation   Death of Loved Ones   Devoted Love Interests   Doctors   Doting Love Interests   Doting Parents   Female Protagonist   Game Elements   Ghosts   Handsome Male Lead   Hiding True Identity   Immortals   Love Interest Falls in Love First   Male Yandere   Manipulative Characters   Nobles   Obsessive Love   Older Love Interests   Possessive Characters   Pregnancy   Psychopaths   Strong Love Interests   System Administrator   Transmigration   Wealthy Characters   World Hopping   World Travel   Yandere   ",
	"rating": "(4.1 / 5.0, 91 votes)",
	"author": "貓毛儒   ",
	"year": "\n2018",
	"ranking": "#1430   #1091   #3284   #4966   #3632   ",
	"reviewcount": "33 Reviews sorted by",
	"description": "Xia Fengguang was forced to transmigrate into several novels. \n\nIn the CEO novel, the female lead was a young, ordinary university student while the male lead was the devilish king of business. \n\nIn the Jianghu novel, the female lead was the energetic and adorable medical genius specializing in poison while the male lead was the vicious demonic sect leader. \n\nIn the fantasy novel, the female lead went from being a useless daughter of a second wife to a cultivating genius that is only seen once every thousand years while the male lead was the demon king who is cold to everyone but warm to only one person… \n\nAs for her, she is the male lead’s fiancee who is a great beauty and has a great family background, but no matter which world she is in, she will never receive the male lead’s affection. Xia Fengguang finds this laughable. A genius who doesn’t get along with society, the enemy country’s emperor who has a poisonous tongue, a playboy crown prince, a medical sage who appears serious on the outside but is frivolous inside… Aren’t all these men already more interesting than the male lead? \n\n(The male lead’s moral values are not normal, please read with caution.)>"
}