{
	"url": "https://www.novelupdates.com/series/the-desolate-era/",
	"title": "The Desolate Era - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2015/06/Cover-Mang-Huang-Ji.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Drama   Fantasy   Martial Arts   Shounen   Xianxia   ",
	"tags": "Academy   Adapted to Anime   Adapted to Drama   Adapted to Manhua   Artifacts   Beast Companions   Beautiful Female Lead   Betrayal   Body Tempering   Calm Protagonist   Caring Protagonist   Clones   Cultivation   Dao Companion   Dao Comprehension   Death of Loved Ones   Determined Protagonist   Devoted Love Interests   Eidetic Memory   Fast Cultivation   Handsome Male Lead   Hard-Working Protagonist   Heavenly Tribulation   Hiding True Abilities   Immortals   Inheritance   Long Separations   Magic Formations   Magical Space   Male Protagonist   Multiple Realms   Multiple Reincarnated Individuals   Pregnancy   Protagonist with Multiple Bodies   Reincarnated in Another World   Revenge   Romantic Subplot   Ruthless Protagonist   Soul Power   Sword Wielder   Time Skip   Tragic Past   Underestimated Protagonist   Wars   Weak to Strong   World Travel   ",
	"rating": "(4.2 / 5.0, 2002 votes)",
	"author": "I Eat Tomatoes   Wo Chi Xi Hong Shi   我吃西红柿   ",
	"year": "\n2014\r\n",
	"ranking": "#4265   #1039   #5   #41   #33   ",
	"reviewcount": "188 Reviews sorted by",
	"description": "Fate had never been kind to Ji Ning. Wracked by illnesses and infirm his entire life on Earth, Ji Ning knew early on that he would die as a teenager. What he didn’t know was that there really was such a thing as life after death and that the multiverse was a far larger place than he thought.\n\nA lucky twist of fate meant that Ji Ning was reborn into a world of Immortals and monsters, of Ki Refiners and powerful Fiendgods, a world where Dynasties lasted for millions of years. A world which is both greater… and yet also smaller… than he ever could imagine. He would have the opportunity to join them, and in this life, Ji Ning swore to himself, he would never let himself be weak again! The Era he was born into was a Desolate one, but Ji Ning would make it his era.>"
}