{
	"url": "https://www.novelupdates.com/series/salted-fish-transmigrated-into-an-apocalyptic-book/",
	"title": "Salted Fish Transmigrated Into An Apocalyptic Book - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/08/Salted-Fish-Transmigrated-Into-An-Apocalyptic-Book.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Fantasy   Romance   Slice of Life   ",
	"tags": "Animal Rearing   Apocalypse   Beautiful Female Lead   Bickering Couple   Carefree Protagonist   Character Growth   Cohabitation   Couple Growth   Devoted Love Interests   Farming   Female Protagonist   Handsome Male Lead   Human Experimentation   Lazy Protagonist   Military   Mob Protagonist   Older Love Interests   Past Trauma   Pets   Post-apocalyptic   Pregnancy   Survival   Transmigration   Zombies   ",
	"rating": "(4.5 / 5.0, 136 votes)",
	"author": "Nai xiangwei da   奶香味哒   ",
	"year": "\n2020",
	"ranking": "#2210   #2294   #2991   #3818   #2228   ",
	"reviewcount": "38 Reviews sorted by",
	"description": "Jiang Miaomiao transmigrated into an apocalyptic book and became an insignificant cannon fodder. Considering all the brutal encounters behind, she decided to lie down and peacefully wait for death. She stayed at home and lived as long as she could. \n\n\nIn order to eat and drink well before she dies, she stored a lot of supplies.\n\n\nUnexpectedly, one day a man broke into her house and was even more salty than her. He stayed and refused to leave. Her three boxes of potato chips were eaten up by that man. Her six boxes of river snail rice noodles were eaten up by that man. Her ten boxes of walnuts were also gnawed by that man! \n\n\nJiang Miaomiao was furious and decided to drive him out. So she secretly followed him in the middle of the night and saw him walk into a horde of zombies with a knife on his hands. He looked handsome as he easily killed those zombies.\n\n\nThe man came back and washed the blood stains. She was pushed to wake up while she was pretending to be asleep, 'Give me a spicy duck neck.' \n\n\nJiang Miaomiao gave it to him decisively with both hands, 'Eat, it's all yours!' \n\n\nA magical thing happened since then, her supplies... Why is it continuously increasing?>"
}