{
	"url": "https://www.novelupdates.com/series/i-was-banished-by-the-power-harassment-knight-captain/",
	"title": "I Was Banished by the Power Harassment Knight Captain - Novel Updates",
	"image": "https://www.novelupdates.com/img/noimagefound.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Comedy   Fantasy   Harem   Supernatural   ",
	"tags": "Aristocracy   Beautiful Female Lead   Charismatic Protagonist   Charming Protagonist   Child Abuse   Death of Loved Ones   Demons   Dense Protagonist   Devoted Love Interests   Elves   Engagement   Fantasy World   Human Experimentation   Kingdoms   Knights   Magic   Magical Technology   Male Protagonist   Marriage   Necromancer   Nobles   Overpowered Protagonist   Poor to Rich   Popular Love Interests   Possessive Characters   Priestesses   Royalty   Saints   Skill Assimilation   Strong Love Interests   Strong to Stronger   Sudden Strength Gain   Sword And Magic   Underestimated Protagonist   Vampires   Wars   Weak to Strong   ",
	"rating": "(2.4 / 5.0, 29 votes)",
	"author": "Koharurun   こはるんるん   ",
	"year": "\n2021",
	"ranking": "#2318   #6173   #4862   #2028   #7962   ",
	"reviewcount": "5 Reviews sorted by",
	"description": "“Abel, a weak man like you is unnecessary for my glorious knights. I banish you!”\n\nI was summoned by the Knight Commander Balan — Abel was declared fired.\n\nIn this world, at the age of eight, the goddess gives special skills.\n\nMy skill was [Buff Master], the ability to increase other people’s status by a few percent.\n\nWhen I was given this, everyone made fun of me for my skill.\n\nHowever, if you continue to use your skill, your skill Lv will increase and become more powerful.\n\nI believed in myself and used my skills every day for eight years.\n\n“…are you sure? Not only has my skill increased to being able to buff 3000 people, but the effectiveness has also increased by 10 times. If this disappears, we will lose a lot of fighting power…”\n\n“Hahahahahahaha hahahahahahaha hahahahahahaha hahahahahahahahahahaha Do you want to remain in my strongest knighthood by you telling me so many lies?”\n\nAnd I was banished????\n\nI realized that if I had buffed myself, my ability would increase by 100 times.\n\nWith his power, he helps the princess who was attacked by assassins from an enemy country and is appointed as the head of the newly established Magic Knights.\n\nOn the other hand, dark clouds hung over the strongest knights of the captain Balan, who had lost my buff.\n\n“The Knights were the strongest with the help of Mr. Abel!”\n\nThis is the story of a boy who continues to be ridiculed for being out of touch and skilled, but is doted on by a princess and becomes a hero of his country.>"
}