{
	"url": "https://www.novelupdates.com/series/to-my-dear-wolf/",
	"title": "To My Dear Wolf - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/08/To-My-Dear-Wolf.jpg",
	"noveltype": "(KR)",
	"genre": "Comedy   Drama   Fantasy   Romance   ",
	"tags": "Animal Characteristics   Arranged Marriage   European Ambience   Female Protagonist   Transformation Ability   ",
	"rating": "(3.6 / 5.0, 7 votes)",
	"author": "마셰리   ",
	"year": "\n2022",
	"ranking": "#2000   #2000   #12366   #11905   #12686   ",
	"reviewcount": "No Reviews",
	"description": "“I never wanted this kind of body either. I wanted to be born with a big, muscular body just like a great hero…!”\n\nThe marriage of the unashamed rabbit and the honorable wolf.\n\nShaila, who chose a political marriage in order to avoid her father, headed to the North.\n\nHowever, the husband, who was supposed to be the legendary “Black Wolf”, turned out to be nothing but a small, feisty puppy…\n\n“Do you always try to avoid situations by pretending to be cute?”\n\nAs long as her husband was this little guy who’s soft as cream bread, Shaila had no intention of leaving the Duke’s Castle.\n\n“Don’t worry about anything. If you can’t become a jewel, I’ll learn alchemy to help you.”\n\n“You are special to me. I will definitely make you shine.”\n\nShaila, who knew that her husband suffered from social phobia and self-hatred, gave him confidence.\n\n“In any case… you’re a guy who needs a lot of love and care.”\n\nThe cute, little guy grew up to be a big and fearsome wolf thanks to Shaila’s devoted caregiving…\n\n“I’m not even the slightest bit cute anymore, because I’m no longer a little, white, baby puppy…”\n\n“You’re still a baby puppy.”\n\n“Really?”\n\n“You’re still a small, white, cute, little pup. At least, that’s what you’re like in my eyes.”\n\n“What do you think, Shasha? Do you like me?”\n\n“Yeah. I like you just as much as I like chicory.”\n\nShaila loves even the dirtiest parts of me.\n\nMy Shaila.\n\nHer husband, Callion, was soon enlisted into the army. After he’d been missing for 15 years, the husband she thought was dead had returned as a strong adult man…\n\n“Now that we’re adults, we should kiss like adults.”\n\nShaila blinked at Callion’s calm voice. She began to recite scripture; after 12 years of monastic life, she didn’t know anything about man and woman skinship.\n\n“How do adults kiss?”\n\n“An adult kiss is not just a peck, Shasha.”\n\n“…Then?”\n\n“It’s a french kiss.”>"
}