{
	"url": "https://www.novelupdates.com/series/i-like-you-so-much/",
	"title": "I Like You So Much - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/10/180.jpeg",
	"noveltype": "(CN)",
	"genre": "Drama   Romance   School Life   Shoujo   ",
	"tags": "College/University   Female Protagonist   Friendship   Handsome Male Lead   Military   Modern Day   Older Love Interests   ",
	"rating": "(4.3 / 5.0, 19 votes)",
	"author": "牛油果桃儿   ",
	"year": "\n2020",
	"ranking": "#2000   #2000   #8513   #8984   #8489   ",
	"reviewcount": "4 Reviews sorted by",
	"description": "Li Jiao was admitted to college, but her family feared that their little girl would get ruined by a pig of a man. But who would’ve thought that she would’ve gotten a boyfriend just immediately after military training. He was a special forces soldier that had come to training camp to help direct for a few days. \n\nHe was cold and handsome, with an overload of aloof temperament.\n\nAfter knowing that he had no girlfriend, her journey to chasing her future husband began.\n\nBut while chasing love for the first time, various deterrents had appeared in her way.\n\nWhile doing push-ups, she had accidentally thrown her body down because of exhaustion, yet he thought that she was trying to infuriate him.\n\nWalking forward, she had accidentally kicked her shoe out and almost hit him, which he considered as revenge.\n\nListening to a lecture, she had not stood firm because of her love for looking at her handsome crush. As a result, she had to kneel down in a spot of a lecture hall in front of thousands of people.\n\nLi Jiao: “Speaking honestly, I’m not embarrassed. I just want to die.”\n\nShe originally thought that she had no hope of getting a boyfriend, but who would have thought…\n\nHer shoes flew. He picked them up.\n\n“These are Cinderella shoes, wear them.”\n\nSeeing that she was getting faint, he stood behind her to provide shade.\n\nThe instructor of another class brought a piece of watermelon, but he didn’t hold it and instead passed it to her. After a while, he said:\n\n“Li Jiao, I order you to eat the watermelon.”\n\n“Okay.”\n\nZhang Jiuling had never expected to meet such a person. As long as she was coquettish, he would want to give her his life. \n\n“If your method of defeating your opponent is to be coquettish, then I wouldn’t even be able to lift my weapon.”\n\n“I love my country, and I also love her. For the rest of my life, I’ll be loyal to my country, and I’ll devote myself to her.”\n\n…\n\n“Li Jiao.”\n\n“Here!”\n\n“My name and my phone number are on this piece of paper. Save it onto your phone.”\n\n“Yes, sir. I promise to complete this mission.”\n\n“This isn’t one of your tasks. It’s my request.”\n\n…\n\n“Tweeeeeeet–”\n\nAt the training camp, a loud and clear whistle sounded.\n\nThe instructor of another class saw a girl snooping around and asked,\n\n“Jiuling, that girl, is she in your class?”\n\nZhang Jiuling took a glance at her,\n\n“Mhm, she’s mine.”\n\nEditor’s note: Military training is optional in China, but it’s recommended. Students can choose to join and go to military training.>"
}