{
	"url": "https://www.novelupdates.com/series/rebuilding-base-is-under-construction/",
	"title": "Rebuilding Base is Under Construction - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/03/rebuildbase1a.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Comedy   Fantasy   Shounen Ai   ",
	"tags": "Alternate World   Body Swap   Calm Protagonist   Clever Protagonist   Fanfiction   Hard-Working Protagonist   Heroes   Lack of Common Sense   Misunderstandings   Modern Day   Poor Protagonist   Prison   Transported into a Game World   ",
	"rating": "(4.1 / 5.0, 18 votes)",
	"author": "中子星   ",
	"year": "\n2019",
	"ranking": "#2000   #2000   #8910   #12115   #8748   ",
	"reviewcount": "4 Reviews sorted by",
	"description": "Zhang Dianyu became the warden of a Prison Building Game.\n\nSince many strange prisoners have been sent to this prison, his daily report had become like this:\n\n-A hydra prisoner tried to infiltrate the D-Area as a guard causing a small-scale riot – Spent huge sums to stop them.\n\n-A certain psychiatric “villain” attempted to blast the wall to escape from prison – Spent huge sums to stop it.\n\n-An expert in jailbreak tried to dig a tunnel to escape – Spent huge sums to stop him.\n\n-Financial Situation: RED FLAG!!!\n\nZhang Dianyu: There seems to be an error on this game?\n\nInsider Natasha: … What kind of prison is this! It isn’t right!\n\nPrisoners: All the newcomers are good-looking and talented… If I want to get a good conduct time I better stay away from them.\n\nZhang Dianyu: For some reasons, the prisoners’ work enthusiasm is unprecedentedly high yet why is the prison’s situation getting poorer?\n\nIn order to reduce the jailbreak rate and build a harmonious and civilized prison, Zhang Dian Yu decided to put on a vest and teach the prisoners to conduct oneself.\n\nThe only problem is that abandoning an NPC (horse) incurs death.\n\nZhang Dianyu thinks this issue isn’t too big.\n\nSince it’s impossible to get off the horse, you only have to be careful on not falling off the horse in this life.\n\nAfterwards: “…”>"
}