{
	"url": "https://www.novelupdates.com/series/allison/",
	"title": "Allison - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2015/08/allison.png",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Shounen   ",
	"tags": "Adapted to Anime   Adapted to Manga   Childhood Friends   Empires   European Ambience   Female Protagonist   Industrialization   Language Barrier   Military   Pilots   Romantic Subplot   Tomboyish Female Lead   Waiters   ",
	"rating": "(4.2 / 5.0, 36 votes)",
	"author": "Sigsawa Keiichi   時雨沢恵一   ",
	"year": "\n2002\n",
	"ranking": "#2000   #2000   #10188   #13810   #6444   ",
	"reviewcount": "1 Review sorted by",
	"description": "Allison is an adventure series set in a world containing one continent (extending roughly from the Equator to 60 degrees North latitude) which is divided down the center by a towering mountain range and a huge river. The industry and technology of the world are roughly equivalent to Europe in the 1930s. Due to the geography, two cultures developed on either side of the divide, and at the time the story begins, the cultures have been at war on and off for hundreds of years. The bloodiest conflict yet began thirty-five years before the start of the story; both sides are so exhausted by the conflict that an uneasy armistice is signed after some five years of fighting. Aside from a brief conflict over the jurisdiction of the river, resulting in the formation of a buffer zone on either side, this peace has largely been unbroken. The east side of the world is known as Roxche, though formally the region's name is the Roxcheanuk Confederation. The entire region comprises sixteen countries which all speak a common language. The west side is known as Sou Beil, though formally the region's name is the Allied Kingdoms of Bezel Iltoa. The region comprises the two kingdoms of Bezel and Iltoa which both serve to bring together a small number of countries under a common language different than that of the eastern region. There are far more blond-haired people in the West than the East.\r\n\r\nAt the beginning of the first novel, Allison, a pilot in the Roxche Air Force, has come to visit her childhood friend Wilhelm ('Wil' for short), who has remained at school over his summer break to continue his studies. While traveling in the countryside near the school, the two encounter an old man well-known to Wil's schoolmates as a teller of tall tales. Nevertheless, he captures their interest with his talk about a 'treasure' which, if found, is said to be able to put an end to the war. No one would believe him that the war between the countries could ever end, so no one listened to him. When the old man is abducted and taken over to Sou Beil, Allison and Wil steal an airplane and chase the abductors across the river into the next region. Fortunately, the two were raised as orphans by a woman who came from the West, and thus can speak both languages.>"
}