{
	"url": "https://www.novelupdates.com/series/after-transmigrating-the-bosses-begged-me-to-plant-the-land/",
	"title": "After Transmigrating, the Bosses Begged Me to Plant the Land - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/05/After-Transmigrating-the-Bosses-Begged-Me-to-Plant-the-Land.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Josei   Romance   Slice of Life   Supernatural   ",
	"tags": "Beautiful Female Lead   Celebrities   Dense Protagonist   Farming   Female Protagonist   Handsome Male Lead   Hard-Working Protagonist   Late Romance   Love Interest Falls in Love First   Modern Day   Non-humanoid Protagonist   Overpowered Protagonist   Revenge   Showbiz   Slow Romance   Special Abilities   Spirits   System Administrator   Transmigration   ",
	"rating": "(4.1 / 5.0, 154 votes)",
	"author": "Come Seven Months   月七兮   ",
	"year": "\n2020",
	"ranking": "#4080   #6320   #2163   #521   #3012   ",
	"reviewcount": "54 Reviews sorted by",
	"description": "Shen Tingshuang is a ten thousand-year-old ginseng spirit who has been transmigrated into a book after being struck by lightning, where the original owner is the villainess of the entertainment industry.\n\nThe original owner was the real daughter, but was forced out of the house by the fake daughter.\n\nDue to lack of money, she sold the mountain that her maternal grandmother had left for her. \nWith the money, she went down the Internet celebrity road.\n\nIn less than half a year, the money ran out, she got entangled with the male lead, harmed the female lead, and hit a dead end.\n\nShen Tingshuang who transmigrated was dying, penniless, and had to complete all kinds of weird tasks from the system in order to restore her spiritual veins.\n\nAfter the spiritual veins recovered, Shen Tingshuang who was about to roll up her sleeves and have a big fight with the system, opened the door, and saw a group of big men squatting at the door. Seeing her, their faces were full of joy. Boss, we will help you fight! Can you give us an extra box of fruit?\n\nThis does not seem to be a following the script?\n\nShen Tingshuang only wanted to farm the land well, but some people reported that the vegetables and fruits she planted contained hormones.\n\nNo matter who wants to buy, she won’t sell!\n\nThat night, big bosses ABC gathered together eagerly at the bottom of her mountain.\n\nBig Boss A: Boss, now the whole network knows that what you grow is the best.\n\nBig Boss B: Those people no longer dare to spread rumors!\n\nBig Boss C: So, boss, can you still sell vegetables to us?>"
}