{
	"url": "https://www.novelupdates.com/series/professor-lis-married-life/",
	"title": "Professor Li’s Married Life - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/10/li.jpg",
	"noveltype": "(CN)",
	"genre": "Drama   Fantasy   Historical   Romance   Shoujo   ",
	"tags": "Ancient China   Appearance Different from Actual Age   Bickering Couple   Black Belly   Forced Marriage   Male Protagonist   Marriage   Slow Romance   Transmigration   ",
	"rating": "(3.9 / 5.0, 20 votes)",
	"author": "Cream Puff Sauce   Nǎiyóu Pào Fú Jiàng   奶油泡芙酱   ",
	"year": "\n2019",
	"ranking": "#2000   #2000   #8301   #9499   #9532   ",
	"reviewcount": "7 Reviews sorted by",
	"description": "University professor, Li Chengze, was electrocuted to death by a leaky water heater. Unexpectedly, his soul transmigrated into ancient times and he became a scholar with poor character. \n\nThis scholar had only touched the water’s surface in his pursuit of knowledge and yet puts on an act of one who is better than others as he dreams of reaching heaven in a single bound. \n\nOne day, the Marquis of highest virtue holds a banquet at his residence and the scholar somehow borrows another’s prestige to attend the banquet. \n\nIn the Marquis’ residence, the scheming favored concubine’s daughter and the short-sighted and brainless unfavored eldest legitimate daughter battled to survive. The unfavored eldest daughter falls into the lotus pond but the scholar immediately jumps in to rescue the young lady who has fallen. \n\nBut woe! The young lady was innocent, but could only be kicked out by the Old Matriarch and pushed onto the scholar from a very ordinary family. \n\nThe concubine’s daughter had won a victory, and the eldest daughter could only cry her heart out! \n\nOn the day of their matrimony, the scholar was knocked unconscious by his angry wife with a porcelain pillow! When he woke up, his face may be the same but now the serious Professor Li lay within his shell. \n\nAfter being single for most of his life, Professor Li squinted his eyes as he wore his poker face that had been perfected for over ten years. Which student wasn’t afraid of this poker face of his? \n\nThe eldest daughter’s imposing manner withered at once. \n\nLi Chengze’s brows pinched tightly. \n\nSeeing an adolescent girl who was in junior high at most in front of him, he felt his head ache. \n\n– A what appears to be a gentle yet educated scholar on the outside but is really a scheming professor on the inside X the eldest daughter who’s been raised to be silly and headstrong\n\n– Love after marriage\n\n– A young gentleman teaches his wife. \n\nProfessor Li: A rebellious student who has not been taught correctly from the start must be broken down to their roots and built back up. \n\nGu Qingci: Wuwuwu, when will my husband consummate our marriage?>"
}