{
	"url": "https://www.novelupdates.com/series/ankoku-kishi-monogatari-yuusha-wo-taosu-tameni-maou-ni-shoukansaremashita/",
	"title": "Ankoku Kishi Monogatari ~Yuusha wo Taosu Tameni Maou ni Shoukansaremashita~ - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/05/ankoku_v1a.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Drama   Ecchi   Fantasy   Harem   Romance   Shounen   ",
	"tags": "Adultery   Angels   Antihero Protagonist   Awkward Protagonist   Childhood Friends   Clingy Lover   Clones   Demi-Humans   Demon Lord   Demons   Dense Protagonist   Dragons   Dwarfs   Elves   Evil Gods   Fairies   Fantasy Creatures   Fantasy World   Fast Learner   God-human Relationship   Goddesses   Godly Powers   Gods   Handsome Male Lead   Hard-Working Protagonist   Heroes   Hiding True Identity   Human-Nonhuman Relationship   Kingdoms   Knights   Love Rivals   Male Protagonist   Misunderstandings   Monster Society   Monsters   Multiple POV   Multiple Transported Individuals   Mythology   Naive Protagonist   Overpowered Protagonist   Polygamy   Power Struggle   Pregnancy   Protagonist Strong from the Start   R-15   Reverse R*pe   Romantic Subplot   Servants   Strong Love Interests   Strong to Stronger   Summoned Hero   Sword And Magic   Transported to Another World   Unrequited Love   Valkyries   Yandere   ",
	"rating": "(3.4 / 5.0, 436 votes)",
	"author": "Nezaki Takeru   根崎タケル   ",
	"year": "\n2014",
	"ranking": "#322   #225   #268   #340   #428   ",
	"reviewcount": "91 Reviews sorted by",
	"description": "This legend tells the tale of the protagonist, Kuroki summoned to protect the demon king from the hero.\r\n\r\nKuroki, unbeknownst to him, suddenly came to another world. He was summoned by the demon king, Modes. The territory which the demon king overrules was in the midst of being destroyed because of the hero. He had no choice but to bow before Kuroki.\r\n\r\n“Please save us, Savior Dono!”\r\n\r\nKuroki nodded, deciding to save the demon king due to an unexpected turn of event.>"
}