{
	"url": "https://www.novelupdates.com/series/letting-loose-after-marrying-a-tycoon/",
	"title": "Letting Loose After Marrying A Tycoon - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/12/Letting-Loose-After-Marrying-A-Tycoon.jpg",
	"noveltype": "(CN)",
	"genre": "Drama   Fantasy   Josei   Romance   ",
	"tags": "Beautiful Female Lead   Betrayal   Couple Growth   Devoted Love Interests   Handsome Male Lead   Marriage   Modern Day   Pregnancy   Reincarnation   Schemes And Conspiracies   Second Chance   Strong Love Interests   Tragic Past   Twins   Wealthy Characters   ",
	"rating": "(3.6 / 5.0, 33 votes)",
	"author": "Emperor Song   ",
	"year": "\nN/A",
	"ranking": "#2000   #2000   #7128   #11313   #8791   ",
	"reviewcount": "11 Reviews sorted by",
	"description": "The number one socialite, Song Ci, marries the most handicapped man, Han Zhan! \n\nEveryone laughs at Song Ci for being blind and leaving the rich and handsome second son of the Chuan Dong Group to marry a handicapped nobody. Only she knows that soon, this person will become the richest man in Wangdong City. \n\n…Song Ci has been reborn to the summer when she was 22. Her sister who was killed by her adoptive father in her last life is still alive, the man who let her down is madly pursuing her, and the man who is out of reach for the entire Wangdong City is still a nobody. \n\nIn this life, Song Ci will tear the scum with her hands, protect her family, and marry the most beautiful love! \n\nOne day, a good friend asks Song Ci, “How do you feel after the wedding, how is Brother Han? Is he considerate or not?” \n\nSong Ci: “Everything else is good; it’s just a little too big.” \n\nHan Zhan, who is eavesdropping is delighted, only to hear his wife grumble. \n\n“It’s said that every three years is a generation gap. I’m three generations from him. It’s so difficult to communicate with him. He doesn’t use emoji when chatting…” \n\nInfuriated, Han Zhan wears an aggrieved look resembling an emoji. \n\nAfter marrying the older man, Han Zhan, Song Ci drinks rejuvenating tea, wears thermal pants, puts on stockings, and lives a life of no worries.>"
}