{
	"url": "https://www.novelupdates.com/series/shes-a-saint-who-was-banished-for-being-a-late-bride-but-shes-being-spoiled-to-the-fullest-by-the-count-who-found-her/",
	"title": "She’s a Saint Who Was Banished for Being a Late Bride, but She’s Being Spoiled to the Fullest by the Count Who Found Her - Novel Updates",
	"image": "https://www.novelupdates.com/img/noimagefound.jpg",
	"noveltype": "(JP)",
	"genre": "Comedy   Fantasy   Romance   Shoujo   ",
	"tags": "Award-winning Work   Broken Engagement   Dense Protagonist   European Ambience   Female Protagonist   Handsome Male Lead   Magic   Naive Protagonist   Nobles   Royalty   Saints   ",
	"rating": "(2.9 / 5.0, 38 votes)",
	"author": "Haruna Bowl   Harunadon   榛名丼   ",
	"year": "\n2021",
	"ranking": "#2642   #2831   #5212   #1860   #7420   ",
	"reviewcount": "7 Reviews sorted by",
	"description": "“Evelyn, we don't need you anymore. Get out of this country immediately.”\r\n\r\nThe Saint, Evelyn was suddenly told that one day.\r\n\r\nEvelyn, who has been praying for her country at the temple since she was five years old, is now twenty-eight years old.\r\n\r\nEvelyn's former fiancé, Alex, the First Prince, and her sister, Mary, ridicule her.\r\n\r\n“How pathetic of a woman to be late getting married after her magic has weakened!”\r\n\r\n(Late marriage... that's because you broke off your engagement with me last year and got engaged to my sister, remember?)\r\n\r\nEvelyn has been expelled from both the temple and her family home, leaving her to fend for herself. The only thing she has left is her weakened magic power.\r\n\r\nEvelyn lives for the day, using her healing magic, but an encounter with a man changes her life forever.\r\n\r\n“I'm glad you're not married yet… It's the only reason we're here.”\r\n\r\n(That's not fair to say!)\r\n\r\nA former Saint uses her healing magic diligently everyday, while being pampered by a sweet young Count and adored by the people.\r\n\r\n—By the way, I was wondering if my magic power is really weakening.\r\n>"
}