{
	"url": "https://www.novelupdates.com/series/the-male-lead-knelt-before-me/",
	"title": "The Male Lead Knelt Before Me - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/01/The-Male-Lead-Knelt-Before-Me.jpg",
	"noveltype": "(KR)",
	"genre": "Comedy   Fantasy   Romance   ",
	"tags": "Acting   Aristocracy   Beautiful Female Lead   Calm Protagonist   Clever Protagonist   Confident Protagonist   Contracts   Devoted Love Interests   European Ambience   Fated Lovers   Female Protagonist   Handsome Male Lead   Kind Love Interests   Knights   Love Interest Falls in Love First   Magic   Magic Beasts   Magical Technology   Misunderstandings   Mysterious Family Background   Nobles   Popular Love Interests   Previous Life Talent   Protagonist Strong from the Start   Royalty   Strong Love Interests   Sword And Magic   Transmigration   Transplanted Memories   Underestimated Protagonist   Villainess Noble Girls   Wealthy Characters   ",
	"rating": "(4.2 / 5.0, 58 votes)",
	"author": "11월의봄   ",
	"year": "\n2019",
	"ranking": "#1444   #2155   #3261   #1308   #2488   ",
	"reviewcount": "10 Reviews sorted by",
	"description": "Ji So-eun possessed Lena, a supporting character in a novel.\r\nAfter being possessed, a lot of people took my hand and knelt before me, causing a strange rumor to arouse because of that.\r\n\r\n“You’ve caused a lot of men to kneel before your feet with your body, haven’t you?”\r\n\r\nYeah, I used my body to place them under my feet…\r\n\r\n“I hear there’s no man who can’t fall down at once with your beckoning.”\r\n\r\nThat’s right, but the gesture you think of and the gesture of rumors have different meanings…\r\n\r\n“When you smile, they can’t even make eye contact with you.”\r\n\r\nThat’s because they’re scared of me…\r\n\r\n“You can use any means or methods. Make the Duke will fall for you.”\r\n\r\nAfter believing the rumors, the Crown Prince offered me a deal to seduce the male protagonist.\r\n\r\nThe male lead will like the female lead anyway,\r\n\r\nI decided to accept the deal…\r\n\r\nBut did something go wrong?\r\n\r\n“Duke, desiring something is never a bad thing. Speak up if you do. However, if you don’t like someone, then back off. That’s all you have to do.”\r\n\r\n“Is that so.”\r\n\r\n“Yes.”\r\n\r\n“Then I dare ask. I want to hug you.”\r\n\r\n…are you serious?>"
}