{
	"url": "https://www.novelupdates.com/series/after-being-picked-up-by-the-top-alpha/",
	"title": "After Being Picked up by the Top Alpha - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/08/20200418145516.jpg",
	"noveltype": "(CN)",
	"genre": "Drama   Romance   Sci-fi   Yaoi   ",
	"tags": "Calm Protagonist   Cautious Protagonist   Celebrities   Confident Protagonist   Curious Protagonist   Cute Protagonist   Cute Story   Determined Protagonist   Devoted Love Interests   Drugs   Futuristic Setting   Handsome Male Lead   Heartwarming   Honest Protagonist   Love Interest Falls in Love First   Models   Mpreg   Older Love Interests   Omegaverse   Past Plays a Big Role   Protagonist Strong from the Start   Wealthy Characters   ",
	"rating": "(3.9 / 5.0, 76 votes)",
	"author": "Zi Jin   紫矜   ",
	"year": "\n2019",
	"ranking": "#3710   #2356   #3658   #4569   #2641   ",
	"reviewcount": "23 Reviews sorted by",
	"description": "As the most beautiful omega from the Silver Moon clan within the last decade, Yu Lan was abducted as a young child.\n\nWhen he was about to be sold to a wealthy businessman at the age of 22, he managed to escape.\n\nBarefoot and running desperately.\n\n-And ended up crashing into the arms of a man.\n\nWhen Yu Lan first met Shao Mingyu, the man was handsome and elegant, and with a calm expression, he said to him, “I won’t touch you, come back with me.”\n\nSo Yu Lan was ignorantly picked up by the man and moved into his manor.\n\nHe didn’t know why the man took care of him, but he hid his affection within his heart. He obediently took inhibitors on a regular basis, not wanting to lose himself during his heat and do something… something terrible to this man he had a crush on.\n\nUntil one day later, when Yu Lan wanted to give himself an injection again, the man clasped his wrist and asked in a hoarse voice, “Do you still need to use inhibitors?”\n\nShao Mingyu gazed at him, his voice low and soft, “Little grape, don’t use it anymore, okay?”\n\nYu Lan’s eyes widened.\n\nAs the man’s kiss fell, the inhibitor fell from his hands to the floor.\n\nSoon after, news of the Shao family’s young master, the top alpha that everyone was paying attention to’s, marriage spread like wildfire.>"
}