{
	"url": "https://www.novelupdates.com/series/blade-skill-online-with-trash-job-summoner-weakest-weapon-bow-and-rotten-stat-luck-i-rise-to-be-the-last-boss/",
	"title": "Blade Skill Online: With Trash Job ‘Summoner’, Weakest Weapon ‘Bow’, and Rotten Stat ‘Luck’, I Rise to Be the ‘Last Boss’! - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/09/Blade-Skill-Online-With-Trash-Job-Summoner-Weakest-Weapon-Bow-and-Rotten-Stat-Luck-I-Rise-to-Be-the-Last-Boss.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Comedy   Gender Bender   Shounen   ",
	"tags": "Adventurers   Aristocracy   Artificial Intelligence   Conditional Power   Demon Lord   Determined Protagonist   Evolution   Fantasy Creatures   Fantasy World   Game Elements   Hot-blooded Protagonist   Lack of Common Sense   Level System   Male Protagonist   Male to Female   Misunderstandings   MMORPG   Modern Day   Monsters   Overpowered Protagonist   Quirky Characters   R-15   Sword And Magic   Virtual Reality   Weak to Strong   ",
	"rating": "(4.2 / 5.0, 18 votes)",
	"author": "Mazi Manzi   馬路まんじ   ",
	"year": "\n2020",
	"ranking": "#180   #136   #7137   #319   #8564   ",
	"reviewcount": "1 Review sorted by",
	"description": "Our MC, Yuri [裕理], always has dead look in his eyes because of his too frequent encounter with misfortunes. One day, he comes up with the idea that his luck may take a turn for the better if he maxes out his Luck stat in the world of VRMMO, and so he steps into the game world under the name Yuri [ユーリ].\r\n\r\nHe chooses ‘Summoner’ as his job and ‘Bow’ as his weapon—hailed as the strongest of their kind on the game’s strategy guide site—and is raring to go on an adventure, but… they turn out to be the worst job and weapon in the game?!\r\n\r\nFurthermore, Yuri also comes to learn that the pure Luck build is ridiculed for being useless in battles. With the triple bad choices (plus the fact that his avatar is a beautiful girl because he picked the option of Random Character Generator!) Yuri falls into despair.\r\n\r\nThis is an adventure diary of Yuri who will eventually rise to become a player who is known as ‘Raid Boss’, ‘Wild Last Boss’, ‘Why Does a Beginner Weapon Do More Damage Than the Strongest Weapon?!’, and ‘Please Don’t Let the Hidden Boss Wander Around in the Wild!’.>"
}