{
	"url": "https://www.novelupdates.com/series/seduced-by-books/",
	"title": "Seduced by Books - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/12/Seduced_By_Books.png",
	"noveltype": "(CN)",
	"genre": "Adult   Fantasy   Harem   Mature   Romance   Smut   ",
	"tags": "BDSM   Books   C*nnilingus   Female Protagonist   First-time Interc**rse   F*llatio   Handsome Male Lead   H*ndjob   Library   M*sturbation   Obsessive Love   Older Love Interests   R*pe Victim Becomes Lover   Threesome   Toys   Wealthy Characters   ",
	"rating": "(3.4 / 5.0, 42 votes)",
	"author": "Cui Hei   崔黑   ",
	"year": "\nN/A",
	"ranking": "#6970   #2000   #7772   #6032   #6587   ",
	"reviewcount": "No Reviews",
	"description": "Xu Ning enjoys reading erotic novels. So, while others are studying at the library, she is busy reading novels that are filled with wanton and lust. Little did she know that she'd actually infuriated the God of Library.\r\n\r\nHistory, English Dictionary, Mathematics Question Set, Sketch Book... All of them turned into wolves, and are 'punishing' her in ways she secretly likes.\r\n\r\n'You forgot when the Roman Empire split up?' The gentle and elegant looking man smiled as he pinched her little nipples between his calloused fingers, '395-AD. If you can't remember, how about changing your bust measurement to 39.5?'\r\n\r\n'You can't translate the article properly?' The young man adjusted his silver framed glasses before striking her with a black whip. It hit at her sensitive spot but instead of pain, she was getting wet. 'There's an article about SM. I think whipping may help you understand more.'\r\n\r\n'Can't solve an easy mathematical problem?' No matter how fiery his actions were, the young boy still wore a stern expression, 'The Popular Science Book from next door said semen could help increase your low IQ. Let's see if it works.'\r\n\r\nXu Ning was panting hard as they punished her. As her grades went up higher, her sexual limitations went down lower.\r\n'I don't want to be a slutty whore! Please have mercy on me!'\r\n\r\nPoor Xu Ning. She was getting fucked even as she studied in her dreams.>"
}