{
	"url": "https://www.novelupdates.com/series/the-female-soldier-has-been-told-to-infiltrate-the-imperial-magic-academy/",
	"title": "The Female Soldier Has Been Told to Infiltrate the Imperial Magic Academy - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/02/The-Female-Soldier-Has-Been-Told-to-Infiltrate-the-Imperial-Magic-Academy.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Fantasy   School Life   Shoujo   ",
	"tags": "Academy   Adapted to Manga   Aristocracy   Assassins   Average-looking Protagonist   Bodyguards   Elemental Magic   Empires   Female Protagonist   Hiding True Abilities   Hiding True Identity   Magic   Military   Monsters   Multiple POV   Multiple Reincarnated Individuals   Nobles   Otome Game   Overpowered Protagonist   Precognition   Prophecies   Protagonist Strong from the Start   Reincarnated in a Game World   Reincarnation   Romantic Subplot   Royalty   Secret Identity   Soldiers   Time Manipulation   Transmigration   Villainess Noble Girls   Wars   ",
	"rating": "(4.1 / 5.0, 148 votes)",
	"author": "Fuyuse   冬瀬   ",
	"year": "\n2020",
	"ranking": "#687   #2318   #1340   #305   #2937   ",
	"reviewcount": "23 Reviews",
	"description": "Razé was a cheat soldier at the age of 15, thanks to the memories of her previous life. One day, she was summoned by her superior – the devil Prime Minister and was ordered to go on a long-term solo mission. She was expecting a harsh mission, but…\r\n\r\n“I knew you are the right person for this, Lieutenant Colonel Razé Orphan. I want you to attend the Centrior Imperial Magic Academy starting from this spring.”\r\n\r\n“…..what?”\r\n\r\nWell, it seems that she has been appointed as the “bodyguard” for the prince and other noble’s kids. And so, she was enrolled to the school where the aristocratic-sama gathered.\r\n\r\nAlthough she was puzzled by the glittering school life, she was trying to live a life so as not to be bullied in the future. But it seems there was a secret that she didn’t know hidden in this world.\r\n\r\n“Hey!!!!!! No one told me that this is an otome game!!!!!”\r\n\r\nAs a bodyguard, her life would be over if any of the noble kids got hurt. But then a young lady who claimed to be the ill-fated villainess came by. If the girl died, won’t she be dead too?\r\n\r\nToday, Razé will continue to watch over her school life (with her own life on the line).>"
}