{
	"url": "https://www.novelupdates.com/series/i-reject-the-villainesss-ending/",
	"title": "I Reject The Villainess’s Ending - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/11/I-Reject-The-Villainesss-Ending.jpg",
	"noveltype": "(KR)",
	"genre": "Fantasy   Josei   Romance   ",
	"tags": "European Ambience   Female Protagonist   Royalty   Saints   Transmigration   Villainess Noble Girls   ",
	"rating": "(4.3 / 5.0, 17 votes)",
	"author": "Danya   단야(丹夜)   ",
	"year": "\n2021",
	"ranking": "#4617   #6323   #10997   #8981   #7948   ",
	"reviewcount": "No Reviews",
	"description": "I’m the villainess who ruined the country?!\r\n\r\nI became a saintess, the protagonist of a devastating R19 novel.\r\nThere are already rumours that her personality is garbage, and there are many things that she did, but I think I will be able to live somehow if I fix it from now on.\r\n\r\n'I'm sorry for what I've done all this time. Pink, no, Iros.'\r\n'But I still like it. When the saintess calls me pink.'\r\n“Huh?”\r\n“I’m a crawling dog that will strip anytime as long as the saintess tells me to.”\r\n“…Huh?”\r\n\r\nEven if something goes wrong, it seems that it had gone wrong for a long time.\r\nIros, the last remaining guardian of the saint, didn't you hate me?\r\n\r\n“Sierra, what do you think? Wouldn't I be better than the temple sword that couldn't get married even if he was placed next to you?”\r\n“Your chest muscles are excellent and your face is commendable, but your highness, the crown prince, I don't want to date.”\r\n\r\nWas it not enough to ruin the country, but how can I date a man who said he will kill me?\r\nI'm not that conscientious.\r\n\r\n'Saintess, rather than being the Crown Prince, I—“\r\n'Sierra, I'll be more gentle at night as a guardian rather than a wooden stone—'.\r\n'Both of you aren't safe, so stop following me!'\r\n\r\nWeird.\r\nShe tries to live a nice life away from the female lead, a villainess who destroyed the country, but the two men continue to untie their jackets so that they cannot be modest.\r\nWill I be able to live safely here?>"
}