{
	"url": "https://www.novelupdates.com/series/im-using-the-interstellar-live-broadcast-to-raise-cubs/",
	"title": "I’m Using the Interstellar Live Broadcast to Raise Cubs - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/03/Raising-Cubs.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Fantasy   Romance   Sci-fi   Shounen Ai   Slice of Life   ",
	"tags": "Animal Rearing   Beasts   Calm Protagonist   Caring Protagonist   Celebrities   Charming Protagonist   Childcare   Cooking   Cute Children   Cute Story   Devoted Love Interests   Discrimination   Familial Love   Family   Famous Protagonist   Futuristic Setting   Handsome Male Lead   Heartwarming   Jealousy   Late Romance   Love Interest Falls in Love First   Lucky Protagonist   Nobles   Persistent Love Interests   Poor to Rich   Possessive Characters   Racism   Secret Identity   Showbiz   Slow Romance   Strong Love Interests   Time Travel   Transmigration   Unconditional Love   ",
	"rating": "(4.0 / 5.0, 305 votes)",
	"author": "As Reckless As Meow   Wèi Miāo Zuò Chāng   为喵作伥   ",
	"year": "\n2019",
	"ranking": "#825   #2436   #1106   #1233   #1181   ",
	"reviewcount": "95 Reviews sorted by",
	"description": "Gu YuMian works as a zookeeper and lives a stable life. Until one day, when he transmigrates to the interstellar era which is different from what he imagined.\n\nHot microblog search: #Humans have been officially listed as an endangered species.#\n\nThe headline of the daily newspaper: [Annual salary is ten million, and there is no one to take it?! Mainecoon Cat Prime Minister said he offered high prices to recruit service workers for grooming, cat cooking, and manicure cutting, but no one has applied in fifty years.]\n\nGu YuMian: ….\n\nTen million a year? Coincidentally, he was a professional zookeeper.\n\nOther anchors focus on things popular, fans and intrigue. Gu YuMian focuses on making cat meals, combing ErHa’s hair and little fox’s tail and feeding the panda cub. His live broadcast became more and more popular.\n\nLater, Gu YuMian found out that the snow leopard he picked up was the Emperor of the Empire, the panda was a famous star, little fox was the chief of the biggest science institute and Erha was the hottest novelist in the whole world?!>"
}