{
	"url": "https://www.novelupdates.com/series/secretly-secretly-but-unable-to-hide-it/",
	"title": "Secretly, Secretly; But Unable to Hide It - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/02/6EF53561-97A7-4DCB-942B-4FD9F770AF1C.jpeg",
	"noveltype": "(CN)",
	"genre": "Comedy   Drama   Josei   Romance   ",
	"tags": "Adapted to Drama   Adapted to Drama CD   Adapted to Manhua   Age Progression   Beautiful Female Lead   Child Protagonist   Childhood Love   Clever Protagonist   Comedic Undertone   Couple Growth   Cute Story   Devoted Love Interests   Discrimination   Doting Love Interests   Doting Parents   Early Romance   Familial Love   Female Protagonist   First Love   First-time Interc**rse   Handsome Male Lead   Kind Love Interests   Love at First Sight   Modern Day   Naive Protagonist   Older Love Interests   Protagonist Falls in Love First   Secret Crush   Smart Couple   Time Skip   Unconditional Love   ",
	"rating": "(4.6 / 5.0, 249 votes)",
	"author": "Zhu Yi   竹已   ",
	"year": "\n2019",
	"ranking": "#317   #3379   #2146   #1216   #1855   ",
	"reviewcount": "64 Reviews sorted by",
	"description": "The year she was thirteen, Sang Zhi liked a man. The man appeared cold and lazy, and spoke carelessly. He would often come over to her home, nestled in her brother’s room playing games the entire afternoon. \n\nWhen he occasionally sees her bringing fruits in, he would merely lift his eyelids indifferently and smile like a villain, “Kid, what’s the matter? You blush as soon as you see Gege.”\n\n—–This novel narrates the story of the young Sang Zhi and Duan Jia Xu. Sang Zhi gets to know Duan Jia Xu, who is seven years older than her, through her Ge Ge (Older brother, 桑延). \n\nDuring their several interactions, Sang Zhi starts to develop a crush on Duan Jia Xu. It happens from a young age till she becomes an adult. After graduation, Duan Jia Xu goes home and works hard. They cut down their contact. \n\nSang Zhi and Duan Jia Xu begin to contact each other again after Sang Zhi attends the university in the city he is in. In their day by day intimate and close interaction, Sang Zhi notices the source of Duan Jia Xu’s burdens. With Sang Zhi’s companionship, Duan Jia Xu also starts to let it go, he starts to have new relationship with her.>"
}