{
	"url": "https://www.novelupdates.com/series/the-emperors-strategy/",
	"title": "The Emperor’s Strategy - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2015/08/emperorsstrategy.jpg",
	"noveltype": "(CN)",
	"genre": "Romance   Wuxia   ",
	"tags": "Ancient China   Female Protagonist   Love Triangles   Politics   Royalty   ",
	"rating": "(3.5 / 5.0, 20 votes)",
	"author": "Qing Yao   ",
	"year": "\nN/A",
	"ranking": "#2000   #2000   #11782   #13810   #9448   ",
	"reviewcount": "No Reviews",
	"description": "In the capital, the young owner of the Su Ji Coffin Shop is Su Li Li (苏离离 - the li is significant in her name because it represents leaving). As spring was just beginning, on one early morning, she by chance saved a woodblock that had met trouble. However, no one knew that she was the daughter of the previous empire's Grand Tutor (akin to the Imperial Adviser), and the other was the current empire's Lin Jiang King's son. They overcome many obstacles, to hide in this small town, to become forgotten by the people, they exchanged their hearts and wanted to never part even till their hairs turned white. However, even before anything could start, Mu Tou who had his own birth secret suddenly disappeared.\r\n\r\nIn this world of chaos and power struggle, Su Li Li's identity was discovered by Qi Feng Xiang, his heart is scheming, his actions are cruel, he wants to reign supreme over the lands, he forcibly retains her by his side. But in the midst of using her then distancing from her, his heart gets clouded. But the road to become an Emperor is a lonely road, will he be able to give her the peace she wants, will she be able to give him his empire, and how about Mu Tou who said 'If I can fly out, I can also fly back', where did he fly to and can he fly back?\r\n\r\nIn this chaos, who is aiming to rule the sky, who is aiming for an ordinary life, who can without hesitation make the emotional attachments, and whose hand will she hold to look back on these memories of upheaval and peace?>"
}