{
	"url": "https://www.novelupdates.com/series/my-lover-was-stolen-and-i-was-kicked-out-of-the-heros-party-but-i-awakened-to-the-ex-skill-fixed-damage-and-became-invincible-now-lets-begin-some-revenge/",
	"title": "My Lover Was Stolen, And I Was Kicked Out Of The Hero’s Party, But I Awakened To The EX Skill “Fixed Damage” And Became Invincible. Now, Let’s Begin Some Revenge - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/03/IMG_20200322_111943.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Drama   Fantasy   Harem   Romance   Seinen   Tragedy   ",
	"tags": "Adapted to Manga   Anti-social Protagonist   Antihero Protagonist   Appearance Different from Actual Age   Beautiful Female Lead   Betrayal   Broken Engagement   Cheats   Dark   Demon Lord   Depictions of Cruelty   Determined Protagonist   Friends Become Enemies   Game Elements   Heroes   Human Experimentation   Magic   Male Protagonist   Near-Death Experience   Netorare   Past Trauma   Polygamy   R-15   Religions   Revenge   R*pe   Ruthless Protagonist   Schemes And Conspiracies   Special Abilities   Sword And Magic   Time Skip   Unrequited Love   ",
	"rating": "(3.0 / 5.0, 95 votes)",
	"author": "Rokushima Asa   六志麻あさ   ",
	"year": "\n2018",
	"ranking": "#4617   #3730   #1739   #10656   #2049   ",
	"reviewcount": "19 Reviews sorted by",
	"description": "Chrome was a magician in the hero’s party.\r\n\r\nHe fought the Demon Lord’s army alongside people like Irina, the lover who vowed to marry him in the future, and the hero, Yuno, who was his close friend.\r\n\r\nThey were all close companions. However, that was only in Chrome’s mind.\r\n\r\nHis lover, Irina, became intimate with the hero, Yuno, and Chrome was sacrificed to make the hero stronger. Chrome’s magic powers were snatched away and he was kicked out of the party. Demons surrounded him as he was on the verge of death and he was driven to a corner.\r\n\r\nAt that moment, Chrome awakened to a “darkness” within himself.\r\n\r\nAmidst his despair, he acquired an unrivaled skill.\r\n\r\nNow with this skill, he could exact revenge.>"
}