{
	"url": "https://www.novelupdates.com/series/suppressing-the-protagonist-in-the-start-to-seize-the-heroine/",
	"title": "Suppressing the Protagonist in the Start to Seize the Heroine - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/01/Suppressing-the-Protagonist-in-the-Start-to-Seize-the-Heroine.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adult   Comedy   Harem   Romance   School Life   Xuanhuan   ",
	"tags": "Alternate World   Antihero Protagonist   Arrogant Characters   Black Belly   Calm Protagonist   Carefree Protagonist   Cold Love Interests   Cold Protagonist   Confident Protagonist   Cunning Protagonist   Gangs   Genius Protagonist   Handsome Male Lead   Harem-seeking Protagonist   Kind Love Interests   Love Interest Falls in Love First   Love Rivals   Loyal Subordinates   Male Protagonist   Modern Day   Multiple Protagonists   Reincarnation   Ruthless Protagonist   Second Chance   Shameless Protagonist   Sudden Strength Gain   Wealthy Characters   Yandere   ",
	"rating": "(3.6 / 5.0, 27 votes)",
	"author": "反派雇佣兵   ",
	"year": "\n2021",
	"ranking": "#2000   #4770   #9297   #8229   #8824   ",
	"reviewcount": "2 Reviews sorted by",
	"description": "When Su Lin transmigrated into a Rebirth novel, he found himself playing the role of a villain.\n\nHe then came to know that Ye Feng, the Protagonist, will be reborn in three days and he began to alter the plot, leaving the reborn Ye Feng dumbfounded. \n\nGoddess Bai Yueguang’s attitude towards him has now changed. \n\nEven his childhood sweetheart began to treat him coldly. \n\nThe reborn Ye Feng who intended to reach the pinnacle of his life, would never have expected he’d sink into oblivion. \n\nOn the other hand, Su Lin, who was well-versed of the plot of the world and the cliches that are bound to it used them to his advantage, and flourished.\n\nHis story had become much more interesting.\n\nThe one who had been reborn, the supreme medical saint who had come from the mountains, the one who had returned from the military, and many more Protagonists were all dealt by Su Lin, and thus he had become a legend. >"
}