{
	"url": "https://www.novelupdates.com/series/starting-today-ill-work-as-a-city-lord/",
	"title": "Starting Today, I’ll Work as a City Lord - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/07/Starting-Today-Ill-Work-as-a-City-Lord_1627190396.jpg",
	"noveltype": "(CN)",
	"genre": "Fantasy   Harem   Romance   Slice of Life   ",
	"tags": "Adapted to Manhua   Alternate World   Army Building   Beautiful Female Lead   Business Management   Calm Protagonist   Caring Protagonist   Charismatic Protagonist   Charming Protagonist   Clever Protagonist   Confident Protagonist   Cooking   Demi-Humans   Devoted Love Interests   Different Social Status   Discrimination   Economics   Elves   Farming   First-time Interc**rse   Gate to Another World   Handsome Male Lead   Hard-Working Protagonist   Hidden Abilities   Human-Nonhuman Relationship   Industrialization   Kingdom Building   Late Romance   Leadership   Loyal Subordinates   Male Protagonist   Management   Modern Knowledge   Monster Girls   Multiple POV   Politics   Polygamy   Pragmatic Protagonist   Royalty   S*aves   Slow Romance   Strategist   Strong Love Interests   Technological Gap   Underestimated Protagonist   Wars   ",
	"rating": "(3.4 / 5.0, 28 votes)",
	"author": "All-nighter Big White   熬夜大白   ",
	"year": "\nN/A",
	"ranking": "#1485   #507   #5798   #1653   #8272   ",
	"reviewcount": "4 Reviews sorted by",
	"description": "Liu Feng unexpectedly possessed the ability to travel between two world. He also has a storage space, and became a second hand dealer of the two worlds.\n\nWhen he used a glass cup from Earth to purchase a city in the other world, he began his life as a city lord in the other world.\n\nThis is a wonderful world in the cold weapon era. In this world, Liu Feng can see catgirls, foxgirls, rabbit girls, and elven princess any time he wants.\n\nPrincess: Liu Feng’s city is the world’s most fortunate city.\n\nPrincess: I will definitely move in and live there, even if I have to ** the status of a princess.\n\nGraduate: The technology and ideas used by Liu Feng’s city surpasses this world by a thousand years.\n\nKing: That place has the world’s tallest buildings and has the world’s strangest things. That place is the world’s wealthiest and magical city.>"
}