{
	"url": "https://www.novelupdates.com/series/dressed-as-a-shady-villains-marriage-partner/",
	"title": "Dressed as a Shady Villain’s Marriage Partner - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/05/Dressed-as-a-shady-villains-marriage-partner.jpeg",
	"noveltype": "(CN)",
	"genre": "Adult   Comedy   Drama   Fantasy   Mature   Romance   Yaoi   ",
	"tags": "Adopted Protagonist   Clumsy Love Interests   College/University   Complex Family Relationships   Cunning Protagonist   Manly Gay Couple   Modern Day   Reincarnation   Second Chance   Shameless Protagonist   Transmigration   ",
	"rating": "(3.7 / 5.0, 15 votes)",
	"author": "马户子君   ",
	"year": "\n2022",
	"ranking": "#6970   #6290   #10661   #9150   #10235   ",
	"reviewcount": "2 Reviews sorted by",
	"description": "The Si family’s business is the story of how the Si family has come to dominate the business world through deception. In order to take down their biggest rival, Lu Huan, the Si family faked a marriage and inserted the most obedient “punk” in the family as an outcast.\n\nWith the author’s deliberate reduction of intelligence, the huge Lu family is completely crushed by such a “little piece of crap”.\n\nLu Huan suddenly awakens to consciousness before he dies in a car accident, and his resentfulness makes him reborn back before the union.\n\nThis time, Lu Huan stared at the marriage letter with a shady smile: good.\n\n* The first time I wore a dress was when I was a little girl.\n\nYu Baihan accidentally dresses up as Si family’s “little tr*sh”.\n\nOn his wedding night, he meets his nominal husband for the first time – and he hits the spot perfectly, no matter what his body looks like.\n\nYu Baihan lying peacefully flat: love it, come and love me.\n\nThe next moment, Lu Huan pinched his chin in a slow tone: “I’d like to see how many …… more you have.”\n\nYu Baihan changed his position, “A little surprise that I don’t know about?”\n\nLu Huan: “……”\n\nYu Baihan understood, so his old attacker liked this kind of affair.\n\nLu Huan breaks the plot for the first time and takes revenge on the Si family.\n\nThe Si family has lost most of its fortune, with family infighting, sons and daughters fighting for power. Lu Huan removes his mask and the two families are completely torn apart.\n\nIn the Lu family mansion.\n\nLu Huan sat on a cushioned chair in the bedroom, half of his face hidden in the shadows, looking at Yu Baihan like a play: “What do you think?”\n\nYu Bai contains a seal applause: “Good! If you bloom, the butterflies will come; if you are wonderful, the sky will arrange itself!”\n\nLu Huan: “……”\n\nThen the plot did break, and like a wild dog off the leash, it never returned.\n\nEveryone is waiting for the outcast of the Si family to be thrown out by the growing Lu family, and even surname Lu’s subordinates are counting the days until the “loser” is ready to be rolled up.\n\nIt wasn’t until his subordinates saw Lu Huan himself walk into the master bedroom with a bunk roll in his hand.\n\nYu Baihan was still wrapped in the roll, and the latter’s eyes were filled with anticipation: “Be stronger, Lu Huan! Have you not eaten!”\n\n“……”\n\nThe bedroom door slams shut!\n\nSubordinate: ????>"
}