{
	"url": "https://www.novelupdates.com/series/concealed-by-brocaded-clouds-frost-on-the-roads/",
	"title": "Concealed by Brocaded Clouds, Frost on the Roads - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2017/01/s8858415.jpg",
	"noveltype": "(CN)",
	"genre": "Drama   Historical   Romance   Tragedy   ",
	"tags": "Alternate World   Amnesia   Ancient China   Beautiful Female Lead   Betrayal   Clever Protagonist   Female Protagonist   Handsome Male Lead   Imperial Harem   Possessive Characters   Pregnancy   Revenge   Royalty   R*pe   Stockholm Syndrome   Time Skip   Unreliable Narrator   ",
	"rating": "(3.9 / 5.0, 57 votes)",
	"author": "Méi Zi Huáng Shí Yü   梅子黄时雨   ",
	"year": "\n2012",
	"ranking": "#4080   #2474   #5957   #8528   #5385   ",
	"reviewcount": "10 Reviews sorted by",
	"description": "He is the emperor who rules the whole of China, except he is unable to control his own heart. Without her, ten thousand miles of rivers and mountains are just like dust.\n\nRuan Wu Shuang: She is the daughter of the current prime minister. Her natural disposition is tranquil and calm and has no interest in manipulative tactics. However, she is still fated to enter the imperial palace and become embroiled in the power struggle.\n\nBai Li Hao Zhe: He is the second prince of the current emperor, well versed in civil and military tactics. He marries Ruan Wu Shuang to make use of the Ruan family’s influence to successfully become the crown prince. Step by step, he ascends the throne.\n\nShe is well-aware that she is just his pawn, yet falls for his real or imaginary gentleness. While he constantly reminds himself that she is a descendant of his enemy, so he cannot fall in love with her. Yet he also loses himself in her gentleness, gradually forgetting his original intention…\n\nLingering and deep love cannot overcome past events, the grievance entangling two generations of people.\n\nHe implements his revenge plan progressively. No matter how well he calculates, he still forgets to include himself in the calculation. If not for the heartache that feels like bone erosion when losing her, he will not realize that he had unconsciously fallen deeply in love with her long ago…\n\nIn the face of new and old flames of hatred, will they be able to let go and live together until the white hairs of old age?>"
}