{
	"url": "https://www.novelupdates.com/series/the-countess-is-afraid-of-the-night/",
	"title": "The Countess Is Afraid of the Night - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/01/The-Countess-Is-Afraid-of-the-Night.jpg",
	"noveltype": "(KR)",
	"genre": "Adult   Josei   Mature   Romance   Smut   ",
	"tags": "Aristocracy   European Ambience   Female Protagonist   First-time Interc**rse   Marriage   Marriage of Convenience   Nobles   Possessive Characters   R-18   R*pe   S*xual Abuse   ",
	"rating": "(3.2 / 5.0, 28 votes)",
	"author": "Baek Yoohyun   ",
	"year": "\n2019",
	"ranking": "#2000   #2000   #9535   #9890   #7802   ",
	"reviewcount": "No Reviews",
	"description": "Countess Daria was afraid of the night.\r\n\r\nWhen the sun shining out of the window disappeared and darkness began to invade, she wandered around the castle, grabbing her sinful heart.\r\n\r\nWhere will he hide and find himself? She begged God to make this night pass quickly.\r\n\r\n“Today is… Here you are.”\r\n\r\nFrom then on, the terrible night began. She cried out in Konak’s arms all night, resentful of the sun that does not rise.\r\n\r\n“Sigh… I thought it would be this soft… .”\r\n“Hey… Sigh… .”\r\n\r\nKonyak began massaging Daria’s breasts with tremendous grip, whether he was going to crush and burst Daria’s breasts. Daria struggled with tremendous pain, twisting her whole body.\r\n\r\n“Ahhh… … Ugh… .”\r\n\r\nKonyak came in mercilessly through the narrow body of Daria. Daria lost even the strength to scream in the excruciating pain surrounding her body.\r\nThe endless behavior continued to bite my teeth again. Daria was afraid that the cryptic teeth would break instead of a place where the tingling pain could not even feel sensation. please… Please finish… . please… .\r\n\r\nFor Daria, who had never experienced a man, Konyak’s act of recklessness was close to violence. But Konyak didn’t care and ran at her like an angry beast.\r\n\r\nDaria, fearful of the night, becomes angry at Konyak’s ruthless behavior, and finds a way out of his arms to meet a mystery woman who will help her…>"
}