{
	"url": "https://www.novelupdates.com/series/the-female-generals-little-childhood-sweetheart/",
	"title": "The Female General’s Little Childhood Sweetheart - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/11/LittleChildhoodSweetheart3.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Drama   Fantasy   Gender Bender   Romance   ",
	"tags": "Age Progression   Ancient China   Beautiful Female Lead   Black Belly   Caring Protagonist   Child Protagonist   Childhood Friends   Childhood Love   Couple Growth   Court Official   Cute Protagonist   Cute Story   Devoted Love Interests   Different Social Status   Doting Love Interests   Fated Lovers   Female Protagonist   First Love   Generals   Heartwarming   Matriarchy   Mpreg   Persistent Love Interests   Politics   Protagonist Falls in Love First   Reincarnation   Second Chance   Strong Love Interests   Tragic Past   Unconditional Love   ",
	"rating": "(4.3 / 5.0, 82 votes)",
	"author": "卟许胡来   ",
	"year": "\n2017",
	"ranking": "#4617   #2261   #4255   #9503   #2500   ",
	"reviewcount": "15 Reviews sorted by",
	"description": "When you grow up, you’re mine.\n\n~~~\n\nLu Feng, with her fiery character and short temper, only had one fatal weakness. That was the lukewarm and soft Xu Mu.\n\nThere were so many youths in the capital, yet she took fancy to none of them. She instead sought after her newly arrived neighbour’s sweetie and secretly planned to kidnap him home.\n\nUntil one day, the two became cousins…\n\nLu Feng: That fertilised water Of our house cannot flow into someone else’s field!\n\nXu Mu: =v=\n\n~~~\n\nXu Mu: What am I to you?\n\nLu Feng: You are my sweetest Candied Fruit!\n\n~~~\n\nIn their previous life, Xu Mu and Lu Feng were married for only half a year when she died in battle.\n\nXu Mu couldn’t bear the news of her death and followed her three days later.\n\nWho knew that after he died, time flowed backwards and returned him to their childhood. Xu Mu sat on his bed, dazed.\n\nIn this life, he must find his wife first and then vigorously tease her, only letting her “off” after he teased her enough for all she did in their last life! \n\nXu Mu: Last life I did not love you enough, I want to love again. Starting from childhood as childhood sweethearts to a pair of white-haired couple never letting go.\n\n\n\nThis contains a Matriarchy plus MPreg setting. Hence the men will have kids. The roles are reversed as well. Just so you know.>"
}