{
	"url": "https://www.novelupdates.com/series/i-imperial-am-this-type-of-man/",
	"title": "I [Imperial] Am This Type of Man - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/07/92809.jpg",
	"noveltype": "(CN)",
	"genre": "Adventure   Drama   Fantasy   Romance   Yaoi   ",
	"tags": "Alternate World   Ancient Times   Clever Protagonist   Devoted Love Interests   Episodic   Handsome Male Lead   Imperial Harem   Multiple POV   Multiple Realms   Multiple Transported Individuals   Possessive Characters   Protagonist Strong from the Start   Royalty   Sickly Characters   System Administrator   Transmigration   World Hopping   ",
	"rating": "(4.1 / 5.0, 55 votes)",
	"author": "Chunxi Di Xiao   春溪笛晓   ",
	"year": "\n2016",
	"ranking": "#2000   #2000   #6305   #7587   #3758   ",
	"reviewcount": "2 Reviews sorted by",
	"description": "System: Want to live? Want to recover from illness? Want to change Da Zhou’s fate? You only need 998 points to redeem a package guaranteed to cure all diseases and strengthen the body! You don’t need 2400 points, also don’t need 1200 points only 998 points. You won’t suffer losses or be fooled! Welcome to the system of the king of the dead…..\r\n\r\nJi Jinrong: This name does not sound very auspicious\r\n\r\nSystem: Don’t pay attention to these details /(ToT)/ ~~\r\n\r\nJi Jinrong killed all his brothers. At the age of thirteen, he dragged his sick body to the throne and worked conscientiously as a puppet emperor in the hands of the courtiers and eunuchs. Everyone says that the great general Wei Tingjun has wild ambitions, and is intentionally revolting however, Ji Jinrong felt that Wei Tingjun was not staring at the throne but at him, who was sat on the throne!\r\n\r\nJi Jinrong carefully tempted: “If I die you can be the emperor.”\r\n\r\nWei Tingjun: “You dare die, I’ll have everyone buried with you!”\r\n\r\nJi Jinrong: “…..”\r\n\r\nSee, it wasn’t his misconception.\r\n\r\nSo even if it was to just tie the head of the wolf, he (JYR) won’t die easily.\r\n\r\nJi Jinrong: It’s getting cold, its time to ruin the country. I (imperial) have to go back and look for (tie) the great general!>"
}