{
	"url": "https://www.novelupdates.com/series/crashing-into-daylight/",
	"title": "Crashing into Daylight - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/08/Crashing-into-Daylight.png",
	"noveltype": "(CN)",
	"genre": "Action   Fantasy   Romance   Shounen Ai   Supernatural   ",
	"tags": "Bloodlines   Broken Engagement   Demons   Flashbacks   Love Interest Falls in Love First   Lovers Reunited   Magic   Misunderstandings   Older Love Interests   Power Couple   Schemes And Conspiracies   ",
	"rating": "(4.0 / 5.0, 25 votes)",
	"author": "Yǐnlù Xīng   引路星   ",
	"year": "\n2021",
	"ranking": "#2000   #2000   #10138   #11527   #8984   ",
	"reviewcount": "1 Review sorted by",
	"description": "The Demon Slayer World and Demon Realm have recently been abuzz with a rumor: Yu Huai and Xu Yinian have crossed paths again. \n\nFive years ago, the Yu family met with unexpected disaster. As a result, Yu Huai was forced to escape into the Demon Burial Grounds that no one had ever dared step foot in. Everyone assumed he would die there, yet he ended up using merely two years to walk out of that hellhole of corpses and blood. Not only did his powers increase exponentially, but his conduct was now even more unbridled: Yu Huai had slaughtered an entire demon clan that he shared enmity with, leaving nothing behind, not even the ashes.  \n\nSuch perverse behavior stirred both worlds into a widespread discussion, but it had to be noted that during this god of fury’s schooling years, he had for a time been in a pure and innocent campus romance. \n\nBack then, Yu Huai and Xu Yinian could be considered as a pair of love birds known by all; they had even had an early engagement. However, when the Yu family met with calamity, Xu Yinian ruthlessly dumped Yu Huai, breaking off the engagement between them and becoming the classic example of a heartless soul.\n\nFive years later, they met again. The joint forum had long been filled with a mountain of posts. A great deal of analysis later, everyone had come to the conclusion that according to Yu Huai’s typical style, Xu Yinian would at the very least be stripped of a layer of his skin if he were to ever fall into Yu Huai’s hands. \n\nThis was the consensus until one certain day, when a post had quietly made its way to the first page of the joint forum. “Are my eyes deceiving me? The person Yu Huai is hugging is Xu Yinian?!”  \n\n-\n\nXu Yinian had always possessed a little shortcoming. As a demon slayer who honed the art of electricity, whenever his emotions got the better of him, his powers would overflow. This was also known as an electricity leak. \n\nWhen their paths crossed again five years later, Yu Huai attempted to correct this habit but encountered repeated failures. In the end, he could only tease him. “Just one simple kiss and you shock me. Are you a hedgehog?”\n\nThe tip of Xu Yinian’s ears burned up as he brazened it out. “How about you… try kissing me twice?”\n\n- Cruel, sharp-tongued demon x obtuse, pretty overbearing babe\n\n- Exes to lovers, both are secretly in love with each other, HE\n\nI hope you are well and in good health, no longer encountering misfortune. Even if you do meet with troubles, it will just be minor ones that are forgotten in a mere second. You can be as you were in the past, a twinkling star, an unreachable moon. Keep moving forward, fulfill all of those impossible dreams, and never fall into the chaos of this world.\n\nMay you always be free and never lonely.>"
}