{
	"url": "https://www.novelupdates.com/series/jun-jiuling/",
	"title": "Jun Jiuling - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2017/06/Jun-Jiuling.jpg",
	"noveltype": "(CN)",
	"genre": "Drama   Fantasy   Mystery   Romance   ",
	"tags": "Adapted to Drama   Ancient China   Beautiful Female Lead   Broken Engagement   Calm Protagonist   Clever Protagonist   Complex Family Relationships   Cunning Protagonist   Death   Death of Loved Ones   Female Protagonist   Flashbacks   Handsome Male Lead   Investigations   Love Interest Falls in Love First   Marriage of Convenience   Mature Protagonist   Medical Knowledge   Mysterious Family Background   Mysterious Past   Older Love Interests   Past Plays a Big Role   Politics   Power Couple   Proactive Protagonist   Revenge   Royalty   Ruthless Protagonist   Schemes And Conspiracies   Sharp-tongued Characters   Slow Romance   Smart Couple   Strong Love Interests   Tragic Past   Transmigration   ",
	"rating": "(4.2 / 5.0, 351 votes)",
	"author": "Xi Xing   希行   ",
	"year": "\n2015",
	"ranking": "#2210   #2509   #1087   #5101   #1560   ",
	"reviewcount": "40 Reviews sorted by",
	"description": "Jun Zhenzhen might have been recently orphaned, but it didn’t dampen her arrogance one bit. She even snubbed her maternal family who took her in, seeing them as merely a stopover as she gained a foothold in Yangcheng. Her final destination, obviously, was with the scholarly and aristocratic Ning Family. More specifically, as the wife of the first son and pride of the Ning Family. After all, their grandfathers had arranged their marriage long ago.\n\nBut the engagement was denied! The family refused to meet with her, refused to accept the validity of a marriage arranged by elders long dead, refused to accept such an unruly, uncouth girl into their family. \n\nShe’ll show them.\n\nSincerity is everything, so she took a room in a nearby inn and strung up a length of white silk. Of course, she figured that once they saw how far she was willing to go, they would need to open their doors to her. Too clever!\n\nOnly, once her eyes fluttered closed… it was another girl who opened them again.\n\nThe recently dead Princess Jiuling, who was hacked to death during her attempted assassination of the King, has been granted another attempt at life and revenge.\n\nBut first, she has to get this petty Ning family and this nonsense arranged marriage out of the way. \n\nChild’s play.>"
}