{
	"url": "https://www.novelupdates.com/series/mr-earnest-is-my-boyfriend/",
	"title": "Mr. Earnest Is My Boyfriend - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2017/09/小说.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Josei   Romance   Slice of Life   ",
	"tags": "Beautiful Female Lead   Couple Growth   Devoted Love Interests   Doting Love Interests   Female Protagonist   Handsome Male Lead   Heartwarming   Love Interest Falls in Love First   Modern Day   Naive Protagonist   ",
	"rating": "(4.0 / 5.0, 69 votes)",
	"author": "阿宁儿   ",
	"year": "\n2016",
	"ranking": "#6970   #2000   #4637   #9321   #4095   ",
	"reviewcount": "4 Reviews sorted by",
	"description": "A free spirit meets her match in all-around perfect bachelor whose humorlessness is his only flaw. When Xia Zhen reaches the unfortunate marriageable age, she is forced to go on a blind date where she meets Pei Cheng An. Her cunning plan is to pretend to be completely infatuated with her date in front of her mother, while sabotaging the actual relationship. Except Pei Cheng An isn’t the type to follow the script.\r\n\r\n*\r\n\r\nIn Xia Zhen’s opinion, Pei Cheng An is a person whose way of thinking belongs in the last century and whose manner of speaking reminds her of her grandpa. But since he looks dreamy and has qualifications, she’ll just pretend that she has fallen for him at first sight.\r\n\r\nEh? Pei Cheng An also finds her good enough to start a relationship with.\r\n\r\nGreat. Now when he finds out that she’s not a suitable partner for marriage and dumps her, she can return home all heartbroken and request to temporarily go on a brief no-blind-dates period. This is excellent. However…\r\n\r\n“I’m so unreasonable. Why aren’t you breaking up with me?”\r\n\r\n“A man should be tolerant towards his girlfriend.”\r\n\r\n“I’m so mean to you. Why are you being so kind to me?”\r\n\r\n“Girlfriends are meant to be spoiled.”\r\n\r\n“I’m not gentle or considerate. Why aren’t you breaking up with me?”\r\n\r\n“Likely it’s because… I like you.”>"
}