{
	"url": "https://www.novelupdates.com/series/supernatural-girlfriend/",
	"title": "Supernatural Girlfriend - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2018/05/SG-cover.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Drama   Josei   Mystery   Romance   Supernatural   ",
	"tags": "Bickering Couple   Depression   Devoted Love Interests   Early Romance   Female Protagonist   First Love   Forced Living Arrangements   Ghosts   Handsome Male Lead   Investigations   Love Interest Falls in Love First   Modern Day   Murders   Seeing Things Other Humans Can't   Wealthy Characters   ",
	"rating": "(4.1 / 5.0, 233 votes)",
	"author": "Miao Le Ge Wang   喵了个汪   ",
	"year": "\n2017",
	"ranking": "#2000   #3728   #1765   #2426   #2625   ",
	"reviewcount": "45 Reviews sorted by",
	"description": "“Boss…I’m really sleepy….” My eyelids were starting to feel heavy. After all, it was past 3am. Most normal people would be asleep by now.\n\n“From now on, don’t call me boss. During this 24 hours date, we are not in a boss subordinate type of relationship.” Suyang whispered in my ears. “If you’re tired, then take a nap. I’ll wake you up when the sunrise begins.”\n\nThen, he tightened his grip and I felt so much warmer in his embrace. “Let me sing you a lullaby.” Suyang suddenly suggested.\n\n“Lullaby? Why lullaby…?”\n\n“Isn’t it common for couples to sing to each other? I read it online.” Suyang explained. Before I gave him consent, he began to sing, “Pig…..your nose has two holes…”\n\nI smacked Suyang, “What type of lullaby is this?”\n\n“Stop interrupting. I purposely chose this song for you. You’re ruining the atmosphere.”\n\n“You’re the one ruining the atmosphere!” I couldn’t help but giggle hysterically.\n\nI turned over and saw how serious he was. It made me laugh even harder. “Stop being so funny!”\n\n—–\n\nLin Yixin has had the ability to see ghosts ever since the car accident. However, it felt more like a curse than a blessing until Yixin almost died in the hands of a masked killer one day. The killer got away, but Yixin realized she had an advantage no one else had. Since she was able to see the ghosts that were following him, it meant she could pinpoint his exact location. But how was she going to obtain the evidence to prove his guilt?>"
}