{
	"url": "https://www.novelupdates.com/series/garbage-brave-isekai-ni-shoukan-sare-suterareta-yuusha-no-fukushuu-monogatari/",
	"title": "Garbage Brave: Isekai Ni Shoukan Sare Suterareta Yuusha No Fukushuu Monogatari (WN) - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/12/IT7kHvR.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Fantasy   Harem   Mystery   Romance   Shounen   ",
	"tags": "Ability Steal   Adapted to Manga   Antihero Protagonist   Artifacts   Betrayal   Cautious Protagonist   Cheats   Chefs   Clever Protagonist   Conditional Power   Cooking   Dark   Demi-Humans   Depictions of Cruelty   Determined Protagonist   Discrimination   Divine Protection   Dungeons   Elemental Magic   Elves   Fantasy Creatures   Game Elements   Goddesses   Grinding   Hated Protagonist   Hidden Abilities   Human-Nonhuman Relationship   Human Weapon   Immortals   Kind Love Interests   Level System   Loner Protagonist   Magic   Male Protagonist   Master-Servant Relationship   Monsters   Multiple Transported Individuals   Near-Death Experience   Overpowered Protagonist   Polygamy   R-15   Revenge   Schemes And Conspiracies   Sentient Objects   Skill Assimilation   Skill Creation   Special Abilities   Strong Love Interests   Strong to Stronger   Sudden Strength Gain   Summoned Hero   Survival   Sword And Magic   Sword Wielder   Transported to Another World   Underestimated Protagonist   Unique Weapon User   Unique Weapons   Wars   Weak to Strong   World Travel   World Tree   ",
	"rating": "(3.5 / 5.0, 90 votes)",
	"author": "Nanjamonja   なんじゃもんじゃ   ",
	"year": "\n2017",
	"ranking": "#3314   #2000   #3665   #2175   #2979   ",
	"reviewcount": "5 Reviews sorted by",
	"description": "Tsukuru, attending school as usual, is suddenly summoned to a different world with his classmates. However, what awaits them after being summoned is a hero auction. in which each country bid for heroes to defeat the demon king.\r\n\r\nWhile his classmates who got cheat jobs sold for sky-high prices, Tsukuru, with the obvious loser jobs of “Chef” wasn’t sold at all, and was thrown out a transfer gate to a magic forest in the middle of nowhere, inhabited by many powerful monsters.\r\n\r\nTsukuru, narrowly avoiding death many times at the hands of monsters, is thrust onto the path of the strongest!>"
}