{
	"url": "https://www.novelupdates.com/series/surrender-at-a-glance/",
	"title": "Surrender At a Glance - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/09/SAG.jpg",
	"noveltype": "(CN)",
	"genre": "Romance   Slice of Life   ",
	"tags": "Comedic Undertone   Death of Loved Ones   Early Romance   Female Protagonist   Handsome Male Lead   Marriage   Marriage of Convenience   Secret Crush   ",
	"rating": "(3.5 / 5.0, 17 votes)",
	"author": "鲸叹叹   ",
	"year": "\n2020",
	"ranking": "#2000   #2000   #11589   #11908   #11741   ",
	"reviewcount": "1 Review sorted by",
	"description": "As a student, Jiang Xiche was self-disciplined and stable in the eyes of everyone, he was like a proud child of heaven. Everything about him was good, except that his family background was not strong enough and his personality was too cold.\n\nYears later, the former Qing Leng Xueba[1] became the biggest name in the business world, but he married the second lady of the Yi family who was not favored and had a bad temper.\n\nBut no one know, why Yi Yan married Jiang Xiche. There were three reasons; First because of money; second because of how handsome Jiang Xiche looks and the last reason was to annoy her elder sister. \n\nUnfortunately, after marriage, she was ridiculed by her elder sister as a “living widow”, because she lived separately from her husband for a long time.     \n\nBut one early morning, Yi Yan was shocked to find herself in the arms of a handsome man, “Why are you here? When did you come back?”\n\nThe person who flew back from Italy overnight said with a low expression: “I arrived in the middle of the night, after finishing my work.”\n\nYi Yan and Jiang Xiche slept in the same bed for two months, and Jiang Xiche’s physical desire for her remained at kissing.\n\nEven when she took the initiative to seduce him, he would be the same; calm and relaxed.\n\nSeeing this, Yi Yan started to think that her charm was not enough, and she slowly began to lose her self-confidence, due to which she became quite frustrated.\n\nUntil one day the two had a conflict, Yi Yan came home at night and lied to Jiang Xiche that she had cheated on him and that she had just come back after having fun with other men.\n\nThe man who had always been calm and self-sufficient suddenly seemed to have changed. Confining her to the wall, like an awakened demon, he looked extremely dangerous.\n\nYi Yan was frightened and asked Jiang Xiche, “What do you want to do?” The other party’s voice was deep, “It’s exciting to play with you.”\n\n[1](清冷)Qīnglěng is a word meaning cold (学霸)Xué bà is a slang used to refer top student or bookworm. Here the author is referring Jiang Xiche as a cold top student.>"
}