{
	"url": "https://www.novelupdates.com/series/excalibur-chronicle-of-raidorl/",
	"title": "Excalibur Chronicle of Raidorl (WN) - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/06/Excalibur-Chronicle-of-Raidorl.jpeg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Drama   Fantasy   Harem   Romance   Seinen   ",
	"tags": "Adventurers   Antihero Protagonist   Betrayal   Broken Engagement   Childhood Friends   Dark   Family Conflict   Love Interest Falls in Love First   Maids   Male Protagonist   Monsters   Nobles   Politics   Polygamy   R-15   Revenge   Reverse R*pe   Royalty   Sibling Rivalry   S*aves   Strong Love Interests   Strong to Stronger   Sword And Magic   Sword Wielder   Weak to Strong   Witches   ",
	"rating": "(3.4 / 5.0, 47 votes)",
	"author": "Leonar D   レオナールD   ",
	"year": "\n2020",
	"ranking": "#2000   #2146   #4022   #2226   #5450   ",
	"reviewcount": "2 Reviews sorted by",
	"description": "Raidorl Zain was born and raised as the second prince of the Kingdom of Zain.\r\n\r\nRaidorl lived a peaciful life surrounded by his kind elder brother and loyal vassals, however his fate completely changed drastically during his coming-of-age ceremony when he was chosen to be the holder of “Dáinsleif “, the excalibur (sacred sword) of the royal house.\r\n\r\nHis brother the first prince started to hate him as an enemy that threatened his claim to the throne, his vassals and even his own fiancée abandoned him and he was banished to a town in develpment at the borders alone.\r\n\r\nSince then, Raidorl has struggled to survive at the borders that were a monster’s domain, gaining the trust of those around him, he found a new happiness with his friends in that poor and harsh life.\r\n\r\nHowever… his fate change once again when the neighboring Arsline Empire started to invade the Kingdom of Zain.\r\n\r\nForced by his brother to fight to protect the kingdom from the Empire’s invasion, Raidorl decides to plot a rebellion against the overly selfish demands of all those people that banished him.\r\n\r\nWhen the exiled prince takes the sacred sword on his hand, the curtains of a new heroic legend will open!\r\n\r\nThe sacred sword legend that started with “Rebellion”, begins here!>"
}