{
	"url": "https://www.novelupdates.com/series/kimi-wa-hontouni-boku-no-tenshi-nano-ka/",
	"title": "Kimi wa Hontouni Boku no Tenshi nano ka - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/08/Kimi-wa-Hontouni-Boku-no-Tenshi-nano-ka.png",
	"noveltype": "(JP)",
	"genre": "Comedy   Drama   Romance   Seinen   ",
	"tags": "Beautiful Female Lead   Celebrities   Childhood Friends   Different Social Status   Famous Protagonist   Female Protagonist   Flashbacks   Forced into a Relationship   Male Protagonist   Modern Day   Multiple POV   Multiple Protagonists   Popular Love Interests   Pretend Lovers   Timid Protagonist   Tragic Past   ",
	"rating": "(3.6 / 5.0, 54 votes)",
	"author": "Shimesaba   しめさば   ",
	"year": "\n2021",
	"ranking": "#2114   #3272   #7252   #6259   #6743   ",
	"reviewcount": "No Reviews",
	"description": "Living as a pseudo-couple with your favorite idol?!\r\n\r\nThe “perfect” idol Akira Sezai. Akira was my last hope after all the idols I had supported retired due to boyfriend revelations and harassment scandals. She’s the last idol I’m going to support. That’s what I had decided. I have a phobia of women and feel physically ill when I get close to one. Still, I mustered up the courage to attend Akira’s handshake event. That night, after a sluggish exchange of words and handshakes, Akira, for some reason, barged into my house.\r\n\r\n“Will you be my boyfriend?”\r\n\r\nThose words suddenly changed my daily life. I had only ever seen Akira standing on stage, but now she was revealing her offstage personality to me one after another. And the reason she approached me had nothing to do with becoming my lover… By spending time with an idol that I had only admired, I was able to see the dazzling brilliance and the abyss that lay beneath her. I’m afraid of women, but at the same time, I yearn for them. And while shining as an idol, Akira seems to be heading for destruction.\r\n\r\nWhat lies ahead for the two of them as they play lovers?>"
}