{
	"url": "https://www.novelupdates.com/series/the-daughter-of-evil/",
	"title": "The Daughter of Evil - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2015/10/ClotureCover.png",
	"noveltype": "(JP)",
	"genre": "Fantasy   ",
	"tags": "Adapted to Manga   Based on a Song   Royalty   Twins   Vocaloid   ",
	"rating": "(4.1 / 5.0, 20 votes)",
	"author": "Akuno-P   mothy_悪ノP   ",
	"year": "\n2010",
	"ranking": "#2000   #2000   #11511   #12114   #8544   ",
	"reviewcount": "No Reviews",
	"description": "The Daughter of Evil is a light novel series based upon the song series of the same name by Akuno-P. Each novel tells a different story set in the same world.\n\nv1. Clôture of Yellow\n\n“To protect you… for that, I will even become evil!”\n\nThe major power of the Evillious region, the Kingdom of Lucifenia. Ruling this vast country was the 14-year-old princess, Riliane. She used her absolute power to squeeze everything from the people, and anyone who defied her was beheaded without mercy.\n\nBeside that princess was a servant with a face similar to hers. His name is Allen. He had been her younger twin brother that pretended to be dead at an early age. Many lives disappeared in the great war that his selfish sister began. When faced with the cruel choice, what did the boy choose?\n\nOn the other side, a “swordswoman in red armor” was at the center of an army group of the masses enraged by the tyranny of the princess. They rose up and revolted against the Lucifenian government. She was at the center, the “swordswoman in red armor”—Allen’s foster sister, Germaine; with her personal feelings, she aimed her blade toward the royal palace.\n\nAnd now, the yellow country’s finale, its “clôture”, begins… \n\nv2. Wiegenlied of Green\n\n“I’m sorry for being alive.”\n\nIn order to prevent the collapse of the “Yellow Country”, the Kingdom of Lucifenia, the mage Elluka has asked the earth god Held for a favor.\n\nAt the same time, Clarith, a racially different girl living through the rampant racism of the “Green Country”, Elphegort, prayed to God about her feelings of loneliness. “Anyone is fine, I just want them to be my friend.” Michaela, a girl with beautiful green hair, appeared in front of Clarith one day, and the two began living together. But life for the two is about to change, as their world collapses by The Daughter of Evil in the neighboring country. Riliane made the Witch Hunting Order to kill the green-haired women and Elphegort is suddenly wrapped up in a war. Michaela wishes to escape with Clarith, and Clarith wishes for Michaela’s safety. Is there a way to save the girl? And now, has Elluka’s behavior attempted to prevent the collapse of the country?\n\nIn the Green Country, will the day the Diva’s lullaby, its “wiegenlied”, flows come again? \n\nv3. Praeludium of Red\n\nv4. Praefacio of Blue>"
}