{
	"url": "https://www.novelupdates.com/series/my-vests-are-all-over-the-world/",
	"title": "My Vests Are All Over The World - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/07/My-Vests-Are-All-Over-The-World.jpg",
	"noveltype": "(CN)",
	"genre": "Adventure   Drama   Fantasy   Romance   Sci-fi   Yaoi   ",
	"tags": "Complex Family Relationships   Demons   Devoted Love Interests   Elves   Fantasy Creatures   Fantasy World   Game Ranking System   Gods   Love Interest Falls in Love First   Magic   Male Protagonist   Misunderstandings   Monsters   Multiple Identities   Nobles   Past Plays a Big Role   Past Trauma   Politics   Protagonist Strong from the Start   Race Change   Reincarnation   Royalty   S*aves   Slow Romance   Tragic Past   Virtual Reality   Wizards   ",
	"rating": "(4.2 / 5.0, 32 votes)",
	"author": "夜半灯花   ",
	"year": "\n2020",
	"ranking": "#2384   #1546   #7090   #5885   #6461   ",
	"reviewcount": "5 Reviews sorted by",
	"description": "“Sanctuary” was the first holographic online game of the Blue Star system.\n\nQiao Nan unified the devil race, pacified the human world, and almost killed the gods when the “Sacred Realm” was deleted.\n\nQiao Nan, who should have been ejected from the game, was trapped in the game, experiencing one censored internal test after another.\n\nDuring this period, Qiao Nan changed countless camps, magic, elves, sea, human, and even the divine realm, relying on the deletion of the file, but also recklessly increasing the goodwill of the NPCs and races.\n\nThen on a day when Qiao Nan was quietly unaware, “Sanctuary” was publicly tested.\n\nThinking the file had been again, Qiao Nan once again chose the Demon camp.\n\nThe man who was appointed by him as the Archduke of the Demon Clan knelt down on one knee and kissed his hand.\n\nWelcome back, my king\n\nQiao Nan: ????\n\nHowever, the situation was still much more than that, and when he went to the other races, he found that things seemed to be a bit big. The high priest of the elves, the prince of the sea race who had been imprisoned for a hundred years, the great hero of the human race a hundred years ago, and the god of light …… who was forced to sleep in the divine realm all cast a respectful yet frenzied gaze at him.\n\nQiao Nan: Wait, what’s going on?!\n\nThe worlds seemed to have…… fused.>"
}