{
	"url": "https://www.novelupdates.com/series/worship-me-i-can-make-you-rich/",
	"title": "Worship Me, I Can Make You Rich - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/04/Worship-me-I-can-make-you-rich.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Comedy   Fantasy   Mecha   Romance   Sci-fi   Shounen Ai   Xuanhuan   ",
	"tags": "Amnesia   Cute Protagonist   Devoted Love Interests   Doting Love Interests   Futuristic Setting   God-human Relationship   God Protagonist   Godly Powers   Handsome Male Lead   Hiding True Abilities   Hiding True Identity   Language Barrier   Love Interest Falls in Love First   Lucky Protagonist   Military   Misunderstandings   Mysterious Past   Naive Protagonist   Overpowered Protagonist   Past Plays a Big Role   Possessive Characters   Power Couple   Protagonist Strong from the Start   Strong Love Interests   Tsundere   ",
	"rating": "(4.7 / 5.0, 483 votes)",
	"author": "Fly Far   向远飞   ",
	"year": "\n2021",
	"ranking": "#931   #1801   #1325   #663   #1267   ",
	"reviewcount": "109 Reviews sorted by",
	"description": "On the first day of work for the little intern God of Wealth, Zhuang Zhou was filled with confidence and complacency.\n\nHe looked at the man collecting junk from a pile of garbage and said: “Worship me, I can make you rich.”\n\nThe big and tall man stubbornly continued to collect junk, ignoring him completely.\n\nNot wanting to lose his job on his first day at work, Zhuang Zhou did his best at persuasion: “Men can’t be so lacking in ambition. You can’t collect garbage for a lifetime, right? How will you find a wife in the future?”\n\nThe Imperial Admiral, Wen XiaoYun, self-destructed with the alien Insect Empress. Surviving by a fluke, he landed on a long abandoned tr*sh planet.\n\nHe could only search for installable parts from a pile of abandoned garbage to fix his mecha and mend his communication array.\n\nThe days spent on the abandoned tr*sh planet were very long and tortuous. Fortunately, there was a little friend accompanying him.\n\nEn. However, this little friend was a little s*upid.\n\nIt’s alright. He’s still pretty cute.\n\nReturning home victorious, the Admiral-daren brought his sweetheart back to the Imperial capital planet, igniting the attention of the entire galaxy. \n\nThe reporters asked: “Admiral-daren, can you tell us what’s your criteria for choosing a spouse? What about Mister Zhuang Zhou attracted you?”\n\nAfter thinking for a moment, the Admiral-daren said: “Many people approach me for my status and power. Only he, is willing to collect garbage with me.”\n\nThe entire galaxy: “????”\n\nAt this time, however, the little God of Wealth was silently hugging himself.\n\nOh no! Something unexpected seemed to have happened when he descended to Earth!\n\nHe has somehow arrived in the intergalactic era!\n\n>"
}