{
	"url": "https://www.novelupdates.com/series/bon-appetit/",
	"title": "Bon Appétit - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/09/xxlarge-1.jpeg",
	"noveltype": "(KR)",
	"genre": "Comedy   Drama   Fantasy   Romance   Slice of Life   ",
	"tags": "Adapted to Manhwa   Aristocracy   Carefree Protagonist   Chefs   Confinement   Cooking   Curses   Cute Protagonist   European Ambience   Female Protagonist   Handsome Male Lead   Lack of Common Sense   Love Interest Falls in Love First   Male Yandere   Mob Protagonist   Nobles   Quirky Characters   Reincarnated in Another World   Reincarnation   Royalty   Strong Love Interests   Witches   ",
	"rating": "(4.2 / 5.0, 103 votes)",
	"author": "Ryu Ran   류란   ",
	"year": "\n2020",
	"ranking": "#648   #696   #2792   #1633   #2636   ",
	"reviewcount": "11 Reviews sorted by",
	"description": "“Are you eating in this situation?”\n\n“Of course! I’ll have to keep savoring the taste until I die. Do you want one?”\n\nShe was reincarnated in a novel as Luana, the abandoned princess.\n\nAnd her death was already decided.\n\nShe just wanted to let people know about her cooking talent, but she was misunderstood as a witch because of her cheese jerky!\n\nThe General of the conquering army, Duke Legion, who had lost his sense of taste, took her to the Empire for her extraordinary jerkies and to break the curse that had come down from generation to generation.\n\n“It is delicious, isn’t it?”\n\n“Prepare the same for the dinner.”\n\nShe was happy to be able to cook and eat as much as delicious food as she wanted…\n\nBut now, she also wanted to look after Legion.\n\n‘Eat three meals a day, and make sure to make dessert. I’m sure he will be able to gain some weight…!’\n\n–\n\nThe Duke took the jerky from the princess. On the surface, it was no different from any beef jerky.\n\nBut when he took a bite of it, it felt like a new world had opened up.\n\nThe jerky, made by the princess, felt more tender than the others as he gently crushed it with his teeth.\n\nThe taste of condensed meat smudged his tongue as he chewed on. It was just as she said.\n\nHe could feel the savory taste of the spicy meat, and at the end of the day, he wanted to have more.\n\nThe desire that he had, faded for a while.\n\n“I didn’t really want anything, but now I think I do.”>"
}