{
	"url": "https://www.novelupdates.com/series/lady-sus-revenge/",
	"title": "Lady Su’s Revenge - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/08/毒妻在上300.jpg",
	"noveltype": "(CN)",
	"genre": "Drama   Josei   Romance   ",
	"tags": "Adopted Protagonist   Alchemy   Ancient China   Apathetic Protagonist   Beautiful Female Lead   Business Management   Calm Protagonist   Cautious Protagonist   Charming Protagonist   Clever Protagonist   Cold Love Interests   Cold Protagonist   Cooking   Cultivation   Cunning Protagonist   Devoted Love Interests   Doctors   Doting Love Interests   Fast Cultivation   Fast Learner   Female Protagonist   Genius Protagonist   Handsome Male Lead   Hard-Working Protagonist   Hiding True Abilities   Kind Love Interests   Magical Space   Mature Protagonist   Medical Knowledge   Multiple Realms   Mysterious Family Background   Past Plays a Big Role   Persistent Love Interests   Pets   Poisons   Pregnancy   Previous Life Talent   Revenge   Ruthless Protagonist   Schemes And Conspiracies   Second Chance   Strong Love Interests   Underestimated Protagonist   Unique Cultivation Technique   Weak to Strong   ",
	"rating": "(3.3 / 5.0, 47 votes)",
	"author": "Xian Xian   鲜仙   ",
	"year": "\n2019",
	"ranking": "#6970   #2953   #4615   #10476   #6315   ",
	"reviewcount": "17 Reviews sorted by",
	"description": "Su Li has never expected that those she met in her first life would follow her to a new life in a new family.\n\nEverything in this life is new and seems easy, but she knows that’s not what she wants.\n\nShe wants a revenge. Those who have done terrible things to her, those who have separated her from her husband, and those who have let her brother fail the royal examination in last life, she will let them pay in her way.\n\nBut how can a 14-year-old girl, innocent and elegant, take a revenge? How can she fight against her family on her own? How can she deal with her weak-kneed father and heartless mother? Just read and find it out now!>"
}