{
	"url": "https://www.novelupdates.com/series/god-is-hungry-for-games-the-ultimate-brain-battle-of-a-boy-who-challenges-the-gods-ln/",
	"title": "God Is Hungry for Games. The Ultimate Brain Battle of a Boy Who Challenges the Gods (LN) - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/02/God-Is-Hungry-for-Games-The-Ultimate-Brain-Battle-of-a-Boy-Who-Challenges-the-Gods-LN.jpg",
	"noveltype": "(JP)",
	"genre": "Adventure   Comedy   Ecchi   Fantasy   Sports   Supernatural   ",
	"tags": "Adapted to Anime   Adapted to Manga   Appearance Changes   Appearance Different from Actual Age   Battle Competition   Beautiful Female Lead   Cautious Protagonist   Confident Protagonist   Cunning Protagonist   Cute Protagonist   Determined Protagonist   Fantasy Creatures   Fearless Protagonist   Friendship   Gamers   Genius Protagonist   God-human Relationship   Goddesses   Gods   Honest Protagonist   Immortals   Magic   Magical Space   Male Protagonist   Misunderstandings   Multiple Realms   Mythical Beasts   Spatial Manipulation   Strategic Battles   ",
	"rating": "(3.3 / 5.0, 12 votes)",
	"author": "Sazane Kei   細音啓   ",
	"year": "\n2021",
	"ranking": "#2000   #2000   #11336   #10271   #10915   ",
	"reviewcount": "No Reviews",
	"description": "The Ultimate Brain Games, “Play of the Gods” made by their supreme grace, Gods, who had too much spare time probably.\n\nA former God, Leche, who woke up from a long slumber; declared unto the world:\n\n“Bring forth the person who is the best in Games in this era!”\n\nThe test given to the humankind was to win 10 games against Gods.\n\n10 difficult games brought by the Supreme Gods.\n\nThere is yet to be a Victor throughout this vast human history.\n\nFast forward to the modern time;\n\nThe “God-chosen” man Faye\n\nOn the behalf of the whole humanity, he was given the task.\n\nThe task to challenge and win at brain battles with these Supreme Gods.\n\nBut, Faye was no ordinary boy.\n\nHe is the boy nominated as the “best rookie” in the recent years.\n\nThe “Play of Gods” he is about to challenge might be too difficult.\n\nIndeed, there is no human in history able to succeed. Well, the reason is quite obvious.\n\nGod is capricious, very unreasonable, and sometimes even “Absolutely Incomprehensible”.\n\nBut, because its such a game, “Its a waste to not have fun and play from the bottom of my heart!”\n\nAnd thus begins the Ultimate Brain Battle of a Genius Game Boy, a former God (who happens to be a girl) , and friends!>"
}