{
	"url": "https://www.novelupdates.com/series/spending-the-male-leads-money-to-change-her-fate/",
	"title": "Spending the Male Lead’s Money to Change Her Fate - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/07/Spending-the-Male-Leads-Money-to-Change-Her-Fate.jpg",
	"noveltype": "(CN)",
	"genre": "Drama   Fantasy   Romance   Slice of Life   ",
	"tags": "Beautiful Female Lead   Businessmen   Calm Protagonist   Character Growth   Charming Protagonist   Clumsy Love Interests   Cold Love Interests   Confident Protagonist   Cute Children   Devoted Love Interests   Doting Love Interests   Female Protagonist   Forced Marriage   Friendship   Handsome Male Lead   Marriage   Modern Day   Older Love Interests   Pregnancy   Slow Romance   Transmigration   Wealthy Characters   Younger Brothers   Younger Sisters   ",
	"rating": "(3.8 / 5.0, 27 votes)",
	"author": "时星草   ",
	"year": "\n2021",
	"ranking": "#3314   #4673   #6906   #10063   #6716   ",
	"reviewcount": "8 Reviews sorted by",
	"description": "Two years after Jiang Qiuyi's wedding, she realized that she was but a cannon fodder in a novel. \r\n\r\nIt didn’t matter that she was being thrifty with money, or that she walked on thin ice everyday trying to be the best wife that she could be, Lu Mingcheng, her husband, would still divorce her in a year's time and left her with nothing. \r\n\r\nJiang Qiuyi, who had now been enlightened set a goal for herself: she is going to spend 10 billion yuan first before she worry about anything else. \r\n\r\nHigh-end custom jewelries? Sure!\r\nYacht? Yes!\r\nA private plane? Why not!\r\n\r\nEverybody thought that Jiang Qiuyi had lost her mind and waited for the day she was swept outside of the Lu's door. \r\n\r\nWhen their wedding anniversary came around, Lu Mingcheng gave Jiang Qiuyi shares of his company as a gift. \r\n\r\nLu Mingcheng: Go buy what you want.\r\nJiang Qiuyu: ?\r\nEverybody else: ? ? ?\r\n\r\nLu Mingcheng noticed that his wife had changed.\r\nShe went from one who too frugal to even buy a purse for herself in the past to one who spent money mindlessly. \r\n\r\nThere was no more room for his clothes in the closet and Lu Mingcheng went from surprised to acceptance. \r\n\r\nAll the way until…\r\nHis assistant told him that, 'Sir, Mrs. Lu invested in an entertainment company today and signed 10 little fresh meat. They are going to have a celebratory dinner tonight.'\r\n\r\nLu Mingcheng: I am sure there is still a place for me in her heart. >"
}