{
	"url": "https://www.novelupdates.com/series/who-allowed-you-to-get-on-the-bed/",
	"title": "Who Allowed You to Get on the Bed - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/07/whoallowyou1.jpg",
	"noveltype": "(CN)",
	"genre": "Adult   Drama   Josei   Romance   Smut   ",
	"tags": "Beautiful Female Lead   Bodyguards   Boss-Subordinate Relationship   Calm Protagonist   Cold Protagonist   Devoted Love Interests   Doting Love Interests   Female Protagonist   Handsome Male Lead   Misunderstandings   Modern Day   Possessive Characters   Pregnancy   Protagonist Falls in Love First   Short Story   Strong Love Interests   ",
	"rating": "(3.5 / 5.0, 91 votes)",
	"author": "An Jing   安靖   ",
	"year": "\n2012",
	"ranking": "#2000   #1132   #3547   #3302   #3426   ",
	"reviewcount": "13 Reviews sorted by",
	"description": "When she loves him she hopes everyday and waits everyday for him, feeling grievances like a little daughter-in-law; When she didn't want to love him, he is overbearingly like a jealous husband wrapping around her everyday and noisy everyday.\n\nAnyone who knows Han Luoting understands that HE, is firm and old-fashioned.\n\nHe has always been cold and indifferent to the women. Although there are a lot of women that admire his handsome appearance, no woman dares to be as stupid as Du Linglan, knowing that man doesn't love her, she is still stupid enough to accompany him to roll under the sheet for a night.\n\nTo Du Linglan, as long as SHE loves him, it's enough.\n\nIt isn't until he coldly pushes her away that she decided she will never love this man anymore.\n\nIt's just that her forefoot is gone, Han Luoting, a man who has never had a heart for her actually chases her before her eyes. He is very clumsy and changes his style hard to please her.\n\nPregnant woman? Looking at Du Linglan with a big belly, Han Luoting is very sure that the man who makes her get a big belly, who else besides him?\n\nCold eyes look at one person after another shows love to her, he is like a jealous husband can't wait to catch her into the auditorium and declare sovereignty.\n\nSince this stupid woman foolishly loves him for so many years then he will marry her home as a legal wife.\n\nIt shouldn't be excessive, but she not only not let him get on the bed still keeps on saying that she doesn't want to marry him!>"
}