{
	"url": "https://www.novelupdates.com/series/the-imperial-marshals-male-wife-is-pregnant/",
	"title": "The Imperial Marshal’s Male Wife is Pregnant - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/09/The-Imperial-Marshal’s-Male-Wife-is-Pregnant.png",
	"noveltype": "N/A",
	"genre": "Adult   Romance   Sci-fi   Yaoi   ",
	"tags": "Cold Love Interests   Cute Protagonist   Futuristic Setting   Mpreg   Multiple Personalities   Multiple Transported Individuals   Royalty   Strong Love Interests   Transmigration   Transported to Another World   Tsundere   Twisted Personality   ",
	"rating": "(3.8 / 5.0, 35 votes)",
	"author": "Moon Lotus Guest   月下莲客   ",
	"year": "\n2019",
	"ranking": "#3133   #6281   #6987   #8107   #4819   ",
	"reviewcount": "7 Reviews sorted by",
	"description": "Shen Yi transmigrated into the novel ‘Interstellar Empire‘ and slept with the second personality of the the big villain, Lu Yunbo.  According to the novel’s plot, there is a baby in his stomach.\r\n\r\n \r\n\r\nAs the wife of Lu Yunbo’s first personality, and having conceived a child with Lu Yunbo’s second personality, his ending in the novel was to be murdered in cold-blood by Lu Yunbo’s first personality. Both mother and son died.\r\n\r\n \r\n\r\nOption 1 : Secretly abort. Sorry, our Empire doesn’t permit it!\r\n\r\nOption 2 : Divorce without delay. Sorry, no divorce is allowed before a child of Lu and Shen’s family is born.\r\n\r\nOption 3 : Getting laid with Lu Yunbo’s first personality.\r\n\r\nLu Yunbo: Sorry, I’m not interested in you.\r\n\r\nShen Yi : Who are you interested in?\r\n\r\n \r\n\r\nLater ….\r\n\r\nLu Yunbo discovered that he likes being a father, and the wife that he had never touched is pregnant!\r\n\r\nKill him, not willing to part with him.\r\n\r\nKill the child, afraid that it may harm his body.\r\n\r\nEndure it? How the heck can he endure it?\r\n\r\nShen Yi : Hubby ~~\r\n\r\nLu Yunbo : Aiii ~ Just endure it!!!\r\n\r\n \r\n\r\nCute Tsundere, Machine Enthusiast Slag Shou X Cold-blooded, Two-faced Gong with Multiple Personality Disorder>"
}