{
	"url": "https://www.novelupdates.com/series/villain-hides-his-true-colors/",
	"title": "Villain Hides His True Colors - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/02/Villain-Hides-His-True-Color.jpg",
	"noveltype": "(KR)",
	"genre": "Action   Adventure   Comedy   Fantasy   Harem   Mature   Romance   Supernatural   ",
	"tags": "Abandoned Children   Abusive Characters   Academy   Adopted Children   Adopted Protagonist   Age Progression   Antihero Protagonist   Beastkin   Calm Protagonist   Child Abuse   Child Protagonist   Cold Protagonist   Comedic Undertone   Crime   Cruel Characters   Cunning Protagonist   Demi-Humans   Demons   Depictions of Cruelty   Dishonest Protagonist   Distrustful Protagonist   Dystopia   Elves   Enemies Become Allies   Evil Gods   Evil Organizations   Evil Protagonist   Fanaticism   Firearms   Game Elements   Game Ranking System   Gamers   Gangs   Gate to Another World   Gore   Guilds   Handsome Male Lead   Heroes   Hiding True Abilities   Human Experimentation   Interdimensional Travel   Lack of Common Sense   Level System   Loyal Subordinates   Lucky Protagonist   Magic Beasts   Magical Space   Male Protagonist   Misunderstandings   MMORPG   Multiple Realms   Murders   Naive Protagonist   Necromancer   Nobles   Organized Crime   Overpowered Protagonist   Past Plays a Big Role   Past Trauma   Protagonist Strong from the Start   Psychopaths   Race Change   Revenge   Ruthless Protagonist   Sadistic Characters   Schemes And Conspiracies   Second Chance   Shameless Protagonist   Shota   Special Abilities   Strong to Stronger   Sword And Magic   Sword Wielder   Terrorists   Time Travel   Torture   Tragic Past   Twisted Personality   Werebeasts   Witches   Yandere   ",
	"rating": "(3.9 / 5.0, 111 votes)",
	"author": "당신의5분   ",
	"year": "\n2021",
	"ranking": "#2642   #3190   #2477   #3235   #3491   ",
	"reviewcount": "18 Reviews sorted by",
	"description": "What does it mean to live when it’s so painful?\nA young boy thought about it for days and days, but he couldn’t think of an answer.\n\nTo him, every day was like a nightmare…\n\nUntil one day, when the answer came to him.\n\nBang–!\n[ Level has risen. ]\n\nThis is a story of a villain who hid his true colors and vowed to become a hero.>"
}