{
	"url": "https://www.novelupdates.com/series/takarakuji-de-40-oku-atattandakedo-isekai-ni-ijuu-suru/",
	"title": "Takarakuji de 40-oku Atattandakedo Isekai ni Ijuu Suru - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2015/06/takarakuji.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Drama   Fantasy   Mystery   Romance   Seinen   Slice of Life   ",
	"tags": "Adapted to Manga   Aristocracy   Army   Army Building   Beautiful Female Lead   Dense Protagonist   Depictions of Cruelty   Devoted Love Interests   Different Social Status   Domestic Affairs   Farming   Gate to Another World   God Protagonist   Gods   Helpful Protagonist   Hiding True Identity   Indecisive Protagonist   Industrialization   Interdimensional Travel   Kind Love Interests   Lottery   Love Rivals   Love Triangles   Magic Beasts   Maids   Male Protagonist   Management   Merchants   Mob Protagonist   Modern Day   Modern Knowledge   Multiple Transported Individuals   Mysterious Family Background   Mythical Beasts   Naive Protagonist   Nobles   Pacifist Protagonist   Parallel Worlds   Past Plays a Big Role   Persistent Love Interests   Politics   Popular Love Interests   Power Couple   Power Struggle   R-15   Schemes And Conspiracies   Secret Crush   Secret Identity   Shapeshifters   Slow Romance   Special Abilities   Strategic Battles   Strong Love Interests   Sudden Strength Gain   Sudden Wealth   Technological Gap   Transformation Ability   Transported Modern Structure   Transported to Another World   Unconditional Love   Unrequited Love   Wars   Weak Protagonist   Wealthy Characters   Werebeasts   Younger Love Interests   ",
	"rating": "(3.7 / 5.0, 306 votes)",
	"author": "Suzunoki Kuro   ",
	"year": "\n2010\n",
	"ranking": "#6970   #6224   #944   #4189   #418   ",
	"reviewcount": "26 Reviews sorted by",
	"description": "Kazura was selected as the winner on a lottery that he bought on a whim and received ¥4,000,000,000 (4 billion yen).\n\nTo evade the hyenas that smelled the scent of his money, Kazura took refuge on an old residence that had been handed down from generation to generation.\n\nWhen Kazura was investigating the place that would become his shelter, he stumbled on a certain room where it was possible to go into and back from another world.\n\nThe Culture and Technology level of that world was relatively low. The protagonist sometimes brought goods, sometimes brought technological knowledge.\n\nAt that world, he would find his true value as a person.\n\n——–\n\nMC has Zero survival instinct; happily tells people all his weaknesses and how to prevent him from escaping; does nothing to be able to defend himself or escaped and the author uses that to set up ridiculous situations where it goes wrong for him because of such nonesense;\n\n…\n\nbesides that it is very wholesome and quite good; but be aware this stuff happens\n\n——–>"
}