{
	"url": "https://www.novelupdates.com/series/dont-fall-in-love-with-the-boss/",
	"title": "Don’t Fall In Love With The Boss - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/05/LoveWithTheBoss2b.jpg",
	"noveltype": "(CN)",
	"genre": "Josei   Romance   School Life   ",
	"tags": "Adapted to Drama   Adapted to Manhua   Beautiful Female Lead   Businessmen   Cold Love Interests   College/University   Confident Protagonist   Dense Protagonist   Devoted Love Interests   Dishonest Protagonist   Female Protagonist   First-time Interc**rse   Handsome Male Lead   Lawyers   Love Interest Falls in Love First   Misunderstandings   Modern Day   Past Plays a Big Role   Popular Love Interests   Possessive Characters   Second Chance   Shameless Protagonist   Siblings   Slow Romance   Tsundere   Wishes   ",
	"rating": "(4.4 / 5.0, 409 votes)",
	"author": "Ye Fei Ran   叶斐然   ",
	"year": "\nN/A",
	"ranking": "#2510   #931   #1236   #1645   #1157   ",
	"reviewcount": "125 Reviews sorted by",
	"description": "Qian Wei’s last regret in her life was at the age of 19, when she offended Lu Xun, known as the “Light of the Law School”. She helped her brother Qian Chuan to pry at Lu Xun’s corner and robbed Mo Zixin from him. Who knew that Lu Xun would become her boss one day, and Qian Wei could only work like a cow or horse for atonement. But now God gave her the opportunity to return to the age of 19. Qian Wei said that she will help Lu Xun and ensure that he and Mo Zixin will be together. But … Why did she seem to offend Lu Xun more thoroughly? Help! She just wanted to help the future boss fall in love, not to fall in love with the future boss!\n\nQian Wei complained a lot about her boss: “Doesn’t Lu Xun have a private life? He works overtime all day, is he not afraid of developing kidney deficiency?”\n\nUntil one day, her boss called her to the office:\n\nLu Xun: Today, don’t work overtime. Come to my house.\n\nQian Wei: ???\n\nLu Xun smiled indifferently: A good boss should not let employees always have doubts. Tonight, I will show you personally that I don’t have kidney deficiency.>"
}