{
	"url": "https://www.novelupdates.com/series/butcher-demon/",
	"title": "Butcher Demon - Novel Updates",
	"image": "https://www.novelupdates.com/img/noimagefound.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adult   Ecchi   Fantasy   Harem   Horror   Mature   Seinen   Tragedy   ",
	"tags": "An*l   Amnesia   Antihero Protagonist   Assassins   Beastkin   Betrayal   Bisexual Protagonist   Brainwashing   Cannibalism   Conflicting Loyalties   Demi-Humans   Demons   Distrustful Protagonist   Elves   Female to Male   Firearms   F*llatio   Gate to Another World   Gore   Hiding True Abilities   Human Weapon   Language Barrier   Magic   Magical Technology   Male Protagonist   Manipulative Characters   M*sturbation   Military   Mind Break   Mind Control   Modern Day   Monsters   Multiple POV   Mute Character   Netorase   Non-humanoid Protagonist   Outdoor Interc**rse   Overpowered Protagonist   Past Trauma   Perverted Protagonist   Protagonist Strong from the Start   R-18   Race Change   R*pe Victim Becomes Lover   Revenge   R*pe   Secret Organizations   S*x S*aves   S*xual Abuse   S*aves   Special Abilities   Threesome   Torture   Tragic Past   Twisted Personality   Ugly Protagonist   Unreliable Narrator   ",
	"rating": "(3.9 / 5.0, 135 votes)",
	"author": "Akadashi Nameko   赤だし滑子   ",
	"year": "\n2020",
	"ranking": "#291   #413   #1450   #676   #3838   ",
	"reviewcount": "19 Reviews",
	"description": "There is an ugly beast that violates women in prison.\n\nA treacherous beast that is feared and called a “Butcher”.\n\nThat’s me.\n\nI was once a human but now I can’t even remember my own name.\n\nI can’t speak, and I don’t understand a word they say.\n\nIt is in this deep loneliness that I am pouring my essence into the women everyday.\n\nI pour my burning rage into them.\n\nOver and over again, until they conceive.\n\nFrom morning till night. Until the women’s souls withered.\n\nTo show them that I’m an excellent stallion and an obedient domestic animal.\n\nBut my soul has not perished yet.\n\nI will break free from this prison soon. And when I do, it will be your last.\n\nEvery human who betrayed me, every demon who altered me, I will trample down like an ant.\n\nAnd it won’t stop until I’m satisfied.\n\nThe dawn of the beast is near.>"
}