{
	"url": "https://www.novelupdates.com/series/fierce-chirpchirp/",
	"title": "Fierce chirp~chirp! - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/05/Fierce-chirpchirp.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Fantasy   Slice of Life   Yaoi   ",
	"tags": "Beasts   Cute Protagonist   Doting Older Siblings   Doting Parents   Dragons   Elves   Fated Lovers   Futuristic Setting   Non-humanoid Protagonist   System Administrator   Transmigration   ",
	"rating": "(4.1 / 5.0, 29 votes)",
	"author": "风入松鼠   ",
	"year": "\n2021",
	"ranking": "#4617   #6282   #7638   #6341   #7484   ",
	"reviewcount": "6 Reviews sorted by",
	"description": "In the interstellar era, a family of ferocious beasts, who had not had a cub in 100,000 years, got a golden egg from the oracle. It is said that it will crack a ferocious beast that has not been seen in many years!  Under the attention of the public, the eggshell cracked, and the next second a pair of small furry wings popped out, and the fat chirp on the eggshell and the family of villains stared at each other.\n\nQiu Qiu: QAQ tweet?\n\nThe big brother of the family hesitated: …a ferocious beast?\n\n#I have never seen something so outrageous in my life # The whole family are brutal carnivores, but the youngest son is herbivorous! ？  In this regard, everyone on Star Network: poor cub, it is probably weak.\n\nUntil the photos of the transformation period were accidentally exposed, the whole universe was crazy after seeing the young man who was held by a big family, holding a small dragon, and looking back shyly with lavender eyes!\n\nBoiling interstellar citizen: Woohoo, help! What ferocious beast? I hurried over to recognize my father-in-law! !  Regarding this, Qiu Qiu’s Dad V: Scram! Don’t be beaten by Lao Tzu, don’t even think about it! ！ Immediately hurrying back to Emperor Star to clean you up!\n\nWhile the whole internet was full of grief, there was a rare low laugh from the palace and the black dragon’s tail wrapped around the sleeping boy’s waist.>"
}