{
	"url": "https://www.novelupdates.com/series/talisman-emperor/",
	"title": "Talisman Emperor - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2015/09/tailsmanemperor.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Fantasy   Harem   Martial Arts   Mystery   Seinen   Xuanhuan   ",
	"tags": "Absent Parents   Arrogant Characters   Artifacts   Battle Competition   Beast Companions   Body Tempering   Broken Engagement   Caring Protagonist   Clan Building   Clones   Confident Protagonist   Cooking   Crafting   Cultivation   Dao Comprehension   Demons   Destiny   Determined Protagonist   Enemies Become Lovers   Handsome Male Lead   Hard-Working Protagonist   Hiding True Abilities   Immortals   Inheritance   Late Romance   Long Separations   Magic   Magical Space   Male Protagonist   Mysterious Family Background   Polygamy   R*pe Victim Becomes Lover   Revenge   Romantic Subplot   R*pe   Ruthless Protagonist   Siblings   Spirit Advisor   Strength-based Social Hierarchy   Sword Wielder   Time Skip   Transformation Ability   Underestimated Protagonist   Unique Cultivation Technique   Weak to Strong   World Travel   ",
	"rating": "(3.3 / 5.0, 376 votes)",
	"author": "Xiao Jinyu   萧瑾瑜   ",
	"year": "\n2008",
	"ranking": "#2000   #6157   #57   #2838   #833   ",
	"reviewcount": "70 Reviews sorted by",
	"description": "Chen Xi was a jinx who radiated misfortune the way a torch radiated light, and everyone around him knew it. His entire clan was annihilated when he was young, and not too long after that his parents disappeared. His marriage contract? Poof. Torn to shreds and gone up in smoke before the eyes of everyone in the city, almost humiliating his grandfather to the point of suicide! Cultivation? No time for that, he had a family to take care of!\n\nThis is the story of Chen Xi, a youth forced to stop cultivating and instead craft talismans to pay for his younger brother’s tuition… and who, in the process, would rise to become known by all as the Talisman Emperor!>"
}