{
	"url": "https://www.novelupdates.com/series/everyone-but-me-is-reborn/",
	"title": "Everyone But Me is Reborn - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/08/ebmir.png",
	"noveltype": "(CN)",
	"genre": "Comedy   Drama   Fantasy   Romance   Slice of Life   Tragedy   ",
	"tags": "Abusive Characters   Adultery   Ancient China   Aristocracy   Arrogant Characters   Beautiful Female Lead   Calm Protagonist   Cautious Protagonist   Character Growth   Charming Protagonist   Complex Family Relationships   Corruption   Cousins   Cute Protagonist   Cute Story   Engagement   Family   Female Protagonist   Handsome Male Lead   Hard-Working Protagonist   Heartwarming   Honest Protagonist   Jealousy   Love Interest Falls in Love First   Lovers Reunited   Loyal Subordinates   Manipulative Characters   Marriage   Mature Protagonist   Mismatched Couple   Misunderstandings   Multiple POV   Multiple Reincarnated Individuals   Obsessive Love   Past Plays a Big Role   Second Chance   Tragic Past   ",
	"rating": "(3.8 / 5.0, 84 votes)",
	"author": "Shi Sanshi   时三十   ",
	"year": "\n2018",
	"ranking": "#3923   #891   #2239   #3071   #3150   ",
	"reviewcount": "22 Reviews sorted by",
	"description": "Her father is a coward and senselessly filial. Her mother is weak and gullible. Her elder brother is a wastrel.\n\nWhen she married into the Wangfu, she suffered and was coldly treated. And by the time she was in labour, she was fated to die with the unborn child in her belly.\n\nThis was supposed to be Ning Nuan’s life.\n\nHowever this time, everyone but her is reborn.\n\nNing Nuan is at a loss. She felt that her dad has suddenly become the pillar of the family, her mother’s temper became fierce, and even her elder brother, who would only walk the dogs and play with birds all day, has begun picking up books and reading them carefully.\n\nThere is also that juvenile that shows up at the wall of her courtyard everyday, calling her “Ah Nuan, Ah Nuan” with an honest face.>"
}