{
	"url": "https://www.novelupdates.com/series/date-a-live/",
	"title": "Date A Live - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/11/Date-A-Live.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Comedy   Drama   Ecchi   Fantasy   Harem   Mecha   Romance   School Life   Sci-fi   Shounen   Supernatural   Tragedy   ",
	"tags": "Absent Parents   Adapted to Anime   Adapted to Game   Adapted to Manga   Adopted Children   Adopted Protagonist   Alternate World   Beautiful Female Lead   Brother Complex   Caring Protagonist   Cross-dressing   Determined Protagonist   Handsome Male Lead   Loli   Male Protagonist   Multiple Timelines   Past Plays a Big Role   R-15   Secret Organizations   Shy Characters   Siblings   Siblings Not Related by Blood   Special Abilities   Spirits   Stoic Characters   Strong Love Interests   Time Loop   Time Travel   Tsundere   Weak to Strong   Yandere   Younger Sisters   ",
	"rating": "(4.2 / 5.0, 107 votes)",
	"author": "Tachibana Koushi   橘 公司   ",
	"year": "\n2011\r\n",
	"ranking": "#2000   #2000   #6795   #11077   #3541   ",
	"reviewcount": "4 Reviews sorted by",
	"description": "April 10th. Yesterday was the last day of spring vacation, so starting this morning it was a school day. After being woken up by his cute little sister, Itsuka Shidou believed that it would be the start of another normal day. As for predicting the chance meeting with the girl who called herself a spirit......\r\n\r\nAlong with a sudden shockwave, the townscape vanished without a trace. In a corner of the street which had now become a crater, the girl was there.\r\n\r\n'?You, have you come to kill me too?'\r\n\r\nShe is the disaster that will destroy humanity, a monster of unknown origin, and a being rejected by the world. There are only two ways to stop this girl: annihilation, and conversation. His little sister Kotori, wrapped in a military uniform, thus said to Shidou: 'Since it's like this, just go date her, and make the spirit fall for you!' 'Wh.. whaaaaaaaat!?' Enter a new age of boy meets girl!!>"
}