{
	"url": "https://www.novelupdates.com/series/film-emperors-wedding-diary/",
	"title": "Film Emperor’s Wedding Diary - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/07/122406s.jpg",
	"noveltype": "(CN)",
	"genre": "Adult   Josei   Romance   Slice of Life   ",
	"tags": "Academy   Acting   Beautiful Female Lead   Caring Protagonist   Celebrities   Character Growth   Charming Protagonist   Doting Love Interests   Female Protagonist   Handsome Male Lead   Marriage   Modern Day   Older Love Interests   Showbiz   Slow Romance   Wealthy Characters   ",
	"rating": "(4.1 / 5.0, 42 votes)",
	"author": "Shi Liu Yue Xi Gua   十六月西瓜   ",
	"year": "\n2020",
	"ranking": "#6970   #2000   #5938   #8227   #5368   ",
	"reviewcount": "11 Reviews sorted by",
	"description": "The craziest thing Qiao Hui has ever done in her life was to marry Xu Yiyang, the righteous Film Emperor, at the age of 21.\n\nLife after marriage is plain and boring. Mr. Xu will kiss her good morning and good night every day and will report to her from time to time when going out for filming.\n\nBut even in the most intimate times, his kiss was gentle and restrained.\n\nQiao Hui shared her feelings to her friend, “He spoils me as if he is spoiling his daughter.” In the end, it was still a little bit worse.\n\nOn the day Xu Yiyang’s new drama hit, he and the drama’s female protagonists were in the midst of the scandal; and countless CP(Couple) fans rejoiced all night.\n\nQiao Hui sat cross-legged on the bed, and after considering it again and again; she asked for a separation.\n\nThat same night, Xu Yiyang risked the violent stormy weather and rushed back home from where he was filming. His body was soaked and his eyes were flushed with rain.\n\n“Why?”, shouted Xu Yiyang.\n\nThe girl was wearing pink bear pajamas and with a serious face said, “The gap between us is too wide No one will think we are as suitable as I think we are.”\n\nThe next day, a photo hit the hot search.\n\nIn the empty streets, [ the charming and self-assured Film Emperor embraced his newlywed wife and kissed her passionately.]>"
}