{
	"url": "https://www.novelupdates.com/series/a-heartwarming-decade/",
	"title": "A Heartwarming Decade - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/09/23930858-1_u_15-300x300.jpg",
	"noveltype": "(CN)",
	"genre": "Josei   Romance   School Life   ",
	"tags": "Abandoned Children   Adapted to Drama   Adapted to Movie   Family   Modern Day   ",
	"rating": "(3.8 / 5.0, 4 votes)",
	"author": "Shu Hai Cang Sheng   书海沧生   ",
	"year": "\n2011",
	"ranking": "#2000   #2000   #13047   #11528   #11933   ",
	"reviewcount": "No Reviews",
	"description": "Years later, the grandchildren gathered around their grandmother in front of the fireplace, listening to her telling a story during winter time.\n\nWen Heng smilingly, told a story that spanned a decade. Well kids, to start it off, this is just a story.\n\nIn the first year, from a crow in the southern small town, she became a glittering phoenix. She came across a pair of man and woman kissing. The male looked rather delicious, my heart delighted.\n\nIn the second year, sick with a strange disease. She took the opportunity to occupy the magpie’s nest, hanging around his home.\n\nIn the third year, the adulterous husband flew back from Vienna. All was lost so quickly fled.\n\nIn the fourth year,  under her father’s arrangement, she became the child bride of another family, she almost forgot about him.\n\nIn the fifth year, the prospective fiance did not like her so ran away with another woman. She was gratified by others’ trouble.\n\nIn the sixth year, have no impression.\n\nIn the seventh year, a pair of  adulterous couple, damn it.  Continue to have no impression!\n\nIn the eighth year, she went abroad to study, she completely broke off relations with the family for another man.\n\nIn the ninth year, she was forced to marry and have children with him.\n\nIn the tenth year, a child was born. Because of an embarrassing incident, the family of three was deported.\n\nYan Xi protested and pointed his trembling fingers. Wifey, you have been telling lies as the story is actually like this.\n\nIn the first year, the pork ribs she made taste very good, very delicious to eat.\n\nIn the second year, because of illness, have no impression.\n\nIn the third year, he went abroad on vacation, she was expelled from Wen family.\n\nIn the fourth year, she was missing for a whole year. He was angry with her, so do not want to go and look meant do not want to search.\n\nIn the fifth year, he was hiding in the corner, following her for a whole year.\n\nIn the sixth year, the man she cared most in her whole life made an appearance.\n\nIn the seventh year, have no impression.\n\nIn the eighth year, he had a car accident, she was out of the country.\n\nIn the ninth year, he chased all the way to France.  He carried her and walked on the snowy ground for the whole winter.\n\nIn the tenth year, the number one rival was born, so returned home.\n\nWifey, this is the complete and true story, did you know?\n\nThis is their story, a kind of love in their light fleeting years. Who is right, who is wrong is just one chuckle. Ten years passed like the smoke, woke up from your dream and rubbed your eyes. Those youthful years, such a heartwarming decade.>"
}