{
	"url": "https://www.novelupdates.com/series/reborn-to-love-lord-qiansui/",
	"title": "Reborn to Love Lord Qiansui - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/07/qiansui1.jpg",
	"noveltype": "(CN)",
	"genre": "Fantasy   Historical   Mature   Romance   ",
	"tags": "Adapted to Drama   Ancient China   Androgynous Characters   Charming Protagonist   Cold Protagonist   Couple Growth   Court Official   Cross-dressing   Cunning Protagonist   Devoted Love Interests   Doting Love Interests   Early Romance   Eunuch   Female Protagonist   Female to Male   Generals   Inferiority Complex   Jealousy   Loyal Subordinates   Male Protagonist   Male Yandere   Military   Multiple Identities   Obsessive Love   Older Love Interests   Politics   Possessive Characters   Power Couple   Protagonist Strong from the Start   Reincarnation   Royalty   Ruthless Protagonist   Schemes And Conspiracies   Second Chance   Smart Couple   Wars   ",
	"rating": "(4.3 / 5.0, 180 votes)",
	"author": "Jun Xiao   君骁   ",
	"year": "\n2017",
	"ranking": "#4265   #4775   #1902   #884   #1610   ",
	"reviewcount": "56 Reviews sorted by",
	"description": "If there was any identical and pure coincidence.\n\nHe is Lord Jiu Qiansui (nine thousand year) who everyone loathed. He is vicious, merciless, cruel and savage. Receiving flattery and take unfair advantage, causing calamity and chaos beyond the scope of syllabus. The emperor doted on him and trusted him, the consorts tried to gain his favor, the crown prince vowed to get rid of him and the officials wished that they could devour his bones and eat his flesh.\n\nThe crafty wanted to get into his favor.\n\nThe honorable wanted to kill him.\n\nThe commoners looked down upon him.\n\nHe is the rebel and traitor that everyone wanted dead.\n\nAnd such a him got a love that he wouldn’t even dare to think about. That cold fragrance had always stood by his side and vaguely always surrounded him. She was like an antidote that seemed to carry poison, making him crazy.\n\nIf you don’t abandon me, then I will give up everything for you to have a life of no worries!\n\nWhen Zhao Zimu pulled Ling Qing’s first white hair, his lips were in a thin line and asked displeased, “Do you abhor me now?”\n\nZhao Zimu touched his forehead with her lips and laughed, “How would I dislike you? You are the one I want to grow old with. Now, you are just one step ahead of me.”\n\nEven through rain of blood and forest of daggers, I will stay by your side in this life, looking at how the flowers bloom and wither and how winter becomes spring.>"
}