{
	"url": "https://www.novelupdates.com/series/ang-ang/",
	"title": "Ang Ang - Novel Updates",
	"image": "https://www.novelupdates.com/img/noimagefound.jpg",
	"noveltype": "(KR)",
	"genre": "Adult   Mature   Romance   Smut   Yaoi   ",
	"tags": "Adapted to Manhwa   BDSM   Bodyguards   Boss-Subordinate Relationship   Calm Protagonist   Caring Protagonist   Devoted Love Interests   Early Romance   First Love   First-time Interc**rse   F*llatio   Honest Protagonist   Love at First Sight   Male Yandere   Masochistic Characters   Mercenaries   Obsessive Love   Polite Protagonist   Possessive Characters   R-18   Sadistic Characters   Selfless Protagonist   Younger Love Interests   ",
	"rating": "(3.9 / 5.0, 37 votes)",
	"author": "Gwendolyn   그웬돌린   ",
	"year": "\n2019",
	"ranking": "#2000   #2000   #5943   #4831   #5842   ",
	"reviewcount": "5 Reviews sorted by",
	"description": "“Nice to meet you, I’m Yoon Hwayoung.”\n\nThe man, more beautiful than a woman, smiled like a flower. Gyuwon, his bodyguard, flushed up to his ears with his head bowed. Nearly two meters tall, lean muscles, bronze skin, tall nose, pronounced cupid’s bow, thick eyebrows, and narrow eyes… This shy man’s appearance was too hideous despite being a bodyguard. Born with an athletic physique and senses, he made a living as a mercenary, but stopped because had such a complex that he planned on getting plastic surgery. \n\nCompared to him, Hwayoung was beautiful. With an amazingly beautiful face, fantastic body, and a well-paid job, he was the third son of the Yoon Group, a nationwide gang syndicate. He was being stalked for his exquisite charm. The Yoon Group hires Gyuwon to protect their beloved, youngest family member and reluctantly welcomes him, but Hwayoung’s eyes immediately shone. To Hwayoung who wanted to raise a big, strong, pretty cat, Gyuwon was the ideal man he had been looking for.\n\nOne day, he followed Hwayoung into a gay, exclusive SM club, “DUNGEON,” while guarding him.\n\n“Do you know what I’m best at? Recognizing masochists. Must be instinctual.”\n\nHwayoung looked at Gyuwon with a kind but cruel smile. Seeing at a glance that Gyuwon was an SMer with an inclination for being a gay sub, Hwayoung suggested that they be play partners… Gyuwon realized that the ideal type he’d always wanted was right in front of him, and felt that he would unconditionally obey Hwayoung. He weakly resisted, but when Hwayoung’s hand touched him, a groan escaped his throat.\n\n“Your crying voice is really lovely, Gyuwon.”\n\nGyuwon’s back felt sweetly numb. The oncoming pain from was just a prelude to sweet pleasure.>"
}