{
	"url": "https://www.novelupdates.com/series/nights-nomenclature/",
	"title": "Night’s Nomenclature - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/06/Nights-Nomenclature.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Comedy   Martial Arts   Mystery   Sci-fi   Tragedy   Xuanhuan   ",
	"tags": "Absent Parents   Adapted to Manhua   Arranged Marriage   Artifacts   Artificial Intelligence   Betrayal   Calm Protagonist   Cautious Protagonist   Clan Building   Clever Protagonist   Cold Protagonist   Complex Family Relationships   Cultivation   Eidetic Memory   Enemies Become Allies   Evil Organizations   Fantasy World   Firearms   Friendship   Genius Protagonist   Gods   Interdimensional Travel   Leadership   Love Interest Falls in Love First   Loyal Subordinates   Lucky Protagonist   Magical Technology   Male Protagonist   Master-Disciple Relationship   Multiple Transported Individuals   Mysterious Family Background   Mysterious Past   Nationalism   Parallel Worlds   Post-apocalyptic   Prison   Racism   Ruthless Protagonist   Secret Identity   Secret Organizations   Secretive Protagonist   Slow Romance   Student-Teacher Relationship   Technological Gap   Time Paradox   Time Travel   Torture   Transported to Another World   Unique Cultivation Technique   Weak to Strong   ",
	"rating": "(4.7 / 5.0, 72 votes)",
	"author": "The Speaking Pork Trotter   会说话的肘子   ",
	"year": "\n2021",
	"ranking": "#763   #1435   #4163   #2536   #5685   ",
	"reviewcount": "14 Reviews sorted by",
	"description": "In the midst of the blue and purple neon lights, under the gray, metallic sky, it is the frontier of all data, the aftermath of a scientific revolution, also the border of fiction and reality.   \n\nSteel versus body; the past and the future.   \n\nHere, the Outer World and the Inner World exist alongside each other. It seems like the wall of time is right in front of your eyes.   \n\nDarkness gradually swallows the world.   \n\nBut listen, my friend, we cannot use kindness to survive the darkness. We need fire.>"
}