{
	"url": "https://www.novelupdates.com/series/mistakenly-saving-the-villain/",
	"title": "Mistakenly Saving the Villain - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/05/Mistakenly-Saving-the-Villain.jpeg",
	"noveltype": "(CN)",
	"genre": "Drama   Mature   Psychological   Romance   Shounen Ai   Xianxia   Yaoi   ",
	"tags": "Amnesia   Ancient Times   Appearance Different from Actual Age   Black Belly   Calm Protagonist   Caring Protagonist   Child Abuse   Comedic Undertone   Cultivation   Cute Protagonist   Dense Protagonist   Devoted Love Interests   Doctors   Doting Love Interests   Fated Lovers   God Protagonist   Gods   Handsome Male Lead   Heavenly Tribulation   Love Interest Falls in Love First   Love Triangles   Lovers Reunited   Male Yandere   Master-Disciple Relationship   Medical Knowledge   Misunderstandings   Multiple POV   Naive Protagonist   Past Plays a Big Role   Past Trauma   Possessive Characters   Prostit**es   Protagonist Strong from the Start   Reincarnation   Revenge   R*pe   S*x S*aves   S*xual Abuse   Stubborn Protagonist   Suicides   System Administrator   Tragic Past   Transmigration   Unconditional Love   Yandere   Younger Love Interests   ",
	"rating": "(4.7 / 5.0, 674 votes)",
	"author": "Feng Yu Nie   凤羽涅   ",
	"year": "\n2020",
	"ranking": "#542   #576   #889   #224   #421   ",
	"reviewcount": "178 Reviews sorted by",
	"description": "Professor System has issued a mission: to rescue the gentle, kind and tragic protagonist shou of the novel “The Exceptional Furnace”.\n\nSong ‘Scholar-Tyrant’ Qingshi: “Don’t worry, Professor! I can definitely ensure the patient’s recovery!”\n\nIn the Immortal Realm:\n\nSong Qingshi praised from the bottom of his heart: “My patient is the kindest and most beautiful little angel in the world.”\n\nYue Wuhuan quietly washed the blood from his hands and smiled softly: “En.”\n\nSong Qingshi swore from the bottom of his heart: “As a doctor, I will never covet nor take advantage of my beautiful patient!”\n\nYue Wuhuan took full and complete advantage of the doctor and smiled softly: “En.”\n\nSong Qingshi affirmed from the bottom of his heart: “Under my loving care, the patient will never be blackened!”\n\nYue Wuhuan secretly hid his monstrously evil thoughts and smiled softly: “En.”\n\nAt that inextinguishable summit, upon thousand and thousands of soul lamps, he sat on the god’s throne of white bone, guarding that piece of stone.\n\n“You are the only one in this world who treats me tenderly.”\n\n“And so, you are the only one I treat tenderly.”\n\nScholar-tyrant Song was absolutely delighted: “Professor! Can I get full marks?”\n\nProfessor System exploded: “You fool! You saved the wrong person!”>"
}