{
	"url": "https://www.novelupdates.com/series/the-villain-just-wants-to-be-a-salted-fish/",
	"title": "The Villain Just Wants to be a Salted Fish - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/09/The-Villain-Just-Wants-to-be-a-Salted-Fish.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Romance   Shounen Ai   ",
	"tags": "Acting   Calm Protagonist   Charismatic Protagonist   Clingy Lover   Complex Family Relationships   Dense Protagonist   Doting Love Interests   Doting Parents   First Love   First-time Interc**rse   Kind Love Interests   Lazy Protagonist   Love Interest Falls in Love First   Love Triangles   Manly Gay Couple   Misunderstandings   Modern Day   Movies   Older Love Interests   Popular Love Interests   Previous Life Talent   Protagonist Strong from the Start   Showbiz   Slow Romance   Smart Couple   Transmigration   Tsundere   Unrequited Love   Wealthy Characters   ",
	"rating": "(3.9 / 5.0, 187 votes)",
	"author": "夕朝南歌   ",
	"year": "\n2020",
	"ranking": "#2425   #1774   #1866   #767   #1888   ",
	"reviewcount": "57 Reviews sorted by",
	"description": "Ye Zexi transmigrated as the big villain in a danmei novel, who shares the same name as him. Then, he found out that everyone regards him as an imaginary enemy.\r\n\r\nIn this regard, he adheres to only one principle: Don’t want to fight, take everything you want.\r\n\r\nIn the boy group’s audition show:\r\nThe team member wanted to take the C [Center] position from Ye Zexi.\r\nYe Zexi took the initiative to withdraw for the sake of being lazy.\r\nThe team member was complacent and thought that Ye Zexi had stage fright and the team member was determined to win.\r\nAfter the performance, Ye Zexi took first place.\r\nTeam member: ?\r\n\r\nThe instructor asked everyone about their purpose to join the competition.\r\nOther contestants: Dreams, because we love the stage!\r\nYe Zexi: In order to go home and inherit the family property.\r\nOther contestants: ???\r\n\r\nUnexpectedly, not only did Ye Zexi fail to be lazy, he also became more popular.>"
}