{
	"url": "https://www.novelupdates.com/series/todays-dinner-is-the-hero/",
	"title": "Today’s Dinner is the Hero - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/04/Today’s-Dinner-is-the-Hero.jpg",
	"noveltype": "(JP)",
	"genre": "Comedy   Fantasy   Mature   Romance   Slice of Life   Yaoi   ",
	"tags": "Cute Story   Demon Lord   Demons   Devoted Love Interests   Doting Love Interests   Fantasy World   First-time Interc**rse   Handsome Male Lead   Hard-Working Protagonist   Heroes   H*ndjob   Magic   Misunderstandings   Naive Protagonist   Possessive Characters   R-18   Strong Love Interests   Summoned Hero   Transported to Another World   Tsundere   ",
	"rating": "(4.2 / 5.0, 54 votes)",
	"author": "Kigashi   木樫   ",
	"year": "\n2019",
	"ranking": "#6970   #4691   #3471   #10271   #3588   ",
	"reviewcount": "6 Reviews sorted by",
	"description": "A pure-hearted, doting tsundere Demon Lord ✕ a straightforward, oblivious airheaded Hero! A story about the hero being kept as livestock for sucking blood when he was defeated by the Demon Lord.\n\nShouryuu, a hero tired of his day-to-day life of working without getting paid after being forcibly summoned, was driven out of the castle to kill the demon lord. He marched alone into the demon lord’s castle in the demon realm out of desperation, but was easily defeated.\n\nHe, who had prepared himself for death, wakes up confined in an iron cage on top of an excessively luxurious bed.\n\n“You can’t put an injured person inside a cage, y’know?! It’s my fault for accidentally turning into my final form anyway…!”\n\n“That won’t do, my lord! That hero is a dangerous berserker who hunts demons! What would you do if you were bitten!”\n\n“H-he bites?!”\n\nThis is a story about an awkward, human-like tsundere demon lord who keeps an unfortunate, hardworking, corporate s*ave hero who has been sentenced by those who exploited him (in the human realm) as livestock for his blood, and tries his best to get along with him.>"
}