{
	"url": "https://www.novelupdates.com/series/the-rich-and-vicious-male-supporting-character-is-tearing-up-the-script/",
	"title": "The Rich and Vicious Male Supporting Character is Tearing up the Script - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/06/The-Rich-and-Vicious-Male-Supporting-Character-is-Tearing-up-the-Script.jpg",
	"noveltype": "(CN)",
	"genre": "Drama   Fantasy   Romance   Shounen Ai   Yaoi   ",
	"tags": "Businessmen   Charismatic Protagonist   Charming Protagonist   Clumsy Love Interests   Cold Protagonist   Complex Family Relationships   Doting Older Siblings   Family Business   Genius Protagonist   Hackers   Love Interest Falls in Love First   Modern Day   Multiple Reincarnated Individuals   Power Couple   Reincarnation   Revenge   Schemes And Conspiracies   Second Chance   Showbiz   Slow Romance   Weak to Strong   Wealthy Characters   ",
	"rating": "(3.5 / 5.0, 79 votes)",
	"author": "水仙乘鲤   ",
	"year": "\n2020",
	"ranking": "#4617   #6329   #3683   #8229   #4134   ",
	"reviewcount": "20 Reviews sorted by",
	"description": "After Ruan Qingyuan died, he discovered that he was one of the many evil supporting characters in a novel about a filthy rich sugar baby.\r\n\r\nIn this novel, the protagonist that everyone pampered was his father’s illegitimate child Bai Yunshu.\r\n\r\nBai Yunshu, the delicate, pitiful, beautiful and naive male lead and shou, naturally came with a mesmerizing aura that could charm thousands.\r\n\r\nRuan Qingyuan’s boyfriend was madly in love with him; The triad member couldn’t help but fall in love with him; the senior president of the pharmaceutical company was so in love with him that he was willing to humble himself\r\n\r\nWherever Bai Yunshu went, he easily could find a crowd of admirers.\r\n\r\nOnly Ruan Qingyuan opposed him in all matters, trying to sabotage him and  drive him out of the house. In the end, his dad and boyfriend worked together to send him to prison.\r\n\r\nAfter his rebirth, Ruan Qingyuan breezily handed over a DNA test report to his heartless trashy father,. “Sorry, my dad’s dead.”\r\n\r\nFaced with his boyfriend’s cheating, Ruan Qingyuan only had this to say: This shitty guy and this bitch can stay together forever, just lock them up together.\r\n\r\nDumped by his boyfriend and thrown out by his family, Ruan Qingyuan became the abandoned child that everyone gossiped about. After that—\r\n\r\nRuan Qingyuan held the DNA test report and walked into the richest family in the area.\r\n\r\nCrazy rich older brother: “Ah my cute little brother, welcome home!”\r\n\r\nEccentric scientist older brother: My baby brother, why are you so thin!? The Ruan Family must have bullied you!!\r\n\r\nBad-tempered little brother: Who dares to harm my older brother, I’ll have your heads!!!\r\n\r\nRuan Qingyuan smiled faintly.The future is unpredictable indeed. “No need to bother with the Ruan family, let me handle them.”>"
}