{
	"url": "https://www.novelupdates.com/series/pampered-poisonous-royal-wife/",
	"title": "Pampered Poisonous Royal Wife - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/09/Pampered-Poisonous-Royal-Wife.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Drama   Fantasy   Martial Arts   Mystery   Romance   ",
	"tags": "Adapted to Manhua   Ancient China   Beautiful Female Lead   Business Management   Calm Protagonist   Clever Protagonist   Cold Love Interests   Complex Family Relationships   Determined Protagonist   Doting Parents   Economics   Familial Love   Female Protagonist   Handsome Male Lead   Hiding True Identity   Kuudere   Love Interest Falls in Love First   Loyal Subordinates   Male Yandere   Marriage   Medical Knowledge   Mystery Solving   Nobles   Obsessive Love   Older Love Interests   Parent Complex   Poisons   Politics   Poor to Rich   Possessive Characters   Power Struggle   Pregnancy   Rebellion   Reincarnation   Revenge   Royalty   Schemes And Conspiracies   Second Chance   Secret Identity   Single Parent   Slow Romance   ",
	"rating": "(4.3 / 5.0, 143 votes)",
	"author": "Yān Yǔ Fāng   烟雨芳汀   ",
	"year": "\n2017",
	"ranking": "#2566   #3139   #701   #4826   #827   ",
	"reviewcount": "29 Reviews sorted by",
	"description": "The Capital’s girls look on with hatred, “You’re just a country girl without any knowledge. Do you have Niyun Shop’s clothes? Do you have Brilliant Treasure Pavillion’s jewellery? Do you even know how eminent and domineering the famous Yue Wang is?'\n\nMu Yunyao looked at them lazily, “Niyun Shop? I opened it. Brilliant Treasure Pavillion? I opened it. As for Yue Wang…when are you returning my silver?”\n\nYue Wang’s face was cold: “I will pay with my body.”\n\n(Wang means Prince. In this case, “Yue Wang” was a title given by the Emperor to his son.)\n\nAfter being reincarnated, Mu Yunyao believes in three things: One, do not have good intentions towards others. Two, do not let the enemy have the chance to rise again. Three, do not believe in feelings. Thus, she is merciless. She is fearless. She would rather have everything destroyed than to compromise for everything. \n\nHowever, after one fateful meeting, a cold-blooded prince keeps following her, silently plotting on making her his wife and bringing her back to pamper her…>"
}