{
	"url": "https://www.novelupdates.com/series/ill-make-it-a-bad-ending-like-a-villain/",
	"title": "I’ll Make It a Bad Ending Like a Villain - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/08/Ill-Make-It-a-Bad-Ending-Like-a-Villain.jpg",
	"noveltype": "(KR)",
	"genre": "Drama   Fantasy   Mystery   Romance   ",
	"tags": "Aristocracy   Arrogant Characters   Beautiful Female Lead   Calm Protagonist   Cautious Protagonist   Charming Protagonist   Cold Protagonist   Death of Loved Ones   Determined Protagonist   European Ambience   Female Protagonist   Hard-Working Protagonist   Magic   Nobles   Politics   Power Struggle   Proactive Protagonist   Royalty   Schemes And Conspiracies   Second Chance   Selfish Protagonist   Sword And Magic   Sword Wielder   Tragic Past   Transmigration   Tsundere   Underestimated Protagonist   Villainess Noble Girls   ",
	"rating": "(3.7 / 5.0, 52 votes)",
	"author": "세엘리   ",
	"year": "\n2021",
	"ranking": "#6970   #4856   #4260   #4930   #4567   ",
	"reviewcount": "12 Reviews sorted by",
	"description": "'Please send me to that swordsmanship academy.'\r\n\r\nThe air around them quieted for a moment at the sound of Filina's voice.\r\n\r\nLaura, who was standing beside her, looked at Filina with an astonished face.\r\n\r\nGabriel stared at her with a stern expression, and then quickly gave a twisted laugh.\r\n\r\n'So you're finally going crazy.”\r\n\r\nFilina, who raised the corner of her lips slightly as if she knew he would say that, whispered calmly.\r\n\r\n'Father, I'm serious.'\r\n\r\n***\r\n\r\n[Cecilia's Flower]\r\n\r\nI had transmigrated into an R19 harem novel and possessed a villain.\r\n\r\nFilina Debussy, who chose to do evil deeds and ended up being executed...\r\n\r\nI managed to escape death, but before I knew it, I had already faced four deaths and was repeating my fifth life.\r\n\r\nSo I decided to make a different choice this time.\r\n\r\n“I’ve been running away to avoid death, let's face it proudly this time.”\r\n\r\nOne way or the other, I was going to live a life of my own, no matter what.\r\n\r\nI certainly was, but….\r\n\r\nThe Crown Prince, who had been showing a cold stare and a cold reaction, became impatient.\r\n\r\nThe mastermind who hid his painful past gave me a mysterious look.\r\n\r\nAnd the timid heroine somehow started to cling to her relationship with me...\r\n\r\nTired of repeating my life, I just want to change the ending of death.\r\n\r\nEven if it ends up killing people.>"
}