{
	"url": "https://www.novelupdates.com/series/president-this-is-really-a-misunderstanding/",
	"title": "President, This Is Really a Misunderstanding! - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/12/President-This-Is-Really-a-Misunderstanding.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Fantasy   Harem   Mystery   ",
	"tags": "Absent Parents   Appearance Changes   Beautiful Female Lead   Business Management   Calm Protagonist   Charismatic Protagonist   Clever Protagonist   Cold Love Interests   Confident Protagonist   Dense Protagonist   Emotionally Weak Protagonist   First-time Interc**rse   Genius Protagonist   Handsome Male Lead   Hard-Working Protagonist   Jack of All Trades   Male Protagonist   Modern Day   Polygamy   System Administrator   Wealthy Characters   ",
	"rating": "(3.3 / 5.0, 49 votes)",
	"author": "贝贝贝   ",
	"year": "\n2020",
	"ranking": "#6970   #6285   #4915   #3029   #8472   ",
	"reviewcount": "7 Reviews sorted by",
	"description": "The goddess president came for an inspection. Zhou Xuan hurried to the company for a meeting. But because he got up late, he had to eat breakfast in a hurry to make it to the company meeting.\r\n\r\nAs a result, there was a grain of rice on the corner of his mouth. At the meeting, the goddess president pointed to the corner of her mouth after seeing it, suggesting that Zhou Xuan had rice in there.\r\n\r\nZhou Xuan was stunned, thinking that the goddess president would like him to kiss her. He was a little hesitant and shy.\r\n\r\nBut the female president still pointed to the corner her mouth, hinting at Zhou Xuan again.\r\n\r\n'Okay! President, since you are so aggressive, then I...'\r\n\r\nZhou Xuan got up and kissed the goddess president in front of everyone who eventually were shocked at such scene.\r\n\r\nSuddenly, the entire conference room was silent!\r\n\r\nAfter the meeting, Zhou Xuan learned that he was going to be terminated, and was immediately puzzled.\r\n\r\nPresident! This is a misunderstanding!\r\n……..\r\n……..\r\n\r\nZhou Xuan expressed his disagreement to be fired just because of such incident.\r\n\r\nIf only I could have a system like in the novels.\r\n\r\nI will not be so powerless. I am so displeased.\r\n\r\n'Ding! The host has been detected. The Unlimited Acquisition System has been activated!'\r\n\r\n'Ding! You glanced at the contract and gained basic legal knowledge.'\r\n\r\n'Ding! You took a step and gained 0.01 agility!'\r\n\r\n'Ding! You talked with people and got 0.1 eloquence!'>"
}