{
	"url": "https://www.novelupdates.com/series/breakthrough-with-the-forbidden-master/",
	"title": "Breakthrough with the Forbidden Master - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/11/81xk8lduvjl._ac_sl1500_.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Comedy   Drama   Fantasy   Harem   Martial Arts   Romance   School Life   Shounen   ",
	"tags": "Accelerated Growth   Adapted to Manga   Antihero Protagonist   Battle Competition   Beastkin   Breast Fetish   Character Growth   Childhood Friends   Childhood Love   Demi-Humans   Demon Lord   Demons   Dense Protagonist   Elves   Famous Parents   Ghosts   Hard-Working Protagonist   Heroes   Human-Nonhuman Relationship   Inferiority Complex   Kind Love Interests   Love Interest Falls in Love First   Love Rivals   Magic   Magic Beasts   Maids   Male Protagonist   Master-Disciple Relationship   Misunderstandings   Multiple POV   Ninjas   Obsessive Love   Older Love Interests   Perverted Protagonist   Possession   R-15   Royalty   Sharp-tongued Characters   Siblings Not Related by Blood   Spirit Advisor   Spirits   Strong Love Interests   Strong to Stronger   Sword And Magic   Tsundere   Underestimated Protagonist   Yandere   Younger Love Interests   ",
	"rating": "(4.0 / 5.0, 339 votes)",
	"author": "Anikki Burazza   アニッキーブラッザー   ",
	"year": "\n2019",
	"ranking": "#331   #244   #440   #357   #521   ",
	"reviewcount": "63 Reviews",
	"description": "“Compared to our time, the current generation just aren’t as reliable” they said, “Still, isn’t he the son of the Hero?” How annoying.\n\nIt’s been over ten years since the battle between mankind and the demons ended. The children of the heroes who saved the world are all grown up.\n\nOne of them, Earth, was a talented man, and everyone expected him to succeed his father as a warrior and defend his country, but Earth was always wary of his father’s title.\n\nOne day, Earth is shocked to find his father’s sword, which was used to overthrow the Demon King, sealed in his family’s mansion.\n\nBecause trapped within was the ghost of the Great Demon King who was unable to pass on and continued to roam the world.\n\nFor some reason, only he could see the spirit of the Demon King, and the Demon King possessed him through the sword.\n\nEvery day, forced to coexist with the spirit of the Demon King, they live a strange shared life, when the Demon King whispers to Earth on a whim.\n\n“I have a grudge against your father. If you want to get back at your father and the world, I’ll train you. I’m free.”\n\nEarth receives special personal guidance from the Demon King just to get back at his parents and the world.\n\nThen, in the coming days. The hero’s parents, the heroes of the past, the first love, the princess childhood friend, the geniuses of the era, and the world will tremble.>"
}