{
	"url": "https://www.novelupdates.com/series/god-emperor/",
	"title": "God Emperor - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2017/07/eternalgodemperor.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Fantasy   Harem   Martial Arts   Xuanhuan   ",
	"tags": "Academy   Adapted to Manhua   Artifacts   Beast Companions   Beautiful Female Lead   Betrayal   Bloodlines   Body Tempering   Calm Protagonist   Crafting   Cultivation   Dense Protagonist   Enemies Become Allies   Gods   Hard-Working Protagonist   Immortals   Loli   Magic   Magic Formations   Magical Space   Male Protagonist   Martial Spirits   Politics   Polygamy   Revenge   Spatial Manipulation   Time Manipulation   Transmigration   Wars   Weak to Strong   ",
	"rating": "(2.8 / 5.0, 121 votes)",
	"author": "Flying Fish   飞天鱼   ",
	"year": "\n2015",
	"ranking": "#2000   #2000   #2694   #7720   #5613   ",
	"reviewcount": "29 Reviews sorted by",
	"description": "Zhang Ruo Chen was the sole male heir of one of the nine emperors of the Kunlun Field. Ruo Chen’s father was known to all as the “Enlightened Emperor”, however Ruo Chen didn’t just leech off his status as emperor’s son. He proved himself to be a dragon amongst men, possessing a heaven defying body, and managing to cultivate to Greater Perfection within the Yellow Horizon Realm, at just the young age of 16.\r\n\r\nBut even though he stood at the summit of the younger generation and had a boundless future, he sadly died at the treacherous hands of his own fiancee at a young age.\r\n\r\nReincarnated 800 years later in the body of a young boy who shares his name, he found out his former fiancee already unified Kunlun’s Field and built the First Central Empire, and was now known as Empress Chi Yao… Empress Chi Yao—Her Majesty governed the mortal world and enjoyed prestige in all directions as well as an eternal life.\r\n\r\nZhang Ruochen stood outside of the Imperial Ancestral Temple, looking at the statue of Empress Chi Yao, and the flames of hatred burned in his heart. “After I practice for 13 years, I shall send the empress to her doom!”>"
}