{
	"url": "https://www.novelupdates.com/series/haunted-houses-chronicles/",
	"title": "Haunted Houses’ Chronicles - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/04/Haunted-Houses-Chronicles-translation.jpg",
	"noveltype": "(CN)",
	"genre": "Adventure   Comedy   Drama   Horror   Mystery   Supernatural   ",
	"tags": "Adapted to Drama   Adapted to Manhua   Brotherhood   Exorcism   Feng Shui   Friendship   Ghosts   Hiding True Identity   Male Protagonist   Mysterious Past   Mystery Solving   Mythology   Naive Protagonist   Near-Death Experience   Secrets   Souls   Spirits   Teamwork   Thriller   ",
	"rating": "(4.0 / 5.0, 13 votes)",
	"author": "Er Shi San   贰十三   ",
	"year": "\n2012",
	"ranking": "#2000   #2000   #10391   #11528   #10537   ",
	"reviewcount": "3 Reviews sorted by",
	"description": "A “xiongzhai”, or “haunted house” in English context, is a house where someone dies an unexpected death. Legend has it that if a person dies in such a manner, they would be resentful because their destined lifespan has not yet finished. Their ghosts will then linger around, causing ‘unnatural’ things to occur in the place.\n\nJiang Shuo and Qin Yiheng are a peculiar duo of real estate investors who purchase well-known haunted houses at low prices. After exorcising the ghosts and evil spirits, they sell the houses again, each time earning great profits. Their ‘business’ is doing exceptionally well! \n\nHowever, the lucky duo never expect that they are being followed by some strange people. Surrounding them, a big conspiracy is quietly being harboured. The mysterious real estate collaborator Six Fingers and the ‘non-human’ partner Yuan Zhen comes one after another; many extremely dangerous haunted houses keep appearing. Things become increasingly difficult to handle, sometimes even bring them to the verge of death. At this point, they realise  they are trapped in a deadly net!\n\nIn the end, what conspiracy is hidden there? Is it true that those haunted houses’ ghosts and feng shui¹ want them dead? Who is the Mysterious Figure behind all this?\n\n¹ 风水 [Feng Shui], also known as Chinese geomancy, is a practice originating from ancient China which claims to use energy forces to harmonise individuals with their surrounding environment. Believed to be a pseudo-science and still widely used in many East Asian countries today, feng shui’s most common application is to orient homes and buildings in an auspicious manner.>"
}