{
	"url": "https://www.novelupdates.com/series/the-legend-of-the-dragon-king/",
	"title": "The Legend of the Dragon King - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2018/06/The-Legend-of-the-Dragon-King-.png",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Comedy   Martial Arts   Mecha   School Life   Sci-fi   Tragedy   Xuanhuan   ",
	"tags": "Adapted to Manhua   Age Progression   Battle Academy   Beasts   Beautiful Female Lead   Blacksmith   Bloodlines   Caring Protagonist   Cultivation   Death   Death of Loved Ones   Devoted Love Interests   Dragons   Evil Organizations   First-time Interc**rse   Friends Become Enemies   Gods   Half-human Protagonist   Handsome Male Lead   Hard-Working Protagonist   Magical Technology   Male Protagonist   Martial Spirits   Misunderstandings   Money Grubber   Near-Death Experience   Poor Protagonist   Poor to Rich   Power Couple   Romantic Subplot   Schemes And Conspiracies   Souls   Spies   Strong Love Interests   Teamwork   Virtual Reality   Weak to Strong   ",
	"rating": "(3.8 / 5.0, 350 votes)",
	"author": "Tang Jia San Shao   唐家三少   ",
	"year": "\n2015",
	"ranking": "#3923   #2000   #109   #2915   #684   ",
	"reviewcount": "35 Reviews sorted by",
	"description": "The Age of Gods has long since ended, their voices no longer heard on the continent of Douluo. Humanity, standing on the shoulders of legends from its history, advanced soul technology to inconceivable heights. The humans of Douluo invented weapons of mass destruction, mechanized armor, and living metals. With these advancements, they went on to conquer the oceans and discovered two new continents. To fuel these new technologies, humanity hunted the soul beasts to the very brink of extinction. \n\nOnce the dominant force of Douluo, the few surviving soul beasts now hide in the darkest recesses of their last sanctuary. The weakest have all been hunted, leaving only the strongest to scheme in the heart of the forest. The soul beasts, not willing to fade away, plot an uprising for their survival. In the midst of this, a god from a long forgotten era awakens in the depths of the Great Star Dou Forest to seek vengeance for the soul beasts. \n\nAs darkness encroaches from the abyss, hope is found in a young boy who holds a power beyond divinity within himself—Tang Wulin! Hope for both humanity and the soul beasts, as the bridge between the two. He finds his way into the fabled halls of Shrek Academy, where he learns to wield his prodigious powers, makes friends and finds allies, eventually rising to become a towering leader. \n\nAs he learns to harness his strength, danger lurks within the shadows as the various factions of humanity maneuver and plot to usurp Shrek Academy. Tang Wulin discovers the threat to the only world he knows as he sinks deeper into the intrigue. Meanwhile, camouflaged by the chaos and unbeknownst to the humans, the soul beasts’ plot continues to steadily advance.\n\nTo defend what he loves and reclaim what was lost, Tang Wulin must seek out the legacies of legends past and unlock the full might of the Golden Dragon King!>"
}