{
	"url": "https://www.novelupdates.com/series/matriarch-is-pretty-and-cool/",
	"title": "Matriarch is Pretty and Cool - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/11/Matriarch-is-Pretty-and-Cool.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Shoujo   Xianxia   ",
	"tags": "Confident Protagonist   Cultivation   Doting Love Interests   Female Protagonist   Modern Day   Overpowered Protagonist   Romantic Subplot   Wealthy Characters   ",
	"rating": "(4.2 / 5.0, 10 votes)",
	"author": "Sweet Western Treasure   甜西宝   ",
	"year": "\nN/A",
	"ranking": "#2000   #2000   #10422   #10477   #10596   ",
	"reviewcount": "2 Reviews sorted by",
	"description": "Bai Chuwei has lived for five thousand years, and after becoming an ancestor of all human beings, she descends the mountains and initiates the plot of a novel. \r\n\r\nA new female student is transferred into Henghua Secondary School Year 3. The young lady has bright eyes, white teeth, red lips and her appearance is similar to an immortal fairy. But unfortunately, she has Eighth-Grader Syndrome. \r\n\r\n“The wealth of ten Duan Family added together does not even make up half of my combined wealth over the past five thousand years.” \r\n\r\n“The first classic masterpiece of China? Oh I casually wrote that for fun two decades ago.” \r\n\r\n“Scientific research isn’t comparable to flying in the skies with a sword. Today, this ancestor here shall teach everyone how to cultivate scientifically.” \r\n\r\nThe online lurkers reveal a snort of contempt and wait to see Bai Chuwei slapping herself in the face after acting so pretentiously. Eventually, the China Property Statistics Association reveals this particular information: The respected ancestor is the richest person in the world, owning the most number of gold mines, hundreds of islands, and countless property worldwide. \r\n\r\nChina Writer’s Association: @Bai Chuwei, Respected ancestor, when will you continue updating your book after having stopped it for two centuries?>"
}