{
	"url": "https://www.novelupdates.com/series/sister-in-law-of-the-heroine-in-a-childcare-novel/",
	"title": "Sister-in-law of the Heroine in a Childcare Novel - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/03/New-Child-Care-Sister-of-the-Heroine.jpg",
	"noveltype": "(KR)",
	"genre": "Drama   Fantasy   Romance   Slice of Life   ",
	"tags": "Appearance Different from Actual Age   Aristocracy   Beautiful Female Lead   Calm Protagonist   Childcare   Complex Family Relationships   Cute Children   Engagement   European Ambience   Family Conflict   Female Protagonist   Hated Protagonist   Loneliness   Love Interest Falls in Love First   Multiple POV   Multiple Reincarnated Individuals   Nobles   Politics   Power Struggle   Reincarnation   Royalty   Sickly Characters   Villainess Noble Girls   ",
	"rating": "(3.8 / 5.0, 19 votes)",
	"author": "금눈새   ",
	"year": "\n2022",
	"ranking": "#3923   #4133   #8148   #5193   #6669   ",
	"reviewcount": "2 Reviews sorted by",
	"description": "I was reincarnated as a supporting villain character.\n\nA tr*shy princess who was obsessed with the big brother of the cute heroine and eventually poisoned the heroine to destroy her.\n\nI made up my mind and prepared to run away. After saving the heroine, things went wrong.\n\n“Those who touch her, chase them to the end of the world and destroy them.”\n\n“Imperial family? The incompetent imperial family that makes Titania unhappy. They don’t matter anyway.”\n\n“Hahahaha, they call me a mad dog. If a mad dog ​​bites people, is it crazy?”\n\nGee, calm down everyone.\n\nBecause I’m leaving to enjoy my dreams, hopes, and money in a seaside villa with beautiful waves! Everyone should be happy too!\n\nI thought so…\n\n“…I thought you were really dead. I…”\n\nHis golden eyes that contained me were engulfed in emotions I couldn’t read. I felt like I was going to drown just by looking at it.\n\n“…It felt like an endless nightmare, Tia.”\n\nPlease don’t disappear in front of me like that anymore, while whispering earnestly. I was at a loss for words to say to him, who grabbed my hand as if tying me to go nowhere.\n\nAnd…\n\n“It’s okay to hate my brother! But, don’t hate the duke’s money!”\n\n…The cute heroine who gives me the key to the underground safe containing all the treasures…\n\n“Is everything bothering you? Then choose me instead. Don’t let it bother yourself, Duchess. I’ll be by your side anytime, anywhere.”\n\nEven the second older brother of the female protagonist, who always looked at me like a thorn in his eyes, became a bit strange. \n\nWhat is wrong here?>"
}