{
	"url": "https://www.novelupdates.com/series/the-villainous-classmate-is-my-lucky-star/",
	"title": "The Villainous Classmate is My Lucky Star - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/08/The-Villainous-Classmate-is-my-Lucky-Star.jpeg",
	"noveltype": "(CN)",
	"genre": "Comedy   Drama   Fantasy   Gender Bender   Romance   School Life   ",
	"tags": "Academy   Ancient China   Arrogant Characters   Brotherhood   Caring Protagonist   Cross-dressing   Doting Love Interests   Female Protagonist   Friendship   Handsome Male Lead   Kind Love Interests   Slow Romance   Transmigration   ",
	"rating": "(4.0 / 5.0, 39 votes)",
	"author": "Feng Ge Qie Xing   风歌且行   ",
	"year": "\n2019",
	"ranking": "#1698   #1397   #7076   #2428   #6805   ",
	"reviewcount": "4 Reviews sorted by",
	"description": "Wen Yantong found herself transmigrated into a novel as a cannon fodder character with the same name as hers.\n\nIn this novel, this cannon fodder entered the Academy disguised as a man. She made the mistake of falling in love with the main male character. Then she was used by a female supporting character and met a bad end.\n\nSo after she was transmigrated into the novel, Wen Yantong’s priority was to escape from the Academy. But once she put her plan into action, bad luck would befall her, and she even crippled her legs. On crutches, she was trapped in the Academy and was sent to copy texts from the classical works of literature as punishment.\n\nThen an incredible thing happened. Wen Yantong found the moment her classmate Little Marquis, the number one villain in the novel, decided to scold her, the wheel of fortune would turn in her favor. So Wen Yantong gave up on her plan. And the first thing in the morning was to find her lucky koi fish.\n\nBut the Little Marquis was very ferocious, often lashed out in violence at the least provocation. So Wen Yantong racked her brain, jumping back and forth on the verge of getting kicked and being scolded.\n\nA typical dialogue between them was like this:\n\nWen Yantong:” Hi, Little Marquis.”\n\nLittle Marquis:” Get out!”\n\nWen Yantong:” Ok!”>"
}