{
	"url": "https://www.novelupdates.com/series/the-strongest-guild-master-founded-a-nation-in-a-week/",
	"title": "The Strongest Guild Master Founded a Nation in a Week - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2018/02/evp3skj9j5n1gegtao3b7ecs1v_ed2_er_kx_54oc.jpg.580.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Comedy   Ecchi   Fantasy   Harem   Martial Arts   Shounen   Supernatural   ",
	"tags": "Adventurers   Beastkin   Calm Protagonist   Cheats   Demi-Humans   Demons   Depictions of Cruelty   Devoted Love Interests   Domestic Affairs   Dragon Riders   Dragons   Dwarfs   Elves   Fantasy World   First-time Interc**rse   Game Elements   Guilds   Handsome Male Lead   Kingdom Building   Loli   Loyal Subordinates   Maids   Male Protagonist   Marriage   Masochistic Characters   Master-Servant Relationship   Monsters   Multiple POV   Multiple Transported Individuals   Obsessive Love   Overpowered Protagonist   Polygamy   Protagonist Strong from the Start   R-15   Reverse R*pe   Royalty   Sadistic Characters   S*aves   Sword And Magic   Transported to Another World   War Records   Wars   ",
	"rating": "(3.3 / 5.0, 357 votes)",
	"author": "Inoue Mitsuru   井上みつる   ",
	"year": "\n2017",
	"ranking": "#2642   #3427   #281   #730   #330   ",
	"reviewcount": "61 Reviews sorted by",
	"description": "Renjin Yanase is an ordinary member of society whose occupation is a sales person. His hobby is an online VR game “Einherjar” that has been on for over five years now. It is a game with high degree of freedom and Renjin silently works hard to nurture his subordinate character.\r\n\r\nThe next day was a holiday so he’s going to use it for boss hunting all night.\r\n\r\nWhen the boss hunt is finished, Renjin falls asleep in the game. He felt like someone was calling his name so he woke up.\r\n\r\nStanding in front of the half-asleep Renjin was Eleanor, a character he created.\r\n\r\nWhen Renjin looked outside after being puzzled to the characters who behave like they are alive, the outside scenery changed into one that he did not know at all.\r\n\r\nRenjin who surveyed the surrounding, realized that the castle and the 200 subordinates that he created with time and money was transferred to a different world.\r\n\r\nThe transferred Renjin announced the declaration of the founding of a nation after a week.>"
}