{
	"url": "https://www.novelupdates.com/series/everyone-else-is-a-returnee/",
	"title": "Everyone Else is a Returnee - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/12/Everyone-Else-is-a-Returnee.jpeg",
	"noveltype": "(KR)",
	"genre": "Action   Adventure   Comedy   Fantasy   Harem   Martial Arts   Mystery   Romance   Sci-fi   Shounen   Supernatural   ",
	"tags": "Adopted Children   Alternate World   Angels   Anti-social Protagonist   Apocalypse   Artifact Crafting   Artifacts   Beastkin   Beasts   Beautiful Female Lead   Blacksmith   Bloodlines   Calm Protagonist   Clever Protagonist   Cold Protagonist   Cooking   Crafting   Cunning Protagonist   Cute Children   Dense Protagonist   Determined Protagonist   Dragons   Dungeons   Evolution   Fallen Angels   Familial Love   Familiars   Family   Famous Parents   Famous Protagonist   Fantasy Creatures   Fantasy World   Fast Learner   First-time Interc**rse   Game Elements   Game Ranking System   Gate to Another World   Genius Protagonist   God Protagonist   Gods   Grinding   Guilds   Handsome Male Lead   Hard-Working Protagonist   Hiding True Abilities   Hiding True Identity   Human-Nonhuman Relationship   Lack of Common Sense   Leadership   Level System   Loner Protagonist   Love Rivals   Loyal Subordinates   Magical Space   Male Protagonist   Marriage   Misunderstandings   Modern Day   Monsters   Multiple Transported Individuals   Mutations   Mysterious Family Background   Older Love Interests   Outer Space   Overpowered Protagonist   Parody   Playful Protagonist   Polygamy   Pregnancy   Race Change   Returning from Another World   Romantic Subplot   Ruthless Protagonist   Shameless Protagonist   Skill Assimilation   Slow Romance   Spatial Manipulation   Spear Wielder   Special Abilities   Spirit Users   Spirits   Strength-based Social Hierarchy   Strong Love Interests   Strong to Stronger   Sword And Magic   Time Paradox   Time Skip   Weak to Strong   World Travel   ",
	"rating": "(4.3 / 5.0, 3397 votes)",
	"author": "Toika   Toy Car   토이카   ",
	"year": "\n2016",
	"ranking": "#2182   #775   #17   #169   #3   ",
	"reviewcount": "381 Reviews sorted by",
	"description": "Yu Illhan was always the one left behind. Left out of cliques in school. Left out of social invitations. Just…always left out. Except now he’s been left behind for real.\n\nWhen Earth’s future is threatened, Yu Illhan stays behind while the rest of the population flees to other planets for safety.\n\nIt’s up to Yu Illhan to save our planet before it’s too late!>"
}