{
	"url": "https://www.novelupdates.com/series/the-devilish-duke-cant-sleep/",
	"title": "The Devilish Duke Can’t Sleep - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/07/The-Devilish-Duke-Cant-Sleep.jpg",
	"noveltype": "(KR)",
	"genre": "Fantasy   Romance   Supernatural   ",
	"tags": "Adapted to Manhwa   Aristocracy   Beautiful Female Lead   Comedic Undertone   Curses   Different Social Status   European Ambience   Fated Lovers   Female Protagonist   First Love   Handsome Male Lead   Hard-Working Protagonist   Hidden Abilities   Love Interest Falls in Love First   Magic   Maids   Master-Servant Relationship   Nobles   Politics   Possessive Characters   Sealed Power   Slow Romance   Strong Love Interests   Timid Protagonist   Wealthy Characters   ",
	"rating": "(3.9 / 5.0, 49 votes)",
	"author": "Lemon Frog   레몬개구리   ",
	"year": "\n2021",
	"ranking": "#2836   #4751   #4669   #4496   #4230   ",
	"reviewcount": "11 Reviews sorted by",
	"description": "Duke Kahel Luave, the unlucky duke, who cannot keep one servant by his side because of the devilish nature that charms men and women of all ages.\r\n\r\nMeet Lena, a maid with a rare constitution where devilish charms don’t work.\r\n\r\n***\r\n\r\nIf the devilish energy emanating from him was a scent, now this room would be filled with a dizzyingly strong scent.\r\n\r\nHowever, there were no other positive emotions in Lena's eyes except worry and fear.\r\n\r\nKahel decided to take another approach.\r\n\r\nHis appearance was also so seductive that it was rumored to be the best in the kingdom, so no matter how much he suppressed his devilish nature, he could not stop people from falling for him.\r\n\r\nRecalling that troublesome past, Kahel gave Lena a strange smile.\r\n\r\nThis kind of service was not given to anyone.\r\n\r\nBut…….\r\n\r\n“Sa, save me, please… … .”\r\n\r\nLena, who was barely holding back her tears, began to cry and beg for her life. \r\n\r\nIt was the moment when the law of 'even the gods will fall in love' on his smile faded away.\r\n\r\n'It's not normal. As expected, it’s suspicious.'>"
}