{
	"url": "https://www.novelupdates.com/series/the-sacred-ruins/",
	"title": "The Sacred Ruins - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2017/03/The-Sacred-Ruins.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Martial Arts   Mature   Sci-fi   Xuanhuan   ",
	"tags": "Adapted to Manhua   Apocalypse   Artifacts   Beast Companions   Black Belly   Clever Protagonist   Cultivation   Determined Protagonist   Evolution   Futuristic Setting   Male Protagonist   Multiple Realms   Possession   Pregnancy   Romantic Subplot   S*xual Cultivation Technique   Strength-based Social Hierarchy   Underestimated Protagonist   Wars   Weak to Strong   World Travel   ",
	"rating": "(3.6 / 5.0, 205 votes)",
	"author": "Chen Dong   辰东   ",
	"year": "\n2016",
	"ranking": "#2000   #2000   #1059   #12293   #2765   ",
	"reviewcount": "23 Reviews sorted by",
	"description": "To rise from defeat; to revive amidst the dissipation.\n\nAs the vast oceans turn to dust and the thunder and lightning fade away,\n\nThat strand of spiritual mist once again approaches our great world.\n\nWith the shackles that bound our world now severed—\n\nA whole new world of mystery and wonder awaits,\n\nAs we turn the corner…\n\n——\n\nThe Sacred Ruins is a story set in a post-apocalyptic world. A world that has recovered to a state that is roughly equal to our own world in terms of technology and culture, although its ancient history remains largely unknown. The story begins during the post-graduation trip of our protagonist, where he discovers some ancient ruins and witnesses “the great change”, an upheaval that changed everything. The changing earth not only brought about new, unexplored landscape but also sparked the evolution of all organisms. Plants and animals started gaining sentience and some humans obtained unimaginable powers. The legends, myths, and tales of old seemed to have suddenly come to life as the earth entered a new era where beasts and men formed factions, explored new lands and ultimately struggled for supremacy.>"
}