{
	"url": "https://www.novelupdates.com/series/concealed-and-blended-fendai/",
	"title": "Concealed and Blended: Fendai - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/10/Concealed-and-Blended-Fendai.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Romance   Shounen Ai   ",
	"tags": "Adapted to Drama CD   Adapted to Manhua   Androgynous Characters   Celebrities   Cross-dressing   Dishonest Protagonist   Modern Day   Power Couple   Seme Protagonist   Straight Seme   ",
	"rating": "(4.2 / 5.0, 6 votes)",
	"author": "七英俊   ",
	"year": "\n2019",
	"ranking": "#808   #2635   #12410   #10838   #12790   ",
	"reviewcount": "No Reviews",
	"description": "Once upon a time, there was a makeup artist who possessed outstanding skills and top-notch aesthetic judgement. When he did makeup for various stars, he could embellish sharpness onto the smooth vases that lacked edges, and he could make models who exceeded the boundaries of aesthetics to appear delicate and soft, more approachable to people.\n\nMale stars loved to request him, because he had a thorough understanding of masculine charm in particular, and the makeup he did was never garishly slathered in oils or powders, instead exuding a natural, dashing air of elegance.\n\nFemale stars loved to request him, because not only was he excellent in his skills, he was also everyone’s closest confidant; when they chatted, he could easily hold any conversation, and his mouth would be tightly sealed, never allowing anyone’s privacy to slip out.\n\nAlthough this person was quite young, after getting by in the makeup industry the past few years, he was virtually considered as a distinguished personality in his profession, and would be referred to as a ‘master’ wherever he went.\n\nBut he had a terrifying secret. He needed to carefully tread on thin ice and couldn’t expose even the slightest traces; otherwise, nobody would invite him to work ever again, and nobody would apply to the classes he led anymore.\n\n—He was a straight man.>"
}