{
	"url": "https://www.novelupdates.com/series/dont-think-about-hindering-my-studies/",
	"title": "Don’t Think About Hindering My Studies - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/08/Dont-Think-About-Hindering-My-Studies.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Fantasy   Romance   School Life   Slice of Life   ",
	"tags": "Beautiful Female Lead   Bullying   Childhood Friends   Clumsy Love Interests   Doting Older Siblings   Enemies Become Allies   Familial Love   Female Protagonist   Friendship   Genius Protagonist   Handsome Male Lead   Hard-Working Protagonist   Hidden Abilities   Love Interest Falls in Love First   Modern Day   Multiple POV   Overprotective Siblings   Popular Love Interests   Possessive Characters   Psychic Powers   Sharp-tongued Characters   Special Abilities   Transmigration   Tsundere   Underestimated Protagonist   Villainess Noble Girls   Wealthy Characters   ",
	"rating": "(3.6 / 5.0, 49 votes)",
	"author": "池多鱼   ",
	"year": "\n2019",
	"ranking": "#377   #2534   #4797   #2698   #5568   ",
	"reviewcount": "8 Reviews sorted by",
	"description": "When Ning Yi, a young top student, transmigrated and became the white lotus female supporting character who only knew how to go “ying ying ying”1, she discovered that pretending to be pitiful and picking on the female lead was more difficult than getting first place.\r\n\r\nDo you know how painful it is for a top student to look at the WuSan2 and not be able to work on it?\r\n\r\nDo you understand the despair of clearly knowing the answer yet being unable to fill in the answer sheet?\r\n\r\nSuch a wonderful period of time, why use it to be jealous and chase men?!\r\n\r\nNing Yi presented the cake with a cold and detached heart: “Nan gege, I made this myself ying~ Can you teach me after you eat it?”\r\n\r\nLu Xu Nan frowned as he looked at the annoying person in front of him: “Not eating, not teaching, get lost!”\r\n\r\nNing Yi, who had completed the storyline, scolded a ‘smelly trash’ in her heart, turned around, and left.\r\n\r\nLu Xu Nan who has the ability to read minds: ??? When she wants something, it’s Nan ­­gege, and when there’s nothing, it’s smelly trash. Did she graduate with a major in face changing?\r\n\r\nNotes\r\n[1] 嘤嘤嘤 (yīngyīngyīng) represents the sound of crying cutely, can be generalized for acting cute\r\n[2] 五三 (wŭsān) is a set of test prep materials that students use to prepare for the gaokao/college entrance exam>"
}