{
	"url": "https://www.novelupdates.com/series/the-maid-in-the-reverse-harem-game-wants-to-quit/",
	"title": "The Maid In The Reverse Harem Game Wants To Quit - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/06/The-Maid-In-The-Reverse-Harem-Game-Wants-To-Quit.jpg",
	"noveltype": "(KR)",
	"genre": "Comedy   Fantasy   Harem   Romance   ",
	"tags": "Apathetic Protagonist   Aristocracy   Calm Protagonist   Childhood Friends   Cruel Characters   Dense Protagonist   Determined Protagonist   European Ambience   Female Protagonist   Kuudere   Love Interest Falls in Love First   Love Rivals   Maids   Male Yandere   Master-Servant Relationship   Misunderstandings   Mob Protagonist   Nobles   Obsessive Love   Otome Game   Possessive Characters   Reincarnation   Reverse Harem   Second Chance   Secret Organizations   Time Loop   Transported into a Game World   Tsundere   Wealthy Characters   ",
	"rating": "(3.8 / 5.0, 52 votes)",
	"author": "Eun Hae Yoon   은해윤   ",
	"year": "\n2021",
	"ranking": "#2002   #1998   #4051   #2943   #3357   ",
	"reviewcount": "9 Reviews sorted by",
	"description": "I reincarnated as a side character maid in a reverse harem game. Even after going through all six endings of the game, I still couldn’t return back to reality.\r\n\r\nSo then I made up my mind on the seventh round—\r\n\r\n“Here is my letter of resignation. I’m leaving this mansion.”\r\n\r\n—to quit the game and live my own life.\r\n\r\n* * *\r\n\r\nNo matter how hard I tried, I was just an extra. I no longer wanted to dwell on the tragedy of the characters in the game.\r\n\r\nSince I don’t hold much importance here anyway, I thought everyone would forget about me if I left quietly.\r\n\r\nHowever…\r\n\r\n“Who’s leaving the mansion? Didn’t you say you were mine, Irene?”\r\n“Irene, I have no intention of becoming involved with anyone but you. Just you.”\r\n“Don’t go, Rea. Stay by my side. Please?”\r\n\r\nThe men in the game, who should be obsessed with the female lead, suddenly began to cling to me, but…\r\n\r\nI don’t want to love anyone anymore.>"
}