{
	"url": "https://www.novelupdates.com/series/this-damned-sweetness/",
	"title": "This Damned Sweetness - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/01/This-Damned-Sweetness.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Drama   Josei   Romance   Shoujo   Slice of Life   ",
	"tags": "Arrogant Characters   Beautiful Female Lead   Business Management   Businessmen   Family Business   Female Protagonist   Handsome Male Lead   Modern Day   Power Couple   Power Struggle   Wealthy Characters   ",
	"rating": "(4.0 / 5.0, 5 votes)",
	"author": "Gu Le Zhi   顾了之   ",
	"year": "\n2020",
	"ranking": "#2000   #2000   #12143   #8981   #11138   ",
	"reviewcount": "1 Review sorted by",
	"description": "Xu Qiao was working night duty at a tollbooth. In the early morning, she dozed off until she was like a chick pecking at rice and was woken up by a gold galore, gentlemanly car owner: “Seeing you sleep so soundly, I can’t bear to disturb you, but I’m really in a hurry to get through. Ah, sorry for the trouble.” \n\nXu Qiao’s heart was stirred in a flash and she worked the night shift everyday from that point on. \n\nA week later, with dark circles under her eyes, she complained to her girlfriends in a bar: “We’ve already met up in the middle of the night so many times, why hasn’t he even asked for my number yet?”\n\nJust when her voice fell, she overheard a conversation from behind: “For a little girl, I go on late night drives instead of sleeping. I’m so tired my eyelids are coming to blows.”\n\n“What are you acting a gentleman for? Just directly go up and ask for the phone number.”\n\n“Don’t you feel she’s too pure to put your hands on?”\n\nXu Qiao unhurriedly turned around and cleared her throat: “Sorry to bother you, but in fact she might not be as pure as you believe.”\n\n“……”\n\nAfter the sweetness—\n\nXu Qiao: My golden rule when dating; if we fight, I will absolutely never give in.\n\nCheng Lang: My golden rule when dating; if we break up, we will absolutely never get back together.\n\nSeveral days after a cold war.\n\nXu Qiao: Hubby, I want a hug.\n\nCheng Lang: Little brat, come home with me.\n\n“Oh this damned sweetness, it’s the crime of my mouth.”>"
}