{
	"url": "https://www.novelupdates.com/series/even-a-tired-villain-has-circumstances/",
	"title": "Even A Tired Villain Has Circumstances - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/07/Even-A-Tired-Villain-Has-Circumstances.jpeg",
	"noveltype": "(KR)",
	"genre": "Comedy   Fantasy   Shounen Ai   ",
	"tags": "Game Elements   Game Ranking System   Handsome Male Lead   Level System   Loner Protagonist   Modern Day   R-15   Strong Love Interests   Transmigration   Transported into a Game World   ",
	"rating": "(4.5 / 5.0, 15 votes)",
	"author": "Sojerry   ",
	"year": "\n2022",
	"ranking": "#2566   #2000   #11627   #11907   #9024   ",
	"reviewcount": "No Reviews",
	"description": "Baek Woo-jin, the older brother of the protagonist and the villain of the game.\n\nThe day he saw the ending of his hundredth death, a notification arrived.\n\n[Baek Woojin died 100 times. A hidden event will occur! Would you like to accept it?]\nThe game that charges for everything is showing you a free of charge event,\n\nYou should have been suspicious.\n\nBut the foolish man pressed the s*upid word, “yes”\n\nAnd possessed Baek Woo-jin, the villain who died a hundred times.\n\nAnd he received a quest as soon as he possessed,\n\nReconcile with Baek So-hyuk, the younger brother who killed Baek Woo-jin!\n\nBut what? If you fail, the penalty is death?\n\nTo pull out this crazy flag of death,\n\nHe hastened and put the apology in his mouth, but…….\n\n[Status Abnormality Triggered: The remark is corrected and delivered to the other party due to ‘entitlement’.]\n“If you kneel down and beg, there’s nothing you can’t live with.”\n\nThe only thing that comes out of his mouth is venomous words, so misunderstanding with Baek So-hyuk keeps piling up.\n\nTo make matters worse, he even drags the main villain, Kang Kwon-hoo’s aggro.\n\n“What you’re doing is pretty funny, so I’ll do as you say.”\n\nIs this what it feels like to have a shrimp in a whale fight?\n\nPlease, both of you stop paying attention to me,\n\nI just want to have a carefree life!>"
}