{
	"url": "https://www.novelupdates.com/series/crossover-actors/",
	"title": "Crossover Actors - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/10/Crossover-Actors.png",
	"noveltype": "(CN)",
	"genre": "Comedy   Drama   Romance   Slice of Life   Yaoi   ",
	"tags": "Acting   Adapted to Drama CD   Adapted to Manhua   Caring Protagonist   Celebrities   Co-Workers   Cold Love Interests   Dense Protagonist   Doting Love Interests   Doting Older Siblings   Handsome Male Lead   Heartwarming   Misunderstandings   Modern Day   Multiple POV   Past Trauma   Popular Love Interests   Protagonist Falls in Love First   Righteous Protagonist   Seme Protagonist   Shameless Protagonist   Showbiz   Straight Seme   Tragic Past   Wealthy Characters   ",
	"rating": "(4.3 / 5.0, 33 votes)",
	"author": "Bei Nan   北南   ",
	"year": "\n2019",
	"ranking": "#2917   #2694   #7884   #6107   #5368   ",
	"reviewcount": "4 Reviews sorted by",
	"description": "'I just love music, but I became an actor instead, and I’m not even popular.' \n\nThe eighteen tier young actor Lu Wen had low EQ. He had talent for acting but no foresight. On the first day of joining the filming crew, he offended Qu Yanting, a big screenwriter in the circle. \n\nLu Wen: It was not intentional.\n\nLater, he thought that Qu Yanting would use his position as a big name in the circle to take revenge, using upspoken rule on this small fresh meat then using money to ruin his reputation.\n\nLu Wen: The entertainment industry is really dirty.\n\nRepeatedly jumping between being turned over and overturning, fighting with traffic actors, making daring statement, face-slapping program group, abandoning the script on reality show, Lu Wen: I like Teacher Qu very much.\n\nFrom the 18th tier actor to a popular actor, from being blacken by the whole internet to a great god, at last the silly Lu Wen finally became a qualified star. \n\nLu Wen: Thanks to Teacher Qu for not abandoning or giving me cold shoulder!\n\nThe silly and straightforward gong who love music vs. cold on the surface but actually warm inside shou who had social phobia. \n\nQu Yanting: I will improve your IQ for you, and you will treat social fear for me. This is probably love.\n>"
}