{
	"url": "https://www.novelupdates.com/series/soon-to-die/",
	"title": "Soon To Die - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/11/Soon-To-Die.jpg",
	"noveltype": "(CN)",
	"genre": "Horror   Romance   Supernatural   Yaoi   ",
	"tags": "Cautious Protagonist   Character Growth   Cold Love Interests   Death   Doting Parents   Familial Love   Ghosts   Handsome Male Lead   Past Trauma   Possessive Characters   R*pe   Showbiz   Tragic Past   Wealthy Characters   Younger Love Interests   ",
	"rating": "(3.9 / 5.0, 17 votes)",
	"author": "Mo Xi Ke   墨西柯   ",
	"year": "\n2019",
	"ranking": "#2000   #2000   #9160   #9322   #8508   ",
	"reviewcount": "2 Reviews sorted by",
	"description": "Lu Wenxi, a popular idol, had a good family, good looks and high popularity. At the same time, he had poor acting skills, bad temper and poor reputation. Though there was one secret that few knew about. He was gay and he liked to be pressed down!\n\nHe never had a relationship, he was turned down when he confessed in high school and have never been in love since. Life was't going well recently until one morning the door bell rings. That was when he's fate would be changed forever. A handsome young man standing by the door with the aura of an immortal making his introduction.\n\nXu Chen' There's an evil spirit in your house, oh and you looked like you're about to die soon'\n\nLu Wenxi' ???'\n\nFrom that day on Lu Wenxi start seeing things that he never seen before, evil spirits and ghosts wandering around him with him needed to solve their grievances to attain merits to extend his life. He started this journey with this young man by his side who protects him along the way. The heart that was frozen when he was younger starts to beat again. \n\nLu Wenxi' I love you, I just want us to date before I die'\n\nXu Chen' But we can't , I will blame myself for the rest of my life if you die because we're together!'\n\nSorrow and pain swept up , journey filled with thorns, life and death hangs on the balance every moment. Lu Wenxi will stake his life in order to obtain the love of the man he set his sights on.\n\nEccentric unapologetic Shou x Younger Gong with a heart of a Buddhist >"
}