{
	"url": "https://www.novelupdates.com/series/shinwa-densetsu-no-eiyuu-no-isekaitan-ln/",
	"title": "Shinwa Densetsu no Eiyuu no Isekaitan (LN) - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/07/eiyuuisekaitan_v1b.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Drama   Fantasy   Harem   Mystery   ",
	"tags": "Amnesia   Aristocracy   Army   Beastkin   Beasts   Beautiful Female Lead   Betrayal   Calm Protagonist   Chuunibyou   Clever Protagonist   Cold Protagonist   Criminals   Cunning Protagonist   Demons   Empires   Fantasy World   Former Hero   Handsome Male Lead   Heroes   Heterochromia   Hidden Abilities   Hiding True Abilities   Hiding True Identity   Kingdom Building   Kingdoms   Leadership   Love Interest Falls in Love First   Male Protagonist   Manipulative Characters   Mind Break   Mind Control   Overpowered Protagonist   Politics   Polygamy   Protagonist Strong from the Start   Romantic Subplot   Royalty   Ruthless Protagonist   Schemes And Conspiracies   Spirit Users   Strategic Battles   Strategist   Strong Love Interests   Strong to Stronger   Summoned Hero   Sword And Magic   Sword Wielder   Torture   Transported to Another World   Wars   ",
	"rating": "(3.9 / 5.0, 111 votes)",
	"author": "Tatematsuri   奉   ",
	"year": "\n2014",
	"ranking": "#3133   #4208   #1945   #4930   #2190   ",
	"reviewcount": "14 Reviews sorted by",
	"description": "Once upon a time, a boy was referred to as a “War Hero.”\r\n\r\nIn another world called Aletia, the boy who had saved the Lost Kingdom, conquered their neighbouring countries, and led to the rise of a grand empire decided to throw everything away, returning to the modern era at the cost of his memories.\r\n\r\nAs three years passed, the boy who was happily enjoying his daily life was once again called back to the other world.\r\n\r\nHowever, what awaited him was the Aletia of 1000 years in the future.\r\n\r\nAs his past glories became a “myth,” the legend of the youth referred to as the, “Twin Black Hero King,” begins.>"
}