{
	"url": "https://www.novelupdates.com/series/chaos-of-beauty/",
	"title": "Chaos Of Beauty - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2015/08/chaosofbeauty.jpg",
	"noveltype": "(CN)",
	"genre": "Drama   Gender Bender   Harem   Historical   Josei   Romance   Tragedy   ",
	"tags": "Ancient China   Arranged Marriage   Beautiful Female Lead   Cunning Protagonist   Female Protagonist   Handsome Male Lead   Imperial Harem   Misunderstandings   Politics   Power Couple   Reverse Harem   R*pe   Schemes And Conspiracies   ",
	"rating": "(3.8 / 5.0, 219 votes)",
	"author": "Duo Duo Wu   ",
	"year": "\n2006",
	"ranking": "#2000   #2000   #3088   #13807   #2929   ",
	"reviewcount": "51 Reviews sorted by",
	"description": "She has been drawn into the life of the phoenix, such fate – “The Emperor Swallow”, but few days later she married the Prime Minister; she possesses beauty that overthrows cities and ruins states but also has a talented and virtuous mind, yet her husband is deeply in love with the Emperor’s doted consort. On their wedding night, his face filled with guilt, says to her: Apart from love, I can give you anything……\r\n\r\nThough deep in nobility, her life is not monotonous, to pick up the new number one scholar from within the imperial palace, to rescue the Nu clan’s prince in the back alleys, and with the young general falling off the cliff, with the Emperor engaging in a battle of wits over the inner palace…….\r\n\r\nMany men were unable to conquer her beauty and wisdom, yet when trying to win the beauty, they cannot let go of their plundering desires in lust for power. Within the imperial court, there is an underlying turbulence of disputing fronts. On the battlefield, there is the slaughtering of armoured cavalry……the tender grace of a beauty, hearts fuelled with lust for power, which is it that is the burial of such heroes?\r\n\r\nTroubled times since the war, they survive in this strife, fighting to dominate this world, seizing the beauty that overthrows cities and ruin states……\r\n\r\nThe world, because of this beauty, is in chaos; but who is it that this beauty charmingly smiles at?>"
}