{
	"url": "https://www.novelupdates.com/series/after-crossing-through-ten-worlds-i-failed-to-run-away/",
	"title": "After Crossing Through Ten Worlds, I Failed To Run Away - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/06/After-Crossing-Through-Ten-Worlds-I-Failed-To-Run-Away.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Fantasy   Mystery   Romance   Supernatural   Tragedy   Yaoi   ",
	"tags": "Acting   Ancient China   Apocalypse   Charismatic Protagonist   Charming Protagonist   Clingy Lover   Cold Protagonist   Cultivation   Enemies Become Lovers   Fantasy World   Futuristic Setting   Ghosts   Handsome Male Lead   Jealousy   Long Separations   Love Interest Falls in Love First   Love Rivals   Lovers Reunited   Male Yandere   Manipulative Characters   Modern Day   Obsessive Love   Omegaverse   Past Plays a Big Role   Royalty   Secret Identity   Secret Relationship   Secretive Protagonist   Seduction   Showbiz   Strong Love Interests   System Administrator   Transmigration   Vampires   World Hopping   Yandere   ",
	"rating": "(4.0 / 5.0, 48 votes)",
	"author": "啾咪啾咪兔   ",
	"year": "\nN/A",
	"ranking": "#946   #1221   #5647   #1296   #5260   ",
	"reviewcount": "7 Reviews",
	"description": "Ji Ning is an experienced transmigrator. His mission was to capture male protagonists inside various novels. Once he succeeded, he escaped by dying and continued with his mission in the next world.\n\nEach protagonist was devastated by Ji Ning’s death yet Ji Ning remained indifferent, until the day the worlds merged together and the protagonists found he wasn’t dead. One by one, they arrived at his door-\n\nThe Xianxia protagonist: I cultivated immortality, mastered Tao, and shattered the void, all for you. You have escaped for two thousand years, where do you want to escape to now?\n\nThe interstellar protagonist: If you don’t want your home planet to be destroyed, obediently come back with me.\n\nThe infinite flow protagonist: Since you’ve run away, I’ll cut you to pieces so your soul can only belong to me. Don’t be afraid, I still love you!\n\nThe wealthy president ABO protagonist: You think I can’t get you pregnant if you’re not an omega?\n\nThere were more protagonists from different novels such as Western fantasy, the court palace, vampires, the apocalypse, and martial arts.\n\nJi Ning, who was attacking a protagonist in the entertainment industry: ??\n\nThe protagonist of the entertainment industry: Do you think I like the colour green? If you don’t cut ties with them, I’ll never fall in love with you.\n\nJi Ning: …No, I’m sorry!>"
}