{
	"url": "https://www.novelupdates.com/series/extreme-flame-wizard/",
	"title": "Extreme Flame Wizard - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/04/Extreme-Flame-Wizard.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Comedy   Ecchi   Fantasy   Harem   School Life   Shounen   ",
	"tags": "Abandoned Children   Acting   Adapted to Manga   Adventurers   Battle Academy   Battle Competition   Character Growth   Charismatic Protagonist   Charming Protagonist   Childhood Friends   Childhood Love   Childhood Promise   Complex Family Relationships   Demon Lord   Demons   Dense Protagonist   Dragons   Elemental Magic   Elves   Engagement   European Ambience   Fallen Nobility   Fantasy World   Hard-Working Protagonist   Harem-seeking Protagonist   Harsh Training   Loli   Love Interest Falls in Love First   Magic   Male Protagonist   Masochistic Characters   Master-Disciple Relationship   Nobles   Obsessive Love   Older Love Interests   Overpowered Protagonist   Polygamy   Popular Love Interests   R-15   Romantic Subplot   Royalty   Saints   Sibling Rivalry   Strong Love Interests   Strong to Stronger   Student Council   Sword And Magic   Trap   Tsundere   Unlucky Protagonist   Weak to Strong   Wizards   World Travel   Yandere   Younger Brothers   ",
	"rating": "(4.1 / 5.0, 100 votes)",
	"author": "Shikuramen   シクラメン   ",
	"year": "\n2020",
	"ranking": "#1144   #632   #1401   #1285   #2675   ",
	"reviewcount": "15 Reviews sorted by",
	"description": "“From today onwards you are no longer my son. Get out”\n\n Being born into a noble family that is aiming to become the ‘strongest’, at his aptitude ceremony held on his 12th birthday it was discovered that Igni could only use fireballs.\n\n Igni who can only use beginner level magic was kicked out of his house.\n\nWith no where to go and without much magical ability, Igni is scraping by through life. However, one day he has miraculous reunion.\n\n “What? Is that Igni there?”\n\n “Gr-grandpa!?” \n\nIt was a reunion with his grandfather, the man who was once called the strongest [Kyokuten] but was banished from his noble family because of his excessive womanizing…! \n\n“Grandpa! You said strong men are popular, but I can’t be strong!!” \n\n“Igni, listen carefully. Strong men are popular but, hard-working men are even more popular!!”\n\n “Grandpa! I’ll try my best!!!”\n\n Igni whose parents who banished Igni from the house, didn’t yet know of his obsession with being popular under the guidance of the strongest [Kyokuten] magician…!\n\n“Igni that magic!”\n\n “This? It’s a fireball” \n\n“With this you can aim for [Kyokuten]! Come back here!!”\n\n “Nobility isn’t popular” \n\n“What are you saying?” \n\nThis is a story where a young magician becomes the strongest by honing his skills all in order to become popular.>"
}