{
	"url": "https://www.novelupdates.com/series/love-me-again/",
	"title": "Love Me Again - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2017/01/zoom_big_5066.jpg",
	"noveltype": "(CN)",
	"genre": "Adult   Drama   Josei   Mature   Romance   ",
	"tags": "Abusive Characters   Beautiful Female Lead   Clever Protagonist   Cold Protagonist   Devoted Love Interests   Evil Protagonist   Female Protagonist   Handsome Male Lead   Love Interest Falls in Love First   Misunderstandings   Modern Day   Reincarnation   Second Chance   Short Story   Siblings Not Related by Blood   Tragic Past   Unconditional Love   Younger Love Interests   ",
	"rating": "(4.2 / 5.0, 596 votes)",
	"author": "Yuan Yuan   元媛   ",
	"year": "\n2015",
	"ranking": "#2773   #6216   #1514   #2955   #737   ",
	"reviewcount": "112 Reviews sorted by",
	"description": "6th book in Yuan Yuan’s series 老梗也是梗系列之(AKA We were supposed to have died in a plane crash, instead we transmigrated). The stories consist of three modern settings and three historical.\n\n—\n\nLuo An Hai didn’t expect that one day she would witness her own funeral.\n\nThe last thing she remembered was being on a plane to England for business negotiations. If she had succeeded then the majority of shareholders would vote her way, and she would become the CEO of Luo’s company.\n\nBut she didn’t expect the plane to crash.\n\nHer last thought was that ten years of hard work fell down the drain. She had endured ten years living at the Luo Mansion, and fought to keep the homewrecker and the homewrecker’s son, Han Ding Rui taking Luo’s company from her hands.\n\nShe couldn’t accept the moment her dream was within grasp, her life would end in a plane crash.\n\nA second after the plane crash, she was standing in front of her tombstone.\n\nHer father had aged since the last time she saw him.\n\nShe froze. Unexpectedly her father was sobbing at her funeral. She hadn’t called the aged man her father since their estrangement the day he brought home the homewrecker and Han Ding Rui.\n\nShe resented her father for marrying her mother for money. Her mother loved her father deeply. But what did her mother receive? Her mother ended up dying of a lonely heart.\n\nShe dedicated her life to opposing her father, the homewrecker, and the homewrecker’s son. She hated them and treated them badly… so why are they grieving? Why does Han Ding Rui stare at her photo?\n\nSuddenly she is given a second chance, but will things be different?>"
}