{
	"url": "https://www.novelupdates.com/series/reborn-to-when-the-old-man-was-17/",
	"title": "Reborn to When the Old Man Was 17 - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/05/16964s.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Romance   School Life   ",
	"tags": "Cold Love Interests   Female Protagonist   Modern Day   Reincarnation   Time Travel   ",
	"rating": "(3.8 / 5.0, 13 votes)",
	"author": "Gongzi Shang   公子商   ",
	"year": "\n2020",
	"ranking": "#2000   #6304   #9376   #11315   #8987   ",
	"reviewcount": "4 Reviews sorted by",
	"description": "As the saying goes, if there is a stepmother there will be a stepfather.\n\nThe year Su Ran turned 20 years old, she was sold by her father to a powerful and influential old man for a project worth 4 billion.\n\nThe old man was cold, gloomy, and prejudiced; he was habitually silent and treated his words like gold, moreover, he was also ruthless and fierce, making decisions without consulting others.\n\nAfter three years of marriage, her total communication with the other party didn’t even amount to 100 sentences. Moreover, the number of times she had met him could be counted on one hand.\n\nThe old aunt that took care of her at home continuously persuaded Su Ran how much the mister was handsome before and how good he was in the past. However, she didn’t believe a single sentence of whatever she said.\n\nLater, she heard that the old man had an incurable heart disease and couldn’t find a matching donor for organ transplantation, and that he didn’t have much longer to live.\n\nSu Ran herself didn’t understand what went wrong in her brain, because on the 40th day of the old man’s hospitalization, she committed suicide in the big villa where she lived while holding a written consent of “Organ Transplant donor”.\n\nThis incident shocked the entire network. Everyone was saying how Su Ran didn’t hesitate to sacrifice her life to save her husband.\n\nCountless netizens left a message on Su Ran’s social media account that had been idle for three years, such as: “I’m so moved”, “May you rest in peace”, “ I Believe in love again”\n\n……… Nonsense! She just had enough of that kind of life, and she didn’t want to unexpectedly see that nauseating old man again!\n\n——– Opening her eyes again, the scene in front of Su Ran had changed from the ice-cold villa to a vibrant campus.\n\nHold on! The man in front of her looked like he was dressed by his mom yet was so handsome he could incur the wrath of men and gods, but why did he look kind of familiar?!>"
}