{
	"url": "https://www.novelupdates.com/series/after-transmigrating-into-a-book-i-have-an-entire-family-of-cannon-fodder/",
	"title": "After Transmigrating into a Book, I Have an Entire Family of Cannon Fodder - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/12/After-Transmigrating-into-a-Book-I-Have-an-Entire-Family-of-Cannon-Fodder.jpeg",
	"noveltype": "(CN)",
	"genre": "Comedy   Romance   Shounen Ai   ",
	"tags": "Acting   Celebrities   Dense Protagonist   Doting Love Interests   Doting Older Siblings   Doting Parents   Familial Love   First Love   Handsome Male Lead   Hard-Working Protagonist   Modern Day   Movies   Multiple Reincarnated Individuals   Multiple Transported Individuals   Past Plays a Big Role   Previous Life Talent   Showbiz   Transmigration   Wealthy Characters   ",
	"rating": "(4.0 / 5.0, 115 votes)",
	"author": "Wu Ren Tangyuan   五仁汤圆   ",
	"year": "\n2020",
	"ranking": "#2463   #3209   #2347   #3678   #1511   ",
	"reviewcount": "21 Reviews sorted by",
	"description": "When Qi Xingchen transmigrated, he transmigrated into a fiction book set in the entertainment industry as cannon fodder and was lucky enough to have an entire family of cannon fodder.\n\nThe kind of cannon fodder whose names would only appear once on their tombstone and were all eventually killed off by the male protagonist.\n\nWith regards to this, Qi Xingchen understands that what goes around comes around. He only prays to go through the entire plotline such that he can return to the real world.\n\nBut when he understands his family’s style ↓↓↓\n\nCF (cannon fodder) Dad: I bought a private airplane for you, it’s currently at the apron beside our family’s mine. Is that enough for you to play around for half a month?\n\nCF older brother: Here’s a Hollywood co-production film and the hottest IP drama of the year. Pick one of the two.\n\nCF younger brother: (Pressing the head of a paparazzi into mud water) Heh, dare to secretly take pictures of my older brother, and I’ll let you see the 3 am sun at the crematorium!\n\nCF childhood friend: Xingxing’s graduation project was ridiculed by the entire internet? Teaching assistant, send some of my patented projects over to him to play with.\n\nHence, the Qi Xingchen who was never spoiled before waved his hands in tears: Isn’t it just killing off the popular male protagonist? All of you, don’t seek your deaths, let me do it instead!>"
}