{
	"url": "https://www.novelupdates.com/series/the-ultimate-heel-heals-everything-repairing-trash-into-rare-items/",
	"title": "The Ultimate Heel Heals Everything! ~ Repairing Trash Into Rare Items! - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/07/The-Ultimate-Heel-Heals-Everything-Repairing-Trash-Into-Rare-Items.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Harem   Slice of Life   ",
	"tags": "Adapted to Manga   Caring Protagonist   Fantasy World   Game Elements   Healers   Male Protagonist   R-15   Underestimated Protagonist   ",
	"rating": "(3.3 / 5.0, 4 votes)",
	"author": "Fuji Nanarou   藤七郎   ",
	"year": "\n2020",
	"ranking": "#6970   #4868   #12059   #4324   #11256   ",
	"reviewcount": "No Reviews",
	"description": "Lars, an orphan, was seriously injured when he was a child. His life was saved by a Healer. Since then he worked hard to train in Healing magic. Even when there were no people or livestock to cure, he practiced Healing against trees and rocks.\r\n\r\nHowever, Lars, whose vocation was [Unemployed], could only use the lowest level heals no matter how much he practiced, and even those heals would not activate unless he physically touched the target. You can't even be a healer for an adventuring party if you can't heal them on the fly in battle.\r\n\r\nAlso, he couldn't learn swordsmanship, magic, hunting, or farming. Eventually, at the age of 17, he was expelled from the village as useless when an intermediate level healer arrived.\r\n\r\nLars went out into the city looking for a place to live. He noticed that unlike the village, people threw away lots of items that were strewn about as garbage. He had an idea: Perhaps it would be profitable to pick up broken swords, rusted armour etc., repair them with 'Heal' and sell them?\r\n\r\nSo Lars picked up trash here and there, fixed it up just like new and sold it. For some reason all the items he picked up were high-quality items, so he made a lot of money.\r\n\r\nBut Lars was unaware: Whenever he fixed up weapons and armor, it acquired excellent unique bonuses such as [Attack Speed Increase: Large] and [Fire Resistance: Maximum]. Although it was regarded by people around him as impossible magic, he continued to misunderstand that the trash he picked up was luckily high-class stuff.\r\n\r\nThus he established his own shop and thrived, and he became the hero of the city with just 'Heal'.>"
}