{
	"url": "https://www.novelupdates.com/series/i-became-my-sons-first-love/",
	"title": "I Became My Son’s First Love - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/12/I-Became-My-Sons-First-Love.jpg",
	"noveltype": "(KR)",
	"genre": "Adult   Fantasy   Romance   Smut   ",
	"tags": "Abandoned Children   Aristocracy   Arrogant Characters   Beautiful Female Lead   Betrayal   Caring Protagonist   Charming Protagonist   Complex Family Relationships   Couple Growth   Cruel Characters   Demon Lord   Demons   Devoted Love Interests   Divorce   Doting Love Interests   Engagement   European Ambience   Family   Female Protagonist   First-time Interc**rse   Forced into a Relationship   Forced Living Arrangements   Forced Marriage   Handsome Male Lead   Heartwarming   Honest Protagonist   Kind Love Interests   Kingdoms   Love at First Sight   Marriage   Nobles   Past Plays a Big Role   Persistent Love Interests   Polite Protagonist   Popular Love Interests   R-18   Royalty   Strong Love Interests   Unconditional Love   Wealthy Characters   Younger Love Interests   ",
	"rating": "(3.2 / 5.0, 34 votes)",
	"author": "Bubllea   ",
	"year": "\n2021",
	"ranking": "#2000   #2000   #9928   #9321   #7464   ",
	"reviewcount": "No Reviews",
	"description": "Eve Jenna, a poor rural noblewoman who had only beauty and a sense of reality, becomes the fourth Countess of the Hound County, aiming for the monthly cost of maintaining noble dignity.\n\nIn the third year of her marriage, which was full of stability even without love, her husband suddenly asked for a divorce. And on the same night, her husband’s first son, Azazel, who hated her, came to visit,\n\n“What do you think about marrying me?”\n\nwith an absurd proposal and without the slightest smile on his face.\n\n“Azazel, I know I was a mother you don't like. But you don’t have to make fun of me like this.”\n\n“I’ve always wanted to shove mine in your place.”\n\n“What……”\n\n“What do you mean by a mother? That’s ridiculous. What son would think of his mother like this?”\n\nAfter the end of the contract marriage, the things that followed were a series of things that Eve had never expected.>"
}