{
	"url": "https://www.novelupdates.com/series/the-comeback-of-the-interstellar-billionaire/",
	"title": "The Comeback of the Interstellar Billionaire - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/08/The-Comeback-of-the-Interstellar-Billionaire_1629717249.jpg",
	"noveltype": "(CN)",
	"genre": "Fantasy   Mecha   Sci-fi   Yaoi   ",
	"tags": "Adopted Protagonist   Businessmen   Character Growth   Childcare   Complex Family Relationships   Cute Children   Doting Older Siblings   Doting Parents   Genius Protagonist   Heartwarming   Hidden Abilities   Hiding True Identity   Love Triangles   Lovers Reunited   Manly Gay Couple   Mismatched Couple   Misunderstandings   Mpreg   Mysterious Family Background   Poor to Rich   Power Struggle   Revenge   Schemes And Conspiracies   Second Chance   Smart Couple   Sudden Wealth   Time Skip   Transported to Another World   Unrequited Love   Wealthy Characters   ",
	"rating": "(3.2 / 5.0, 22 votes)",
	"author": "Ye Yiluo   叶忆落   ",
	"year": "\n2016",
	"ranking": "#6970   #4123   #7853   #9891   #8477   ",
	"reviewcount": "5 Reviews sorted by",
	"description": "As he had been repeatedly kidnapped, Fang Yun’an, the second young master of the Fang family of Watercloud Planet, changed his name to Lu Yunchu and grew up in a civilian family to hide his identity.\n\nFortunately, he fell in love with Qin Rui, the young master of the Qin family from Central Planet when he was in college. Unfortunately, Qin Rui thought Lu Yunchu’s family was mediocre and could not match with him, so he abandoned Lu Yunchu without mercy.\n\nWhen the two met again, Lu Yunchu was already living in a luxurious villa and driving an expensive star shuttle. Qin Rui couldn’t help but sigh, “Where did you get so much money?”\n\n“My sugar daddy is rich and willing to spend money for me.” Lu Yunchu showed Qin Rui the black-diamond gold card in his hand.\n\n“You are so shameless, being kept as mistress by another man!” Qin Rui angrily rebuked.\n\n“So what? Do you remember everyone around you thought I was so shameless to be kept as mistress by you in college? So why should I keep my face? You are really lifting me up.” Lu Yunchu shook the Château Lafite in his wine glass and said contemptuously.>"
}