{
	"url": "https://www.novelupdates.com/series/the-starting-point-of-raising-a-husband/",
	"title": "The Starting Point of Raising a Husband - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/06/The-Starting-Point-of-Raising-a-Husband.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Fantasy   Historical   Romance   ",
	"tags": "Ancient Times   Childcare   Doting Love Interests   Female Protagonist   Handsome Male Lead   Matriarchy   ",
	"rating": "(3.9 / 5.0, 14 votes)",
	"author": "卟许胡来   ",
	"year": "\n2021",
	"ranking": "#6970   #6382   #10366   #11528   #11235   ",
	"reviewcount": "1 Review sorted by",
	"description": "Shi Qing became cannon fodder in the book, and could see the countdown to her life every day, and learned that in the end her family would be ruined and she would be hung on the wall to dry.\r\n\r\nHer mother is a censor. After so many years of speaking straightforwardly in the court, Shi Qing had inherited her mother's mantle. After knowing the end, Shi Qing lived every day like she didn't want to live through tomorrow. \r\n\r\nThe newly appointed champion, the heroine of the book, said that Shi Qing was young, frivolous, and rude. Shi Qing instantly replied, 'I am two months, three days, and eight hours older than you! Respect the old and love the young. You are disrespectful and unfilial, how can you say that I am young, frivolous,s and rude??'\r\n\r\nThe son of the prime minister, the most beautiful man in the capital, said that Shi Qing had a small poison mouth. Shi Qing said, 'Oh, how can I compare to you, condolences for the grievances when you were young.'\r\n\r\nShi Qing's mouth was bad, and the whole capital was waiting for her to marry her husband. Later, she learned to restrain herself, and then her family married her a gentle and virtuous husband who is knowledgeable and reasonable. \r\n\r\nThe rumored gentle and virtuous husband who was good at embroidering peonies clasped his hand and clasped his fists. \r\n\r\nQing Jun, who was good-looking and full of energy said, 'Can the girl lend me two thousand silver taels, and I will pay you ten times when I become famous in the future!' \r\n\r\nShi Qing slowly lifted her eyelids and knocked melon seeds and asked, 'I have the final say in this family, I want you here. What do you do when you become famous?? Be honest and embroider peonies at home.' \r\n\r\nQing Jun, '???' \r\n\r\nLater, Shi Qing discovered that the longer she lived, the longer the bar was, and she even had better luck than male and female protagonists! \r\n(Life can be a little unsatisfactory, but the one who has unsatisfaction must not be me…)>"
}