{
	"url": "https://www.novelupdates.com/series/after-being-sacked-from-my-band-i-found-myself-10-years-in-the-past-to-redo-my-life-and-save-my-idol/",
	"title": "After Being Sacked From My Band, I Found Myself 10 Years in the Past To Redo My Life and Save My Idol - Novel Updates",
	"image": "https://www.novelupdates.com/img/noimagefound.jpg",
	"noveltype": "(JP)",
	"genre": "Romance   School Life   Slice of Life   Supernatural   ",
	"tags": "Bands   Beautiful Female Lead   Determined Protagonist   Male Protagonist   Modern Day   Music   Reincarnation   Second Chance   Singers   ",
	"rating": "(3.7 / 5.0, 13 votes)",
	"author": "水卜みう   ",
	"year": "\n2022",
	"ranking": "#5262   #4746   #9628   #10839   #10552   ",
	"reviewcount": "No Reviews",
	"description": "Tohru Shibakusa, 26 years old. The drummer for his rock band, Strange Chameleon, is kicked off the band as a condition for signing with a major record label. \n\nBetrayed by his friends after the record label forcibly kicked him out, Tohru drowns in the simple pleasure of alcohol. To help drown his sorrows, the songs of the popular artist, Shigure Narahara, play in the background. She happened to go to the same high school as Tohru. \n\nHowever, news broke that Shigure Narahara had jumped off from her apartment balcony. Unable to accept what had happened, Tohru finds himself in the same situation as Shigure, as he leaps from his own balcony.\n\nTohru’s eyes jump and he finds himself back in his parent’s home. He thought his suicidal leap was but a dream, but something felt off. \n\nTohru found himself 10 years in the past. \n\nAnd it is then that a thought crosses Tohru’s mind. \n\nIf things play out the same, the next 10 years will end up the same for Tohru. He’ll be kicked from his band and Shigure will commit suicide. \n\n“So maybe, just maybe, if I invite Shigure to join my band, we could erase the shitty ending destined for us.”\n\nThis is a story of re-doing my youth in order to save the future of a girl who holds nothing but despair.>"
}