{
	"url": "https://www.novelupdates.com/series/the-wealthy-psychic-lady-99-stolen-kisses/",
	"title": "The Wealthy Psychic Lady: 99 Stolen Kisses - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/03/99stolenkiss.jpg",
	"noveltype": "(CN)",
	"genre": "Josei   Romance   Supernatural   ",
	"tags": "Abusive Characters   Beautiful Female Lead   Cold Love Interests   Curses   Destiny   Detectives   Divination   Divorce   Fated Lovers   Female Protagonist   First Love   First-time Interc**rse   Flashbacks   Ghosts   Handsome Male Lead   Hard-Working Protagonist   Love Interest Falls in Love First   Lovers Reunited   Magic   Misunderstandings   Modern Day   Multiple Personalities   Multiple Reincarnated Individuals   Mysterious Family Background   Mysterious Past   Past Plays a Big Role   Politics   Poor to Rich   Pregnancy   Psychic Powers   Reincarnation   R*pe   Strong Love Interests   Weak to Strong   Wealthy Characters   ",
	"rating": "(2.3 / 5.0, 58 votes)",
	"author": "An Xiaoning   安小柠   ",
	"year": "\n2015",
	"ranking": "#2000   #2000   #5436   #9698   #7688   ",
	"reviewcount": "11 Reviews sorted by",
	"description": "After discovering about her wealthy husband's affair, she humiliates the adulterous pair on the streets and divorces him the very next morning. Just as everyone anticipates her downfall, she goes on to marry the most brilliant bachelor in the nation whom her unfaithful former husband cannot hold a candle to!\r\n\r\n'Aren't your mother's legs always hurting? It hasn't gotten any better despite seeking help from various doctors.'\r\n'How did you know that?'\r\n'Not only do I know why her legs hurt, I can also treat her condition.'\r\n'As long as you can treat my mother, I'll give you anything you want.'\r\n'I want money.'\r\n\r\nAfter An Xiaoning uses her psychic powers to break the curse of a poltergeist, she earns herself a fortune as well as a perfect man of her dreams.\r\n\r\nDon't be daunted by her psychic powers, for this book isn't terrifying at all!>"
}