{
	"url": "https://www.novelupdates.com/series/song-of-time-dusk-awakening-verse/",
	"title": "Song of Time – Dusk Awakening Verse - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/09/songoftime.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Comedy   Fantasy   ",
	"tags": "Fantasy World   Magic   Male Protagonist   ",
	"rating": "(2.8 / 5.0, 8 votes)",
	"author": "O苍白o   ",
	"year": "\nN/A",
	"ranking": "#6970   #2000   #12456   #11313   #11924   ",
	"reviewcount": "No Reviews",
	"description": "The events in Varlhun (维尔哈伦) are set in an urban fantasy world where magic permeates everyday life, from the age-old nation of Wong, bountiful in magic and energy resources and steeped in old traditions, to the floating city of Agnesa, a land filled with resourceful Alchemists who had revolutionized the world with its magic-infused equipment, vehicles, and weaponry. \n\nThe magic energy flowing in this world is able to collect and form into two embodiments: the Shimmering Flower (幻光花), which grows in waves in the fields of Wong, and the Saffrea gem (莎华宝石) used as currency in the greater parts of the world. \n\nThe hierarchy of the world is divided into three sects: the Chosen, humans who are highly receptive to the magical energies of the world and possess their own special brand of magical powers; the Fanatics, humans who are not receptive to magic but use the Saffrea to bestow upon them their powers; and the powerless, some of whom instead choose to divert their resourcefulness to become Alchemists, humans who dabble in the art of infusing magic to machinery.\n\nIn the current trajectory of the world, the continent of Varlhun has been split into four nations: Wong, the origin of it all; Agnesa, a nation built by Alchemists exiled from Wong; Fersares, a former colony of Agnesa, and Tarpaz, a democratic nation built by emigrants from Wong. Agnesa and Fersares are experiencing a detente coming down from the conclusion of the recent Agnesa-Fersares war, only stopped due to a disastrous explosion of magical energy eight years ago in one of Agnesa’s fort strongholds, Fort Arcadina. The result of this explosion is a space-time distortion in the surrounding area, creating an area that seems to be perpetually enveloped in darkness and that has become teeming with unknown monsters. To combat this, the nation of Fersares has set up a number of Guilds, the growth of which is unprecedented and that has now established bases in the other nations of Agnesa and Wong. Meanwhile, the looming energy shortage in Agnesa and the avarice of power in Tarpaz bring a foreboding to the stability of the continent…\n\nThe story follows closely six perspectives: Vyrut Chrono, the young commander of a special secret Tarpazian squad, Shun Oldwin, the Crown Prince of Wong who seeks answers to events that had led to his sister Miyo’s amnesia, Rhea Turner and Yuno Asker, two Agnesian heirs who seek answers to the downfall of their close relatives in Fort Arcadina, Gloria Vella and Emon J, two Fersarian mercenaries, and Gian Lannal, a Tarpazian exchange student to Wong who’s managed to embroil himself in the tangle of stories.>"
}