{
	"url": "https://www.novelupdates.com/series/mr-zhou-doesnt-want-to-work-hard-anymore/",
	"title": "Mr. Zhou Doesn’t Want to Work Hard Anymore! - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/11/a29OQx.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Romance   Shounen Ai   Yaoi   ",
	"tags": "Acting   Cute Protagonist   Cute Story   Doting Love Interests   Doting Older Siblings   Doting Parents   Handsome Male Lead   Lazy Protagonist   Love Interest Falls in Love First   Mob Protagonist   Multiple Reincarnated Individuals   Reincarnation   Showbiz   Transmigration   Wealthy Characters   ",
	"rating": "(4.3 / 5.0, 111 votes)",
	"author": "墨钱桃花   ",
	"year": "\n2020",
	"ranking": "#1021   #3314   #2850   #3678   #1917   ",
	"reviewcount": "21 Reviews sorted by",
	"description": "Zhou Chenxi was reborn due to an accident. He found himself as a supporting character in a book. In his previous life, he gave up his family’s inheritance in order to pursue his dream in showbiz business, but in the end, all his efforts were for others.\n\nZhou Chenxi lost his dream and let out a cry of a salted fish,”I don’t want to work hard anymore!” \n\nWhen he returned to inherit the family business, his agent kept coming to his door. \n\nAgent: ” Are there any variety shows you want to be a part of?” \n\nThe paralyzed salted fish Zhou Chenxi: “No. Don’t wanna.” The spots are all for the main characters anyway.\n\n“Do you want to take the XX shampoo endorsement?”\n\n“No, don’t take it.” It will end up with the protagonist’s signature printed on it anyway. \n\n“How about a TV series invested by Director Lu of Lu’s Group?”\n\n“No….Wait, wait!” \n\nZhou Chenxi sat up. He remembered this drama, the main character had missed it in his last life because of his schedule but in the end this drama unexpectedly had a small explosion. It was the only chance without the main character involved, Zhou Chenxi turned over from being the salted fish and decided to make one last effort.\n\nLittle did he know that he would become famous with this drama. Fans dug up a video of Zhou Chenxi wearing ten dollar slippers, squatting on the side of the road eating pancakes and shouting “I don’t want to work hard anymore” Therefore expressed their heartfelt concern for the boy.\n\nBefore filming, Zhou Chenxi quietly posted on his wei bo: [If I don’t get ‘famous’ again, I’ll really have to go back and live with my millions family for the rest of my life.]\n\nFans thought Zhou Chenxi was joking and said they would ‘top up’ for him and buy up all his endorsements, only Mr. Lu quietly @ him.\n\n[@周晨兮(Zhou Chenxi) Can I apply to be your billions family fortune?]\nThen the hot search exploded. >"
}