{
	"url": "https://www.novelupdates.com/series/when-the-foolish-gong-lost-his-memories/",
	"title": "When The Foolish Gong Lost His Memories - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/06/When-The-Foolish-Gong-Lost-His-Memories.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Romance   Slice of Life   Yaoi   ",
	"tags": "Amnesia   Calm Protagonist   Character Growth   Childhood Friends   Clumsy Love Interests   Cold Protagonist   Couple Growth   Enemies Become Lovers   Handsome Male Lead   Love Interest Falls in Love First   Love Rivals   Marriage   Mature Protagonist   Modern Day   Multiple POV   Persistent Love Interests   Wealthy Characters   ",
	"rating": "(4.1 / 5.0, 20 votes)",
	"author": "多金少女猫   ",
	"year": "\n2022",
	"ranking": "#2000   #2000   #10040   #7461   #9761   ",
	"reviewcount": "1 Review sorted by",
	"description": "To elope with Jiang Wangshu, the wealthy young master, Duan Xiuze, stole his household registration book and ran away from home. After marriage, he plucked the stars from the sky, held them in his palms and gave them all to Jiang Wangshu.\n\nBut alas, the good times didn’t last long. Duan Xiuze had a car accident and lost his memory. All that’s left was the time from when he was 17, back when he and Jiang Wangshu were still bitter enemies.\n\nJiang Wangshu thought it’d be fine if he lost his memory. He was confident in making the other party fall in love with him again.\n\nHowever, Duan Xiuze found him immediately after he was discharged and wanted to divorce him. He threatened by saying, “The 23-year-old Duan Xiuze must’ve been bewildered by Gu to marry you. Aren’t I just a pure and innocent high schooler?”\n\nJiang Wang scoffed and agreed to the divorce on the spot. “Friendly reminder, we signed a prenup. You have to leave everything if you want to file for a divorce.”\n\nDuan Xiuze was dumbstruck — What the hell? Is he out of his mind?\n\nBut for the sake of his innocence, he gritted his teeth and left.\n\nAfter the divorce, Jiang Wangshu received a huge sum of money, he was even followed by a small fresh meat. That day, he gave the little wolfdog a private birthday party. He was so comfortable, he completely forgot he had an ex-husband.\n\nDuan Xiuze returned to freedom and was so happy, he set off fireworks at his door for three days straight.\n\nWhen asked if he would regret it, he said with a serious face, “I have a deep-rooted hatred for Jiang Wangshu. At the age of seven, I vowed that I would never shake hands nor make peace with him. Ever.”\n\nWhen this remark reached Jiang Wangshu’s ears, he sneered and sent a message asking, “Deep-rooted hatred? For exposing that you wet your bed?”\n\nDuan Xiuze was so angry, he broke his phone. He really hated Jiang Wangshu. He swore he’d never regret his divorce in his life.\n\nLater, Duan Xiuze’s search history gradually increased ——\n\n“How can I cut off my ex-husband’s peach blossoms without appearing like I want him back?”\n\n“Is a man’s self-esteem important?”\n\n…\n\n“How to win the heart of a prodigal ex-husband?”\n\n“What kind of washboard is comfortable to kneel on?”>"
}