{
	"url": "https://www.novelupdates.com/series/unprecedented-pill-refiner-entitled-ninth-young-lady/",
	"title": "Unprecedented Pill Refiner: Entitled Ninth Young Lady - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2018/04/cb_58f4bd0b422ff.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Comedy   Fantasy   Josei   Martial Arts   Romance   Xuanhuan   ",
	"tags": "Academy   Adapted to Manhua   Alchemy   Artifacts   Beast Companions   Black Belly   Character Growth   Clever Protagonist   Cultivation   Cunning Protagonist   Demons   Devoted Love Interests   Doctors   Dragons   Female Protagonist   Friendship   Genius Protagonist   Gods   Handsome Male Lead   Heavenly Tribulation   Hiding True Identity   Immortals   Kingdom Building   Love Interest Falls in Love First   Magic   Monsters   Mythical Beasts   Overpowered Protagonist   Pill Concocting   Politics   Power Couple   Protagonist Strong from the Start   Shameless Protagonist   Slow Romance   Special Abilities   Strong Love Interests   Strong to Stronger   Transmigration   Transported to Another World   Underestimated Protagonist   Vampires   Wealthy Characters   ",
	"rating": "(4.4 / 5.0, 440 votes)",
	"author": "North Night   夜北   ",
	"year": "\n2016",
	"ranking": "#3923   #2000   #664   #2348   #542   ",
	"reviewcount": "52 Reviews sorted by",
	"description": "She is the twenty-fourth century’s strongest immortal cultivator, but transferred into a world of magic where demons roamed rampant; a punching bag tyrannized and ostracized by her clan on one side while the scum of a man that is her fiancé humiliated, trampled her on the other side…\r\n\r\nWant to ravage her? She laughs as she will soon teach them how to behave themselves!\r\n\r\nMagic is amazing? Her Five Lightning’s Bombardment Talisman will turn you into ashes! Medication is very incredible? With one furnace of medicinal pills, useless can also become genius! A vigorous army of a million is very ferocious? With Scattering Beansprout Soldiers, all of you can slowly play!\r\n\r\nSmilingly watching as those who court death act vilely without salvation. Those who submit to me prosper, those who oppose me, perish!\r\n\r\nOnly… For what reason does this Grandmaster whose face is as beautiful as a flower, when facing her, always “secretly casts passionate glances”?\r\n\r\nA certain Grandmaster: “After sleeping for so long, now you don’t acknowledge”?>"
}