{
	"url": "https://www.novelupdates.com/series/pet-addiction-the-princes-desire-to-spoil-his-pet/",
	"title": "Pet Addiction: The Prince’s Desire to Spoil His Pet - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/04/princes-desire-to.png",
	"noveltype": "(CN)",
	"genre": "Drama   Historical   Josei   Psychological   Romance   School Life   ",
	"tags": "Ancient China   Beautiful Female Lead   Betrayal   Childcare   Childhood Love   Complex Family Relationships   Couple Growth   Doting Love Interests   First Love   First-time Interc**rse   Forced into a Relationship   Forced Marriage   Friendship   Handsome Male Lead   Heartwarming   Interconnected Storylines   Jealousy   Long Separations   Love at First Sight   Love Rivals   Loyal Subordinates   Master-Servant Relationship   Merchants   Military   Misunderstandings   Multiple Protagonists   Mysterious Past   Older Love Interests   Orphans   Past Trauma   Pets   Possessive Characters   Pregnancy   Royalty   S*xual Abuse   S*ave Protagonist   Slow Romance   Student-Teacher Relationship   Twisted Personality   Unconditional Love   Wars   ",
	"rating": "(3.2 / 5.0, 77 votes)",
	"author": "Mo Touxi   ",
	"year": "\n2017",
	"ranking": "#2000   #2000   #2778   #1263   #3862   ",
	"reviewcount": "16 Reviews sorted by",
	"description": "'Can you be useful to me?'\n\n'I... I can be...'\n\nThe first time they met, she knelt trembling before him, begging for shelter. The slave caught his interest, and he brought her back to his palace.\n\nShe could've never imagined that in one night she'd go from a spoiled little slave princess of a defeated kingdom, to becoming a powerful prince's pet.\n\nHe kept her by his side... spoiled her, cared for her, loved her, and gave her meticulous care and high status. Whatever she wished... she could do so under his name.\n\nBut, she angered him and chose to run away. He captured her within a day.\n\n'Don't forget, my little dearest, everything I have given you can be taken back...'\n\nIn a spur of anger, she hit him, her feeble hands striking against the flesh of his cheek. Gnashing her teeth in anger, she said, 'Do you have the ability to take my child back?!'>"
}