{
	"url": "https://www.novelupdates.com/series/the-delicate-lady-coroner/",
	"title": "The Delicate Lady Coroner - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/09/The-Delicate-Lady-Coroner.jpg",
	"noveltype": "(CN)",
	"genre": "Historical   Mystery   Romance   ",
	"tags": "Ancient China   Aristocracy   Calm Protagonist   Episodic   Female Protagonist   Love Interest Falls in Love First   Mystery Solving   Strong Love Interests   ",
	"rating": "(4.1 / 5.0, 30 votes)",
	"author": "薄月栖烟   ",
	"year": "\n2020",
	"ranking": "#3802   #3870   #7277   #7363   #7265   ",
	"reviewcount": "2 Reviews sorted by",
	"description": "Female Lead’s Perspective:\n\nAt five years old, Bó Ruò Yōu’s parents passed away. Her uncles looked for a Taoist Priest to divine her fate. Apparently, she was a woman who brought ill luck to her family and jinxed her father and mother, and it was asserted that she would die young, unable to live past the age of eighteen.\n\nUnder the banner of changing her fate, her uncles chased her out of the family door.\n\nAfter she departed, her assets were seized, and her marriage contract was taken away. They wrested away everything, only waiting for her to die at eighteen.  \n\nThey waited and waited, but before Bó Ruò Yōu even reached eighteen, what awaited them was how she used her corpse dissecting and bone examining skills to shake Jiangnan.\n\nThe influential and the nobility invited her to make the dead speak, the princes and marquises entreated her to redress an injustice for the living.\n\nAnd behind her, also stood a man that could strike terror in the entirety of the Great Zhou Dynasty.\n\nMale Lead’s Perspective:\n\nWielding the Embroidered Emissaries above, Assuming the Court of Punishments below.\n\nThe ruthless and intractable Huò Wēi Lóu had the power to subvert the courts and commons, but he snorted disdainfully at female charms.\n\nHence, on their first encounter, even if Bó Ruò Yōu came from an official family and possessed a matchless countenance, he still detested it like a worn-out shoe.\n\nLater, after seeing her long, slender, and fair hands examining a female corpse in red robes, breaking past her ghosts and seizing back her life, clearing up the long-standing injustices of the past…\n\nHuò Wēi Lóu: Truly fragrant, truly and genuinely fragrant!>"
}