{
	"url": "https://www.novelupdates.com/series/the-prince-can-always-hear-the-secret-servant-chanting-the-qingxin-mantra-before-going-to-bed/",
	"title": "The Prince Can Always Hear The Secret Servant Chanting The Qingxin Mantra Before Going To Bed - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/05/The-Prince-Can-Always-Hear-The-Secret-Servant-Chanting-The-Qingxin-Mantra-Before-Going-To-Bed.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Drama   Fantasy   Horror   Martial Arts   Romance   Supernatural   Yaoi   ",
	"tags": "Amnesia   Ancient China   Ancient Times   Daoism   Demons   Handsome Male Lead   Hidden Abilities   Identity Crisis   Manly Gay Couple   Monsters   Mysterious Past   Mythical Beasts   Mythology   Past Plays a Big Role   Reincarnation   Royalty   R*pe   Schemes And Conspiracies   Secret Identity   Tragic Past   ",
	"rating": "(4.1 / 5.0, 54 votes)",
	"author": "Yi Yi Yi Yi   伊依以翼   ",
	"year": "\n2019",
	"ranking": "#2132   #3594   #5219   #4831   #3984   ",
	"reviewcount": "2 Reviews sorted by",
	"description": "Qi Ci was persecuted, sold into a brothel, humiliated and beaten. To put it even worse, he was poisoned with a Gu worm, and if he didn’t had sex, he would be dead by the next morning.\n\nHis fate was so miserable!\n\nHowever, under such a miserable circumstance, he met Bian Zhonghua.\n\nOnce they became acquaintances with each other, and Bian Zhonghua helped Qi Ci with the Gu worm, Bian Zhonghua accidentally found out that the young man he met by chance, was in fact, a Prince who was exiled years ago!\n\nSo, Bian Zhonghua helped Qi Ci become the Prince, and naturally, he became his Secret Servant. However, it’s hard to just be his Secret Servant, ah.\n\nOn the first night, Bian Zhonghua recited the Qingxin mantra a thousand times. On the second night, he copied the Pranja Sutra a thousand times. On the third night, Bian Zhonghua…. Bian Zhonghua was losing his mind!\n\nDamn it! There’s nothing else he can use to eradicate this desire?!\n\nOn the other hand, Qi Ci felt like he was losing his mind as well!\n\nGod damn it! F*cking restrain yourself!!!>"
}