{
	"url": "https://www.novelupdates.com/series/he-has-a-sickness-that-needs-to-be-cured/",
	"title": "He Has a Sickness that Needs to be Cured - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/03/He-Has-a-Sickness-that-Needs-to-be-Cured.jpg",
	"noveltype": "(CN)",
	"genre": "Drama   Fantasy   Romance   Shounen Ai   Supernatural   Xuanhuan   ",
	"tags": "Bloodlines   Clingy Lover   Comedic Undertone   Cultivation   Demons   Depression   Devoted Love Interests   Dragons   Elves   Enemies Become Lovers   Fantasy Creatures   Fantasy World   Handsome Male Lead   Human-Nonhuman Relationship   Kidnappings   Love Interest Falls in Love First   Lovers Reunited   Magic   Multiple Reincarnated Individuals   Omegaverse   Sickly Characters   System Administrator   Transmigration   Vampires   World Hopping   ",
	"rating": "(3.9 / 5.0, 91 votes)",
	"author": "六等星之夜   ",
	"year": "\n2020",
	"ranking": "#515   #406   #1588   #604   #2520   ",
	"reviewcount": "17 Reviews sorted by",
	"description": "Xi Ning was punished for something he did. As his punishment, he had to go into different worlds to complete missions, which includes fixing bugs that would cause the plot to shift.\n\nHis mission targets include [a person that never existed in the original plot], [a supporting character who had suddenly had a breakdown], [the villain who suddenly killed the protagonist], etc. As a punishment for his wrongdoing, he was reborn into…\n\nAn omega young master who is suffering from [anorexia].\n\nThe emperor’s son who has [skin hunger].\n\nA beautiful young vampire with [mania].\n\nA little mermaid with [aphasia]\n\nA forest elf suffering from [depression]\n\n…\n\nSystem: Host, good luck! You can do it!\n\nXi Ning: …\n\nFortunately for him, there is a way to alleviate his illness. There is an “antidote” for him in each world. Xi Ning had always adhered to his principle of [a tool would be useless if it’s not used], but the direction of the plot suddenly took a twist…\n\n——A delicate and graceful omega from a noble family tugged on his silent classmate who is from a poor family. He refused to let go and said, “I want to eat the meal you brought. You have to feed me.”\n\n——The crown prince of the world of immortals descended from the Azure Dragon. One day, he suddenly brought back a low-level demon. With his eyes filled with glistening tears, he said to the low-level demon, “Can you hug me and stroke my dragon horns again?”\n\n——A beautiful but dangerous vampire caught a sickly young man. He sniffed the beautiful pale neck of the young man in front of him and licked his fangs. He threatened the man, “If you don’t let me take a bite, I’ll kill you.”\n\n——The little mermaid who disliked talking was abducted by a group of interstellar pirates. When he met the cruel and vicious pirate leader, he whined coquettishly, “Give me a bite of the cake and I’ll sing for you.”\n\n——The beautiful elf, who symbolized peace and life, was depressed. He tightly embraced the infamous and wicked dark magician. The beautiful elf sobbed, “Please don’t go. I need you.”>"
}