{
	"url": "https://www.novelupdates.com/series/i-left-the-time-limited-villainous-duke-without-saving-him/",
	"title": "I Left the Time-limited Villainous Duke Without Saving Him - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/10/I-left-the-timelimited-villainous-duke-without-saving-him.jpeg",
	"noveltype": "(KR)",
	"genre": "Comedy   Fantasy   Romance   ",
	"tags": "Character Growth   Charismatic Protagonist   Charming Protagonist   Childcare   Cold Protagonist   Different Social Status   Female Protagonist   Glasses-wearing Love Interests   Handsome Male Lead   Jealousy   Love Triangles   Maids   Nobles   Possessive Characters   Reincarnation   Rivalry   Royalty   Servants   Unrequited Love   ",
	"rating": "(4.2 / 5.0, 32 votes)",
	"author": "모조조조   ",
	"year": "\n2021",
	"ranking": "#3633   #3728   #7674   #12113   #5771   ",
	"reviewcount": "3 Reviews sorted by",
	"description": "It was when I was 10 years old in my second life. I found the young duke that the female protagonist should have saved.\r\n\r\nIn these villains and extras' novels, it is the standard to help, whether it is the female lead, male lead, or villain.\r\n\r\nI know the original, too, since it's like this, should I try to seduce the duke to avoid the death flag?\r\n\r\nBut in the original story, the female lead said something to him.\r\n\r\n‘I like the Duke as he is.’\r\n\r\nHearing this, this guy came to me in the middle of the night while covered in blood.\r\n\r\n‘You said you like me the way I am. I love you too, you will never… You won't leave me, right?’\r\n\r\nPhew, you're hopeless.\r\n\r\nJust die.\r\n\r\nRather than saving the young duke, I decided to break the plot and run away.\r\n\r\nBut...\r\n\r\n'You're a kid with no blood or tears'.\r\n\r\n'Argh! I'm sorry!'\r\n\r\n*\r\n\r\n'Where else are you going to disappear and hide?'\r\n\r\n'……….”\r\n\r\n“I tell you, no matter where you hide on this damned empire, there's nowhere I can't find you.”\r\n\r\nThe Duke said, but it was not scary at all when he threatened me with such an insecure and desperate face.\r\n>"
}