{
	"url": "https://www.novelupdates.com/series/his-highness-the-crown-prince-knelt-and-begged-please-dont-abandon-our-engagement-my-poor-fiance-had-his-throne-robbed-by-his-younger-brother-but-even-if-were-exiled-to-the-f/",
	"title": "His Highness the Crown Prince Knelt and Begged, “Please Don’t Abandon our Engagement!” ~My Poor Fiancé had his Throne Robbed by his Younger Brother, but Even if We’re Exiled to the Frontier, We’ll Live Happily!~ - Novel Updates",
	"image": "https://www.novelupdates.com/img/noimagefound.jpg",
	"noveltype": "(JP)",
	"genre": "Fantasy   Josei   Romance   Slice of Life   ",
	"tags": "Arranged Marriage   Domestic Affairs   Engagement   European Ambience   Female Protagonist   Nobles   Royalty   ",
	"rating": "(4.0 / 5.0, 22 votes)",
	"author": "Karui Hiroshi   軽井広   ",
	"year": "\n2021",
	"ranking": "#2642   #1442   #5360   #10063   #6193   ",
	"reviewcount": "3 Reviews sorted by",
	"description": "The timid Duke’s daughter, Alisa, was an instrument to a political marriage. As such, she was raised to become the fiancée of the crown prince.\n\nAt the royal academy’s graduation party, she was suddenly summoned by the crown prince. Alisa, who was unconfident, was frightened.\n\n“Is our engagement going to be annulled?”\n\nBut it was the exact opposite.\n\nThe crown prince kneeled and pleaded—\n\n“—Please don’t abandon our engagement!”\n\nIt seemed that the crown prince was going to be deprived of his right to succeed the throne by his much more talented younger brother, the second prince, and would be reduced into a territory lord.\n\nBecause of that, the crown prince came to conclude he was going to be abandoned by Alisa. Alisa realized that she was actually deeply loved by the crown prince and made a decision.\n\nShe said, “Even if everyone else abandons you, I alone won’t.”\n\nAlisa, along with the crown prince, led a newlywed, leisure, life in the remote territory where they loved each other.\n\nEventually, their territory became prosperous enough to overwhelm the royal family.>"
}