{
	"url": "https://www.novelupdates.com/series/received-a-wife-from-the-civil-affairs-bureau/",
	"title": "Received a Wife From the Civil Affairs Bureau - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/02/civil-affairs.png",
	"noveltype": "(CN)",
	"genre": "Drama   Mature   Romance   Slice of Life   Yuri   ",
	"tags": "Beautiful Female Lead   Blind Dates   Carefree Protagonist   Cute Children   Devoted Love Interests   Female Protagonist   First Love   Heartwarming   Hiding True Identity   Love at First Sight   Manipulative Characters   Marriage   Modern Day   Pregnancy   Protagonist Falls in Love First   Slow Romance   ",
	"rating": "(4.4 / 5.0, 127 votes)",
	"author": "Báiniànjūn   白念君   ",
	"year": "\n2018",
	"ranking": "#2773   #6308   #3955   #3400   #4261   ",
	"reviewcount": "21 Reviews sorted by",
	"description": "A 28 year old single dog, Jiang Ziquan, ran a hot pot restaurant for a living and designed houses for a hobby. However, as the proverb says, when one is fed and warm, one’s sexual desire ******.  The worrywart Jiang Ziquan’s only wish for her 28th birthday is a shy and coy lover. The heavens seemed to have heard her wish and treated her well, for she only had to pass through the Bureau of Civil Affairs and brought back a fair-skinned, beautiful wife. Sure enough, only the state can provide such beautiful ladies!\n\nSimilarly, the 28 year old Shen Yumo suddenly found out on her wedding day that her fiance had a three year old child! She originally wanted to avoid the whole fiasco and walk away, but ended up getting tricked by Jiang Ziquan into signing a marriage certificate. \n\n“I heard your wife was given to you by the Civil Affairs Bureau? How did this happen?” \n\nJiang Ziquan lifted her eyes, held up that shiny red book and replied, “It must be because of my good deeds and virtuous daily life that the state gave me one! Therefore you regular mortals,” she shrugs her shoulders, “I reckon will never receive one!”\n\nEveryone: “Isn’t it just some good deeds?! We can do the same by donating some money! Hmph!”\n\nA “love after the marriage” type of story featuring two women.>"
}