{
	"url": "https://www.novelupdates.com/series/dont-pick-up-boyfriends-from-the-trash-bin/",
	"title": "Don’t Pick Up Boyfriends From the Trash Bin - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/02/Dont-Pick-Up-Boyfriends-From-the-Trash-Bin.jpg",
	"noveltype": "(CN)",
	"genre": "Adventure   Comedy   Drama   Mature   Psychological   Romance   Sci-fi   Shounen Ai   ",
	"tags": "Abusive Characters   Acting   Adapted to Drama CD   Adapted to Manga   Alternate World   Amnesia   Apocalypse   Appearance Changes   Artificial Intelligence   Calm Protagonist   Childhood Friends   Clever Protagonist   Cunning Protagonist   Death of Loved Ones   Depictions of Cruelty   Devoted Love Interests   Doting Love Interests   Doting Older Siblings   Family Conflict   Ghosts   Love Interest Falls in Love First   Misunderstandings   Modern Day   Multiple Realms   Omegaverse   Parody   Past Plays a Big Role   Power Couple   Protagonist Strong from the Start   Racism   R*pe   Second Chance   Shameless Protagonist   Showbiz   Slow Romance   System Administrator   Tragic Past   Transmigration   World Hopping   ",
	"rating": "(4.7 / 5.0, 762 votes)",
	"author": "Qi Jing Nan Qu   Riding A Whale South   骑鲸南去   ",
	"year": "\n2018",
	"ranking": "#1768   #1568   #393   #1750   #120   ",
	"reviewcount": "162 Reviews",
	"description": "Chi Xiaochi: fourth-rate citizen at birth, three-time award-winning film emperor, second-rate temper, first-class looks.\n\nHe crawled his way out of hell on hard mode to become a winner at life.\n\nThen, he was smashed into a vegetative state by a chandelier.\n\n061: Hello, here’s a brief rundown on the scum gong reconditioning system. This system measures the regret level of the scum gong. Every time their regret level reaches one hundred points, you will be able to leave the current world. A friendly tip, usually, through dedication and self-sacrifice, our employees slowly foster a sense of dependency in the scum gongs, gradually making it so the scum gongs can’t live without them.\n\nChi Xiaochi: How many regret points is a complete loss of reputation and standing worth? How about a fall from grace? Or wanting something but never being able to obtain it?\n\n061: ……>"
}