{
	"url": "https://www.novelupdates.com/series/the-great-ruler/",
	"title": "The Great Ruler - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2018/05/tgr_eng_cover.png",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Fantasy   Martial Arts   School Life   Shounen   Xuanhuan   ",
	"tags": "Academy   Adapted to Anime   Adapted to Drama   Adapted to Manhua   Artifacts   Battle Academy   Beautiful Female Lead   Bloodlines   Body Tempering   Cold Love Interests   Confident Protagonist   Cultivation   Cunning Protagonist   Demon Lord   Demons   Devoted Love Interests   Dragons   Genius Protagonist   Handsome Male Lead   Heavenly Tribulation   Inheritance   Inscriptions   Legends   Lucky Protagonist   Magic Formations   Male Protagonist   Multiple Realms   Mysterious Family Background   Phoenixes   Revenge   Romantic Subplot   Ruthless Protagonist   Sealed Power   Strong Love Interests   Tsundere   Unique Cultivation Technique   Wars   Weak to Strong   World Travel   ",
	"rating": "(3.9 / 5.0, 614 votes)",
	"author": "Heavenly Silkworm Potato   Tian Can Tu Dou   天蚕土豆   ",
	"year": "\n2013\r\n",
	"ranking": "#6970   #2000   #101   #284   #245   ",
	"reviewcount": "49 Reviews sorted by",
	"description": "The Great Thousand World. It is a place where numerous planes intersect, a place where many clans live and a place where a group of lords assemble. The Heavenly Sovereigns appear one by one from the Lower Planes and they will all display a legend that others would desire as they pursue the road of being a ruler in this boundless world.\r\n\r\nIn the Endless Fire Territory that the Flame Emperor controls, thousands of fire blazes through the heavens.\r\n\r\nInside the Martial Realm, the power of the Martial Ancestor frightens the heaven and the earth.\r\n\r\nAt the West Heaven Temple, the might of the Emperor of a Hundred Battles is absolute.\r\n\r\nIn the Northern Desolate Hill, a place filled with thousands of graves, the Immortal Owner rules the world.\r\n\r\nA boy from the Northern Spiritual Realm comes out, riding on a Nine Netherworld Bird, as he charges into the brilliant and diverse world. Just who can rule over their destiny of their path on becoming a Great Ruler? In the Great Thousand World, many strive to become a Great Ruler.>"
}