{
	"url": "https://www.novelupdates.com/series/the-distinguished-cute-master/",
	"title": "The Distinguished Cute Master - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/03/images-9.jpeg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Comedy   Martial Arts   Romance   Xianxia   ",
	"tags": "Adapted to Manhua   Adopted Protagonist   Age Regression   Amnesia   Ancient Times   Apocalypse   Bickering Couple   Caring Protagonist   Character Growth   Child Protagonist   Childhood Love   Childish Protagonist   Clingy Lover   Complex Family Relationships   Cultivation   Cute Protagonist   Death of Loved Ones   Demonic Cultivation Technique   Divination   Divine Protection   Doting Love Interests   Family   Family Conflict   Female Protagonist   Handsome Male Lead   Loli   Love Interest Falls in Love First   Lovers Reunited   Male Yandere   Manipulative Characters   Master-Disciple Relationship   Misunderstandings   Multiple Protagonists   Mysterious Past   Mythical Beasts   Obsessive Love   Older Love Interests   Past Plays a Big Role   Pregnancy   Protagonist Strong from the Start   Resurrection   Royalty   Schemes And Conspiracies   Second Chance   S*xual Cultivation Technique   Shota   Shounen-Ai Subplot   Slow Romance   Strong to Stronger   Time Loop   Time Manipulation   Time Skip   Tragic Past   Transmigration   Unique Cultivation Technique   Unique Weapons   ",
	"rating": "(4.3 / 5.0, 123 votes)",
	"author": "Feng Yu Tianmu   风与天幕   ",
	"year": "\n2018",
	"ranking": "#3133   #4808   #1877   #9321   #1307   ",
	"reviewcount": "21 Reviews sorted by",
	"description": "If you transmigrate into a cultivation novel, you absolutely have to fight over opportunities with the protagonist! I can’t be Long Aotian, but I can be the female version of him!\n\nUnfortunately, as beautiful of a thought that was, our protagonist was still killed off as a boss by the male lead! Luckily, she reincarnated again and returned to when the male lead was a child! Seeing the little thing, bone thin with a vague hint of domineering flashing on his face, she had two choices:\n\n1. Kill him. See how he’s going to be so overpowered when he’s dead!\n\n2. Take care of him and honorably ask for something in return in the future!\n\nThinking of the treasures only the male lead could get to, the money crazy her chose to take care of him.\n\nBut who would have known that she would accidentally raise this cute and upright little boy into a black-bellied wolf! After he grew up, he used his treasures to seduce her!\n\n“Master, do you want it? Then why don’t you dual cultivate with your disciple?”\n\nMaster, with tears streaming down her face: If I had known I could get treasures by selling my body, why would I have been a boss in my last life!>"
}