{
	"url": "https://www.novelupdates.com/series/otherworldly-evil-monarch/",
	"title": "Otherworldly Evil Monarch - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2017/04/Otherworldly-Evil-Monarch.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Comedy   Ecchi   Fantasy   Harem   Martial Arts   Mature   Seinen   Supernatural   Xuanhuan   ",
	"tags": "Adapted to Manhua   Alchemy   Army Building   Arrogant Characters   Artifact Crafting   Artifacts   Assassins   Beautiful Female Lead   Bickering Couple   Chuunibyou   Cultivation   Cunning Protagonist   Death of Loved Ones   Depictions of Cruelty   Doctors   Drugs   Fast Cultivation   Gore   Handsome Male Lead   Heavenly Tribulation   Hiding True Abilities   Human-Nonhuman Relationship   Hypnotism   Immortals   Late Romance   Loli   Love Interest Falls in Love First   Magic Beasts   Magical Space   Male Protagonist   Marriage   Misunderstandings   Monsters   Nationalism   Nobles   Older Love Interests   Pill Concocting   Politics   Polygamy   Previous Life Talent   Quirky Characters   Racism   R*pe Victim Becomes Lover   Romantic Subplot   R*pe   Ruthless Protagonist   Shameless Protagonist   Strong Love Interests   Torture   Transmigration   Transported to Another World   Underestimated Protagonist   Unique Cultivation Technique   Unreliable Narrator   Wars   Weak to Strong   Younger Love Interests   ",
	"rating": "(3.9 / 5.0, 1435 votes)",
	"author": "Fengling Tianxia   风凌天下   ",
	"year": "\n2010",
	"ranking": "#2000   #6224   #62   #5347   #100   ",
	"reviewcount": "167 Reviews sorted by",
	"description": "Jun Xie was the number one assassin in modern earth. His skills and knowledge in the field of assassination were unparalleled, his accomplishments unprecedented, his reputation terrified the entire underworld. However, during a mission to retrieve a mystical treasure, a mishap occurred…\n\nHe is now Jun Moxie, a sixteen year old super level debauchee, sole heir to the declining Jun family. A family of valiant heroes, left with an old grandpa, a crippled uncle and a debauchee as the sole heir! Accepting the world’s criticism and cold stares with a smile, his new journey begins! His life will be carved by his own will! Rise to the top! Evil Monarch Jun Xie!\n\n“This cup I toast to those I’ve killed in my past life. Forgive me, for there is no chance for you to have revenge. Gulp!”\n\n“This cup I toast to those whose life I will take in my new life. Forgive me, for you are fated to die by my hands. Cheers!”>"
}