{
	"url": "https://www.novelupdates.com/series/villager-a-wants-to-save-the-villainess-no-matter-what/",
	"title": "Villager A Wants to Save the Villainess no Matter What! - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/03/Villager-A-Wants-to-Save-the-Villainess-no-Matter-What.jpg",
	"noveltype": "(JP)",
	"genre": "Adventure   Drama   Fantasy   Romance   School Life   Shounen   ",
	"tags": "Academy   Accelerated Growth   Adapted to Manga   Adventurers   Age Progression   Alchemy   Beautiful Female Lead   Betrayal   Brainwashing   Calm Protagonist   Cheats   Comedic Undertone   Cunning Protagonist   Devoted Love Interests   Different Social Status   Divine Protection   Dragons   Dungeons   Elves   Engagement   Fantasy Creatures   Fantasy World   Firearms   First-time Interc**rse   Game Elements   Gods   Guilds   Gunfighters   Hard-Working Protagonist   Hiding True Abilities   Kidnappings   Kind Love Interests   Kingdoms   Knights   Level System   Love Interest Falls in Love First   Male Protagonist   Manipulative Characters   Marriage   Mind Break   Mob Protagonist   Modern Knowledge   Money Grubber   Multiple POV   Multiple Reincarnated Individuals   Nobles   Otome Game   Politics   Poor to Rich   Pragmatic Protagonist   Previous Life Talent   Proactive Protagonist   R-15   Reincarnated in a Game World   Royalty   R*pe   Ruthless Protagonist   Saints   Schemes And Conspiracies   Special Abilities   Strong Love Interests   Sword And Magic   Time Skip   Unique Weapon User   Villainess Noble Girls   Wars   Weak to Strong   Witches   ",
	"rating": "(3.7 / 5.0, 333 votes)",
	"author": "Isshiki Koutarou   一色孝太郎   ",
	"year": "\n2020",
	"ranking": "#778   #1264   #601   #362   #1035   ",
	"reviewcount": "80 Reviews sorted by",
	"description": "Allen, an eight-year-old boy from a poor family in the royal capital, is living a poor but happy life together with his mother. One day, however, memories of his previous life suddenly come back to him and he remembers that he is in an dating sim game and that the capital will be destroyed by war if he doesn't do something about it.\r\n\r\nIf this continues, both he and his mother will be killed!\r\n\r\nWith a sense of urgency, he decides to rise to the occasion in order to save his precious mother's life and save his favorite character, the villainous young lady Anastasia, the only girl he liked in the game, from her all too tragic and ruinous end.\r\n\r\nThis is the story of a man who isn't even a character in the game, but who strives with his steely determination and uses all the knowledge he has to turn overcome fate!>"
}