{
	"url": "https://www.novelupdates.com/series/battle-through-the-heavens-prequel-the-legend-of-yao-lao/",
	"title": "Battle Through the Heavens Prequel – The Legend of Yao Lao - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2017/02/yao-load.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Fantasy   Martial Arts   Xuanhuan   ",
	"tags": "Adapted to Manhua   Alchemy   Cultivation   Male Protagonist   ",
	"rating": "(3.8 / 5.0, 72 votes)",
	"author": "Heavenly Silkworm Potato   Tian Can Tu Dou   天蚕土豆   ",
	"year": "\n2014",
	"ranking": "#2000   #2000   #6407   #6416   #5658   ",
	"reviewcount": "1 Review sorted by",
	"description": "This is the Dou Qi world, where the strong are respected and the weak are despised. The Yao clan is one of the eight ancient clans with a Dou Di's blood in their veins, and it is a holy land for alchemists. Follow Yao Chen, Xiao Yan's teacher, as he goes from his low position in the Yao clan to standing at the summit of the Dou Qi continent.\n\nLocated on the edge of the Dou Qi continent was the Yao clan descended from an ancient Dou Di. Not only was this place isolated from the Central Plains, it was also a breeding ground for poisonous insects and vicious beasts. But with the Yao clan's incredible strength and their exquisite alchemy, it became a holy land that was worshiped by alchemists. Born in a weak branch family, orphaned by his father at a young age, treated with indifference by the clan, and banished from the clan for false charges when he tried to display his talent. He experienced all kinds of trials and adventures, in the end gaining the title of the Central Plain's mainland number one alchemist. But because of his apprentice's betrayal, not even his bones remained...\n\nHow did Yao Chen go from a youngster in a weak branch of the Yao clan manage to reverse his fate to become the mainland's number one alchemist?\nWhat kind of encounters did he have after being banished from the Yao clan?\nFrom a lowly trash to the top of the mainland, just how many secrets are still hidden in Saint Yao's story?>"
}