{
	"url": "https://www.novelupdates.com/series/beware-mr-officer-tread-carefully/",
	"title": "Beware Mr. Officer, Tread Carefully! - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/06/bewaremrofficer1.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Comedy   Josei   Mystery   Romance   ",
	"tags": "Acting   Antihero Protagonist   Army   Arrogant Characters   Assassins   Battle Academy   Beautiful Female Lead   Bickering Couple   Boss-Subordinate Relationship   Calm Protagonist   Carefree Protagonist   Celebrities   Charismatic Protagonist   Charming Protagonist   Clever Protagonist   Clumsy Love Interests   Co-Workers   Cold Love Interests   Cold Protagonist   Confident Protagonist   Cruel Characters   Cunning Protagonist   Curious Protagonist   Determined Protagonist   Doting Love Interests   Enemies Become Allies   Enemies Become Lovers   Famous Protagonist   Fast Learner   Fated Lovers   Fearless Protagonist   Female Protagonist   Firearms   First Love   Gangs   Generals   Genius Protagonist   Gunfighters   Handsome Male Lead   Harsh Training   Hated Protagonist   Hot-blooded Protagonist   Kind Love Interests   Kuudere   Love Interest Falls in Love First   Low-key Protagonist   Mature Protagonist   Mercenaries   Military   Modern Day   Mysterious Family Background   Narcissistic Protagonist   Near-Death Experience   Older Love Interests   Orphans   Past Plays a Big Role   Playful Protagonist   Power Couple   Previous Life Talent   Protagonist Strong from the Start   Quirky Characters   Reincarnation   Ruthless Protagonist   Schemes And Conspiracies   Secret Organizations   Secretive Protagonist   Seduction   Shameless Protagonist   Sharp-tongued Characters   Showbiz   Slow Romance   Smart Couple   Soldiers   Spies   Stoic Characters   Strategic Battles   Strong Love Interests   Strong to Stronger   Stubborn Protagonist   Student-Teacher Relationship   Survival   Tomboyish Female Lead   Tragic Past   Tsundere   Twisted Personality   Underestimated Protagonist   Wars   Wealthy Characters   ",
	"rating": "(4.2 / 5.0, 30 votes)",
	"author": "Coconut Fiber   椰子絮   ",
	"year": "\nN/A",
	"ranking": "#2000   #2000   #7209   #13810   #8574   ",
	"reviewcount": "9 Reviews sorted by",
	"description": "He—an enigmatic and cold-blooded soldier with a mysterious background.\nShe—a ruthless and bloodthirsty spy.\n\nAfter she transmigrated out of the blue, she held a knife to his neck on their first meeting— marking the beginning of their twisted fate.\n\nOne day, she pinned him to a wall.\n'I've been teasing you for so long but you aren't reacting at all, you're forcing me to…'\n\nBefore she could finish, he smiled wickedly and counterattacked.\n'Good girl, this is what you call sending a lamb to a tiger's mouth.'\nThen, he sealed her lips with a kiss... >"
}