{
	"url": "https://www.novelupdates.com/series/corporate-slave-hero-says-hes-quitting-his-job/",
	"title": "Corporate S*ave Hero Says He’s Quitting His Job - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2018/11/Corporate-Slave-Hero-Says-Hes-Quitting-His-Job.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Comedy   Fantasy   Mystery   Romance   Slice of Life   ",
	"tags": "Adventurers   Beastkin   Beasts   Betrayal   Cohabitation   Conditional Power   Corruption   Demi-Humans   Demon Lord   Demons   Divine Protection   Elemental Magic   Enemies Become Lovers   Fantasy World   Former Hero   Heroes   Hidden Abilities   Hiding True Abilities   Hiding True Identity   Human Experimentation   Human-Nonhuman Relationship   Male Protagonist   Marriage   Multiple POV   Overpowered Protagonist   Protagonist Strong from the Start   Schemes And Conspiracies   Sealed Power   Secretive Protagonist   Secrets   Slow Romance   Strong Love Interests   Sword And Magic   Sword Wielder   Transformation Ability   Tsundere   Unique Weapon User   Unique Weapons   ",
	"rating": "(3.0 / 5.0, 86 votes)",
	"author": "Kishimoto Kazuha   岸本 和葉   ",
	"year": "\n2018",
	"ranking": "#5262   #2000   #1452   #2119   #1861   ",
	"reviewcount": "7 Reviews sorted by",
	"description": "“I quit being a Hero.”\n\nLeaving behind those words, I separated from my allies and began a life of retirement in a village in the middle of a mountain.\n\nSeparating myself from a life of fighting the demon lord, I had a rich life cultivating a field and intermingling with the villagers.\n\nAt the time my life finally began to stabilize, a woman came to visit.\n\n“I am called the demon lord Isvel…geh, you! The Hero!?”\n\n“The demon lord!?”\n\nBefore my eyes was my natural enemy, the demon lord. According to her story, she also seems to have come to retire.\n\nSince then began the strange life of retirement of me and the demon lord.\n\n“You’re not really putting your back into it are you?”\n\n“Shut up! I’ve never worked in a farm!”\n\n… I’ve been anxious about it from the beginning.>"
}