{
	"url": "https://www.novelupdates.com/series/daddys-cub-is-three-and-half-years-old/",
	"title": "Daddy’s Cub Is Three and Half Years Old - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/05/Daddys-cub-is-three-and-half-years-old.jpg",
	"noveltype": "(CN)",
	"genre": "Adventure   Comedy   Drama   Fantasy   Historical   Shoujo   Slice of Life   ",
	"tags": "Beautiful Female Lead   Carefree Protagonist   Child Protagonist   Childcare   Cute Children   Cute Protagonist   Doting Parents   Familial Love   Female Protagonist   Hard-Working Protagonist   Lucky Protagonist   Naive Protagonist   Reincarnation   Single Parent   ",
	"rating": "(3.6 / 5.0, 22 votes)",
	"author": "Shao Han   ",
	"year": "\n2021",
	"ranking": "#2000   #2101   #10181   #11314   #9397   ",
	"reviewcount": "No Reviews",
	"description": "Jiang Ranran is the cutest cub in Daozi Village.\n\n    On her third birthday, the little cub saw a strange screen in her mind.\n\n    The brother and sister on the screen kindly told Ran Ran.\n\n    “Ran Ran, your father is a scumbag, and he will abandon you in the future, he will marry someone else, and spoil the new daughter he brought.”\n\n    “Ran Ran, the scumbag will go bad if he has money, you secretly save the money and don’t give it to the scumbag.”\n\n    Dad, daddy want to abandon her?\n\n    Her eyes were red, and she cried out.\n\n    Jiang Zhile was once a well-respected scholar in Daozi Village. Chongxi married his wife at the age of 15, but the eccentric wife finally left.\n\n    At the age of nineteen, he was not admitted as a talent, but after being kicked out by his eldest brother and second brother, he brought a three-year-old oil bottle with him.\n\n    Jiang Zhile never raised the girl carefully, this little girl is not noisy or troublesome, and she is so sweet that he dare not touch her.\n\n    He is young, impatient to take care of others, and has a strong mindset.\n\n****\n\n    At the beginning.\n\n    Jiang father: Good girl, the villagers help to raise it, so it’s great to not worry about her.\n\n    Later.\n\n    Jiang father: The girl is too cute, what can I do, make money and raise her well.\n\n    After that.\n\n    Jiang father: Why is there always someone robbing my girl? It’s so rough!\n\n    After arriving in the capital.\n\n    The superior wants him to marry the youngest daughter who is widowed at home.\n\n    That person also had a little girl named Weiwei, who was as old as Ran Ran.\n\n    Weiwei: “Uncle, can you be my father? I like you!”\n\n    Jiang Zhile: “I only have one girl, don’t recognize dad by little things.”\n\n    The reborn Song Xuewei: This is different from the previous life!>"
}