{
	"url": "https://www.novelupdates.com/series/i-played-the-role-of-the-adopted-daughter-too-well/",
	"title": "I Played the Role of the Adopted Daughter Too Well - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/12/adopteddaughter4.jpg",
	"noveltype": "(KR)",
	"genre": "Fantasy   Romance   ",
	"tags": "Abandoned Children   Adopted Children   Appearance Different from Actual Age   Beautiful Female Lead   Calm Protagonist   Child Protagonist   Childcare   Cold Protagonist   Complex Family Relationships   Cruel Characters   Cute Children   Doting Older Siblings   Doting Parents   Family   Family Conflict   Female Protagonist   Handsome Male Lead   Loner Protagonist   Love Interest Falls in Love First   Male Yandere   Misunderstandings   Protagonist Strong from the Start   Reincarnation   Second Chance   Survival   Weak to Strong   ",
	"rating": "(4.3 / 5.0, 110 votes)",
	"author": "다나   ",
	"year": "\n2020",
	"ranking": "#3567   #2926   #2717   #6797   #1457   ",
	"reviewcount": "10 Reviews sorted by",
	"description": "When I first came into the book, my goal was just to survive.\n\n‘I have to live longer! And be happy!’ So I did my best.\n\nI am going to walk on my own flower path.\n\n“Wherever I go, the seat next to you is mine. You promised to pat my head for the rest of your life, isn’t that right?” The strongest male character, who was stabbed to death in the original novel, stared at me with obsessive eyes.\n\nIf I say no, he will destroy the world.\n\n“Yes, I’ll kill him. Then you’ll be happy, too, right?” The fifth brother looked a bit crazy.\n\n“This is my land from here to here. And yours, too. I’m glad to be able to breathe with your grandest dreams.” The fourth oldest sister, who became the richest woman on the continent, opened the map and said that.\n\nIf I say I don’t have such a grand dream like her, I think a catastrophe will happen.\n\n“I’m looking forward to the Winter Solstice that you’ll rule completely.” Laughter rose on the face of the butler who served me.\n\n“If you don’t connect to Verratoux, my heart will stop tomorrow morning. Are you sure you’re okay with that?” My first sister, who was supposed to be the original successor, threatened me with her life.\n\nAnd this is the biggest problem. Somehow, a faint smile raised my father’s mouth, which became stronger than the original father he was. “Independence? Try it then. I won’t even let a single ant live on this land.\n\n“Did you think you could leave my arms and stand on your own…” He then stared at me obsessively.\n\nThey are all acting weird.\n\nEverything went wrong.\n\nI only did my very best.>"
}