{
	"url": "https://www.novelupdates.com/series/pendleton-revolution/",
	"title": "Pendleton Revolution - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/07/Pendleton-Revolution_1625988586.jpg",
	"noveltype": "(KR)",
	"genre": "Action   Adventure   Josei   Mystery   Romance   ",
	"tags": "Aristocracy   Beautiful Female Lead   Clever Protagonist   European Ambience   Female Protagonist   Handsome Male Lead   Hard-Working Protagonist   Love Interest Falls in Love First   Military   Mystery Solving   Nobles   Power Couple   Righteous Protagonist   Slow Growth at Start   Slow Romance   Smart Couple   Strong Love Interests   ",
	"rating": "(3.4 / 5.0, 11 votes)",
	"author": "Yanna   유안나   ",
	"year": "\n2019",
	"ranking": "#2000   #2000   #11580   #7988   #10216   ",
	"reviewcount": "No Reviews",
	"description": "Don't worry yourself over trying to take responsibility for us.\r\n\r\nOur happiness is not something that you hold.\r\n\r\n***\r\n\r\nThe happy ending of a romance to be written into history. Beyond that are numerous forgotten faces.\r\n\r\nAfter the married couple of the Pendleton Grand Duchy decorated the century with their growth into lovers from a secretive 'Daddy Long Legs' patron and beneficiary, the act of exchanging letters within secret patronages just like them became the trend.\r\n\r\nHowever, would that romantic clandestine patronage always bring happiness?\r\n\r\nOnce her roommate became the victim of an attempted murder case, Andie Julinas, a prospective officer who was currently attending the Academy as a student of the Military Department with the help of a patron, put forth the hypothesis that the recent serial cases of murders were targetting the recipients of secret patronages.\r\n\r\nAnd before she knew it, she, too, was already long entangled within the case!\r\n\r\n'I'm the fourth son, so there's no need for a heir, and since I can't use a gun, there's no need for me to go out to the site of the incident, so I can take care of the household, not to mention I'm from the upper class, so I'll be able to educate the children well.......'\r\n\r\n'Wait, wait. What are you doing right now?'\r\n\r\n'Proposing.'\r\n\r\n'Are you crazy?'\r\n\r\n'.......'>"
}