{
	"url": "https://www.novelupdates.com/series/i-became-the-villains-pendant/",
	"title": "I Became the Villain’s Pendant - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/05/villainspendant1.jpg",
	"noveltype": "(CN)",
	"genre": "Adventure   Comedy   Drama   Romance   Xianxia   ",
	"tags": "Arrogant Characters   Beautiful Female Lead   Cultivation   Death of Loved Ones   Demon Lord   Demons   Female Protagonist   Gore   Handsome Male Lead   Male Yandere   Naive Protagonist   Obsessive Love   Older Love Interests   Possessive Characters   System Administrator   Transmigration   Transported to Another World   Weak Protagonist   Weak to Strong   ",
	"rating": "(4.2 / 5.0, 100 votes)",
	"author": "Da Cha Wei Wei   大茶娓娓   ",
	"year": "\n2020",
	"ranking": "#1411   #1329   #2781   #1998   #2804   ",
	"reviewcount": "21 Reviews sorted by",
	"description": "Ji Yan crossed over into a Mary Sue book and became the male lead’s vicious younger sister. She was a weak waste that didn’t even have a spiritual root.\r\n\r\nWhile other people practiced fasting, she had to eat three meals a day. While other people engaged in battles, she was gasping for breath when she climbed up the stairs. While other people leaped onto roofs and vault over walls, just flipping over a wall will cost her life.\r\n\r\nThe Justice Sect: She colluded with the devil clan and planned to hold us back!\r\n\r\nIn order to deal with the devil, the Justice Sect offered the waste to the Devil Clan leader, Yin Xuezhuo.\r\n\r\nAfter some time passed, the Justice Sect and the Devil Clan were surprised to find that no matter where the Devil Clan leader went, there was always a small young girl hanging on his body. The Devil Clan leader was carefully feeding her while he carried her. However, he was still disgusted by her.\r\n\r\nJi Yan: “Yin Xuezhuo, I’m hungry.”\r\n\r\nJi Yan: “Yin Xuezhuo, I’m sleepy. I have to sleep for four hours a day.”\r\n\r\nJi Yan: “Yin Xuezhuo, I think I caught a cold because I was blown by the cold wind last night.”\r\n\r\nJi Yan: “Yin Xuezhuo…”\r\n\r\nYin Xuezhuo: “Shut up!”\r\n\r\n【Devil Clan Leader】\r\n\r\nAs the King of the Devil Realm, Yin Xuezhuo was temperamental and crazy. He was fond of killing people. People would be terror-stricken whenever they heard his name.\r\n\r\nBut he never imagined that he would be controlled by a mysterious force that forced him to always be within ten steps distance of a young mortal girl.\r\n\r\nAll her pain, injuries, and sickness would be shared with him.\r\n\r\nIf she died, he would die.\r\n\r\nThe devil was furious. He was very irritable every day.\r\n\r\nJi Yan felt that this mysterious force might be called “the system”.>"
}