{
	"url": "https://www.novelupdates.com/series/i-didnt-save-you-to-get-proposed-to/",
	"title": "I Didn’t Save You To Get Proposed To - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/04/I-Didnt-Save-You-To-Get-Proposed-To_1619361154.jpg",
	"noveltype": "(KR)",
	"genre": "Drama   Fantasy   Romance   ",
	"tags": "Abandoned Children   Adapted to Manhwa   Adopted Protagonist   Aristocracy   Beautiful Female Lead   Comedic Undertone   Enemies Become Lovers   European Ambience   Fat to Fit   Female Protagonist   Handsome Male Lead   Love Interest Falls in Love First   Magic   Marriage   Misunderstandings   Mob Protagonist   Reincarnation   Royalty   Transmigration   ",
	"rating": "(3.7 / 5.0, 82 votes)",
	"author": "Yoo Na Jin   유나진   ",
	"year": "\n2020",
	"ranking": "#6970   #6323   #3192   #8371   #3663   ",
	"reviewcount": "11 Reviews sorted by",
	"description": "On the way home from work as usual.\r\n\r\nAs I was about to die in a sudden accident, then I heard someone's voice ringing in my head.\r\n\r\n[I'm Elsia Artise, save him, please, you could do it!]\r\n\r\nIt was the last time I lost consciousness and the place where I was when I opened my eyes...\r\n\r\nIt was in the novel I was reading right before the accident!\r\n\r\nI was also in possession of Elsia's body, an extra that dies at the beginning of the novel.\r\n\r\nThere was only one thing I could do to survive.\r\n\r\nDoing Elsia's request and twisting the original story!\r\n\r\nFirst, it was to save this Ixion, her unrequited love, who was assassinated and killed.\r\n\r\n'Prince, I'm here to warn you of the assassination that would take place today.'\r\n\r\nI managed to succeed in saving him using the information from the original, I wanted to live a peaceful life unrelated to the original.\r\n\r\nUntil I received a letter…\r\n\r\n'I owe you a lot of grace. I hope you come to the capital immediately because I want to repay you with marriage.'\r\n\r\nIxion's proposal, which I thought was the end of our relationship.\r\n\r\n'Hey... Prince, I didn't save you to get proposed to?'\r\n\r\nWould Elsia be able to safely refuse his proposal and return to her peaceful life?>"
}