{
	"url": "https://www.novelupdates.com/series/god-of-slaughter/",
	"title": "God Of Slaughter - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2017/06/GOS.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Ecchi   Fantasy   Harem   Martial Arts   Mature   Seinen   Xuanhuan   ",
	"tags": "Antihero Protagonist   Beautiful Female Lead   Bloodlines   Body Tempering   Cold Protagonist   Confident Protagonist   Cultivation   Cunning Protagonist   Death of Loved Ones   Demons   Determined Protagonist   Dragons   Evil Gods   Evil Protagonist   Friends Become Enemies   Gods   Handsome Male Lead   Hiding True Abilities   Hiding True Identity   Immortals   Long Separations   Lucky Protagonist   Male Protagonist   Martial Spirits   Older Love Interests   Perverted Protagonist   Politics   Polygamy   R*pe Victim Becomes Lover   Revenge   Romantic Subplot   R*pe   Ruthless Protagonist   S*xual Cultivation Technique   Shameless Protagonist   S*aves   Spatial Manipulation   Strength-based Social Hierarchy   Time Skip   Transmigration   Transported to Another World   Weak to Strong   Zombies   ",
	"rating": "(3.8 / 5.0, 809 votes)",
	"author": "Ni Cang Tian   逆苍天   ",
	"year": "\n2011",
	"ranking": "#4617   #6157   #99   #231   #290   ",
	"reviewcount": "88 Reviews sorted by",
	"description": "Growing up parentless, Shi Yan, who was left with a large inheritance money, bore a general disinterest in life.\n\nThe only times he felt alive was when adrenaline coursed thorough his veins. He quickly found that extreme sports, bungyjumping, cave diving & skydiving, gave him the biggest kicks. The bigger the adrenaline kick, the closer he was to death, the more alive he felt.\n\nWaking up in a pile of dead bodies in an unknown land, after a diving adventure had ended disastrously, he quickly realizes the body he now possessed was not his own.\n\nFollow Shi Yan as he explores this new world where danger lurks around every corner, and death is only a breath away; a world in which Shi Yan could not feel any more alive.>"
}