{
	"url": "https://www.novelupdates.com/series/daughter-in-law-of-a-noble-house/",
	"title": "Daughter-in-Law of a Noble House - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/02/DaughterinLaw-of-a-Noble-House.jpg",
	"noveltype": "(CN)",
	"genre": "Historical   Josei   Romance   ",
	"tags": "Ancient China   Arranged Marriage   Beautiful Female Lead   Calm Protagonist   Clever Protagonist   Female Protagonist   Love Interest Falls in Love First   Nobles   Politics   Royalty   Tragic Past   ",
	"rating": "(4.4 / 5.0, 70 votes)",
	"author": "Hai Qing Na Tian Er   Sea Blue Swan   海青拿天鹅   ",
	"year": "\nN/A",
	"ranking": "#3710   #2000   #3846   #11905   #3686   ",
	"reviewcount": "9 Reviews sorted by",
	"description": "There was chaos throughout all lands under Heavens, while warlords were vying for supremacy.\r\n\r\nFu Jin, the daughter of an exterminated noble clan, was forced to marry Wei Tan, an ambitious and formidable eldest son at the apex of his life.\r\n\r\nThis new daughter-in-law of the noble house received the solicitude of the officials and overturned the internal strife. In times of chaos, displacement and the subjugation of prominent clans, as a married woman one only wished to survive, conduct business, manage the affairs of the household  and live one's life in peace.\r\n\r\nAmidst the chaotic war, she watched the changes in the Imperial court and the battle for power. One exquisite heart had set in motion thousands of strategies and success was but a leap!\r\n\r\nYet, one was not able to scheme beyond his ten years’ plan of ‘giving a taste of one’s own medicine’.\r\n\r\nThe eyes of the fourteen year old Wei Tan, who had arrived at the Imperial Guards, caught sight of Fu Jin. His emotions stirred when they encountered each other in the Southern market. He noticed her eyes would dart to the right when she was calculating and knew that she had a penchant for haggling prices. He  believed the ‘exorbitant price’ he had paid for the plum flower bottle in her hands would certainly attract the beauty’s attention. Little did he expect that she would only remember the hundred and fifty coins. She had paid no attention to the build or stature of the person who had paid.\r\n\r\nTen years later, what was gratifying was that the affairs of the world were ever changing. In the end, after many twists and turns, she actually became his Furen.>"
}