{
	"url": "https://www.novelupdates.com/series/my-evil-imperial-wife-is-too-arrogant/",
	"title": "My Evil Imperial Wife is Too Arrogant - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/09/My-Evil-Imperial-Wife-is-Too-Arrogant_1631081852.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Romance   Xianxia   ",
	"tags": "Academy   Alchemy   Ancient Times   Battle Competition   Beast Companions   Beautiful Female Lead   Black Belly   Body Tempering   Calm Protagonist   Cautious Protagonist   Clever Protagonist   Confident Protagonist   Cultivation   Cunning Protagonist   Dao Companion   Determined Protagonist   Devoted Love Interests   Doting Love Interests   Doting Older Siblings   Doting Parents   Early Romance   Elemental Magic   Familiars   Famous Protagonist   Fast Cultivation   Fast Learner   Fearless Protagonist   Female Protagonist   Genius Protagonist   Handsome Male Lead   Heartwarming   Heavenly Tribulation   Immortals   Jack of All Trades   Kind Love Interests   Loyal Subordinates   Mature Protagonist   Multiple Realms   Mythical Beasts   Mythology   Overpowered Protagonist   Pill Concocting   Power Couple   Sharp-tongued Characters   Smart Couple   Special Abilities   Strong Love Interests   Transmigration   Unconditional Love   Underestimated Protagonist   Weak to Strong   ",
	"rating": "(3.8 / 5.0, 36 votes)",
	"author": "Lan Bai Ge Zi   蓝白格子   ",
	"year": "\n2015",
	"ranking": "#154   #245   #2197   #340   #5142   ",
	"reviewcount": "11 Reviews sorted by",
	"description": "‘Lou Mu Yan’, the daughter of Tian’ling Continent, Yan’zhou Kingdom’s God of War, has a prominent family background. But she was known throughout the Empire for being a tr*sh with blocked meridians. After the concubine, arranged by her most beloved’s Clan to marry him, severely injured her, she perished.\n\n‘Lou Mu Yan’ was the finest, most talented Female Immortal from the Immortal Cultivation World who was at the Body Fusion Stage and bore the Heavenly Spiritual Root. But because of a spatial storm, her Soul transmigrated to a completely foreign world and continent.\n\nPerhaps destined, ‘she’ became ‘her’, and hence forth, she improved her constitution, tossed away the scumbag man, disabled the fake white lotus, and ‘abducted’ a powerful, devilishly handsome, and beautiful man as her husband.\n\nThe queen had returned. Just watch how she, the almighty, brewed a gentle breeze that roused the waters, flourishing in this foreign world, stirring up layers upon layers of storms and waves.>"
}