{
	"url": "https://www.novelupdates.com/series/summoner-who-was-expelled-at-a-power-harassment-meeting-aims-to-become-the-strongest-by-forming-a-party-with-an-old-friend-its-too-late-to-come-back-now-eh-just-lend-me-the-summoned-beast/",
	"title": "Summoner Who Was Expelled at a Power Harassment Meeting, Aims to Become the Strongest by Forming a Party With an Old Friend – It’s Too Late to Come Back Now. Eh? Just Lend Me the Summoned Beast? I’m Sorry but I Refuse~ - Novel Updates",
	"image": "https://www.novelupdates.com/img/noimagefound.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Fantasy   Harem   Romance   ",
	"tags": "Adventurers   Caring Protagonist   Childhood Friends   Childhood Love   Dense Protagonist   Depictions of Cruelty   Guilds   Male Protagonist   Monster Tamer   Nobles   Protagonist Strong from the Start   R-15   Strong Love Interests   ",
	"rating": "(3.4 / 5.0, 16 votes)",
	"author": "Tsukishima Shuuichi   月島 秀一   ",
	"year": "\n2021",
	"ranking": "#4080   #6232   #6662   #7143   #7351   ",
	"reviewcount": "2 Reviews sorted by",
	"description": "'Alto Wraith. You're incompetent, your only skill is summoning magic, and you're unfit to work for our guild – you're fired.'\r\n\r\nAfter a series of harassment meetings, Alto was expelled from the Adventurer's Guild.\r\n\r\nWhen he returned home, his shoulders slumped, he found three old friends with whom he had competed as a student. It's been a year since they graduated from the Adventurers' Academy.\r\n\r\n'Happy birthday, Altoo!'\r\n\r\n'What, you got fired from the Adventurer's Guild...?'\r\n\r\n'Well, if that's the case, we'd love to have you join our party!'\r\n\r\nThe old friends, now famous adventurers, are in a desperate battle to attract the 'strongest summoner' to their party.\r\n\r\nHaving found a new place to belong, Alto sets his sights on the glorious future he once dreamed of as the 'strongest adventurer'.\r\n\r\nAt the same time, the guild leader who unjustly expelled Alto has fallen into disgrace with the influential people who came to the guild to see him...\r\n\r\nThis is the story of a tamed summoner who makes a name for himself in the world.>"
}