{
	"url": "https://www.novelupdates.com/series/be-the-sixth-anchor-in-the-escape-game/",
	"title": "Be The Sixth Anchor In The Escape Game - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/11/Be-The-Sixth-Anchor-In-The-Escape-Game.jpg",
	"noveltype": "(CN)",
	"genre": "Horror   Mystery   Romance   Yaoi   ",
	"tags": "Amnesia   Clever Protagonist   Doctors   Handsome Male Lead   Human Experimentation   Lack of Common Sense   Mysterious Past   Past Plays a Big Role   Power Couple   Scientists   Smart Couple   Survival Game   Unlimited Flow   Younger Love Interests   ",
	"rating": "(4.0 / 5.0, 42 votes)",
	"author": "惭时   ",
	"year": "\n2019",
	"ranking": "#6970   #6276   #8148   #9503   #7016   ",
	"reviewcount": "2 Reviews sorted by",
	"description": "People all over the world were put in an infinite escape game where each escapee was given a live broadcast channel, and those that failed to escape could watch in the real world.\n\nAs the game progressed and became more intense, it became apparent that one of the broadcasters had a very clean style.\n\nSomeone else’s game was: “Ahhhh help!”\n\nXia Yihui’s game was: “High energy coming ahead, pop-up cutie hurry up and wrap up your little blanket, this door opening is sure to scare us a bit. Let’s set a grenade to blow the door and scare it back!”\n\nThe door blew open.\n\nThe NPC’s horrified face: “Ah, ah, everyone, run away, the anchor Xia Yihui is in our dungeon, we’ll be annihilated!!!”\n\nBarrage: Rich character knight, bigshot 66666666 [hahaha]\n\nN put a copy game of Survival of the Fittest, with only two live channels left on the entire platform. The two were put inside the double copy for the final battle.\n\nJust when people around the world thought the two would fight to the death.\n\nXia Yihui: send you a handful of r*pe flowers, let’s live in peace and stability, okay?\n\nBarrage: Hahahahahaha sl*tty anchor again, this isn’t NPC, this is a big brother player who’s ten times more awesome than you! Big Brother, get rid of this anchor who’s all about the popularity. We’ve been watching him for a long time!\n\nBig Guy: Give me the flowers, turn off the live feed, and we’ll get on with our lives now.\n\nXia Yihui/barrage:?>"
}