{
	"url": "https://www.novelupdates.com/series/transmigrated-as-the-wife-of-wealthy-vegetative-man/",
	"title": "Transmigrated as the Wife of Wealthy Vegetative Man - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/06/Transmigrated-as-the-wife-of-wealthy-vegetative-man.jpg",
	"noveltype": "(CN)",
	"genre": "Drama   Fantasy   Josei   Romance   Supernatural   ",
	"tags": "Acting   Beautiful Female Lead   Celebrities   Coma   Female Protagonist   Handsome Male Lead   Marriage   Showbiz   System Administrator   Tragic Past   Transmigration   ",
	"rating": "(3.9 / 5.0, 18 votes)",
	"author": "牛皮   ",
	"year": "\n2021",
	"ranking": "#2000   #2000   #8499   #10838   #9065   ",
	"reviewcount": "4 Reviews sorted by",
	"description": "Mu Yanyan transmigrated in a book and became a third-rate actress who tried to poison her wealthy vegetative husband for the property. Before the original owner succeeded, she was caught by Han Zheng who just woke up, and the ending can be imagined.\r\n\r\nMu Yanyan, who had just transmigrated, looked at Han Zheng who was about to wake up, and immediately concealed with her affectionate personality: 'Husband, as long as you can wake up, I am willing to eat vegetable forever.'\r\n\r\nFrom then on, Mu Yanyan played an affectionate personality every day.\r\n\r\nEveryday rainbow fart flies up. Young Master Han was in a good mood.\r\n\r\nHis wife didn't even eat any meat for him, so he got his wife like this.\r\n\r\nWhat more could the husband ask for!\r\n\r\nUntil one day an entry 'Mu Yanyan ate it' airborne a hot search.\r\n\r\n'Derailed?'\r\n\r\n'Fucking big news, Yan Yan's poisonous woman was finally caught.'\r\n\r\n'Too embarrassing to be a woman, hurry up and get out of the entertainment circle.' ... All waiting for Yan Yan to get out of the entertainment circle.\r\n\r\nLu Heifen was particularly excited to open the link.\r\n\r\nIn the picture, there was a girl holding a bowl of braised pork, while the man standing next to her is staring at the bowl in her hand with his face is as black as charcoal.>"
}