{
	"url": "https://www.novelupdates.com/series/my-childs-father-is-the-emperor/",
	"title": "My Child’s Father Is the Emperor - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/07/My-Childs-Father-Is-the-Emperor.jpg",
	"noveltype": "(KR)",
	"genre": "Drama   Fantasy   Josei   Romance   ",
	"tags": "Aristocracy   Childcare   Cute Children   European Ambience   Family   Female Protagonist   Nobles   Pregnancy   Royalty   ",
	"rating": "(3.0 / 5.0, 25 votes)",
	"author": "Kaye   카예   ",
	"year": "\n2021",
	"ranking": "#2000   #2000   #8188   #10065   #7425   ",
	"reviewcount": "3 Reviews sorted by",
	"description": "“I’ve come for my son.”\r\n \r\nJust before she was sold to an old lord, Adele spent a night with a stranger. She ended up pregnant with the child of a wandering knight whose name she didn’t even know.\r\n \r\nAnd now, four years later. \r\n \r\nThe messenger of the battlefield, the cruel butcher Vanhelm Von Alfred…\r\n \r\nThe man who appeared as an Emperor wanted only her child. \r\n \r\nAdele was taken with him to protect her beloved young son. \r\nBut in the suffocating, prison-like imperial palace, she was confronted with a reality she had never expected. \r\n \r\n“I am the one who will be your mother. Your Highness Leo.”\r\n \r\nA woman who dared to say she was the mother of Adele’s child. \r\n \r\n“It is foolish to spend your life in recklessness.” \r\n \r\nThe Emperor’s strategist told Adele not to covet the Empress’s seat as it was something that a commoner like her shouldn’t have.\r\n \r\n“From now on, you’re not allowed to leave the castle.” \r\n \r\nAnd the emperor. \r\n \r\n“I will not let you go. Never.”\r\n \r\nThe emperor, who was cruel and cold, somehow became obsessed with Adele……. \r\n \r\nAdele’s life began to get caught up in a whirlwind of intense political strife. \r\n \r\n‘I want to be happy as a person, and I want to love as a woman.’\r\n \r\nShe wished. In the Imperial Palace where she would live in the future….>"
}