{
	"url": "https://www.novelupdates.com/series/dominating-the-love-of-the-villains/",
	"title": "Dominating the Love of the Villains - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/11/Dominating-the-Love-of-the-Villains.jpg",
	"noveltype": "(KR)",
	"genre": "Drama   Fantasy   Romance   Shoujo   ",
	"tags": "Abandoned Children   Age Regression   Child Protagonist   Death of Loved Ones   Family Conflict   Female Protagonist   Handsome Male Lead   Hated Protagonist   Protagonist Strong from the Start   Reincarnation   Sister Complex   Villainess Noble Girls   Weak to Strong   ",
	"rating": "(3.5 / 5.0, 35 votes)",
	"author": "Eonhongsi   언홍시   ",
	"year": "\n2020",
	"ranking": "#6970   #6382   #8189   #6620   #5127   ",
	"reviewcount": "No Reviews",
	"description": "In the future, all of their families will be named villains. Sophia Benny worked very hard to stop them from destroying the world.\n\n“You have to live.” With that thought, they tried to save their family.\n\nHowever, no matter what they did, they became villains and killed Sophia.\n\nThe day she returned to the age of 12 again, Sophia made up her mind.\n\n‘Damn it. I’ll do it. I will live on my own way.’\n\nAnd she did.\n\n“Sophie, look here.”\n“I baked your favorite cookies. Ignore him and eat this with me.”\n“If there is anything you want, you can say anything. Whatever it is, it will be in your arms.”\n\nThe families who turned away from her have changed.\n\nTo get the attention of the cold youngest, they began to neglect working as a villain.\n\nIn the meantime, an unexpected twist came to her.\n\n“Sophie.”\n\nLong dark red hair fluttered in the air. It was like a sight of rose petals that were dyed at night. The pink eyes laughed purely like when she was a child.\n\nLun, who was alive and well, patted her cheeks.\n\nHis hand was as cold as ever.\n\n“Because you like a good person, you gave up everything.”\n\nHe, who was a hidden villain, came out with his own veil. Even erased the word villain.\n\nIs this an illusion?>"
}