{
	"url": "https://www.novelupdates.com/series/buddha-like-rebirth/",
	"title": "Buddha-like Rebirth - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/09/Buddhalike-Rebirth.jpg",
	"noveltype": "(CN)",
	"genre": "Drama   Fantasy   Historical   Psychological   Romance   Shounen Ai   Slice of Life   ",
	"tags": "Ancient China   Betrayal   Black Belly   Calm Protagonist   Character Growth   Family   Handsome Male Lead   Kingdoms   Male Yandere   Misunderstandings   Multiple Reincarnated Individuals   Nobles   Obsessive Love   Past Plays a Big Role   Protagonist Falls in Love First   Royalty   Second Chance   System Administrator   Tragic Past   Transmigration   ",
	"rating": "(4.0 / 5.0, 45 votes)",
	"author": "Su HuaiHuang   苏怀荒   ",
	"year": "\n2019",
	"ranking": "#126   #210   #5358   #222   #7073   ",
	"reviewcount": "12 Reviews",
	"description": "Only after dying did Fu Zhiyu realise that the world he lived in turned out to be a novel.\n\nNo wonder he devoted all his life to loving Xie Ke but Xie Ke didn’t even like him. After all, the protagonist’s journey was to the sea of stars, while he was an indigenous cannon fodder who bit the dust halfway, just blindly delaying the protagonist’s career path.\n\nFu Zhiyu, who woke up: What is love? What is power? The world in the novel is all fake, I don’t know what they are fighting for there (disillusioned and opt out of the rat race.jpg)\n\nHe deeply reflected and regretted his previous life that was really baffling. After being reborn, he immediately decided to let go and become Buddha-like calm, not bothering with anything and living his life as a happy cannon fodder, the farther away from Xie Ke and the main plot, the better. But he didn’t expect that he was not the only one who had changed in this life.\n\n…It seems the protagonist became strange too.\n\nFu Zhiyu: General Xie, please follow the script. Now let go of me, I’m tired and want to go back and lie down.\n\nXie Ke [gentle smile]: I will accompany you.\n\nFu Zhiyu: …? >"
}