{
	"url": "https://www.novelupdates.com/series/super-dimensional-wizard/",
	"title": "Super Dimensional Wizard - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/06/636159057160842201.jpg",
	"noveltype": "(CN)",
	"genre": "Adventure   Fantasy   Mature   Mystery   Psychological   Slice of Life   Supernatural   ",
	"tags": "Alchemy   Alternate World   Artificial Intelligence   Beast Companions   Calm Protagonist   Character Growth   Cold Protagonist   Cooking   Crafting   Dark   Demons   Dragons   Fantasy Creatures   Fantasy World   Genius Protagonist   Ghosts   Handsome Male Lead   Hard-Working Protagonist   Inscriptions   Interdimensional Travel   Kingdom Building   Kingdoms   Magic   Magic Beasts   Magic Formations   Magical Space   Magical Technology   Male Protagonist   Master-Disciple Relationship   Modern Knowledge   Multiple Realms   Nobles   Parallel Worlds   Pets   Prophecies   Slow Growth at Start   Soul Power   Souls   Technological Gap   Witches   Wizards   World Hopping   World Travel   World Tree   ",
	"rating": "(4.3 / 5.0, 258 votes)",
	"author": "Shepherd Fox   牧狐   ",
	"year": "\n2016",
	"ranking": "#6970   #2000   #2430   #3810   #5193   ",
	"reviewcount": "24 Reviews sorted by",
	"description": "The status of a wizard is transcendent in all continents and in the universal plane. \n\nMysterious, wise, cruel and bloodthirsty are synonymous with wizards. But what does a real wizard look like? \n\nAfter coming into contact with the world of wizards, Angel came to the conclusion:\n\nWizards are a group of people who illuminate themselves with intellect-driven ideas, but are in a dialectical world with a materialistic attitude. \n\nIn other words, this is a group of alternative scientists who walk alone in a rigorous manner in the pursuit of understanding reality.\n\n…..\n\nMultiple worlds, boundless overlap. Under the guidance of intelligent creatures, they have walked out of their respective paths of civilization. \n\nAmong them, the wizard world, with its unique cultivation of civilization, runs through the endless plane. \n\nEven if the wizard world is so strong, the reality of the universe, is that the mysteries of the dimension are still unbreakable. \n\nUntil, a multiverse traveler, visited this side of the world. (The traveler is not the protagonist, the traveler is not the protagonist , the traveler is not the protagonist, things that are important are said three times!)>"
}