{
	"url": "https://www.novelupdates.com/series/exiled-in-a-class-trial-for-poor-dexterity-because-he-was-dexterous-he-lived-on-his-own-because-of-his-dexterity-he-was-able-to-use-all-the-skills-and-magic-of-the-higher-ranks-making-him-inv/",
	"title": "Exiled in a Class Trial for “Poor Dexterity”. Because He Was Dexterous, He Lived on His Own. Because of His Dexterity, He Was Able to Use All the Skills and Magic of the Higher Ranks, Making Him Invincible. I Decided to Live on My Own, but the People Around Me Wouldn’t Leave Me Alone. - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/02/Exiled-in-a-Class-Trial-for-Poor-Dexterity-Because-He-Was-Dexterous-He-Lived-on-His-Own-Because-of-His-Dexterity-He-Was-Able-to-Use_1645428363.jpg",
	"noveltype": "(JP)",
	"genre": "Adventure   Comedy   Fantasy   Harem   Shounen   ",
	"tags": "Academy   Adapted to Manga   Betrayal   Bullying   Caring Protagonist   Cheats   Crafting   Dense Protagonist   Discrimination   Farming   Game Elements   Hated Protagonist   Jack of All Trades   Jobless Class   Level System   Love Interest Falls in Love First   Lucky Protagonist   Magic   Male Protagonist   Monster Tamer   Overpowered Protagonist   Poor Protagonist   Poor to Rich   Saints   Skill Assimilation   Weak to Strong   ",
	"rating": "(2.8 / 5.0, 138 votes)",
	"author": "Satou Kenyou   佐藤謙羊   ",
	"year": "\n2021",
	"ranking": "#1820   #596   #1092   #883   #4037   ",
	"reviewcount": "23 Reviews sorted by",
	"description": "The boy Leopin was born with unnaturally high dexterity. From an early age, he used his dexterity to contribute to his peers in a variety of crafts. Leopin and his friends entered the Royal Pioneer Academy. However, during the “Ritual of Ability Development” at the entrance ceremony, the status given to Leopin was disastrous.\n\n“Occupation: Unemployed.”\n\n“All statuses except dexterity remain at their initial values and do not grow.”\n\n“Skills are poor dexterity*.”\n\nLeopin’s classmates exiled him because he had nothing to offer other than his dexterity. Leopin is placed in the “Special Training Class”, a class for failures. Leopin is left all alone. However, he realizes that the skill he has been given, “Poor Dexterity,” has an unexpected performance. That is…\n\nYou can convert your dexterity status to any other status.\nYou can change your occupation to any one you want.\n\nThe first thing Leopin did was to become a lumberjack. First, Leopin changed his job to “Lumberjack” to get wood from the forest. He then became a carpenter and built the most magnificent house of all. He became an Appraiser to identify rare items, and a Battle Axe User to fight off students from other classes who tried to attack him. Become a Ranger to explore dungeons and a Ninja to get through traps with ease.\n\nLeopin, alone (solo), had gained enough power to do everything.\n\nAs Leopin continues to be a warrior, he is adored by his childhood friend, a saint, and admired by a beautiful alchemist, and his activities become even more well known. On the other hand, the classmates who expelled Leopin regret their decision to do so when they witness Leopin’s abilities.\n\nTheir home remains a shack, they are unable to explore, and they gradually lose their place in the school and are ruined.\n\n*Explanation: the skill is not “poor dexterity”, but “dexterous poor”, which is the japanese equivalent to a Jack of all trades, master of none; since they can do a bit of everything, they are “dexterous”, but since they have mastered none, they supposedly cannot make a living from it, hence they are “poor”.>"
}