{
	"url": "https://www.novelupdates.com/series/kill-the-villainess/",
	"title": "Kill The Villainess - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/04/Kill-The-Villainess.jpg",
	"noveltype": "(KR)",
	"genre": "Drama   Fantasy   Romance   Tragedy   ",
	"tags": "Abusive Characters   Adapted to Manhwa   Appearance Changes   Aristocracy   Arranged Marriage   Beautiful Female Lead   Broken Engagement   Calm Protagonist   Cold Love Interests   Complex Family Relationships   Depression   Dragons   European Ambience   Female Protagonist   Handsome Male Lead   Kingdoms   Knights   Love Interest Falls in Love First   Maids   Male Yandere   Manipulative Characters   Multiple POV   Murders   Nobles   Poisons   Politics   Psychopaths   Religions   Royalty   R*pe   Schemes And Conspiracies   S*xual Abuse   Shy Characters   Suicides   Time Manipulation   Time Travel   Tragic Past   Transmigration   Villainess Noble Girls   Witches   ",
	"rating": "(4.1 / 5.0, 149 votes)",
	"author": "Your April   사월생   ",
	"year": "\n2019",
	"ranking": "#6970   #4074   #3239   #1085   #2120   ",
	"reviewcount": "29 Reviews sorted by",
	"description": "“You… who are you?”\n\nShe was possessed by the villainess in the novel. When her fiancé, the crown prince, married their childhood sweetheart, Helena, she poisoned her to death. From the moment she realized she was possessed, “I” have only one goal: to escape the world in this novel. She tried to escape this world, even if it meant dying, but the world wouldn’t let her. But when she refused to follow the path of ‘Eris’ in the original story, the men who had ignored and persecuted her began to beg for her attention and affection. \n\n“Who are you?” \n\nAsked the priest who brought Helena back to life, and the hero who swore her eternal love.\n\n“You have changed.”\n\n And the Crown Prince who won Helena’s heart.\n\nIt was a new question. They didn’t even care about Eris. \n\nShe ‘the new Eris’ didn’t feel attached as time passed. She had no confidence in loving this world.>"
}