{
	"url": "https://www.novelupdates.com/series/reincarnated-in-a-different-world-as-a-sacred-treasure-i-am-unmatched-with-an-elf-girl/",
	"title": "Reincarnated in a Different World as a Sacred Treasure, I Am Unmatched With an Elf Girl! - Novel Updates",
	"image": "https://www.novelupdates.com/img/noimagefound.jpg",
	"noveltype": "(JP)",
	"genre": "Adventure   Fantasy   Shounen   ",
	"tags": "Elves   Fantasy World   Inferiority Complex   Male Protagonist   Multiple Transported Individuals   Non-humanoid Protagonist   Reincarnated as an Object   Sword And Magic   Transmigration   ",
	"rating": "(2.8 / 5.0, 8 votes)",
	"author": "Satou   Sugar   さとう   ",
	"year": "\n2021",
	"ranking": "#2000   #2000   #12812   #10269   #12218   ",
	"reviewcount": "No Reviews",
	"description": "I am the bullied child, Yamiyo Yoitsuki, and I hate my twin sister, Hikaru Yoitsuki. I hate being in the same class as my sister. She gets good results in class, is good at all sports, and is popular in class…But my results, and physique, are under par. And to top it off, I was bullied by a group centred around Hikaru.\n\nI don’t have a place at home nor at school. I wish for nothing more than for this to end.\n\nOne day, a change in fate occurs.\n\nMy class is transferred to another world.\n\nWhen speaking of a different world, you’d think of cheats, harems, and a slow life!…. But, our transmigration was a little… no, was quite unusual.\n\nHow so? We were transferred, not as a human, but as a “weapon” with a will to be used by the people of another world.\n\nExcellent members of the other world can choose us as their weapons.\n\nBut I was a dropout here.\n\nI was unable to be used as a weapon and was on the verge of being thrown out… But, a dropout elf girl, Seto, from the other world saved me.\n\nHowever, Seto was trapped by her classmates and abandoned in a danger zone called the Abyss Forest.\n\nI don’t want to die. I really wish…. Our true powers awaken!!\n\nTo live, and to trap our classmates in return, me and Seto are determined to get stronger.\n\nThis is the tale of me, the dropout weapon, and Seto, the dropout elf girl.>"
}