{
	"url": "https://www.novelupdates.com/series/magus-tech/",
	"title": "Magus Tech - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/06/magustech3.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Comedy   Fantasy   Mature   Seinen   ",
	"tags": "Army   Beast Companions   Beasts   Beautiful Female Lead   Bookworm   Calm Protagonist   Character Growth   Clever Protagonist   Cold Protagonist   Court Official   Cunning Protagonist   Determined Protagonist   Dragons   Elemental Magic   European Ambience   Fantasy Creatures   Fantasy World   Genius Protagonist   Handsome Male Lead   Kingdoms   Library   Loyal Subordinates   Magic   Male Protagonist   Master-Servant Relationship   Mature Protagonist   Medical Knowledge   Mercenaries   Modern Knowledge   Mythical Beasts   Nobles   Politics   Pragmatic Protagonist   Prison   Reincarnation   Romantic Subplot   Royalty   Servants   Sharp-tongued Characters   Slow Romance   Sword And Magic   Transmigration   Transported to Another World   Wars   Wealthy Characters   ",
	"rating": "(3.5 / 5.0, 19 votes)",
	"author": "Twenty-Three Sun   孙二十三 著   ",
	"year": "\n2017",
	"ranking": "#2000   #2000   #8739   #7725   #10293   ",
	"reviewcount": "2 Reviews sorted by",
	"description": "This is a story about the study of technology in the wizarding world.\r\n\r\nProbability, electromagnetic induction, nuclear physics, relativity... if one explored and learned the scientific way, one would be able to master everything. This was Richard's way of thinking until he traveled to a world similar to the Middle Ages as the prince of a nation.\r\n\r\nOne day... he'd been carried away by a dragon.\r\n\r\n'This is quite an interesting aerodynamic flight, isn't it. How does it fly when it doesn't satisfy the Kutta Condition. Maybe it has to do with the number of wings and the Bernoulli Theorem? Does it have a built-in engine?'\r\n\r\nRichard could not help but wonder as he looked at the dragon he was riding.\r\n\r\n'Well, this is good study material. Oh, by the way, you said just now that you kidnapped me as a prince because you wanted to find a playmate for your dragon daughter? Isn't this reason a bit too... outlandish?'\r\n\r\n'Roar!' the dragon roared angrily and flapped its large wings straight into the sky.>"
}