{
	"url": "https://www.novelupdates.com/series/this-marriage-is-bound-to-sink-anyway/",
	"title": "This Marriage Is Bound To Sink Anyway - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/04/This-Marriage-Is-Bound-To-Fail-Anyway.jpg",
	"noveltype": "(KR)",
	"genre": "Adult   Fantasy   Romance   Smut   ",
	"tags": "Abusive Characters   Adapted to Manhwa   Age Regression   Apathetic Protagonist   Aristocracy   Arranged Marriage   Arrogant Characters   Award-winning Work   Cold Protagonist   Couple Growth   Depictions of Cruelty   Depression   Famous Protagonist   Fated Lovers   Handsome Male Lead   Love Interest Falls in Love First   Manipulative Characters   Marriage   Marriage of Convenience   Multiple POV   Multiple Protagonists   Past Plays a Big Role   Past Trauma   Phobias   Popular Love Interests   Pragmatic Protagonist   Secretive Protagonist   S*xual Abuse   Slow Romance   Strong Love Interests   Suicides   Time Loop   Tragic Past   Twisted Personality   ",
	"rating": "(4.2 / 5.0, 253 votes)",
	"author": "Kim Chacha   김차차   ",
	"year": "\n2019",
	"ranking": "#493   #783   #2245   #3541   #1464   ",
	"reviewcount": "19 Reviews",
	"description": "The plan was perfect.\r\n\r\nAnd there was no better match than the prim playboy of the Escalante family.\r\n\r\n“After we get married, everything will be different. You will be more free than before our marriage.”\r\n\r\n“What about you?”\r\n\r\n“Under the duties as your wife, I will do what is justifiable. It will be done regardless of you.”\r\n\r\n“So, you’re saying you’re going to have a child but you’re not going to do this kind of thing with me?”\r\n\r\nThis was because she didn’t need a decent husband, but a man who would someday be legally removed from her life.\r\n\r\nWhen he can fill the petition up with the names of the women he fooled around with overnight, then she can become a successful Ortega woman.\r\n\r\nBut then…\r\n\r\n“I am not going to lay a finger on a woman who is not you, and until you give birth to a child, until you give birth to the next child, and then regardless of any child, I will satisfy you and I will make you satisfy me.”\r\n\r\n“……”\r\n\r\n“I don’t need such dog-like freedom or privacy that you want to give me so badly. There’s no such thing as that in the first place from the marriages I know of.”\r\n\r\nThe Duchess of Escalante refuses to live with the Duke of Escalante. Divorce due to unilateral fault.\r\n\r\n“I’m a son of a bit*h but I’m more faithful than you think. Inés Valeztena.”\r\n\r\nInés Valeztena strives for a wonderful life.\r\n\r\n“So I will never betray my family.”\r\n\r\nUntil her promiscuous fiancé betrays her by saying he will not betray her.\r\n\r\n“I’m sorry, but you can’t live a life separated from me. Inés Valeztena.”>"
}