{
	"url": "https://www.novelupdates.com/series/pampered-consorts-acting-awards/",
	"title": "Pampered Consort’s Acting Awards - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/12/Pampered-Consorts-Acting-Awards.jpg",
	"noveltype": "(CN)",
	"genre": "Drama   Fantasy   Historical   Mature   Romance   ",
	"tags": "Acting   Ancient China   Aristocracy   Beautiful Female Lead   Childcare   Couple Growth   Death of Loved Ones   Doting Older Siblings   Dreams   Fated Lovers   Female Protagonist   Flashbacks   Forced Marriage   Handsome Male Lead   Hiding True Identity   Imperial Harem   Love Interest Falls in Love First   Misunderstandings   Nobles   Past Plays a Big Role   Politics   Pregnancy   Reincarnation   Royalty   Schemes And Conspiracies   Second Chance   ",
	"rating": "(4.5 / 5.0, 89 votes)",
	"author": "Well-Developed Lachrymal Glands   发达的泪腺   ",
	"year": "\n2020",
	"ranking": "#3923   #4780   #4104   #7991   #3358   ",
	"reviewcount": "12 Reviews sorted by",
	"description": "In her last life, everyone said that Su Ling had a good life, a matchless beauty born from a high family. Her father was the Great General of Zhen and her elder brother was a high official of the Supreme Court.\n\nShe was married to Prince Jin as his consort and two years later she became the empress of Great Zhou.\n\nNobody can compete with someone so honorable.\n\nLike this, in the first year of Yanxi era, Duke of Zhen deserted the army just before the war, and so, the Su family was accused of treason.\n\nSu Ling died in the back palace after giving birth to a son.\n\nWhen she opened her eyes again, she had become the daughter of a fifth-ranked grand scribe—Qin Ling.\n\nWaking up from the dream, although she will no longer be concerned about the fickle man, she has no choice but to enter the palace once again for the child she had given birth to.\n\nOn the day of the draft, the emperor leans against the Dragon Throne with drooped eyes and without a word while rubbing his eyebrows impatiently.\n\nEven while sighing, he never lifts his eyes once.\n\nUntil Qin Ling walks in, and with the exact same face as Empress Su, says: Wishing the emperor boundless happiness, good luck, and a long life.\n\nUp the throne, the emperor suddenly raises his head. He looks absent-minded and the tea cup falls to the ground.\n\nDesperately whispers: Ah Ling.>"
}