{
	"url": "https://www.novelupdates.com/series/level-99-villainous-daughter/",
	"title": "Level 99 Villainous Daughter - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/08/cvmefctya7o56phdhhn9jzgkikj5_1c1i_ir_rs_6spx.jpg",
	"noveltype": "(JP)",
	"genre": "Comedy   Fantasy   Romance   School Life   Shoujo   ",
	"tags": "Absent Parents   Academy   Adapted to Manga   Apathetic Protagonist   Aristocracy   Beast Companions   Calm Protagonist   Carefree Protagonist   Comedic Undertone   Cute Protagonist   Demon Lord   Dense Protagonist   Dragon Slayers   Dragons   Dungeons   Engagement   Evil Gods   Female Protagonist   Game Elements   Goddesses   Gods   Hard-Working Protagonist   Harsh Training   Hated Protagonist   Kind Love Interests   Kingdoms   Lack of Common Sense   Level System   Love Interest Falls in Love First   Magic   Magic Beasts   Marriage   Misunderstandings   Multiple Realms   Nobles   Otome Game   Overpowered Protagonist   Parallel Worlds   Politics   Protagonist Strong from the Start   Quirky Characters   Reincarnated in a Game World   Reluctant Protagonist   Rivalry   Royalty   Schemes And Conspiracies   Sword And Magic   Time Skip   Transmigration   Unreliable Narrator   Villainess Noble Girls   ",
	"rating": "(3.8 / 5.0, 249 votes)",
	"author": "Tanabata Satori   七夕さとり   ",
	"year": "\n2018",
	"ranking": "#325   #470   #547   #848   #279   ",
	"reviewcount": "60 Reviews sorted by",
	"description": "I was reborn as the villainous daughter, Yumiela Dolknes, in the world of an otome RPG game. Yumiela only had a small role in the original story, but after defeating the Demon King, she will appear as the Hidden Boss with a bonus specs to solo fight the Hero party.\r\n\r\nHaving a gamer-spirit, I’ve been raising my level since I was a child. By the time I enter the academy where the game stage is, I was level 99.\r\n\r\nI wanted the heroine and the capture targets to defeat the Demon King, but they just flirted around and didn’t raise their level. Moreover, they treat me as if I’m the Demon King just because I have dark hair and use dark magic.\r\n\r\nIt’s a story where I aim for peaceful days.>"
}