{
	"url": "https://www.novelupdates.com/series/ze-tian-ji/",
	"title": "Ze Tian Ji - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2015/06/Zetianji.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Drama   Shounen   Xuanhuan   ",
	"tags": "Adapted to Anime   Adapted to Drama   Adapted to Manhua   Arranged Marriage   Assassins   Awkward Protagonist   Beautiful Female Lead   Betrayal   Bloodlines   Books   Bookworm   Calm Protagonist   Character Growth   Clever Protagonist   Cultivation   Dao Companion   Dao Comprehension   Demons   Destiny   Doctors   Dragons   Engagement   Friends Become Enemies   Friendship   Genius Protagonist   Hard-Working Protagonist   Introverted Protagonist   Limited Lifespan   Lucky Protagonist   Male Protagonist   Manipulative Characters   Master-Disciple Relationship   Misunderstandings   Mysterious Illness   Philosophical   Politics   Power Couple   Romantic Subplot   Schemes And Conspiracies   Slow Growth at Start   Smart Couple   Strong Love Interests   Stubborn Protagonist   Sword Wielder   Time Skip   Underestimated Protagonist   Unique Cultivation Technique   Unique Weapon User   Weak to Strong   ",
	"rating": "(4.0 / 5.0, 1277 votes)",
	"author": "Mao Ni   猫腻   ",
	"year": "\n2014",
	"ranking": "#3314   #6289   #92   #380   #173   ",
	"reviewcount": "201 Reviews sorted by",
	"description": "To pick is to choose. This is a story about choices. Three thousand worlds full of gods and demons, with a daoist scroll in your hand, you are able to control the entire universe…\n\nAt the beginning of time, a mystical meteor came crashing down from outer space and scattered all over the world. A piece of it landed in the Eastern Continent. There were mysterious totems carved upon the meteor. Through viewing these totems, mankind comprehended the Dao and established the Orthodoxy.\n\nSeveral thousand years later, the fourteen years old orphan Chen Changsheng left his master to cure his illness and change his fate. He brought a part of a marriage vow with him to the capital, thus beginning the journey of a rising hero…>"
}