{
	"url": "https://www.novelupdates.com/series/the-legendary-moonlight-sculptor/",
	"title": "The Legendary Moonlight Sculptor - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2015/06/moonlightsculptor.png",
	"noveltype": "(KR)",
	"genre": "Action   Adventure   Comedy   Fantasy   Martial Arts   Sci-fi   Shounen   ",
	"tags": "Adapted to Manhwa   Artificial Intelligence   Average-looking Protagonist   Beautiful Female Lead   Blacksmith   Cooking   Cunning Protagonist   Dense Protagonist   Domestic Affairs   Dragons   Dungeons   Dwarfs   Elves   Familial Love   Fantasy Creatures   Gamers   Grinding   Guilds   Hard-Working Protagonist   Kingdom Building   Kingdoms   Knights   Level System   Male Protagonist   Merchants   Misunderstandings   MMORPG   Modern Day   Money Grubber   Monsters   Multiple POV   Necromancer   Poor Protagonist   Poor to Rich   Romantic Subplot   Royalty   Ruthless Protagonist   Sculptors   Shameless Protagonist   Slow Romance   Sword Wielder   Tragic Past   Underestimated Protagonist   Vampires   Virtual Reality   Wars   Weak to Strong   Younger Sisters   ",
	"rating": "(4.3 / 5.0, 1704 votes)",
	"author": "Nam Heesung   남희성   ",
	"year": "\n2007",
	"ranking": "#561   #696   #95   #433   #16   ",
	"reviewcount": "188 Reviews sorted by",
	"description": "The man forsaken by the world, the man a s*ave to money and the man known as the legendary God of War in the highly popular MMORPG Continent of Magic. With the coming of age, he decides to say goodbye, but the feeble attempt to earn a little something for his time and effort ripples into an effect none could ever have imagined.\n\nThrough a series of coincidences, his legendary avatar is sold for 3 billion won, bringing great joy to him, only to plunge him into despair at losing almost all of it to vicious loan sharks. With revelation of money through gaming, he rises from the abyss with new found resolve and steps forward into the new age of games led by the first ever Virtual Reality MMORPG, Royal Road.\n\nThis is the legend of Lee Hyun on his path to becoming Emperor with only his family’s loving heart, his boundless desire for money, his unexpected mind, his diligently forged body and the talent of hard work backing him.>"
}