{
	"url": "https://www.novelupdates.com/series/the-e-sports-circles-toxic-assembly-camp/",
	"title": "The E-Sports Circle’s Toxic Assembly Camp - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/08/camp.jpg",
	"noveltype": "(CN)",
	"genre": "Romance   Shounen Ai   Sports   Yaoi   ",
	"tags": "Comedic Undertone   Doting Love Interests   e-Sports   First-time Interc**rse   Friendship   Gamers   Handsome Male Lead   Hard-Working Protagonist   Love Interest Falls in Love First   Manly Gay Couple   Misunderstandings   Past Trauma   Power Couple   Protagonist Strong from the Start   Shameless Protagonist   Smart Couple   Strategist   Strong Love Interests   Teamwork   Tragic Past   Transmigration   Wealthy Characters   ",
	"rating": "(4.7 / 5.0, 390 votes)",
	"author": "Green Plum Sauce   Qīngméi jiàng   青梅酱   ",
	"year": "\n2020",
	"ranking": "#2033   #2007   #796   #362   #768   ",
	"reviewcount": "74 Reviews",
	"description": "Chief tactician Lin Yan entered an e-sports novel. At this time, there was still a whole year to go before the original plot started.\n\nThe big devil who would frighten people in the future was still a thin-skinned little anchor; the disaster who once disturbed the e-sports circle was playing as an accompanying player; the best healer was sitting on the cold bench of a third-rate team; the strongest king at shooting his mouth off offending the media and his black materials were flying all over the place…\n\nThey would shine as the plot progressed but unfortunately, their teams weren’t strong enough. In the end, they couldn’t escape the fate of a cannon fodder.\n\nLin Yan couldn’t bear to see these talents being wasted. The e-sports professional reality show started and he spent money to set up the GH Club, moving from east to west to select his team.\n\nThe variety fans: ??? Is this ‘Go Home’ team picking up the junk?\n\nThis lasted until all the opponents were coughing up blood at GH’s tactics and could only watch GH get a ticket to the professional league.\n\nThe entire e-sports circle knew that apart from their captain Jing Yuanzhou, the entire GH team was a group of barely qualified variety show players not worth paying attention to. As a result, this toxic team swept through the field and reached the top in their first year of the league.\n\nWhen the media interviewed GH: Captain Jing, why did you agree to Coach Lin's proposal and join GH?\n\nJing Yuanzhou: He pestered me every day saying ‘I want you’. It was really difficult to turn down such great kindness.\n\nLin Yan: “???”\n\nCheck the salary deduction warning.\n\nThe entire Internet went crazy: Parental love is real!!!>"
}