{
	"url": "https://www.novelupdates.com/series/i-attacked-because-i-was-afraid-of-death/",
	"title": "I Attacked Because I Was Afraid Of Death - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/05/I-attacked-because-I-was-afraid-of-death.jpeg",
	"noveltype": "(CN)",
	"genre": "Action   Comedy   Drama   Sci-fi   ",
	"tags": "Apocalypse   Beautiful Female Lead   Calm Protagonist   Charismatic Protagonist   Female Protagonist   Human Experimentation   Late Romance   Love Interest Falls in Love First   Misunderstandings   Overpowered Protagonist   Protagonist Strong from the Start   Romantic Subplot   Special Abilities   Strong to Stronger   System Administrator   Transmigration   Zombies   ",
	"rating": "(4.1 / 5.0, 66 votes)",
	"author": "装盘烤鱼   ",
	"year": "\n2021",
	"ranking": "#2000   #2000   #3629   #4496   #4023   ",
	"reviewcount": "9 Reviews sorted by",
	"description": "Chi Xin was afraid of death but was convinced by her roommate to watch a newly released doomsday movie. At first glance, she was attracted by the handsome, calm, and resolute male lead.\n\nWhen the tide of zombies flooded the city, the male protagonist stood on the wall with a sad smile and raised his gun. And when the camera closed up on a scarlet mouth that took the entire screen, Chi Xin screamed and fainted in shock.\n\nWhen she opened her eyes again, the city wall under her feet was shaking and countless zombies rushed to bite her neck. A desert eagle in her hand, she trembled and almost fell off the wall. When she turned her head, the face that had made her swoon a moment ago was looking at her with a cold smile.\n\n“Chi Xin, use your life to pay for this mistake.”\n\nChi Xin: Frightened to the extreme but expressionless.jpg\n\nShe remembered the voice of the self-proclaimed troublemaker system when she closed her eyes: [The doomsday world is highly difficult. The host can choose to add defense, attack, foresight, or other functions…]\n\nWhat did she answer?\n\n“Attack! Give me full attack!”\n\nChi Xin was about to hug the hero’s thigh and beg for forgiveness when a zombie came to bite her. She instinctively raised her gun and in the male protagonist’s horrified eyes, she smashed the zombie’s head with the butt of the gun.\n\nChi Xin: Blood!!!\n\nEverybody saw her look sad (scared), stunned (scared), and silent (scared) as she shot the remaining zombies one by one in ruthlessly accurate headshots.\n\nEveryone: Why did you pretend to be so weak!>"
}