{
	"url": "https://www.novelupdates.com/series/wealthy-supporting-actress-tore-the-script/",
	"title": "Wealthy Supporting Actress Tore the Script - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/09/007S8ZIlgy1gh18qpdyc9j30go0nc0xj.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Drama   Fantasy   Romance   ",
	"tags": "Beautiful Female Lead   Business Management   Charismatic Protagonist   Charming Protagonist   Clever Protagonist   Divorce   Family   Family Business   Female Protagonist   Handsome Male Lead   Misunderstandings   Modern Day   Parallel Worlds   Precognition   Second Chance   Special Abilities   Villainess Noble Girls   Wealthy Characters   ",
	"rating": "(3.1 / 5.0, 56 votes)",
	"author": "Wan Li Ta   万莉塔   ",
	"year": "\n2020",
	"ranking": "#2917   #2134   #3089   #7725   #3847   ",
	"reviewcount": "13 Reviews sorted by",
	"description": "Jiang Dai had a massive fight with her leading billionaire husband and left home, before landing herself in a car accident. After waking up from being unconscious, she realized that she was actually a villainous ex-wife in a President comic.\n\n　　\n\nIn the comic, the handsome and rich husband was about to get divorced from her and go into a love-hate relationship with the pure, silly, and sweet female lead. As the biggest villain in the comic, she had to fight her way through to the last moment, only then would she be able to end her story. Jiang Dai looked at her account of hundreds of millions of fortune…… a question mark then appeared over her face??\n\nComing to a decision, she tore the comic with her bare hands and became the first person to suggest divorce. To her dismay, her ex-husband tore the divorce agreement into bits. “If you want to divorce, give birth to a child first.”\n\nShe shouted, “Bastard! You’re out of luck, sooner or later you’ll be struck by lightning!” A loud clap of thunder resonated from outside the window, as her husband was struck by lightning and passed out…… \n\nNot long after.\n\nIn regards to the President of the Group suppressing the Jiang clan maliciously, Jiang Dai said a sentence casually. “It’s getting colder these days, it should be time for the Zhang clan to go bankrupt.”  \n\nThe next day, the stocks of the Zhang financial group hit a limit down and went into liquidation. Her mother-in-law, who used to make things difficult for Jiang Dai, would instead pamper her all day long. Daughters of eminent families, who used to outcast her, would also constantly crowd around her.\n\n“Daughter, do you think mother should slim down 5kg this month?”\n\n“Goddess Dai Dai, do you think my new movie box office would sell well?”\n\n“President Jiang, President Jiang, I’m going down on my knees to beg for your blessings. Would I be able to recoup my 300 billion investment……”  \n\nLeading billionaire Huo Rongshen had a docile and beautiful wife.\n\nThat was until she got into a car accident, where her personality went through a massive change, threw a divorce agreement to his face and said “Goodbye, I’ll be on my way to revive my family enterprise.” Huo Rongshen was rendered stunned. “……The stocks of your Jiang clan, which sells vanishing creams, is only valued at 28 cents.”\n\nA few days later, Huo Rongshen discovered his wife live-streamed to market goods and garnered over ten million fans.\n\nAfter a few months, Huo Rongshen witnessed the shares of the Jiang clan’s cosmetic group soared. Even all the products in Asia were all sold out.\nAfter a year.\nAssistant: President, Young Madame has already fought in the business world for a year…… \n\nHuo Rongshen: She is finally willing to admit that she was wrong?\n\nAssistant: No, Young Madame has acquired some of our property, financial, hospital, and entertainment subsidiaries. Also, on the Forbes list of billionaires, she has outranked you. _(:з」∠)_>"
}