{
	"url": "https://www.novelupdates.com/series/bringing-calamity-to-the-nation/",
	"title": "Bringing Calamity to the Nation - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2018/12/huo-guo-tu-bi-resized.jpg",
	"noveltype": "(CN)",
	"genre": "Drama   Historical   Josei   Romance   Tragedy   ",
	"tags": "Aristocracy   Beautiful Female Lead   Betrayal   Broken Engagement   Clever Protagonist   Death of Loved Ones   Female Protagonist   Handsome Male Lead   Imperial Harem   Late Romance   Nobles   Politics   Reverse Harem   Royalty   Schemes And Conspiracies   Unrequited Love   Weak to Strong   ",
	"rating": "(3.8 / 5.0, 34 votes)",
	"author": "Shi Si Que   十四阙   ",
	"year": "\n2010",
	"ranking": "#6970   #2000   #8097   #12115   #8103   ",
	"reviewcount": "3 Reviews sorted by",
	"description": "Using a thread to embroider, time can be weaved;\n\nUsing a heart to embroider, a nation can be weaved.\n\nHow can a palace, imprison a phoenix?\n\nOne’s life is decided by oneself and not by heaven!\n\nOn one great land, the world is split into four, Yan, Bi, Yi and Cheng.\n\nNation Bi’s Right Prime Minister’s daughter, who is of a dignified demeanour, virtuous and gentle, admires the son, Ji Ying of the Four Great Families. Yet when the two families were preparing for a marriage alliance, it was flagrantly wrecked by the King, Zhao Yin, with one imperial edict, selecting her to enter the palace.\n\nFor the sake of her family, Jiang Chenyu had no other way but to accept the imperial edict and enter the palace.\n\nHowever, she was not willing to become the Monarch’s consort and die of old age in the palace, so she volunteered herself and requested to become Zhao Yin’s strategist.\n\nZhao Yin, impressed by her courage, then sent her as an ambassador to Nation Cheng, under the pretext of celebrating King Cheng’s birthday to secretly steal classified information. Who would have thought that the rewrite of the volatile and tumultuous situation of the four countries’ history would have begun due to such a careless decision...\n\nThe gears of fate start to rotate: From a naive, pure and romantic girl, to a befitting Empress that rules the world; From a weak little girl who is at the mercy of others, to an all-powerful female Emperor of the generation…\n\nAs calamity is brought to the nation, the world is overturned.\n\nT/n: The female protagonist’s name comes from the phrase “chen yu luo yan”(which is part of a longer sentence), which was used to describe Xi Shi’s extraordinary beauty where it caused the fish to drown and the geese to fall. Xi Shi is one of Ancient China’s Four Beauties.>"
}