{
	"url": "https://www.novelupdates.com/series/rise-of-humanity/",
	"title": "Rise of Humanity - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2018/01/rise-of-humanity.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Fantasy   Harem   Martial Arts   Xuanhuan   ",
	"tags": "Arrogant Characters   Average-looking Protagonist   Clever Protagonist   Cultivation   Death of Loved Ones   Demons   Dragons   Friendship   Gods   Hard-Working Protagonist   Inheritance   Male Protagonist   Mythology   Pill Based Cultivation   Polygamy   Romantic Subplot   Soul Power   Souls   Spirit Advisor   Spirits   Sudden Strength Gain   Teachers   Unique Cultivation Technique   Weak to Strong   ",
	"rating": "(3.8 / 5.0, 213 votes)",
	"author": "Pig Nerd   Zai Zhu   宅猪   ",
	"year": "\n2015",
	"ranking": "#2000   #2000   #686   #10064   #2158   ",
	"reviewcount": "39 Reviews sorted by",
	"description": "In the world birthed by Pangu, the Three Sovereigns lit the spark of humanity that the Five Emperors would later fan into a blazing fire, eternally branding humanity as the leaders of the world….\n\nThis was a time where twilight had descended on the reign of the Human Sovereign and the Five Emperors had yet to emerge – humanity was merely one of the myriad races wandering about the vast cosmos.\n\nThis was a desolate and barren era. The monsters, devils, heavenly gods, and deities of all races stood aloft; with the demons, heavenly souls, and spirits dancing freely around the world.\n\nThe humans were still a feeble and burgeoning race, often taken as livestock and offered as sacrifices to the pantheon of races that ruled the world together from within the great wilderness.\n\nThis was not the era of the Foreworld, but the barbaric and untamed era of uncivilization!\n\nLet us rewind back to China’s ancient and classical mythology and recount the legendary tale of how a single figure led humanity out of an epoch of darkness and into a new dawn.\n\nPlease sit back, relax and enjoy the (Rise of Humanity) !>"
}