{
	"url": "https://www.novelupdates.com/series/above-the-firmament-legend-of-skyrim/",
	"title": "Above the Firmament: Legend of Skyrim - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/03/Above-the-Firmament-Legend-of-Skyrim.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Mature   Romance   Sci-fi   Smut   Yaoi   ",
	"tags": "Aliens   Artificial Intelligence   Bisexual Protagonist   Black Belly   Carefree Protagonist   Charismatic Protagonist   Charming Protagonist   Childhood Friends   Cold Love Interests   Comedic Undertone   Dense Protagonist   Devoted Love Interests   Earth Invasion   Fearless Protagonist   Futuristic Setting   Genius Protagonist   Handsome Male Lead   Heroes   Jealousy   Love Interest Falls in Love First   Military   Obsessive Love   Older Love Interests   Outer Space   Popular Love Interests   Possessive Characters   Post-apocalyptic   Scientists   Selfless Protagonist   Strong Love Interests   Tsundere   Wars   ",
	"rating": "(3.4 / 5.0, 17 votes)",
	"author": "Jiao Tang Dong Gua   焦糖冬瓜   ",
	"year": "\n2012",
	"ranking": "#2000   #2000   #10867   #10476   #10395   ",
	"reviewcount": "1 Review sorted by",
	"description": "Livy – a deadbeat of the Air Force Academy. Unruly, undisciplined, lazy. Before Claude, no one saw his talent, and as a leisurely and carefree fighter pilot, his [Livy’s] three main hobbies in life were beer, fried calamari, and hot babes.\n\nBut… why was that d*mned Claude always interrupting him right when he was about to get lucky? Even if he [Claude] was a bottom, he was a trashy bottom, a bottom that made his little top suffer helplessly……\n\nClaude – a man draped in halos galore. The youngest major general, the most perfect man, the most unsurpassable genius. Such a man had discovered Livy’s talent against the aliens’ one-sided defeat, and he would give to Livy the fighter jet that he regarded as his own life. He was obsessed with Livy, but he deeply understood that this man, who had turned his world upside down, would only belong to the sky.>"
}