{
	"url": "https://www.novelupdates.com/series/doomsday-ecstasy-cave/",
	"title": "Doomsday Ecstasy Cave - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/09/Doomsday-Ecstasy-Cave.jpeg",
	"noveltype": "(CN)",
	"genre": "Adult   Adventure   Harem   Mature   Romance   Sci-fi   Smut   Supernatural   ",
	"tags": "An*l   Apocalypse   Appearance Changes   Arrogant Characters   Beautiful Female Lead   Calm Protagonist   Charismatic Protagonist   Charming Protagonist   Clever Protagonist   C*nnilingus   Cold Protagonist   Confident Protagonist   Cruel Characters   Cunning Protagonist   Depictions of Cruelty   Devoted Love Interests   Dishonest Protagonist   Enemies Become Allies   Enemies Become Lovers   Evil Protagonist   Female Protagonist   First-time Interc**rse   F*llatio   Incest   Loyal Subordinates   Manipulative Characters   Nudity   Obsessive Love   Older Love Interests   Outdoor Interc**rse   Persistent Love Interests   Polyandry   Poor to Rich   Possessive Characters   Post-apocalyptic   Proactive Protagonist   Reverse Harem   R*pe   Ruthless Protagonist   Schemes And Conspiracies   Secretive Protagonist   Seduction   Shapeshifters   Shoujo-Ai Subplot   Shounen-Ai Subplot   Sister Complex   Special Abilities   Strength-based Social Hierarchy   Strong Love Interests   Threesome   Transformation Ability   Weak to Strong   Wealthy Characters   Younger Brothers   Younger Love Interests   Zombies   ",
	"rating": "(4.3 / 5.0, 151 votes)",
	"author": "苍汐落   ",
	"year": "\n2020",
	"ranking": "#386   #422   #1379   #259   #2394   ",
	"reviewcount": "38 Reviews",
	"description": "God made a joke with Chu Youning when the doomsday came. She was one of the lucky people among the first batch that awakened abilities, but the shapeshifting ability she awakened did not have any attack power at all. Seeing the people outside, Chu Youning gritted her teeth bitterly in the mouth of the zombies. As long as she can survive…she was willing to do anything.\n\nIn the eyes of others, Chu Youning turned the cannon fodder shapeshifting ability into a powerful ability, an ecstasy cave where countless people with powerful abilities rushed into the bewitching maze she created.\n\n…\n\nThe man pressed her tightly beneath him, clutching the chain around her neck in his hands, he said, “Become a mermaid tonight…”>"
}