{
	"url": "https://www.novelupdates.com/series/absolute-great-teacher/",
	"title": "Absolute Great Teacher - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/10/absolutegreatteacher3.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Comedy   Fantasy   Harem   Xuanhuan   ",
	"tags": "Academy   Alchemy   Arrogant Characters   Beautiful Female Lead   Books   Bookworm   Character Growth   Charismatic Protagonist   Charming Protagonist   Cheats   Cultivation   Cunning Protagonist   Doctors   Doting Love Interests   Enlightenment   Eye Powers   Famous Protagonist   Fast Cultivation   Fast Learner   Handsome Male Lead   Jack of All Trades   Late Romance   Library   Male Protagonist   Manipulative Characters   Master-Disciple Relationship   Overpowered Protagonist   Polygamy   Reincarnated in Another World   Shameless Protagonist   Shy Characters   Skill Books   Slow Romance   Student-Teacher Relationship   Sudden Strength Gain   Sword Wielder   System Administrator   Teachers   Transformation Ability   Transmigration   Transported to Another World   Underestimated Protagonist   Weak to Strong   Yandere   ",
	"rating": "(3.2 / 5.0, 47 votes)",
	"author": "Longing Washes Red Beans   相思洗红豆   ",
	"year": "\nN/A",
	"ranking": "#1380   #2000   #5734   #7728   #10110   ",
	"reviewcount": "20 Reviews sorted by",
	"description": "After the gold medal teacher, Sun Mo of the city's No. 2 Middle School, fell into the water, he transmigrated to Tang Guo, Zhongzhou Academy and became a newly graduated intern teacher. Sun Mo bound the Peerless Master System, turning waste into little geniuses. Under Sun Mo’s guidance, the little children became masters after one year, passed emperor level after three years, and attempted god level after five years.\r\n\r\nAn emperor-level boss! How dare you say that this master and apprentice are fakes? Swordsman, spear saint, sword demon, Wushuang Guoshi, a generation of devil emperor, two great saints, three saint supremes, all are taught by me. Are you afraid?\r\n\r\nHe had a pretty, white and rich fiancée who was the principal, but the prestigious school was declining. Any lower and it would be delisted and deposed. Sun Mo’s task is to help his fiancée sit firmly in the position of principal and help Zhangzhou return to the rich list.\r\n\r\nI will turn trash into gold, quoth Sun Mo.>"
}