{
	"url": "https://www.novelupdates.com/series/first-marriage-then-love/",
	"title": "First Marriage Then Love - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2015/10/c2cec3fdfc039245c6ac68268694a4c27d1e25f9.jpg",
	"noveltype": "(CN)",
	"genre": "Drama   Josei   Romance   Slice of Life   ",
	"tags": "Beautiful Female Lead   Black Belly   Business Management   Doting Love Interests   Female Protagonist   Handsome Male Lead   Heartwarming   Love Interest Falls in Love First   Marriage of Convenience   Modern Day   Naive Protagonist   Pregnancy   Wealthy Characters   ",
	"rating": "(4.2 / 5.0, 244 votes)",
	"author": "Mo Ying   莫萦   ",
	"year": "\nN/A",
	"ranking": "#1217   #2922   #1011   #2361   #1159   ",
	"reviewcount": "51 Reviews sorted by",
	"description": "She is of average status. He is young and powerful, achieving  status as a high ranking official of River City within a span of just a few years. She had a deep love, but being unable to endure the harsh reality of life, she left. He had also loved once before,  but he had been suffered betrayal from his girlfriend and friends, he delayed his marriage.\n\nHaving exchanged a few coincidental glances with him, she mistakenly assumed him to be her blind date, and without asking any other questions, she directly inquired him: “Do you want to come with me to get a card (marriage book)?”\n\nHe recognized this woman, and holding her with a feeling that was neither love nor hate, pleasure replacing surprise, he nodded: “I’m free in the afternoon!” He had not corrected her. \n\nAs per marital business, she offered him an agreement, calmly stating: She will agree to roll the bed sheet once a week! He quietly raised an eyebrow, mouth half-smiling, and flamboyantly signed his name. So because of this agreement…\n\n“Wife, it’s late, let’s get some rest,” the man stated. The woman looked in to his eyes, nodded, and turned off the bedside lamp. In the darkness, a pair of large hands probed into her clothes, caressing her skin like satin. It was a beautiful night.\n\nOn the second night: “Wife, it’s late, let’s get some rest, ” the man stated. The woman looked in to his eyes, nodded, turned off the bedside lamp and lay down to sleep. His dark, large hand reached up to her again and slid into her clothes, probing her smooth skin until it was then suddenly caught.\n\n“What are you doing? ” the woman asked coldly.\n\n”There is a marital agreement to fulfill! ” the man said, take it for granted, and then pressed on top of the woman. It was a spectacular night.\n\nThe next morning, the woman who was brimming with an aching waist and grief, came out from the study room with eyes wide open, angrily said: “Su Yicheng, you crafty Official!”\n\nThe agreement read: marriage, rest once a week!\n\nLove after marriage, warm and spoiled.>"
}