{
	"url": "https://www.novelupdates.com/series/running-away-hand-in-hand-with-the-second-female-lead/",
	"title": "Running Away Hand in Hand with the Second Female Lead - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/01/Running-Away-Hand-in-Hand-with-the-Second-Female-Lead.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Romance   School Life   Yuri   ",
	"tags": "Beautiful Female Lead   Devoted Love Interests   Doting Parents   Female Protagonist   Modern Day   Protagonist Falls in Love First   Transmigration   ",
	"rating": "(4.6 / 5.0, 106 votes)",
	"author": "成逆   ",
	"year": "\n2020",
	"ranking": "#1820   #1731   #2804   #2824   #3645   ",
	"reviewcount": "11 Reviews sorted by",
	"description": "Qin Juran finds herself transmigrated into an old-fashioned campus romance novel one day. The original character was a typical pretty but feeble “white lotus.”* Nothing but a dense crybaby, ignorant in many ways.\n\nAfter being used as cannon fodder, pushed around through and through by the male lead, she ends up happily ever after with the same male lead who did nothing but look at her coldly throughout the entire story.\n\nIn the blink of an eye, Qin Juran finds herself standing on top of a podium, a black minidress-wearing, smokey-eyed, pretty younger student standing besides her. She held a letter in her hand, saying, “Qin Juran, you say that you don’t like Fan Chuan, but your love letter sure says differently!”\n\nAmidst the stares of all the classmates around her, Qin Juran curved her lips and grabbed the letter, ripping it apart in a single motion. She stepped closer to the girl and leaned one hand on the blackboard behind her, tilting her chin up with the other. “What, are you jealous, babe?”\n\nRuan Nan: ???\n\nThe rest of the class: ???\n\nRuan Nan: “Qin Juran, actually, I never liked Fan Chuan in the first place. I just wanted to steal something of yours.”\n\nQin Juran: “What do you know, I never liked Fan Chuan either. I’d rather steal your heart.”\n\n“My name is Qin Juran, ‘Ju’ as in ‘unJUst desires.’ “My name is Ruan Nan, ‘Nan’ as in ‘iNANe life.’”**\n\n———\n\nAs Qin Juran read that old-fashioned campus romance novel, she hated the white lotus main character, of the same name, from the start. Instead, she was fascinated by the cool, brave, dashing, straightforward “evil” second female lead. She always hoped that one day in the future…\n\n“Ruan Nan, do you know what it means, to long that for ‘one day’”?\n\n**The Chinese character for “jū” in Qin Juran’s name is the same character as in the term “jūxīnpǒcè,” which means to harbor ill intentions. Similarly, the character for “nán” in Ruan Nan’s name is in the term “Tài nánle,” which is an expression for “life is too hard.” These were the closest equivalents I could come up with English.>"
}