{
	"url": "https://www.novelupdates.com/series/fake-dating-the-amnesiac-school-prince/",
	"title": "Fake Dating the Amnesiac School Prince - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/12/Fake-Dating-the-Amnesiac-School-Prince.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Romance   School Life   Yaoi   ",
	"tags": "Amnesia   Bullying   Character Growth   Clumsy Love Interests   Complex Family Relationships   Cute Protagonist   Dishonest Protagonist   Doting Love Interests   Emotionally Weak Protagonist   Enemies Become Lovers   Forced into a Relationship   Love Interest Falls in Love First   Misunderstandings   Modern Day   Strong Love Interests   Weak Protagonist   ",
	"rating": "(4.0 / 5.0, 241 votes)",
	"author": "Qiáo bì   乔陛   ",
	"year": "\n2019",
	"ranking": "#1326   #4167   #2134   #1999   #1864   ",
	"reviewcount": "49 Reviews sorted by",
	"description": "Zhen Yuanbai, the good student, accidentally injured Shi Bufan, the school bully, after a crash. Blood spilled everywhere.\r\n\r\nAfter the ambulance took Shi Bufan to the hospital, Zhen Yuanbai walked home, trembling in fear. He pleads for his parents to transfer him to another school. As expected, his parents rejected his request.\r\n\r\nZhen Yuanbai has no choice but to brace himself to go and apologize to Shi Bufan. Hopefully, he will show mercy while giving him a beating.\r\n\r\nWho knew —\r\n\r\nShi Bufan had amnesia.\r\n\r\nZhen Yuanbai couldn’t control his happiness. You really don’t know me? I’m your friend. After he lied and claimed to be Shi Bufan’s friend, Zhen Yuanbai quickly realized that he looked at himself strangely.\r\n\r\nUntil one day, Shi Bufan pushed him against the wall. He pecked his bewildered face and lowly chuckled. What friends? I knew that you like me and used this opportunity to get close to me… Be good. I’ll give you a chance. Call me hubby.\r\n\r\nZhen Yuanbai was speechless.\r\n\r\nWake up!\r\n\r\nDon’t mention that I like you as a friend when I was the one who caused you the injury!\r\n\r\nSubmissive: Because he, a well-behaved and timid good student, was scared of being beaten up, he lied to the school bully. Confusedly, he ended up in a relationship with Shi Bufan.\r\n\r\nDominant: After losing his memory, he ended up fake dating Zhen Yuanbai, thinking that the latter was in love with him.>"
}