{
	"url": "https://www.novelupdates.com/series/my-younger-brother-forces-my-flower-path/",
	"title": "My Younger Brother Forces My Flower Path - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/01/My-Younger-Brother-Forces-My-Flower-Path.jpg",
	"noveltype": "(KR)",
	"genre": "Comedy   Drama   Fantasy   Romance   ",
	"tags": "Adapted to Manhwa   Aristocracy   Doting Older Siblings   European Ambience   Female Protagonist   Male Yandere   Nobles   Royalty   Second Chance   Sibling's Care   Sister Complex   Younger Brothers   ",
	"rating": "(4.1 / 5.0, 87 votes)",
	"author": "Heila   하일라   ",
	"year": "\n2020",
	"ranking": "#2000   #6290   #5329   #4462   #2825   ",
	"reviewcount": "1 Review sorted by",
	"description": "I have a younger brother. A good little brother who does anything for his sister. \n\nThe problem is, he doesn’t know the right way. \n\n“Sister, now this is yours.” \n\nWhat my brother gave me was the crown that was on the tyrant’s head just until yesterday. \n\n“Sister, you said you wanted to be an emperor. I’ll be your knight.”\n\nWhen did I say that, crazy brother? \n\nSo, I became the emperor thanks to my crazy little brother. \n\nI’m doing well because it seems to suit my aptitude.  \n\n“Sister! I’ll make the continent kneel under your feet!”\n\nMy brother kept raising the scale. \n\nHey, you crazy bastard, that’s not it…\n\nAt this rate, I’m likely to die of overwork even before I become the first emperor to unify the continent. \n\nThis can’t be done. I need to find a good worker, no, a husband.\n\n“Eddy, I’m thinking of getting married now.”\n\n“I’ll find the best brother-in-law in the world.”\n\n“No need to be the best in the world, just work well and listen well…”\n\n“I can’t accept a man who’s weaker than me to be sister’s partner. I’ll prepare for a National Tournament!”\n\nYou son of a. Listen to me. \n\nThe husband who survived the final battle was the Duke of Dehart, the Monster of the North. \n\nHe was the second crazy man who dreamed of reunifying the continent with his brother-in-law. \n\nHa, these bastards are really…>"
}