{
	"url": "https://www.novelupdates.com/series/kill-the-lights/",
	"title": "Kill the Lights - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2015/09/killthelight.png",
	"noveltype": "(KR)",
	"genre": "Action   Comedy   Drama   Mystery   Romance   Smut   Supernatural   Yaoi   ",
	"tags": "Acting   Adapted to Drama CD   Adapted to Manhwa   Betrayal   Calm Protagonist   Celebrities   Charismatic Protagonist   Death of Loved Ones   Famous Parents   Famous Protagonist   Handsome Male Lead   Hard-Working Protagonist   Hated Protagonist   Hiding True Identity   Kidnappings   Long Separations   Love Interest Falls in Love First   Male Yandere   Mature Protagonist   Mercenaries   Modern Day   Movies   Near-Death Experience   Obsessive Love   Orphans   Past Plays a Big Role   Past Trauma   Popular Love Interests   Possessive Characters   Previous Life Talent   R-18   R*pe   Second Chance   Showbiz   Tragic Past   Transmigration   Wealthy Characters   Younger Love Interests   ",
	"rating": "(4.3 / 5.0, 686 votes)",
	"author": "Jangryang   장량   ",
	"year": "\n2012",
	"ranking": "#2510   #6371   #963   #2686   #432   ",
	"reviewcount": "94 Reviews",
	"description": "Mason was a mercenary, until the day he died on a mission after being betrayed by his unit.\n\nAt the same time, there was a Hollywood actor named Haley Lusk. While famous as a child actor, as an adult, he grew addicted to drugs and sex. With a nasty personality and sub-par acting ability, Haley was disliked, yet he still confessed to Noah Raycarlton in front of the world causing him to be hated by most people. Then one day, he suddenly had a heart attack and died.\n\nNoah Raycarlton is the young CEO of a big company. Though not a celebrity, his mother was an immensely popular actress. Due to his good looks and kindness, he is loved by everyone.\n\n Mason thought he was dead for sure, but he woke up in the hospital full of people he didn’t know. They told him that they were his family and called him Haley. He was so confused, and people told him that he had a heart attack due to overdose and died for a while. \n\nHe realizes that his soul went inside of this Hollywood actor Haley Lusk, and he decides to live a second life. But because of things that Haley did, he has a difficult time with Noah and other people. Mason finds out right away that in his old life, he knew Noah as a child.>"
}