{
	"url": "https://www.novelupdates.com/series/arifureta-shokugyou-de-sekai-saikyou-ln/",
	"title": "Arifureta Shokugyou de Sekai Saikyou (LN) - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2016/05/ari-1.png",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Drama   Ecchi   Fantasy   Harem   Mature   Mecha   Mystery   Supernatural   ",
	"tags": "Adapted to Anime   Adapted to Drama CD   Adapted to Manga   Adventurers   Animal Characteristics   Antihero Protagonist   Appearance Changes   Appearance Different from Actual Age   Artifact Crafting   Artifacts   Average-looking Protagonist   Beastkin   Beautiful Female Lead   Betrayal   Bullying   Character Growth   Chuunibyou   Clever Protagonist   Cold Protagonist   Cute Children   Death   Demi-Humans   Demon Lord   Demons   Depictions of Cruelty   Dragons   Dungeons   Evolution   Fantasy World   Firearms   First-time Interc**rse   Game Elements   Godly Powers   Gods   Heroes   Human-Nonhuman Relationship   Level System   Loli   Love Interest Falls in Love First   Male Protagonist   Male Yandere   Masochistic Characters   Monsters   Multiple Transported Individuals   Older Love Interests   Overpowered Protagonist   Personality Changes   Polygamy   R-15   Ruthless Protagonist   Saving the World   Skill Assimilation   S*aves   Special Abilities   Strong Love Interests   Student-Teacher Relationship   Sudden Strength Gain   Sword And Magic   Transported to Another World   Tsundere   Underestimated Protagonist   Unique Weapons   Vampires   Weak to Strong   World Travel   ",
	"rating": "(3.7 / 5.0, 332 votes)",
	"author": "Ryo Shirakome   白米良   ",
	"year": "\n2015",
	"ranking": "#2000   #2000   #2808   #4930   #1377   ",
	"reviewcount": "33 Reviews sorted by",
	"description": "Seventeen year old Hajime Nagumo is your average, everyday otaku. However, his simple life of pulling all-nighters and sleeping in school is suddenly turned upside down when he, along with the rest of his class, is summoned to a fantasy world! They're treated like heroes and tasked with the duty of saving the human race from utter extinction. But what should have been any otaku's wet dream quickly turns into Hajime's nightmare. While the rest of his class are blessed with godlike powers, Hajime's job, Synergist, only has a single transmutation skill. Ridiculed and bullied by his classmates for being weak, he soon finds himself in despair. Will he be able to survive in this dangerous world of monsters and demons with only a glorified blacksmith's level of strength?>"
}