{
	"url": "https://www.novelupdates.com/series/i-became-a-fanboy-of-the-villain/",
	"title": "I Became a Fanboy of the Villain - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/12/I-Became-a-Fanboy-of-the-Villain.png",
	"noveltype": "(CN)",
	"genre": "Comedy   Fantasy   Romance   School Life   Sci-fi   Slice of Life   Xianxia   Yaoi   ",
	"tags": "Acting   Aliens   Celebrities   Childish Protagonist   Cross-dressing   Cultivation   Cute Protagonist   Demons   Dense Protagonist   Devoted Love Interests   Doting Love Interests   Doting Parents   Dragons   First Love   Futuristic Setting   Handsome Male Lead   Heartwarming   Humanoid Protagonist   Lack of Common Sense   Love Interest Falls in Love First   Military   Misunderstandings   Mob Protagonist   Modern Day   Monsters   Naive Protagonist   Outer Space   Popular Love Interests   Protagonist Strong from the Start   Royalty   Showbiz   Strong Love Interests   System Administrator   Transmigration   World Hopping   ",
	"rating": "(4.5 / 5.0, 113 votes)",
	"author": "No words needed   不著一字   ",
	"year": "\n2018",
	"ranking": "#905   #287   #3466   #1696   #2150   ",
	"reviewcount": "10 Reviews sorted by",
	"description": "After sleeping for 800 years, the Great Demon, Bai Zhi, had woken up in the 21st century. A certain demon had then run around the modern world, surprised to find out that all of the spiritual fruits had gone extinct. He had quickly become very hungry. At that time, the system had appeared. \n\n“You can get 20 demonic spiritual fruits by blocking the gun for the great villain.”\n\nBai Zhi looked at his body that had been beaten into a sieve, “Oh.”\n\n“You can get 50 bottles of demonic spiritual liquid by being a scapegoat for the Great Villain.”\n\nBai Zhi touched the black ash on his face, “Finished.”\n\n“I’ll present hundreds of demonic spiritual barbecues as a gift if you die in place of the villain.”\n\nBai Zhi silently held the large knife pushed inside of him, “The barbecue must be very spicy.”\n\nA certain villain: “For the sake of you liking me so much, I’ll consider snatching a $9 marriage license.”\n\nBai Zhi, who was in the middle of silently nibbling barbecue, “Ah?”>"
}