{
	"url": "https://www.novelupdates.com/series/an-athlete-held-up-by-an-entertainment-career/",
	"title": "An Athlete Held up by an Entertainment Career - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/02/An-Athlete-Held-Up-By-An-Entertainment-Career.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Comedy   Romance   Sports   Yaoi   ",
	"tags": "Level System   Previous Life Talent   Reincarnation   Showbiz   Transmigration   ",
	"rating": "(4.6 / 5.0, 89 votes)",
	"author": "懒就   ",
	"year": "\n2020",
	"ranking": "#1171   #3670   #3686   #4571   #2812   ",
	"reviewcount": "23 Reviews sorted by",
	"description": "Yu Nian transmigrates into a romance novel, where he becomes a beautiful cannon fodder in the Entertainment Industry.\n\nHe is used to contrast to the Protagonist’s innocent, hard-working personality, boosting him to extreme popularity; the Beautiful Cannon Fodder is a vulgar, degenerate, uninteresting, and outrageous vase.\n\nThat’s what everyone thought.\n\nUntil Yu Nian participated in the All-Star Games.\n\nIn the Figure Skating Competition at the All-Star Games, the requirements are high and the number of participants is low. Celebrities can win a medal after skating a few laps on the ice, the scene can be described as chickens pecking each other.\n\nWhen it was Yu Nian’s turn to perform, the teenager took off his jacket to reveal a tight-fitting costume that emphasized his narrow waist, slender body, and his long legs—causing many in the audience to have a dry mouth. Before the fans could let out their admiration, Yu Nian landed a Triple Axel.\n\nFans: “…!”\nReferee: “???” \\(⊙０⊙)/\n\nAfter the game, there were rumors that the National Team’s Coach was seen backstage of the arena, holding the teenager’s hand and was dead set on not letting him leave.\n\nIn response, Yu Nian confessed, “Actually, I’m not good at figure skating.”\nFans: “You are too modest.”\n\nLater, snowboarding, free rock climbing, parkour, alpine skiing.\nFans found out that he was really not good at figure skating. He was an extreme sports athlete.\n99 curved Tongtian Avenue.\nThe summit of Chieftain Rock, a vertical mountain of three thousand feet.\nSurfing on a giant wave with a height of 30 meters on the North Beach of Nazare.\nKawagarbo, a sacred mountain that refuses to be climbed by human beings.>"
}