{
	"url": "https://www.novelupdates.com/series/intercepting-the-boyfriend-when-he-was-young/",
	"title": "Intercepting the Boyfriend When he Was Young - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/07/Intercepting-the-Boyfriend-When-he-Was-Young.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Romance   School Life   ",
	"tags": "Clever Protagonist   Clingy Lover   Cute Protagonist   Early Romance   Female Protagonist   Handsome Male Lead   Helpful Protagonist   Popular Love Interests   Time Paradox   Time Travel   ",
	"rating": "(3.2 / 5.0, 18 votes)",
	"author": "Mo Shu Bai   墨书白   ",
	"year": "\nN/A",
	"ranking": "#2000   #2000   #9130   #9890   #10078   ",
	"reviewcount": "5 Reviews sorted by",
	"description": "When Jiang Huaian went on a blind date with Xia Jiujiu, he said that when he was in high school, he had a good temper, good grades, four bare walls for a home¹, and in dire straits. He was bullied by his classmates, shunned by the goddess, having never felt love and care.  Thus, Xia Jiujiu’s compassionate heart burst. She took him to the movies and went to the amusement park, doing everything he hadn’t done before when he was a youth, and then…became his wife. \n\nOne day, she went back to when she was sixteen. Xia Jiujiu carried a brick and a bag of cash with her as she headed to the City’s No. 1 High School to find Jiang Huaian, determined to give him a good memory of his youth. Overthrow all those who bullied him, and eliminate all the evil forces! \n\nXia Jiujiu: “Excuse me, is the Jiang Huaian in your class here? The one with good temperament, good grades, four bare walls for a home, and was in dire straits?” \n\nJiang Huaian, who is carrying a brick to go out and fight, was stunned: “Who? Who the hell are you talking about?” \n\nXia Jiujiu: “…” \n\nSo Xia Jiujiu found out that what Jiang Huaian needed the most was not money or love, but a set of sample university exam questions. Don’t casually believe others; this was the most profound truth of life taught to Xia Jiujiu by this flirtatious melodramatic little brother Jiang. >"
}