{
	"url": "https://www.novelupdates.com/series/the-male-leads-villainess-stepmother/",
	"title": "The Male Lead’s Villainess Stepmother - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/10/stepmother.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Drama   Josei   Mature   Romance   Slice of Life   ",
	"tags": "Beautiful Female Lead   Businessmen   Childcare   Cowardly Protagonist   Cute Children   Cute Protagonist   Cute Story   Doting Love Interests   Female Protagonist   Handsome Male Lead   Heartwarming   Love Interest Falls in Love First   Manipulative Characters   Modern Day   Older Love Interests   Slow Romance   Transmigration   Villainess Noble Girls   Wealthy Characters   ",
	"rating": "(3.6 / 5.0, 453 votes)",
	"author": "Sei Koshi Ruka   清越流歌   ",
	"year": "\n2019",
	"ranking": "#699   #4730   #248   #236   #517   ",
	"reviewcount": "151 Reviews sorted by",
	"description": "Yan Shuyu, a big fan of all sorts of cliche CEO novels, had transmigrated into a book --\n\nIn the novel, the wealthy CEO male lead has a villainous stepmother. She put up a front of being nice and tender to him, when in fact she was bullying the male lead with her son. After she had successfully driven the male lead and his father apart, her ambition continued to grow as she attempted to take away the inheritance from the male lead. In the second half of the book, the truth came out — that the father had no feelings for her whatsoever but was merely using the two of them to hone his son’s character. In the end, both the stepmom and her son were sent to jail by the male lead after he took over the family business.\n\nYan Shuyu transmigrated and became the well-hated villainous stepmother, but she had transmigrated to the time before everything happened, and the male lead was still a foolish child. Only a fool would want to become the stepmother of a foolish child. Yan Shuyu took a longing look at her “assigned husband”, who was pretty much like the Sleeping Beauty, before she quickly packed up and made a run for it.\n\nAfter that, Yan Shuyu checked out her $250 remaining on her card. She turned to look at her son, who was clinging onto her leg and asking for milk. She wanted to look up at the sky and howl. Is it too late to go back to become the male lead’s whetstone?>"
}