{
	"url": "https://www.novelupdates.com/series/acting-spoiled-in-his-indifferent-arms/",
	"title": "Acting Spoiled In His Indifferent Arms - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/07/7F52CA42-98FC-45B3-B10D-503F94D62AE1.jpeg",
	"noveltype": "(CN)",
	"genre": "Drama   Romance   School Life   ",
	"tags": "Aggressive Characters   Arrogant Characters   Beautiful Female Lead   Bullying   Calm Protagonist   Cautious Protagonist   Delinquents   Family Conflict   Female Protagonist   Handsome Male Lead   Modern Day   Revenge   Second Chance   Sibling Rivalry   Tragic Past   Wealthy Characters   ",
	"rating": "(4.0 / 5.0, 73 votes)",
	"author": "春风榴火   ",
	"year": "\n2019",
	"ranking": "#2836   #6361   #5378   #4880   #4658   ",
	"reviewcount": "20 Reviews sorted by",
	"description": "If she were to make the choice again, Ji Bai would never have let her two-faced sickly sister use her as a personal blood bank. She simply wanted to live her own life.\n\nBut in her previous life, Ji Bai ended up neglecting that intimidating young boy.\n\nWhen she escaped the hospital in an anemic state with nowhere to go, she fainted in the streets. He brought her home, took care of her meticulously and cherished her.\n\nFor countless long nights, he would kiss the ugly scar on her spine where they drew blood from her.\n\nEven after her death, he went mad and broke into the funeral to take her ice cold body.\n\nReturning to when she was 16, Ji Bai seemed to not be afraid of him. When he stared at her from a dark and gloomy corner, Ji Bai looked back at him with a sweet smile.\n\n“As long as you behave, I’ll be your good friend.”\n\nHearing her sincere warning, he looked down at her and laughed coldly——\n\n“Who the hell wants to be your good friend?”\n\nHe just wanted to hold her in his arms.\n\n**\n\nNow that she was reborn, Ji Bai wanted to pay her gratitude to Xie Sui and change his rough destiny. But that violent teenager seemed to not have taken her warning seriously.\n\nUntil one day, Xie Sui stopped her from leaving the classroom and held her hand tightly. His body was burning hot, and there was a devilish smile on his lips.\n\n“You want me to listen to you? Then be more obedient.”>"
}