{
	"url": "https://www.novelupdates.com/series/kusuriya-no-hitorigoto/",
	"title": "Kusuriya no Hitorigoto - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2017/06/14967911908981.jpg",
	"noveltype": "(JP)",
	"genre": "Drama   Historical   Mystery   Romance   Seinen   Slice of Life   ",
	"tags": "Adapted to Drama CD   Adapted to Manga   Adopted Protagonist   Age Progression   Ancient China   Androgynous Characters   Appearance Changes   Average-looking Protagonist   Calm Protagonist   Cautious Protagonist   Clever Protagonist   Cold Protagonist   Couple Growth   Curious Protagonist   Death   Depictions of Cruelty   Different Social Status   Divination   Doctors   Eunuch   Female Protagonist   Handsome Male Lead   Herbalist   Hiding True Abilities   Hiding True Identity   Imperial Harem   Insects   Investigations   Kidnappings   Lack of Common Sense   Love Interest Falls in Love First   Low-key Protagonist   Manipulative Characters   Medical Knowledge   Misunderstandings   Mystery Solving   Past Plays a Big Role   Persistent Love Interests   Pharmacist   Poisons   Politics   Pragmatic Protagonist   Prostit**es   Quirky Characters   R-15   Royalty   Schemes And Conspiracies   Secret Identity   Shameless Protagonist   Sharp-tongued Characters   Sickly Characters   Slow Romance   Smart Couple   Underestimated Protagonist   ",
	"rating": "(4.6 / 5.0, 398 votes)",
	"author": "Natsu Hyuuga   日向夏   ",
	"year": "\n2011",
	"ranking": "#2002   #2216   #438   #5412   #180   ",
	"reviewcount": "34 Reviews sorted by",
	"description": "There is a certain large country in the central plains of the mainland. In the imperial court of its emperor, there is a girl. Her name is Maomao, a pharmacist from the pleasure district, who is currently working as a maidservant in the inner palace. The girl, who surely can not be considered a beauty, is keeping a low-profile waiting for her contract to end. She is confident that she will not be “visited” by the emperor. During that, she learns about the short lives of the children of the emperor. Maomao, hearing that the two surviving children are critically ill, begins her investigation for the cause—.\n\nSet in the middle ages of the East, the “Food Taster” girl continues to solve difficult cases in the imperial court one after another.>"
}