{
	"url": "https://www.novelupdates.com/series/the-princess-wants-to-live/",
	"title": "The Princess Wants to Live - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/11/The-Princess-Wants-to-Live.jpg",
	"noveltype": "(KR)",
	"genre": "Comedy   Drama   Fantasy   Romance   ",
	"tags": "Age Regression   Amnesia   Aristocracy   Beautiful Female Lead   Bickering Couple   Cautious Protagonist   Cold Love Interests   Conditional Power   Couple Growth   Cunning Protagonist   Curious Protagonist   Cute Protagonist   Determined Protagonist   Different Social Status   Empires   Enemies Become Lovers   European Ambience   Evil Gods   Evil Religions   Famous Protagonist   Fast Learner   Female Protagonist   Handsome Male Lead   Hard-Working Protagonist   Honest Protagonist   Kingdoms   Knights   Leadership   Love Interest Falls in Love First   Magic   Multiple Timelines   Pacifist Protagonist   Past Plays a Big Role   Previous Life Talent   Proactive Protagonist   Religions   Righteous Protagonist   Royalty   Schemes And Conspiracies   Secret Organizations   Sharp-tongued Characters   S*aves   Smart Couple   Strong Love Interests   Stubborn Protagonist   Sword And Magic   Time Loop   Wars   Wealthy Characters   Witches   ",
	"rating": "(4.5 / 5.0, 16 votes)",
	"author": "Jinsoo Yoon   진수윤   ",
	"year": "\n2021",
	"ranking": "#2000   #2000   #8419   #10269   #7100   ",
	"reviewcount": "3 Reviews sorted by",
	"description": "“It’s because I’m a s*ave.”\n\nSo said the man who killed her as he smirked.\n\nAfter her fourth return, entering her fifth life, she made up her mind. She needed to stop the one responsible for starting the Continental War, and survive!\n\n“What is required?”\n\n“Let go.”\n\n“Tell me what you want! No, what you need! Whatever it takes, I won’t allow you to start a war!”\n\nThe moment she grabbed that man’s pant leg and looked up him, looking back at her were his eyes, as deep as an abyss.\n\n“Once you say something, you have to take responsibility for it, Princess.”\n\nWill she be able to protect the peace of the world from this man and survive safely?>"
}