{
	"url": "https://www.novelupdates.com/series/acting-like-a-cannon-fodder-is-the-best-life/",
	"title": "Acting Like a Cannon Fodder is the Best Life - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/09/Acting-Like-a-Cannon-Fodder-is-the-Best-Life.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Drama   Romance   Shounen Ai   ",
	"tags": "Arranged Marriage   Cold Love Interests   Cute Protagonist   Dense Protagonist   Doting Love Interests   Doting Older Siblings   First Love   Forced Living Arrangements   Love at First Sight   Love Interest Falls in Love First   Misunderstandings   Mob Protagonist   Naive Protagonist   Older Love Interests   Transmigration   Wealthy Characters   ",
	"rating": "(3.8 / 5.0, 32 votes)",
	"author": "季放   ",
	"year": "\n2021",
	"ranking": "#2000   #2000   #8267   #4389   #7480   ",
	"reviewcount": "6 Reviews sorted by",
	"description": "Yan Yan has become the cannon fodder in the novel.\n\nYoung Master Cannon Fodder was lost when he was a child, and when he was found he was covered with scent of red dust (1) , his lazy look provoked annoyance. So it didn’t take long for the cannon fodder to be sent to marriage by his family. The marriage partner is the protagonist of the book.\n\nAfter the marriage, the cannon fodder not only failed to curb it , but became more able to do it. He pestered the protagonist all day acting coquettish, and finally the protagonist gave the cannon fodder a huge sum of money and drove the person out of the house.\n\nAfter seeing the “end” of the cannon fodder, Yan Yan’s eyes lit up. Behave in a spoiled manner? He is best at it. It is guaranteed that the protagonist will not be able to bear it within three months, and he will be driven out with a huge sum of money.\n\nBecause of a favor owed by his father, Ji Juechuan, who has already achieved something at a young age, had to marry the young master of Yanjia who doesn’t love his mother or father.\n\nOn the first day of cohabitation before marriage, Ji Juechuan sat on the side of the bed and looked at his mobile phone. His face became even more ugly when he thought that he would be sleeping in a bed with the perfume-scented person. He will make it clear as soon as he arrives, and let the man pay attention to his behavior.\n\nThe bathroom door opened, and a soft and refreshing ball rolled into his arms. The young man with wet hair raised his face and smiled sweetly: “Husband, can I sleep with you tonight?”\n\nJi Juechuan looked at the person in his arms for a long time, and his Adam’s apple moved slightly.\n\n“Yes.”\n\nLater, Yan Yan received a huge sum of money from Ji Juechuan. It was just that the ticket he had prepared was torn to pieces. The man’s hot hands pressed against his waist, his tone dangerous.\n\n“Yanyan, our wedding hasn’t been held yet, where do you want to go?”\nYan Yan:? That’s not what it says in the book!\n\n*Mr Ji at the beginning: #Who is his wife? Anyway, it’s not my wife#\n\nLater: #Do you have a wife yourself? Why do you covet my wife all day? #\n\n*sā jiāo in the title means to act like a spoiled child/ to act coquettishly\n\n*(1) 红尘 (hóng chén) the world of mortals (Buddhism) / worldly affairs. It’s a part of a poem, the actual phrase is 看破红尘 ( kān pò hóng chén) to see through the world of mortals or to see through red dust/ disillusioned with human society to reject the world for a monastic life>"
}