{
	"url": "https://www.novelupdates.com/series/dear-not-cunning-witch/",
	"title": "Dear Not Cunning Witch - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/11/Dear-Not-Cunning-Witch.jpg",
	"noveltype": "(KR)",
	"genre": "Adventure   Drama   Fantasy   ",
	"tags": "Demons   European Ambience   Female Protagonist   Industrialization   Magic   Slow Romance   Witches   Wizards   ",
	"rating": "(4.4 / 5.0, 34 votes)",
	"author": "Kim DaHyun   김다현   ",
	"year": "\n2015",
	"ranking": "#6970   #6154   #6767   #6614   #6223   ",
	"reviewcount": "3 Reviews sorted by",
	"description": "An age where science was at the height of its rapid development.\r\nThe smooth lines of railroad tracks had divided Ingram’s large landmass cardinally by the time people had really noticed,\r\nAnd large airships were being developed in their factories by the day in hopes for future commercial use.\r\nThe fruits of science were being shared amongst everyone.\r\n\r\nYet, there still existed almighty beings who could create fire in their bare hands or summon the rain on demand.\r\nIt was a supreme talent that no enlightened reasoning could explain and not even the most developed sciences could dare encroach upon.\r\nPeople had revered them and regarded them with fear and awe since long ago.\r\n\r\nThey, who were sometimes called gods and sometimes called demons —the witches.\r\n\r\nDiana was an unfortunate witch who was born the daughter of a great witch but had inherited none of her mother’s talent.\r\n“You must be the most worthless witch in existence.'\r\nDiana had been taken in by her teacher at the tender age of seven, and the only thing she had wished for ever since\r\nWas only to gain her independence as quickly as possible and to live together happily with Hester, her beloved older sister.\r\n\r\nBut dark clouds hang over even the path she took to finally meet her sister after having gained her independence…….\r\n\r\n“Your trip might be a little long.”\r\n\r\nThe stars had set down an ominous prophecy —what kind of future did they point to?>"
}