{
	"url": "https://www.novelupdates.com/series/im-a-fake-saint-but-the-gods-are-obsessed/",
	"title": "I’m a Fake Saint But the Gods are Obsessed - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/04/Im-a-Fake-Saint-But-the-Gods-are-Obsessed.jpeg",
	"noveltype": "(KR)",
	"genre": "Comedy   Fantasy   Harem   Romance   ",
	"tags": "Aristocracy   Beautiful Female Lead   Clever Protagonist   European Ambience   Female Protagonist   Game Elements   God-human Relationship   Goddesses   Gods   Handsome Male Lead   Love Interest Falls in Love First   Male Yandere   Nobles   Obsessive Love   Religions   Reverse Harem   Royalty   Saints   System Administrator   Transmigration   Transported to Another World   ",
	"rating": "(4.1 / 5.0, 63 votes)",
	"author": "Junye   준예   ",
	"year": "\n2021",
	"ranking": "#723   #598   #3532   #1536   #3005   ",
	"reviewcount": "5 Reviews",
	"description": "I possessed a fake saintess who was going to die when the real saint appeared five years later.\n\n‘Let’s just stay still. Isn’t this an opportunity?’\n\nAt least a building owner just by collecting from the saintess’ salary!\n\nSo I was planning to run away after properly acting like a saintess, but…\n\nSomehow, the Gods are in weird conditions, though?\n\n[God of Knowledge, Hessed, sighs in relief when he sees your body.]\n[God of Benevolence, Oman, declares that he will kill the bastard who treats you disrespectfully.]\n[God of Love, Odyssey is fueling with arrogance next to you.]\n[God of Destruction, Ciel, is shedding tears worrying if you got hurt.]\nIn addition, the candidates for the male lead, who were cold to the fake saintess in the original story, are surely somewhat strange!\n\n“Why do I have mixed thoughts whenever I think of you?”\n\nThe High Priest, who used to be a watcher, comes whenever he have time, “I want you to be in the position of the Crown Princess.”\n\nThe Crown Prince, who hated and avoided me, proposed, “Tell me if you want anything. I’ll give you a title if you want to.”\n\nThe Merchant Owner, who used to say he had no feelings, kept looking at me and trying to give me something!\n\nOn top of that, the villain, who was supposed to destroy the world, said that he would cooperate, let alone, kill me. But!\n\nNo, I’m a saintess and I have no interest in the end of the world!\n\nJust let me be a building owner according to my original plan!>"
}