{
	"url": "https://www.novelupdates.com/series/my-bloodthirty-husband-is-so-gentle/",
	"title": "My Bloodthirty Husband is So Gentle - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/02/bloodthirstyhusband1a.jpg",
	"noveltype": "(CN)",
	"genre": "Romance   Shoujo   ",
	"tags": "Adapted to Manhua   Amnesia   Beautiful Female Lead   Black Belly   Celebrities   Charismatic Protagonist   Charming Protagonist   Confident Protagonist   Devoted Love Interests   Doctors   Famous Protagonist   Female Protagonist   Genies   Genius Protagonist   Handsome Male Lead   Hospital   Love Interest Falls in Love First   Male Yandere   Modern Day   Music   Mysterious Past   Obsessive Love   Past Plays a Big Role   Secrets   Showbiz   Singers   Twisted Personality   Wealthy Characters   Yandere   ",
	"rating": "(3.9 / 5.0, 23 votes)",
	"author": "Gu Nanxi   顾南西   ",
	"year": "\n2017",
	"ranking": "#2000   #2000   #8808   #10659   #8077   ",
	"reviewcount": "3 Reviews sorted by",
	"description": "“Shengsheng, Shengsheng…”\n\nHe always addressed her so gently and lovingly.\n\nPeople described him as a bright and graceful young man who was as noble as a piece of jade, heh, but they had never seen how he looked cutting open corpses with a scalpel. Oh, how his eyes glowed red.\n\nHe had a name that sounded gentle: Shi Jin.\n\nJiang Jiusheng first saw Shi Jin in the elevator of her apartment.\n\n“Your hands are really pretty,” she exclaimed in genuine admiration and was unable to shift her gaze away. “Can I… touch them?”\n\nHe was surprised.\n\nShe explained, “I’m sorry, I have a slight hand fetish.”\n\nHe hesitated for a rather long time. “I’m sorry, I’m a bit of a clean freak.”\n\nAfter a pause, she asked in a serious tone, “Is it okay for me to just touch them briefly?”\n\nThe rock star, Jiang Jiusheng, had a hand fetish. Her new neighbor was a doctor and coincidentally had a pair of hands that she wished she could keep for herself.\n\nSome time in the future, he stood in the bathroom of their new apartment, holding a scalpel with his bloody hands. His back was to her. There was blood all over the floor, and a broken limb. From the pile of bloody bones, she could tell that they belonged to the stray human she had brought home.\n\nShe asked, “What are you doing?”\n\nHe answered, “Dissecting a corpse.”\n\nShe took a step back, but he pressed her down to the cold floor of the bathroom and ripped off her clothes. The blood on the floor stained her snow-white skin.\n\nHe said, “Shengsheng, if I can choose how I die, I hope I die on top of you.”\n\nHe said, “Shengsheng, I’m a doctor who can’t cure himself. I’m sick, blood makes me excited and compels me to slaughter, and you make me feel thirsty for blood. You’re the reason why I’m driven to murder.”\n\nHe said, “Shengsheng, save me. If you don’t hold my hand, I’ll kill myself after I kill everybody who tries to take you away from me.”\n\nShe took his hand, and said, “Shi Jin, the blood on the floor will dirty my shoes. I want you to carry me out of here.”\n\nShe had never loved someone so much that she was willing to descend into hell with him.\n\nHe had never loved someone so much that he was willing to set aside his butcher knife for her.>"
}