{
	"url": "https://www.novelupdates.com/series/the-horror-movie-male-leads-winter/",
	"title": "The Horror Movie Male Lead’s Winter - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/01/The-Horror-Movie-Male-Leads-Winter.jpg",
	"noveltype": "(CN)",
	"genre": "Drama   Romance   Shounen Ai   Slice of Life   ",
	"tags": "Calm Protagonist   Celebrities   Clingy Lover   Couple Growth   Cute Story   Devoted Love Interests   Doting Love Interests   Marriage   Mature Protagonist   Misunderstandings   Modern Day   Poor to Rich   Short Story   Showbiz   Wealthy Characters   Younger Love Interests   ",
	"rating": "(4.7 / 5.0, 328 votes)",
	"author": "77家的喵   ",
	"year": "\n2019",
	"ranking": "#1288   #1174   #2577   #3564   #2555   ",
	"reviewcount": "70 Reviews sorted by",
	"description": "Guan Ling was now 30 years old.\r\n\r\nSix years after his debut, he won an award for his performance and made a lot of money. He was also married to someone for these past seven years. According to reason, he should be the object of envy for everyone.\r\n\r\nIt was a pity…...\r\n\r\nThe award-winning work was a horror movie and the male lead character he played was a bloodstained one-eyed zombie. Therefore, even if he swaggered around the streets, there was still no one who would recognize him.\r\n\r\nSince he had been introduced to the entertainment industry by a famous director, his salary was fairly high. If the money he had earned in those six years were to accumulate, it would make a total of eight-figures. Unfortunately, there was no opportunity for the money to accumulate. It would disappear into thin air almost as soon as it entered his bank account. It was all given away to his lover as funds to pour into that bottomless hole-like company.\r\n\r\nAs for the lover to whom he had been married for seven years…… Guan Ling glanced up and expressionlessly read the small line of words on the computer screen——\r\n\r\n“The difference between the passionate love period and the indifferent period is that when you touched his hair, his XX would stand up but now you touch his XX, and his hair stands up.”\r\n\r\nOh, man! Guan Ling pressed the power button right away and the text in front of him disappeared instantly. He sighed in relief and silently threw himself onto the empty bed.>"
}