{
	"url": "https://www.novelupdates.com/series/the-rankers-guide-to-live-an-ordinary-life/",
	"title": "The Rankers Guide to Live an Ordinary Life - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/06/The-Rankers-Guide-to-Live-an-Ordinary-Life_1623871371.jpg",
	"noveltype": "(KR)",
	"genre": "Action   Adventure   Comedy   Drama   Fantasy   Shoujo   Supernatural   ",
	"tags": "Brother Complex   Death of Loved Ones   Dragons   Dungeons   Fated Lovers   Female Protagonist   Game Elements   God-human Relationship   Hiding True Abilities   Hiding True Identity   Hunters   Lazy Protagonist   Lucky Protagonist   Misunderstandings   Modern Day   Multiple POV   Overpowered Protagonist   Quirky Characters   Secret Identity   Shameless Protagonist   Siblings   Sister Complex   Slow Romance   Strong to Stronger   Younger Brothers   Younger Sisters   ",
	"rating": "(4.4 / 5.0, 61 votes)",
	"author": "톄제   ",
	"year": "\n2020",
	"ranking": "#2000   #6280   #5440   #5744   #4388   ",
	"reviewcount": "7 Reviews sorted by",
	"description": "She properly held onto the star spoon and became the No.1 Ranker\n\nShe is Korea’s first S-rank awakened, and ranked third in the world’s rankings,\n\nSo naturally, she was the first in Korea\n\n-Where is Korea’s first place?\n\n-Nobody knows, or has seen them\n\n-They’re so mysterious– you hear that?\n\n‘This is already the third time. f*ck…’\n\nTowers, cracks, dungeons, whatever\n\nMy mother would angrily stop my cell phone services, so I would have to go around asking for the wi-fi password wherever I went\n\n[The rankings have been updated]\n[Gyeon Zio’s current domestic ranking is 2nd place]\nHuh…? Have I become a kongline now?\n\nCovenant unni, I thought you said you’d only let me walk on flowery paths\n\n[Your covenant admires your shameless personality]\n“Jo. You’re still living like a garbage in the corner of the room”\n\n“Woah. What’s the point of hitting me by the bone?”\n\nThe villain who dreams of the world’s destruction, the factual offender\n\n“Help me”\n\n“Salvation is achieved by oneself. Salvation is achieved by oneself.”\n\n“Please! I know who you are, the magician king”\n\nEven the regressed super rookie who looks so much like the main character of modern fantasy.\n\nI have to defend this comfortable, lazy sloppy lifestyle from those around me who are trying to prey it away!>"
}