{
	"url": "https://www.novelupdates.com/series/former-guild-employee-opens-an-orphanage/",
	"title": "Former Guild Employee Opens an Orphanage - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/08/Former-Guild-Employee-Opens-an-Orphanage.jpg",
	"noveltype": "(JP)",
	"genre": "Adventure   Comedy   Drama   Fantasy   Harem   Romance   Shounen   ",
	"tags": "Accelerated Growth   Adventurers   Beautiful Female Lead   Betrayal   Devoted Love Interests   Doting Love Interests   Fantasy World   Handsome Male Lead   Jealousy   Kind Love Interests   Love Interest Falls in Love First   Male Protagonist   Overpowered Protagonist   Romantic Subplot   ",
	"rating": "(3.0 / 5.0, 4 votes)",
	"author": "Souichi Kazunari   和成ソウイチ   ",
	"year": "\n2020",
	"ranking": "#6970   #2000   #13053   #12116   #11698   ",
	"reviewcount": "No Reviews",
	"description": "“Shut up, shut up! You’re out, that’s what have been decided!”\n\n former staff Isto was expelled from the guild for being too low-level.\n\nAlthough his high administrative skills and discerning eye were indispensable for guild management, they were never been appreciated.\n\nThe world is on the midst of unprecedented battle boom.\n\nWhile high levels and strong battle skills were on high demand, there was nowhere to hire Isto.\n\nAt loss, Isto tries to work at an orphanage where he was once taken care of and encounters a girl who is about to be killed by a monster.\n\nThe level difference between Isto and the enemy is more than four times. Moreover, the monster is a super-rare monster. Isto, however, tactfully defeats the monster and saves the girl.\n\nThen… The Gifted Skill [Awakening Appraisal] is released.\n\nBy risking his life to defeat the monster, Isto’s natural talent blossomed.\n\nThis [Awakening Appraisal] was an extraordinary ability that allowed him to release the hidden skills of others including copying  and using their skills.\n\nThe girl whom Isto saved was also found to have special combat skills through the [Awakening Appraisal].\n\nBy copying her skills, Isto was on his way to becoming an all-around strongman, which he had never imagined.\n\nMeanwhile, the guild that fired Isto has stopped its paperwork while on the  state of collapse.\n\nIsto flatly refuses the request to “come back.”\n\nThis is the story of a man who was banished for no good reason, who is loved by the genius girls who protected him, and who eventually (unwillingly) becomes a legendary adventurer through the power of [Awakening Appraisal].>"
}