{
	"url": "https://www.novelupdates.com/series/reversed-parallel-worlds-messiah/",
	"title": "Reversed Parallel World‘s Messiah - Novel Updates",
	"image": "https://www.novelupdates.com/img/noimagefound.jpg",
	"noveltype": "(JP)",
	"genre": "Adult   Fantasy   Harem   Mature   Romance   Seinen   ",
	"tags": "An*l   Alternate World   Aristocracy   Beautiful Female Lead   Caring Protagonist   Charming Protagonist   Demi-Humans   Devoted Love Interests   Discrimination   Elves   Engagement   Fantasy World   First-time Interc**rse   F*llatio   Harem-seeking Protagonist   Heartwarming   Helpful Protagonist   Loli   Male Protagonist   Marriage   Marriage of Convenience   Nobles   Nudity   Older Love Interests   Or*y   Protagonist Falls in Love First   R-18   Religions   Reverse R*pe   Threesome   Timid Protagonist   Transported to Another World   ",
	"rating": "(3.8 / 5.0, 82 votes)",
	"author": "Akagawa Mikami   赤川ミカミ   ",
	"year": "\n2016",
	"ranking": "#3017   #3737   #2262   #1970   #1891   ",
	"reviewcount": "5 Reviews sorted by",
	"description": "~Thanks to the Beautiful Women I met in my Trip to Another World, I’m now having the time of my Life~\r\n\r\nThe story is about the adventures of an ordinary college student, Yoshima Tomoaki, who got transferred over to another world by an unknown accident. He gathered information about the world he had gotten himself into, only to discover that this world is weird in a lot of ways, particularly in their aesthetics of women’s’ beauty, chastity, and libido – in which all of them are completely reversed in this strange world.\r\n\r\nThose who were regarded as beautiful in our world were treated with disgust for being ‘ugly’.\r\n\r\nThose who were acting prim and proper were ostracized for being ‘lewd,’\r\n\r\nThose who were regarded as a virgin were labeled as ‘sluts’.\r\n\r\nBecause of this strange culture, these women gathered themselves and established the city of their own, which now became the City of Blossom, fully composed of these ‘ugly’, ‘lewd’, and ‘slutty’ women, whom all had no place to go. And now, upon meeting and being saved by its mayor in a stroke of luck, living surrounded by beauties in all sides, Tomoaki will now live his life to the fullest and giving them the proper ‘treatment’ they crave for – by becoming their messiah in this ugly world they are ostracized from.>"
}