{
	"url": "https://www.novelupdates.com/series/mad-dog/",
	"title": "Mad Dog - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/05/Mad-Dog.jpg",
	"noveltype": "(CN)",
	"genre": "Mature   Psychological   Romance   School Life   Slice of Life   ",
	"tags": "Beautiful Female Lead   Bullying   Calm Protagonist   Character Growth   Child Abuse   Childhood Friends   College/University   Couple Growth   Disabilities   Doting Love Interests   Familial Love   First Love   First-time Interc**rse   Handsome Male Lead   Heartwarming   Inferiority Complex   Mature Protagonist   Modern Day   Past Trauma   Possessive Characters   Showbiz   ",
	"rating": "(4.3 / 5.0, 12 votes)",
	"author": "玉寺人   ",
	"year": "\n2020",
	"ranking": "#6970   #6380   #10074   #10476   #10577   ",
	"reviewcount": "3 Reviews sorted by",
	"description": "When Jiang Qi was ten years old, he had black hair and light eyes. He was pale, delicate, and often injured until his head was bleeding.\n\nHe is the son of a ‘famous’ murderer in the Chenkong Alley. He was scorned because of the despicable blood in his bones. Except for Zhiqi, no one cared about him.\n\nZhiqi often bandages his wounds while crying and asking in a soft voice, “Why do you always get hurt? Does it hurt a lot?”\n\nJiang Qi smiled, the indifferent and perverse boy was extraordinarily well-behaved in front of her: “If you coax me, it won’t hurt anymore”\n\nBy the time he was in high school, he had become Lin Lan’s most famous lunatic, cold and ruthless.\n\nZhiqi remembered Jiang Qi once said – that he lived like a dog most of the time in his life. He would rather let everyone be afraid of him than let people bully him.\n\nBut even if everyone is afraid of him, Zhiqi is not afraid.\n\nUnfortunately, people spend their whole lives healing from their childhoods and Zhiqi wants to help heal Jiang Qi.\n\nWhen Jiang Qi took her to the rooftop of the school, she made a promise to him: Jiang Qi, you are good. I can marry you when I am of legal age.\n\nThe young man responded with a slight smile, his eyes were clear and clean like stars in the sky. He was rarely full of yearning for the future.\n\nZhiqi didn’t know that her promise saved Jiang Qi’s life and pulled him out of hell.\n\nNote : A boy who’s like a madman and all the sweet names in this obscure life are called ‘Zhiqi’>"
}