{
	"url": "https://www.novelupdates.com/series/green-tea-villainess-fails/",
	"title": "Green Tea Villainess Fails - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/05/20200425210640.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Fantasy   Romance   Yuri   ",
	"tags": "Beautiful Female Lead   Celebrities   Cold Love Interests   Cute Children   Cute Protagonist   Doting Love Interests   Doting Older Siblings   Doting Parents   Fated Lovers   Love Interest Falls in Love First   Modern Day   Naive Protagonist   Pregnancy   Sibling's Care   System Administrator   Transmigration   Villainess Noble Girls   Wealthy Characters   ",
	"rating": "(4.3 / 5.0, 83 votes)",
	"author": "Bairi Xi   Sun Light   白日曦   ",
	"year": "\n2020",
	"ranking": "#3133   #2183   #3818   #3762   #3271   ",
	"reviewcount": "10 Reviews sorted by",
	"description": "Suddenly transmigrating as the green tea b*tch villainess in a novel, Zuo Bian heard a self-proclaimed system say, “Ding, in order to continue living, you have been bound to system 555.”\n\n“Congratulations, Host, you are qualified to play the green tea b*tch villainess, to promote the development of the plot. Please, Host, read the Green Tea Manual, and attract the female lead.”\n\nThe ancient person Zuo Bian who didn’t understand the meaning of “green tea” carried the “Green Tea Manual”. In order to complete the task, Zuo Bian desperately tried to get the female lead’s attention, and then tell her:\n\n“You are so kind to me, yet I have nothing to reward you with.”\n\n“He misunderstood, it’s all my bad, let me explain.”\n\n“He's actually very good, just misunderstood us, you shouldn’t be so fierce to him.”\n\n“He's spoiled, I certainly can’t bear to let my boyfriend work hard.”\n\n“The rain is heavy, and I am soaked all over, he is away, can I borrow your bathroom to take a shower?”\n\n“This is the last time I will call you big sister. Let’s stop contacting. I don’t want to make him unhappy.”\n\nZuo Bian, who thought that she would successfully complete the task, was pressed against the wall by the female lead, and heard her say, “Since you want to repay me, just give yourself to me. Don’t call me big sister. Call me wife. ”\n\nWait, what!? This development is a bit wrong?>"
}