{
	"url": "https://www.novelupdates.com/series/the-reader-and-protagonist-definitely-have-to-be-in-true-love/",
	"title": "The Reader and Protagonist Definitely Have to Be in True Love - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2017/12/The-Reader-and-Protagonist-Definitely-Have-to-Be-in-True-Love.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Comedy   Fantasy   Psychological   Romance   Smut   Yaoi   ",
	"tags": "Abandoned Children   Adapted to Manhua   Angels   Appearance Changes   Awkward Protagonist   Beast Companions   Beastkin   Betrayal   Blood Manipulation   Bloodlines   Caring Protagonist   Clingy Lover   Contracts   Corruption   Couple Growth   Crafting   Cruel Characters   Demi-Humans   Demons   Destiny   Determined Protagonist   Devoted Love Interests   Disabilities   Discrimination   Doting Love Interests   Dragons   Dwarfs   Elemental Magic   Elves   Evil Gods   Fantasy Creatures   Fantasy World   First-time Interc**rse   Forced into a Relationship   Former Hero   Glasses-wearing Protagonist   Godly Powers   Gods   Handsome Male Lead   Helpful Protagonist   Human-Nonhuman Relationship   Jealousy   Love Interest Falls in Love First   Magic   Male Yandere   Mob Protagonist   Necromancer   Obsessive Love   Past Trauma   Possessive Characters   Prophecies   Race Change   Religions   R*pe   Special Abilities   Strength-based Social Hierarchy   Strong Love Interests   Torture   Transmigration   Transported to Another World   Unconditional Love   World Travel   ",
	"rating": "(4.5 / 5.0, 2043 votes)",
	"author": "Tuí   颓   ",
	"year": "\n2013",
	"ranking": "#428   #1827   #261   #501   #50   ",
	"reviewcount": "372 Reviews sorted by",
	"description": "An internet troll who wanted attention, the reader criticized his favorite web novel, saying: “The protagonist is dumb and the author is s*upid.”\n\nAuthor: “...Got it.”\n\nUnfortunately for him, the author actually listened to his (troll) feedback. The formerly lighthearted tale of a cute harem master suddenly became super dark and edgy. The reader could only helplessly look on as the protagonist was abused and betrayed, finally embarking on the road to becoming completely evil. Everything was a mess!\n\nAfter that the reader transmigrated into a strange world. How come the person in front of him looks like the protagonist (evil undead version)? Just what is going on?!\n\nNote: Du Zhe (读者 meaning Reader) and Du Ze (杜泽 the character's name) sound almost the same>"
}