{
	"url": "https://www.novelupdates.com/series/sweet-adorable-wife-please-kiss-slower/",
	"title": "Sweet Adorable Wife, Please Kiss Slower! - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/04/Sweet-Adorable-Wife-Please-Kiss-Slower.jpg",
	"noveltype": "(CN)",
	"genre": "Drama   Josei   Romance   Tragedy   ",
	"tags": "Abusive Characters   Acting   Beautiful Female Lead   Black Belly   Calm Protagonist   Celebrities   Charming Protagonist   Cold Love Interests   Cute Protagonist   Female Protagonist   Handsome Male Lead   Modern Day   Older Love Interests   Past Plays a Big Role   R*pe Victim Becomes Lover   Reincarnation   Revenge   R*pe   S*xual Abuse   Showbiz   Wealthy Characters   ",
	"rating": "(3.4 / 5.0, 29 votes)",
	"author": "Food Shopkeeper   饭掌柜   ",
	"year": "\n2018",
	"ranking": "#2000   #2000   #7115   #9890   #7868   ",
	"reviewcount": "5 Reviews sorted by",
	"description": "Lin Wanwan is a pitiful mentally-disabled girl. Not only does she suffer abuse from her stepmother, her stepmother even attempts to use her as a sexual commodity to pleasure others. Eventually, the poor Wanwan dies from an overdose… \r\n\r\nPerhaps a god or a devil had witnessed her tragic fate, but Wanwan gets a brand new chance at life—an external soul takes over her body and gains Wanwan's memories. \r\n\r\nThe resurrected Lin Xiao swears to seek revenge for Wanwan. \r\n\r\nHaving witnessed Wanwan's death and resurrection process, Tang Chen is intrigued by the changes she undergoes. When he tries to cheat Wanwan to gain possession of her, a knight descends from the sky and saves her. He allows her to seek his help thrice. \r\n\r\nJust who is this mysterious knight? \r\n\r\nThe revived Wanwan demonstrates her astounding talent and intelligence. Not only does she leave her enemies helpless against her, but she also becomes a celebrity who sweeps through the entertainment industry. Who exactly is she? \r\n\r\nWhen Wanwan interacts more with the knight, she realizes that he is actually a devil… \r\n\r\n'From this moment forth, every inch of your body is mine. Resistance is futile.' \r\n\r\nHe had descended like Satan, wantonly occupying her body and mind… \r\n\r\nIt's fine. Even if he's the devil, he would still be trampled beneath her feet.>"
}