{
	"url": "https://www.novelupdates.com/series/a-fairytale-for-wizards/",
	"title": "A Fairytale for Wizards - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/05/AFairytaleforWizard_original.jpg",
	"noveltype": "(KR)",
	"genre": "Adventure   Drama   Fantasy   Mature   Romance   Tragedy   ",
	"tags": "Abandoned Children   Abusive Characters   Accelerated Growth   Adapted to Manhwa   Amnesia   Appearance Different from Actual Age   Aristocracy   Arrogant Characters   Beast Companions   Beautiful Female Lead   Calm Protagonist   Caring Protagonist   Character Growth   Charming Protagonist   Childcare   Clever Protagonist   Cold Love Interests   Couple Growth   Curses   Death   Death of Loved Ones   Depictions of Cruelty   Determined Protagonist   Devoted Love Interests   Doting Love Interests   Empires   European Ambience   Fallen Nobility   Family   Fantasy Creatures   Fantasy World   Female Protagonist   Flashbacks   Friendship   Handsome Male Lead   Hard-Working Protagonist   Heartwarming   Hiding True Identity   Kind Love Interests   Kingdoms   Loyal Subordinates   Magic   Magic Beasts   Mature Protagonist   Near-Death Experience   Nobles   Older Love Interests   Past Plays a Big Role   Poor to Rich   Possessive Characters   R-15   Romantic Subplot   Royalty   Schemes And Conspiracies   Second Chance   Servants   S*aves   Slow Romance   Special Abilities   Strong Love Interests   Sword And Magic   Time Skip   Tragic Past   Twins   Unrequited Love   Wealthy Characters   Wizards   ",
	"rating": "(3.9 / 5.0, 35 votes)",
	"author": "Eun Soro   은소로   ",
	"year": "\n2018",
	"ranking": "#6970   #3765   #6773   #5566   #4434   ",
	"reviewcount": "2 Reviews sorted by",
	"description": "Azriel, a branded slave, lived as a whipping child of a noble family. This was her life and what she thought would await her in the future ‘till a mysterious man walked into her arduous life.\n\n“Why are you living like this?”\n“Do you know me?”\n\nThe Wizard of the Horizon, Rhema Reshith, gave her a name in the memory of her memories she’d lost over the past three years. She found solace in his presence and desired for him to be happy just as she was.\n\n“The closer you get to me, the more sorrowful your grief will be.”\n“That won’t happen, Rhema. So, please teach me magic.”\n\nThough their future is unknown, Azriel needed to find out Rhema’s true heart and willingly decided to be with him to live a happy fairytale ending.>"
}