{
	"url": "https://www.novelupdates.com/series/guide-to-raising-the-sick-villain/",
	"title": "Guide To Raising the Sick Villain - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/09/Cover-1.jpg",
	"noveltype": "(CN)",
	"genre": "Drama   Fantasy   Romance   School Life   ",
	"tags": "Autism   Beautiful Female Lead   Calm Protagonist   Charming Protagonist   College/University   Couple Growth   Determined Protagonist   Devoted Love Interests   Disabilities   Doting Love Interests   Family Conflict   Female Protagonist   Handsome Male Lead   Hard-Working Protagonist   Heartwarming   Inferiority Complex   Love Interest Falls in Love First   Male Yandere   Mature Protagonist   Modern Day   Past Trauma   Poor Protagonist   Possessive Characters   Pragmatic Protagonist   Slow Romance   Smart Couple   Tragic Past   Transmigration   Ugly to Beautiful   Unconditional Love   ",
	"rating": "(4.7 / 5.0, 696 votes)",
	"author": "小孩爱吃糖   ",
	"year": "\n2019",
	"ranking": "#518   #536   #636   #212   #345   ",
	"reviewcount": "180 Reviews sorted by",
	"description": "Qiao Lan transmigrated into a novel.\n\nShe became a cannon-fodder who was rescued by the heroine after being bullied but was jealous of the heroine because of her love for the hero and ultimately ended up miserable.\n\nWhen she first entered the novel, Qiao Lan met a cannon fodder more pitiful than her. He was bullied, severely autistic, and had crippled legs.\n\nQiao Lan: …\n\nThinking of the male partner who had only been able to live for two years, Qiao Lan had a distressed conscience and began to take care of the gloomy boy.\n\n2 years later, they had both become each other's lift and the boy would stand up again and be able to hold her.\n\n***\n\nShe had seen a passage when she was reading a book about Asperger’s Syndrome. The passage had explained that people with Asperger’s Syndrome generally suffered from “love disorder”. Some believe that a small percentage of people with Asperger’s Syndrome have an IQ far exceeding that of ordinary people, but their EQ is much lower than that of ordinary people. In terms of emotions, they are more like children with blank slates.\n\nThat’s why Qiao Lan was so sure that Tan Mo would never like her. He would rely on her, take care of her, and protect her, but he would not like her like a man likes a woman because Tan Mo did not understand this type of emotion.\n\nSome say that some people with Asperger’s Syndrome will never understand what love is in their entire lives. Perhaps a number of people will understand, but in some cases, people on the higher scale of AS are too paranoid and sometimes overarchingly possessive. With this came a large amount of trouble that came from being too obsessed with one person. Few people could understand or handle such love, which leads to tragedy.>"
}