{
	"url": "https://www.novelupdates.com/series/when-my-childhood-friend-dumped-me-and-i-was-expelled-from-the-soccer-team-it-goes-on-to-the-point-of-other-childhood-friend-left-speechless-eh-you-want-me-to-come-back-because-youre-in/",
	"title": "When My Childhood Friend Dumped Me and I Was Expelled From the Soccer Team, it goes on to the point of other childhood friend left speechless. . EH? You Want Me To Come Back Because You’re in Trouble Because I’m Gone? I Don’t Know Anything About That - Novel Updates",
	"image": "https://www.novelupdates.com/img/noimagefound.jpg",
	"noveltype": "(JP)",
	"genre": "Drama   Romance   School Life   ",
	"tags": "Beautiful Female Lead   Childhood Friends   Male Protagonist   ",
	"rating": "(3.1 / 5.0, 38 votes)",
	"author": "Shimakaze   島風   ",
	"year": "\n2021",
	"ranking": "#2000   #6308   #6926   #5505   #7692   ",
	"reviewcount": "3 Reviews sorted by",
	"description": "My first love ended when my childhood friend and girlfriend, Sorane Takasaki, said, “Let’s break up....”\n\nIt was Todo, the ace striker on the same soccer team, who stole my girlfriend away from me.\n\nYuma Munagata, a second-year high school student, is an inconspicuous boy with a gloomy personality.\n\nBut there were two special things about him. First, he has a beautiful childhood friend, Sorane Takasaki, and second, he is actually a foreigner.\n\nSince he was a returnee, he was very assertive and was ignored by the people around him.\n\nAnd thanks to his efforts, he has been able to contribute greatly to the soccer team with his dedication. Even though he was inconspicuous, he was actually a key player in the offense and defense. But in spite of this, ace striker Todo makes fun of his dedicated play, takes his girlfriend, and expels him from the club.\n\nHe feels as if everything is over, when another childhood friend, Shiranui Mashiro, arrives.\n\nShiranui is half Russian, and like Yuma, is a foreigner who has returned to Japan. In order to change their difficult lives, the teacher in charge of their class orders them to join a special club, the Public Morals Club.\n\nAs they get to know each other through the club activities, the two grow up, and Yuma’s high specs are gradually revealed, and the people around them cannot leave him alone. In addition, other childhood friends and girls who adore him confess their love for him one after another.\n\nOn the other hand, Sorane, who dumped Yuma, finds her heart back in him, regrets it, and cries, but there is nothing she can do about it.\n\nWhen Yuma leaves the soccer team, Sorane is left without him, and naturally, she starts to fall apart.\n\nTodo, a bum striker, gets down on his knees and cries to Yuma, but it’s already too late. Finally, Todo is expelled from the soccer club due to his outrageous behavior, and is expelled from school.>"
}