{
	"url": "https://www.novelupdates.com/series/daily-disposable-persona/",
	"title": "Daily Disposable Persona - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/07/Daily-Disposable-Persona.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Comedy   Fantasy   Horror   School Life   Supernatural   Yaoi   ",
	"tags": "Academy   Alchemy   Alternate World   Arrogant Characters   Astrologers   Beasts   Calm Protagonist   Cautious Protagonist   Cheats   Chuunibyou   Cohabitation   Cold Love Interests   Conditional Power   Confident Protagonist   Cosplay   Determined Protagonist   Divination   Earth Invasion   Elemental Magic   Evil Gods   Evil Religions   Famous Protagonist   Fantasy Creatures   Game Elements   Gate to Another World   God-human Relationship   Godly Powers   Gods   Hard-Working Protagonist   Hidden Abilities   Human-Nonhuman Relationship   Interdimensional Travel   Investigations   Loner Protagonist   Love Interest Falls in Love First   Loyal Subordinates   Magic   Magic Formations   Male Yandere   Manipulative Characters   Military   Mind Control   Modern Day   Music   Mysterious Past   Mythology   Obsessive Love   Older Love Interests   Orphans   Philosophical   Poor Protagonist   Poor to Rich   Possessive Characters   Precognition   Protagonist Strong from the Start   Righteous Protagonist   Sadistic Characters   Saving the World   Secret Organizations   Skill Assimilation   Slow Romance   Special Abilities   Strong Love Interests   Strong to Stronger   Time Manipulation   Time Travel   Transformation Ability   Twisted Personality   World Travel   ",
	"rating": "(4.5 / 5.0, 212 votes)",
	"author": "Raven   Wang Ya   妄鸦   ",
	"year": "\n2020",
	"ranking": "#6970   #2484   #2460   #1578   #2527   ",
	"reviewcount": "49 Reviews sorted by",
	"description": "As Zong Yan sat in the classroom, he always felt like the odd man out. His body was there but his soul had sneaked out the window. He wanted to do anything, wanted to be anyone, as long as he wasn’t himself.\n\nHe had a cool and unbelievable superpower:\n\nHe could extract different persona cards from the void with his bare hands. With a high enough “SAN” value, Zong Yan could become an entirely different being. Superpowers, ancient gods, eldritch powers, even… an Outer God.\n\nSoaring above the dome of the magical city, he was the free-flying son of the wind.\n\nStrolling through the rain-soaked, foggy streets of London, he was the secretive and unpredictable night watchman.\n\nWalking in the extravagance and glamour of New York, he was the sun god who held the light in his hands.\n\nDiving into the geometric city of R’lyeh, he was the indescribable king.\n\nIn the gorgeous and colorful world of dreams, he was the original belief in the universe.\n\nEarly to bed, early to rise, going to school on time, working late to save the world. A senior at Qingyang High School by day, honors scholar at Miskatonic University by night. Investigating unusual events all over the world during summer and winter vacation, battling wits and courage with evil gods, dedicated to preserving peace and saving a faltering world.\n\nZong Yan: Thanks, but I’m just an ordinary high school kid.>"
}