{
	"url": "https://www.novelupdates.com/series/absolutely-spoiled/",
	"title": "Absolutely Spoiled - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/01/Absolutely-Spoiled.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Drama   Romance   School Life   Slice of Life   ",
	"tags": "Absent Parents   Age Progression   Caring Protagonist   Child Abuse   Childhood Friends   Childhood Love   College/University   Cute Protagonist   Devoted Love Interests   Doting Love Interests   Early Romance   Female Protagonist   First Love   Handsome Male Lead   Hard-Working Protagonist   Heartwarming   Love Interest Falls in Love First   Modern Day   Pregnancy   Unconditional Love   ",
	"rating": "(4.6 / 5.0, 93 votes)",
	"author": "Jiang Luo Luo   江萝萝   ",
	"year": "\n2020",
	"ranking": "#1575   #1467   #4017   #2781   #3051   ",
	"reviewcount": "22 Reviews sorted by",
	"description": "Yu Zhiyi was a slow-witted, easily neglected child ever since she was little. Yet the gifted and intelligent Shi Yi liked to take her around everywhere.\r\n\r\nTaking her to and from school, waiting for her to go home, using his own pocket money to buy the prettiest little dress to give her.\r\n\r\nToddler Shi Yi: “If you want to be a princess, then I will build a castle for you.”\r\nTeenager Shi Yi: “Let’s go to outer space together. I’ll count the stars, but since you’re dumb, you can just count the moons.”\r\n\r\nThe year Yu Zhiyi was abandoned, Shi Yi took her to his home and protected her for the whole summer: “You are very adorable, worthy of being loved.”\r\n\r\nThe year they were 18, Shi Yi proposed; the year they were 22, she became Mrs. Shi.\r\n\r\n[Kindergarten]\r\n\r\nYu Zhiyi got picked to be the ‘mother’ when playing house, but it scared her playmate so much they cried, “Yu Zhiyi is so stupid, I don’t want to be her dumb child.”\r\n\r\nAs such, she could only stand there and stare at the other kids playing together. Shi Yi who was passing by picked her up, “You are a little dummy, you need to find a partner that has a high IQ to save your future children.”\r\n\r\n“Then…then who should I look for?”\r\n\r\n“Since we’re neighbors, I’ll allow you to become Mrs. Shi when we’re older!”\r\n\r\n[College]\r\n\r\nWhen Shi Yi was 18, the usually timid Yu Zhiyi gifted him a pricey watch and a red heart-shaped card. Shi Yi only glanced at the watch but took the card away.\r\n\r\nRaising his charming pair of peach blossom eyes, “Giving me something so expensive, was it an impulse buy?”\r\n\r\nThe young lady’s face turned red as she stammered out four words, “It was…deliberately planned!”\r\n\r\n>"
}