{
	"url": "https://www.novelupdates.com/series/the-male-leads-backyard-is-on-fire/",
	"title": "The Male Lead’s Backyard is on Fire - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/09/006y8oKFly1gej2m30acjj305k07sjrh.jpg",
	"noveltype": "(CN)",
	"genre": "Drama   Fantasy   Martial Arts   Romance   Yuri   ",
	"tags": "Abusive Characters   Ancient China   Antihero Protagonist   Arrogant Characters   Beautiful Female Lead   Bullying   Calm Protagonist   Cold Protagonist   Devoted Love Interests   Divorce   First Love   Generals   Heartwarming   Kind Love Interests   Love Interest Falls in Love First   Protagonist Strong from the Start   Royalty   Strong to Stronger   Transmigration   Unconditional Love   Villainess Noble Girls   ",
	"rating": "(4.5 / 5.0, 100 votes)",
	"author": "七千折戏   ",
	"year": "\n2020",
	"ranking": "#1563   #1576   #2661   #4285   #3780   ",
	"reviewcount": "13 Reviews sorted by",
	"description": "The Explorer, Wei Chi Li accidentally fell off the cliff and when she woke up, she was on top of a peerless Beauty in messy clothes and was covered in bruises.\n\nShe has Transmigrated? Becoming a vicious female supporting character in a cruel novel.\n\nFemale Supporting lead married the male lead, but was used by the male lead to abuse the female lead: Liu Luo Yi. In the end, the kingdom was destroyed and was stabbed to death by the fallen female lead.\n\nIn order to survive, Wei Chi Li decided to prevent the female lead from falling in love with the male lead.\n\nHence, the male lead forcefully kisses the female lead. Wei Chi Li rushed forward; Male Lead tortured the Female Lead, Wei Chi Li hit his head; the Male and Female lead chamber room, Wei Chi Li trick the others and slipped into the female lead’s bed.\n\nIn the end, the female lead did not fall in love with the male lead but fell in love with the vicious female supporting lead.\n\nOne Day, Wei Chi Li finally divorced the Male Lead and was exhilarated to prepare to run away but was stopped by Liu Luo Yi.\n\nLiu Luo Yi who had always been cold and indifferent, undressed and her face flushed. “I will give myself to you, don’t leave.”\n\nThere was a rumor in the Capital City, countless nobles came to propose to the princess who had married a Fifth-tier official. But was beaten up by a beauty. “Where did this shrew come from, so aggressive!”\n\nWei Chi Li handed a stick to the beauty then leaned on the door and smiled: “Sorry, she is spoiled by me.”\n\nAfter Liu Luo Yi met that man, her family died tragically and was bullied so she took it as it was her fate.\n\nUnexpectedly, one day, the woman who had tortured herself, changed. The facts had proven that the one who rode a white horse to rescue you may not necessarily be a prince but could be a vicious female supporting lead.>"
}