{
	"url": "https://www.novelupdates.com/series/try-crying-prettier/",
	"title": "Try Crying Prettier - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/10/TCP.jpg",
	"noveltype": "(KR)",
	"genre": "Adult   Fantasy   Romance   Smut   ",
	"tags": "Adapted to Manhwa   Aristocracy   Arrogant Characters   Beautiful Female Lead   Calm Protagonist   Charming Protagonist   Clever Protagonist   European Ambience   Female Protagonist   First-time Interc**rse   Handsome Male Lead   Love Interest Falls in Love First   Love Triangles   Male Yandere   Medieval   Nobles   Persistent Love Interests   Playboys   Popular Love Interests   Possessive Characters   Priests   R-18   R*pe Victim Becomes Lover   R*pe   Saints   Seduction   Siblings Not Related by Blood   Unrequited Love   Villainess Noble Girls   ",
	"rating": "(3.2 / 5.0, 120 votes)",
	"author": "Lachik De   라치크   ",
	"year": "\n2020",
	"ranking": "#2318   #1904   #1753   #3849   #1503   ",
	"reviewcount": "12 Reviews",
	"description": "Sleeping with him was a very impulsive decision.\n\nYesterday, Damia’s first love that usually filled her with anxious joy, broke her heart with a cruel rejection:\n\n“Find another man.”\n\nHer manipulative step-brother smiled at her.\n\n“Didn’t I tell you? You will eventually come to me.”\n\nDamia was fed up with all these games.\n\nSo she seduced and slept with the man who had just arrived in the north.\n\nThe beautiful eyes belonging to the woman subject to terrible rumors held no lust, instead Akkard found her to be rather clumsy and pure.\n\n“Your crying face is pretty. Cry a little more.”\n\nHe grabbed Damia’s ankles that tried to flee, overworked from his persistent ardor, but that only made him covet her even more.\n\nDamia, lying beneath the ferocious beast, literally cried herself hoarse.\n\nThe man kissed all of her tears, and painstakingly licked her eyelids.\n\nAnd soon he laughed greedily.\n\n“Try keep crying under me from now on.”\n\nThe man’s lips whispered until the legs broke apart.\n\n….It seems that she had chosen the wrong person to play with.>"
}