{
	"url": "https://www.novelupdates.com/series/baby-demon-king-has-changed/",
	"title": "Baby Demon King Has Changed - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/01/Baby-Demon-King-Has-Changed.jpg",
	"noveltype": "(KR)",
	"genre": "Comedy   Fantasy   Romance   ",
	"tags": "Beautiful Female Lead   Child Protagonist   Contracts   Curses   Cute Children   Demon Lord   Demons   Female Protagonist   Transmigration   ",
	"rating": "(3.5 / 5.0, 13 votes)",
	"author": "Harasyo   하라쇼   ",
	"year": "\n2021",
	"ranking": "#3314   #6293   #11039   #8107   #8983   ",
	"reviewcount": "No Reviews",
	"description": "I was the last demon king, the strongest and greatest creature in the demon world.\r\n\r\n\r\n\r\n\r\nI'm the best.\r\n\r\n\r\n\r\n\r\n...I mean, until I die after being betrayed and killed by the humans who served me.\r\n\r\n\r\n\r\n\r\n'When you're born again, you'll have to do good things. If you don't want to live a worse life than a small creature.'\r\n\r\n\r\n\r\n\r\nTo break the curse I received before I die, I must do good deeds!\r\n\r\n\r\n\r\n\r\nThe goal is to regain money, power, and fame, and live a life that takes a lot of benefits. \r\n\r\n\r\n\r\n\r\nEven if the body that entered at the best was a human kid, the ugly duckling of the family. \r\n\r\n\r\n\r\n\r\nThis genius and cuteness! And there is nothing that can't be solved with this beauty(?)\r\n\r\n\r\n\r\n\r\nIn order to grow into such a great Demon King, I work hard every day—.\r\n\r\n\r\n\r\n\r\n'I don't fall for cute things. No matter how much you wear a lace dress and tilt your head with cookies in both hands.'\r\n\r\n\r\n\r\n\r\n'...you were hiding your true skills. A clever thing.'\r\n\r\n\r\n\r\n\r\n'Hey, you! They said you brought another boy! Do you think he can be your new brother?!' \r\n\r\n\r\n\r\n\r\n'Oh, for your information, even just now, my soul and body were almost separated by the shock because the Lady was cute. It's inevitable because you're very cute.' \r\n\r\n\r\n\r\n\r\n'You know. You're the only one for me, Esther.'\r\n\r\n\r\n\r\n\r\nThere's something wrong with the people around me.\r\n\r\n\r\n\r\n\r\nNo, there's really something strange about it.\r\n\r\n\r\n>"
}