{
	"url": "https://www.novelupdates.com/series/archean-eon-art/",
	"title": "Archean Eon Art - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/06/archeaneonaruto.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Fantasy   Martial Arts   Xuanhuan   ",
	"tags": "Adapted to Manhua   Artifacts   Artists   Beautiful Female Lead   Bloodlines   Body Tempering   Calm Protagonist   Caring Protagonist   Clones   Couple Growth   Cultivation   Dao Comprehension   Demon Lord   Demons   Devoted Love Interests   Fast Cultivation   Genius Protagonist   Gods   Hard-Working Protagonist   Heavenly Tribulation   Heroes   Hiding True Abilities   Hiding True Identity   Immortals   Inheritance   Magical Space   Male Protagonist   Marriage   Monsters   Multiple Realms   Outer Space   Power Couple   Protagonist with Multiple Bodies   Righteous Protagonist   Romantic Subplot   Soul Power   Strong Love Interests   Sword Wielder   Time Skip   Tragic Past   Unique Cultivation Technique   Wars   Weak to Strong   World Travel   ",
	"rating": "(3.9 / 5.0, 138 votes)",
	"author": "I Eat Tomatoes   Wo Chi Xi Hong Shi   我吃西红柿   ",
	"year": "\n2019",
	"ranking": "#2000   #2000   #4412   #7141   #6668   ",
	"reviewcount": "31 Reviews sorted by",
	"description": "In a world dotted with World Entrances to a demon world, demons have invaded humans for centuries. Humanity has united and one of the most ancient sects in the world, the Archean Mountain Sect, has set up an entire education system in the form of Dao Academies and defenses at the World Entrances.\n\nMeng Chuan, a young genius, is an expert at the swift saber. Despite his noble heritage, he has one goal—kill all demons. Scarred by demons because of how his mother sacrificed her life for him, he strives to enter Archean Mountain Sect to get the best resources and training.\n\nOther than cultivation, his only pleasure is drawing. And as he draws, he becomes stronger…\n\nEnjoy this blood-pumping piece of art in Meng Chuan’s journey to slay demons with the help of united human comrades.>"
}