{
	"url": "https://www.novelupdates.com/series/gods-love-game/",
	"title": "God’s Love Game - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/02/Gods-Love-Game.jpg",
	"noveltype": "(CN)",
	"genre": "Fantasy   Horror   Supernatural   Yaoi   ",
	"tags": "Amnesia   Blind Protagonist   Calm Protagonist   Charming Protagonist   Clever Protagonist   Cold Love Interests   Complex Family Relationships   Ghosts   Gore   Handsome Male Lead   Hiding True Identity   Human-Nonhuman Relationship   Incest   Lucky Protagonist   Monsters   Mystery Solving   Smart Couple   Strong Love Interests   Survival Game   Tragic Past   Unlimited Flow   Weak to Strong   Younger Brothers   ",
	"rating": "(4.0 / 5.0, 43 votes)",
	"author": "木鱼歌   ",
	"year": "\n2021",
	"ranking": "#5262   #6224   #5944   #5008   #5383   ",
	"reviewcount": "5 Reviews sorted by",
	"description": "Before dying, the blind beauty Xiangnu accidentally entered an infinite escape world.\r\n\r\nHe thought he had escaped from death, but never thought that because of his blindness, the first world was regarded as a consumable cannon fodder, and was stuffed into the world of the god of death, where the clearance rate was almost zero.\r\n\r\nIn order to survive and restore the light, Xiangnu decided to sell the color and fight, and entangled with the most powerful boss in this game in his intuition.\r\n\r\nThe boss is also very powerful, and he took the slave god to block the killing of the gods and Buddhas, and cleared the legendary world of death.\r\n\r\nAfter clearing the customs, the first thing Xiangnu did was to change his eyes with rich rewards, so that he could see again.\r\n\r\nAfter that, he opened the task panel and prepared to review the first world to accumulate experience for his future tasks.\r\n\r\nbut found…\r\n\r\nIn the task list, he is the only clearer in that world.\r\n\r\nAnd on his task panel, the unspeakable contact named with three red exclamation marks is still sending him messages persistently:\r\n\r\n“Baby, I’m right outside your door, open the door for me.”\r\n\r\nXiannu: …\r\n\r\nIf he is the only survivor in the mission, the big guy who took him through the customs and the red exclamation mark waiting for him to open the door outside…what the hell? Who is he?\r\n\r\nCopy ghosts: π_π he is the god of death! Is the number one male god of our thousands of worlds!\r\nThe spicy chicken player is shameless. If you can’t beat the male god, you will be beautiful and seduce. You should return our male god quickly. woo woo woo>"
}