{
	"url": "https://www.novelupdates.com/series/nirvana-in-fire/",
	"title": "Nirvana In Fire - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2016/03/51X8Zod-42L._SX350_BO1204203200_.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Drama   Historical   Psychological   Seinen   Tragedy   ",
	"tags": "Adapted to Drama   Adapted to Manhua   Appearance Changes   Aristocracy   Betrayal   Brotherhood   Calm Protagonist   Caring Protagonist   Charismatic Protagonist   Childcare   Childhood Friends   Clever Protagonist   Court Official   Empires   Familial Love   Famous Parents   Famous Protagonist   Friendship   Generals   Genius Protagonist   Handsome Male Lead   Hard-Working Protagonist   Kingdoms   Loneliness   Loyal Subordinates   Male Protagonist   Marriage   Nobles   Politics   Power Struggle   Revenge   Royalty   Schemes And Conspiracies   Siblings   Sickly Characters   Strategist   Teachers   Tragic Past   ",
	"rating": "(4.5 / 5.0, 159 votes)",
	"author": "Hai Yan   海宴   ",
	"year": "\n2006",
	"ranking": "#2510   #3559   #3076   #5884   #2200   ",
	"reviewcount": "12 Reviews sorted by",
	"description": "The East River Alliance is the world’s biggest clan. Its chief, Mei Changsu, arrived at the royal capital Jinling under the alias of Su Zhe. He brought with him storms of disturbances and fogs of mysteries.\n\nA noble young master with dual identities, a Crown Prince and Prince Yu battling for the crown, the empire’s greatest warrior with the Royal Guards in his grasp, a beautiful princess who commands over the border’s cavalry…\n\nAmongst these distinguished and powerful people, how did the inconspicuous Su Zhe become the heart of everything?\n\nCould the hand behind the scenes of the whirlwind be the remnants of a previous storm?\n\nIs he the young general who pursues enemies in snowy nights, or the shadowy tactician with a sickly body who won’t see old age?\n\nHe returns to the old place and reunites with old friends. He plots and schemes. What is he trying to achieve?\n\nThis is a story of dark conspiracies and brotherly bonds. Before this story reaches its end, perhaps you can change its course…>"
}