{
	"url": "https://www.novelupdates.com/series/the-eldest-martial-sister-gave-up-treatment/",
	"title": "The Eldest Martial Sister Gave Up Treatment - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/06/The-Eldest-Martial-Sister-Gave-Up-Treatment.png",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Comedy   Drama   Fantasy   Harem   Romance   Xuanhuan   Yuri   ",
	"tags": "Cultivation   Fantasy World   Fast Cultivation   Female Master   Female Protagonist   Game Ranking System   Martial Spirits   Misunderstandings   Reincarnation   Strong to Stronger   System Administrator   Unique Cultivation Technique   Villainess Noble Girls   Weak Protagonist   Weak to Strong   ",
	"rating": "(4.4 / 5.0, 52 votes)",
	"author": "三杯半可乐   ",
	"year": "\n2021",
	"ranking": "#137   #235   #3473   #126   #6429   ",
	"reviewcount": "5 Reviews",
	"description": "Bai Lian, the eldest martial sister of the Qiongming peak of the Duxian sect, is as pure as jade. and unparalleled in beauty. She is known as a Natural Saint and is sought after by thousands of people.\n\nOne day, she suddenly remembered the memory of her previous life. This world was actually an r18 gal game called the Battle of the Gods.\n\nHer master, An Lan the reincarnated Immortal Heaven Lord; √\n\nHer second martial sister, the future Holy Spirit Goddess; √\n\nHer third younger martial sister, the rebirth of the Rebellious Shura; √\n\nHer fourth younger martial sister, the future Dragon God of War; √\n\nHer fifth martial sister, the future God of Martial Arts; √\n\nAnd she, the eldest martial sister, was a [bitch] and [white lotus flower], who had a villain system and could become stronger by bullying her martial sisters, and had as many as 108 death endings in the original game!\n\n┌(。 Д。) ┐\n\nBai Lian was speechless.\n\n[Every dog has its day, don't look down on me!]\n\n'I will be quitting cultivation!!!'\n\nBai Lian gave up the struggle.\n\n……\n\nSeveral years later, Bai Lian sighed:\n\n'Can you women with the protagonist models stay away from me!' 'I am not a Natural Saint!'>"
}