{
	"url": "https://www.novelupdates.com/series/weed-reincarnation-carefully-raised-in-the-elf-village/",
	"title": "Weed Reincarnation ~ Carefully Raised in the Elf Village ~ - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/07/Weed-Reincarnation-Carefully-Raised-in-the-Elf-Village_1627623755.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Drama   Fantasy   Romance   Slice of Life   Supernatural   ",
	"tags": "Adapted to Manga   Adventurers   Elves   Fantasy Creatures   Goblins   Guardian Relationship   Human-Nonhuman Relationship   Level System   Loli   Magic   Misunderstandings   Monsters   Non-humanoid Protagonist   R-15   Reincarnated as a Monster   Reincarnated in Another World   Special Abilities   Sword And Magic   ",
	"rating": "(3.2 / 5.0, 44 votes)",
	"author": "Tennensuicoffee   天然水珈琲   ",
	"year": "\n2020",
	"ranking": "#2731   #2778   #3984   #4879   #5590   ",
	"reviewcount": "1 Review sorted by",
	"description": "I noticed that I am a weed in the forest, but for some reason I can think and have an ego. Besides, there is also strange knowledge. I have no choice but to live for the time being, even though I feel something is wrong with the status screen and level like a game.\n\nI think I was originally a human being, but I don’t remember much about it.\n\nAside from that, the light is delicious. When I thought that photosynthesis was good, I met a high elf girl who could hear the voice of plants.\n\nIt’s great to be able to talk. For the time being, while giving fruits, I was pulled out by a girl and went to the elf village.\n\nI’m being carefully raised, yeah? Somehow it smells like spring.\n\nApparently, the elves are a persecuted and exiled race.\n\nHowever, because it looks good, there are some undeliverable people who aim them as s*aves.\n\nA weed that already lived with elves like their families struggle to protect everyone. Evolve!\n\nThis is a story of a kind-hearted weed that protects an elf, or a “world tree” that will eventually lead many.>"
}