{
	"url": "https://www.novelupdates.com/series/national-school-prince-is-a-girl/",
	"title": "National School Prince Is A Girl - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/04/National-School-Prince-Is-A-Girl.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Comedy   Gender Bender   Mature   Psychological   Romance   School Life   Shoujo   Sports   Supernatural   ",
	"tags": "Adapted to Manhua   Amnesia   Artificial Intelligence   Beautiful Female Lead   Bullying   Carefree Protagonist   Charismatic Protagonist   Childhood Friends   Childhood Love   Cold Love Interests   Comedic Undertone   Complex Family Relationships   Confident Protagonist   Cross-dressing   Dense Protagonist   Doting Love Interests   e-Sports   Evil Organizations   Family Conflict   Female Protagonist   Gamers   Hackers   Handsome Male Lead   Hiding True Identity   Hypnotism   Incest   Lazy Protagonist   Love Interest Falls in Love First   Military   Misunderstandings   Modern Day   Narcissistic Protagonist   Older Love Interests   Organized Crime   Playful Protagonist   Popular Love Interests   Possessive Characters   Power Couple   Reincarnation   Rivalry   Secrets   Shameless Protagonist   Siblings Not Related by Blood   Strong Love Interests   Tomboyish Female Lead   Transmigration   Vampires   Wealthy Characters   ",
	"rating": "(4.2 / 5.0, 290 votes)",
	"author": "Warring Young Seven   Zhan Qi Shao   战七少   ",
	"year": "\n2017",
	"ranking": "#2000   #4701   #1374   #5685   #1547   ",
	"reviewcount": "57 Reviews sorted by",
	"description": "On the surface, she’s a gay high school boy. Underneath, she’s the hacker known as Z, who hunts criminals on the internet. A girl dressed in men’s clothes; a master at playing games, punishing evil, and having the highest skill in seducing girls. When people learned that “he” was actually female, the entire population blew up!\n\nFu Jiu: “Great Deity Qin, do you have a girlfriend?”\n\nQin Mo puts down the laptop: “I don’t have one.”\n\nFu Jiu starts to seduce in a low voice: “In that case, you have one starting now. Me.”\n\nHearing this, Qin Mo leans over tyrannically.\n\nFu Jiu is dumbstruck: “Hold on! What are you doing?”\n\nQin Mo: “Using my privilege as a boyfriend.”>"
}