{
	"url": "https://www.novelupdates.com/series/how-to-thrive-in-the-60s/",
	"title": "How to Thrive in the ’60s - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/08/SYPR-cover-2.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Fantasy   Romance   Slice of Life   ",
	"tags": "Bickering Couple   Business Management   Charismatic Protagonist   Female Protagonist   Leadership   Love Interest Falls in Love First   Mature Protagonist   Modern Day   Politics   Poor to Rich   Power Couple   Pragmatic Protagonist   Transmigration   ",
	"rating": "(4.0 / 5.0, 69 votes)",
	"author": "湖涂   ",
	"year": "\n2018",
	"ranking": "#1108   #2594   #3585   #6413   #3627   ",
	"reviewcount": "21 Reviews sorted by",
	"description": "Su Yu had been an only child. Her paternal grandfather raised her as if she was a boy that would succeed the family. However, when she was ten years old, her mother gave birth to a pair of fraternal twins. Now that the Su’s had a son to inherit, she had had to step aside. For Su Yu, this was a wonderful thing. She was happy to be able to live a good life without working.\r\n\r\nWho knew that her father would learn from others and want to marry off his daughter into an alliance marriage? If her chosen fiance was good in all aspects, she could have tolerated her father’s arrangement. However, her chosen fiance was a person with IQ problems.\r\n\r\nAt that moment, Su Yu suddenly understood the old saying. It was every person for themselves, and the devil took the hindmost. After seizing control of the family assets from her weak and incompetent father, she made up her mind to be the head of the household for the rest of her life. However, it seemed that the heavens wouldn’t let her live a free and easy life. After a good night’s sleep, she woke up and was back in 1959. She had become another person with the same name.\r\n\r\nThe original owner was someone that worked like a dog for her family, but Su Yu wouldn’t do such a s*upid thing even if someone threatened her with death. Even if she were to work extremely hard for her family, she would require her family to work extremely hard for her too.>"
}