{
	"url": "https://www.novelupdates.com/series/my-civil-servant-life-reborn-in-the-strange-world/",
	"title": "My Civil Servant Life Reborn in the Strange World - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/03/My-Civil-Servant-Life-Reborn-in-the-Strange-World.jpeg",
	"noveltype": "(KR)",
	"genre": "Action   Adventure   Comedy   Fantasy   ",
	"tags": "Academy   Adapted to Manhwa   Adventurers   Black Belly   Calm Protagonist   Clan Building   Coming of Age   Court Official   Demon Lord   Demons   Dishonest Protagonist   Dragon Slayers   Dragons   Economics   Empires   Family Conflict   Friendship   Herbalist   Hiding True Abilities   Hiding True Identity   Hypnotism   Inscriptions   Knights   Magical Technology   Male Protagonist   Misunderstandings   Multiple POV   Nobles   Overpowered Protagonist   Parody   Pets   Power Struggle   Protagonist Strong from the Start   Reincarnation   Romantic Subplot   Roommates   Royalty   Saints   Schemes And Conspiracies   Scientists   Sibling Rivalry   Siblings   Special Abilities   Spies   Strategist   Stubborn Protagonist   Sword And Magic   Sword Wielder   Thieves   Tribal Society   Unique Weapons   Unreliable Narrator   Wealthy Characters   ",
	"rating": "(3.6 / 5.0, 266 votes)",
	"author": "일계   ",
	"year": "\n2019",
	"ranking": "#5262   #2511   #347   #221   #1271   ",
	"reviewcount": "46 Reviews sorted by",
	"description": "He was on his way to buy some beer to celebrate his acceptance as a civil servant when he was suddenly isekai’d by truck-kun.\n\nReincarnated as Denburg Blade, the son of a legendary battle race chief, he caught demons at 8 years old and a dragon at 12 years old. Subjected to the spartan-style training of his muscular monster of a father, his daily life was inhuman.\n\n“I must leave this place that is far from peaceful!”\n\nSafety is the best! So, he chose to be a civil servant of the empire!\n\nCan Denburg really become a civil servant and live the peaceful and stable life he wishes for?>"
}