{
	"url": "https://www.novelupdates.com/series/young-master-and-his-super-inferno-lover/",
	"title": "Young Master and His Super Inferno Lover - Novel Updates",
	"image": "https://www.novelupdates.com/img/noimagefound.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Drama   Romance   Sci-fi   Smut   Yaoi   ",
	"tags": "Adapted to Manga   Aliens   Aristocracy   Army   Black Belly   Business Management   Businessmen   Character Growth   Cold Love Interests   Complex Family Relationships   Cute Children   Doting Love Interests   Family Conflict   Futuristic Setting   Generals   Handsome Male Lead   Hard-Working Protagonist   Hiding True Abilities   Hiding True Identity   Love at First Sight   Love Interest Falls in Love First   Manly Gay Couple   Mercenaries   Military   Misunderstandings   Mpreg   Mysterious Family Background   Nobles   Outer Space   Pets   Power Couple   Reincarnation   Royalty   Saving the World   Schemes And Conspiracies   Special Abilities   Strong Love Interests   Stubborn Protagonist   ",
	"rating": "(3.0 / 5.0, 12 votes)",
	"author": "Liang Luosheng   凉洛笙   ",
	"year": "\n2018",
	"ranking": "#2000   #2000   #9798   #10268   #9658   ",
	"reviewcount": "3 Reviews sorted by",
	"description": "Mu Yunshen returned to his hometown after retiring from the military. He opened a pet shop and lived a quiet life, thinking that the rest of his life was going to be spent peacefully like this, until one day, a young master of a military family he once protected came looking for him…\n\n“You look a little familiar.” Trolexer looked at Mu Yunshen with dark blue eyes.\n\n“I think you must have mistaken me for someone else…” Mu Yunshen turned around to feed the Iceflame fox in the cage, but only to hide the cold sweat running down his face.\n\n“Let’s see… you look a lot like the guard who used to protect me.” Trolexer said, rubbing his chin.\n\nMu Yunshen knew he couldn’t hide anymore. What should come would always come, and it was time to face it all.\n\n“That’s right! Do you know how much pain I’ve gone through during the years you were away?!”\n\n“And those two boys in the room! They are our children!”>"
}