{
	"url": "https://www.novelupdates.com/series/transmigrated-canon-fodder-please-calm-down/",
	"title": "Transmigrated Canon Fodder, Please Calm Down! - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/03/快穿女配冷静点.jpg",
	"noveltype": "(CN)",
	"genre": "Adventure   Fantasy   Romance   ",
	"tags": "Abandoned Children   Academy   Adapted to Manhua   Alternate World   Ancient Times   Antihero Protagonist   Apocalypse   Beautiful Female Lead   Black Belly   Broken Engagement   Calm Protagonist   Clingy Lover   Cold Love Interests   Cold Protagonist   Comedic Undertone   Cunning Protagonist   Determined Protagonist   Devoted Love Interests   Doting Love Interests   Episodic   Fast Cultivation   Female Protagonist   Game Elements   Handsome Male Lead   Hidden Abilities   Love Interest Falls in Love First   Male Yandere   Mature Protagonist   Multiple Identities   Multiple Realms   Multiple Reincarnated Individuals   Multiple Timelines   Multiple Transported Individuals   Obsessive Love   Overpowered Protagonist   Power Couple   Revenge   Ruthless Protagonist   Seduction   System Administrator   Transmigration   Transported to Another World   Wealthy Characters   World Hopping   Zombies   ",
	"rating": "(4.1 / 5.0, 150 votes)",
	"author": "杜了了   ",
	"year": "\nN/A",
	"ranking": "#914   #352   #1634   #1600   #2254   ",
	"reviewcount": "42 Reviews",
	"description": "She was a secondary character, each ending tragic. And then she came to a realization. The system she was bound to was a homeless system. It did not give any newbie package, oldie package, and completing the missions had no rewards. She decided to not do missions anymore. \n\nSystem: Warning! Please complete the mission, or you will be eliminated.\n\nTang Guo: Dream on. \n\nSystem: Host, I beg of you! Please don’t bully the main characters anymore!\n\nTang Guo: No way.\n\nAnd then…..\n\nSystem: Master, how do you plan to bring disaster to this world? Take me with you!\n\nTang Guo: It can be done. Check that man’s information for me.\n\nSystem: *chirping* Okay! Please wait a moment, master!>"
}