{
	"url": "https://www.novelupdates.com/series/interstellar-rare-species/",
	"title": "Interstellar Rare Species - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/08/Interstellar-Rare-Species.jpg",
	"noveltype": "(CN)",
	"genre": "Fantasy   Romance   Sci-fi   Slice of Life   Yaoi   ",
	"tags": "Androids   Artificial Intelligence   Beastkin   Beasts   Caring Protagonist   Charismatic Protagonist   Cute Protagonist   Cute Story   Dense Protagonist   Devoted Love Interests   Disabilities   Discrimination   Doting Love Interests   Family   Famous Protagonist   Forced Marriage   Friendship   Futuristic Setting   Handsome Male Lead   Hard-Working Protagonist   Heartwarming   Hiding True Identity   Kind Love Interests   Love Interest Falls in Love First   Marriage   Mpreg   Music   Mute Character   Older Love Interests   Secretive Protagonist   Shapeshifters   Showbiz   Singers   Strong Love Interests   System Administrator   Transmigration   Transported to Another World   Weak Protagonist   Werebeasts   ",
	"rating": "(4.1 / 5.0, 227 votes)",
	"author": "Hanmen Yatou   Humble Servant Girl   寒门丫头   ",
	"year": "\n2019",
	"ranking": "#1144   #2661   #1891   #221   #1831   ",
	"reviewcount": "59 Reviews sorted by",
	"description": "When Gu Yu woke up, he found himself transmigrated to a werebeast planet and becoming an ‘artificial female’ given to the imperial marshal.\r\n\r\nShudder.\r\n\r\nWhile the males on Brilliant Splendor are so capable that they can freely switch from beast to human form, the females were too fragile in human form and lost the ability to become human during the catastrophe.\r\n\r\nIt was the most common desire of the males – that their partners have human forms.\r\n\r\nTo satisfy this desire, a new product appeared on the market: artificial females – biological robots that are identical to natural human females, equipped with intelligent chips, and capable of responding to stimuli.\r\n\r\nPlanet Law stipulates that, in order to ensure the birth rate of the young, if one does not marry on their own by the age of eighty, they will be issued a partner by the Star Network.\r\n\r\nBrilliant Splendor’s oldest prime bachelor, Marshal Cyno Bruce, made a decision that shocked the network when he was about to turn eighty.\r\n\r\n- Marry an artificial female.\r\n\r\nCyno: Marry a beast female, no way! As for artificial females? Well, it’s cheap and it will not be a hindrance.\r\n\r\nLater…\r\n\r\nReally fragrant! _(:з”∠)_ Baby, let me hold you!>"
}