{
	"url": "https://www.novelupdates.com/series/wife-is-fierce-dont-mess-with-her/",
	"title": "Wife is Fierce, Don’t Mess With Her! - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/06/waifisfierce2b.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Comedy   Josei   Mature   Romance   Sports   ",
	"tags": "Adopted Protagonist   Age Regression   Beautiful Female Lead   Determined Protagonist   Devoted Love Interests   Fat to Fit   Female Protagonist   Firearms   Genius Protagonist   Handsome Male Lead   Hard-Working Protagonist   Hidden Abilities   Military   Modern Day   Older Love Interests   Possessive Characters   Pregnancy   Royalty   Second Chance   Soldiers   Weak to Strong   ",
	"rating": "(4.0 / 5.0, 46 votes)",
	"author": "Gu Mushuang   孤木双   ",
	"year": "\nN/A",
	"ranking": "#2000   #4872   #6192   #6514   #7370   ",
	"reviewcount": "16 Reviews sorted by",
	"description": "Gu Qingjiu was sent to prison by her own biological parents for crime she didn't commit and unjustly died, boyfriend betrayed her for her sister, her loving adoptive family was destroyed. But she is not reconciled.\n\nReliving her life once more, Gu Qingjiu chooses to enlist in the military and bear the toughest hardships she has ever faced. Everyone says that she’s the least possible person to join the special forces. However, she manages to prove all of them wrong.\n\nGood-for-nothing? Who’s the good-for-nothing? Is she a good-for-nothing when she can throw all of them onto the floor in a fight? Is she a good-for-nothing when she has results better than everyone else? She’ll prove all of them wrong.\n\nHe Niancheng, the well-known, youngest major-general in Beijing. A banishment sends him into the basic ranks in a military camp as a new recruit. From then on, he meets a person that makes him dote on and protect at all costs, his beloved. However, his beloved is only focused on fighting and killing. Major-general He declares this to be a very bad, a very terrible situation. Yet, Gu Qingjiu merely replies, “Scram! Lower your gun if you dare!”>"
}