{
	"url": "https://www.novelupdates.com/series/moto-sekai-ichi-i-no-sub-chara-ikusei-nikki/",
	"title": "Moto Sekai Ichi’i no Sub-chara Ikusei Nikki - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/03/81Wy0Rov58L.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Comedy   Fantasy   Harem   Romance   Shounen   Slice of Life   ",
	"tags": "Adapted to Manga   Appearance Changes   Archery   Arrogant Characters   Beastkin   Cheats   Clever Protagonist   Cold Protagonist   Demi-Humans   Dense Protagonist   Dungeons   Elemental Magic   Elves   Fantasy World   Fast Learner   Game Elements   Grinding   Handsome Male Lead   Knights   Lack of Common Sense   Magic Beasts   Male Protagonist   Master-Disciple Relationship   Master-Servant Relationship   Money Grubber   Monsters   Multiple POV   Nobles   Overpowered Protagonist   Parody   Polygamy   R-15   S*aves   Strong to Stronger   Sudden Strength Gain   Summoning Magic   Sword And Magic   Transmigration   Transported into a Game World   Weak to Strong   Wealthy Characters   ",
	"rating": "(3.8 / 5.0, 258 votes)",
	"author": "Sawamura Harutarou   沢村治太郎   ",
	"year": "\n2017",
	"ranking": "#2917   #3619   #486   #2071   #482   ",
	"reviewcount": "34 Reviews sorted by",
	"description": "He never performed well in either middle nor high school, and even after becoming an adult, he never worked. Be it morning, noon or night, he only played an online game. For him, being the world’s number one rank, playing that online game, was his very reason for living.\n\nOne day, his account was hacked and his character deleted. Restoration was impossible. Nothing that could be done. The number 1 rank that he literally spent his life to attain and to defend was now lost. Filled with despair, he turned to suicide.\n\nWhen he opened his eyes again, there was the online game. No, the world itself looked similar to the game. He had been reborn as the extra character of the premium avatar he created in the past, but left untouched.\n\nThe former world’s top, was reborn in a world that looked like that online game. That was the beginning of his extraordinary legend.\n\nA knight, a cat, a dark elf, and so on. Together with several unique companions, his training to regain his “world’s first rank” now begins.>"
}