{
	"url": "https://www.novelupdates.com/series/villain-please-go-easy-on-me/",
	"title": "Villain, Please Go Easy on Me - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/05/1051873.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adult   Comedy   Psychological   Romance   Xuanhuan   Yaoi   ",
	"tags": "Acting   Ancient Times   Apocalypse   Black Belly   Body Swap   Character Growth   Clever Protagonist   Clones   Cold Love Interests   Confident Protagonist   Confinement   Cowardly Protagonist   Cross-dressing   Cultivation   Death   Demons   Devoted Love Interests   Disabilities   Doting Love Interests   Enemies Become Lovers   Family Conflict   Ghosts   Handsome Male Lead   Hypnotism   Kidnappings   Kuudere   Love Interest Falls in Love First   Male Yandere   Medical Knowledge   Mismatched Couple   Modern Day   Near-Death Experience   Obsessive Love   Omegaverse   Otaku   Personality Changes   Possessive Characters   Power Couple   Psychopaths   Reincarnation   Rivalry   Sadistic Characters   Schemes And Conspiracies   Schizophrenia   Shameless Protagonist   Showbiz   Stalkers   Strong Love Interests   Suicides   System Administrator   Torture   Transmigration   Tsundere   Twisted Personality   Unlucky Protagonist   Vampires   Weak to Strong   Wealthy Characters   World Hopping   Yandere   Zombies   ",
	"rating": "(3.9 / 5.0, 83 votes)",
	"author": "A Complex Of Dirty And Naïve   一污二白   ",
	"year": "\nN/A",
	"ranking": "#5262   #2891   #2639   #1494   #2221   ",
	"reviewcount": "33 Reviews sorted by",
	"description": "Life is always full of surprises. Su Bei has transmigrated, the thing is he has transmigrated into all kinds of worlds to captivate the male lead! \n\nWhen he finds that the first target is a villain, Su Bei still tries to comfort himself in his heart that the one in the next world would be better. \n\nBut reality slaps him right in the face. So it turns out the next is always more villainous. \n\nSu Bei has taken the captivating-the-villainous-male-lead way down and could never turn back. \n\nBut who could tell him why every villain he has to captivate is actually the damn same one??? \n\nWhen he is pinned down by the villain for the 108th time, Su Bei feels like weeping but has no tears, “Villain, please go easy on me!”>"
}