{
	"url": "https://www.novelupdates.com/series/after-having-an-ai-boyfriend-i-will-never-be-afraid-of-sunspots/",
	"title": "After Having an AI Boyfriend, I Will Never Be Afraid of Sunspots - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/09/After-Having-an-AI-Boyfriend-I-Will-Never-Be-Afraid-of-Sunspots.jpg",
	"noveltype": "(CN)",
	"genre": "Fantasy   Romance   Sci-fi   Yaoi   ",
	"tags": "Artificial Intelligence   Doting Love Interests   Genius Protagonist   Human-Nonhuman Relationship   Power Couple   Second Chance   Showbiz   Strong Love Interests   Transmigration   ",
	"rating": "(4.1 / 5.0, 10 votes)",
	"author": "Yunxiao YX   云霄YX   ",
	"year": "\n2020",
	"ranking": "#1553   #1315   #9950   #2635   #8359   ",
	"reviewcount": "3 Reviews sorted by",
	"description": "Before leaving he lay on the hospital bed, with a faint light flashing in his eyes. He looked at the man on the screen with a cold expression but a sad look in his eyes. He laughed in a hoarse voice and said, “I’ve gone, and I’ve taken away the emotion imposed on you. After that… You’re free.”\n\nThen, he closed his eyes, leaving a radiant legend for generations after.\n\nHowever, he did not know that at the moment his hand dropped, the man who had been programmed by him for a lifetime looked stunned, and then like a madman wanted to break out.\n\nHowever, the virtual him could only stand at the opposite end of the screen, collapsing as he roared….\n\nAfter waking up, Bai Ruogu found himself reborn, he became an unimpressive third-rate star in the interstellar future.\n\nHe was going to live a day at a time until he turned on his smart bracelet and asked his system, “What’s your name?”\n\n“Ah Miao.” The familiar voice made him pause.\n\n“Which Miao?”\n\n“Miao of Muse.” A mechanical, cold voice came from the bracelet.\n\n(T/N: Muse in Chinese is written as: 缪斯 and Miao is the character: 缪)\n\nBai Ruogu froze: “Su Miao?”\n\nThe bracelet flickered and emitted a flash of light for a moment, and the entire interstellar’s artificial intelligence all collapsed……\n\n……\n\nThe reborn Bai Ruogu seemed as though he had cheats turned on.\n\nFaced with black material –\n\nOther stars: Forget it, put up with it.\n\nBai Ruogu: Before he could say anything, his boyfriend had already followed the net to find the rumor monger and hunted down the evidence to send a lawyer’s letter.\n\nFaced with a black fan siege –\n\nOther stars: Collapse overwhelmed.\n\nBai Ruogu: His boyfriend opened millions of accounts to go against the black powder online. He tore them apart for three days and three nights until they fell to the ground and frothed on the spot.\n\nFaced with fan CP –\n\nOther stars: see if the other party is popular. If they’re trending, it’s OK. If not, it’s better   \n\nto say goodbye.\n\nBai Ruogu: Sorry, this message simply cannot be sent at all.　\n\nOther stars: ……　\n\nLittle theatre.\n\nFriend: My old attack may be in kindergarten.\n\nYoung master: My old attack is 100,000 light years away.>"
}