{
	"url": "https://www.novelupdates.com/series/marrying-the-soft-hearted-villain/",
	"title": "Marrying the Soft-hearted Villain - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/08/B8B2D3F8-A01E-4115-8339-03EF76A4266E.jpeg",
	"noveltype": "(CN)",
	"genre": "Comedy   Drama   Fantasy   Romance   Slice of Life   ",
	"tags": "Arranged Marriage   Beastkin   Beautiful Female Lead   Caring Protagonist   Cultivation   Determined Protagonist   Devoted Love Interests   Disabilities   Disfigurement   Early Romance   Fated Lovers   Female Protagonist   Friendship   Handsome Male Lead   Hard-Working Protagonist   Heartwarming   Human-Nonhuman Relationship   Misunderstandings   Playful Protagonist   Prophecies   Reincarnated in Another World   Reincarnation   Shy Characters   Sickly Characters   Slow Growth at Start   Slow Romance   Special Abilities   Transmigration   Tribal Society   Weak to Strong   ",
	"rating": "(4.2 / 5.0, 244 votes)",
	"author": "Mu Mu Liang Chen   沐沐良辰   ",
	"year": "\n2019",
	"ranking": "#1768   #517   #523   #693   #533   ",
	"reviewcount": "66 Reviews sorted by",
	"description": "Ruan Qiuqiu had transmigrated into a cannon fodder that had the same name as her in the novel, Sweet Pampering in Ancient Times: Demon King Husband, Please Spare Me\n\nRight now, there were two paths before her:\n\nOption 1: Continue playing the role of the supporting female character. After a few rounds of being faceslapped by the female lead, she would die tragically in the beast tide.\n\nOption 2: For the sake of the tribe having enough salt, marry the wolf tribe’s former chief, a fierce wolf demon that was disfigured, crippled, and possibly had personality issues.\n\nRuan Qiuqiu chose the second option without hesitation. She rather go live a peaceful and ambitious-free life than compete with the female lead over some guy.\n\n—\n\nDue to a mishap, Mr. Big Bad Wolf, who had the blood of fiends in him, had become disfigured, crippled, and blind.\n\nHe was on the verge of death and his tribe had abandoned him. When he fell to the state of being so hungry that he was gnawing on ice…\n\nThe young bride, who his tribe had exchanged 300 catties of salt for, carefully walked to his side and covered his ugly damaged body with an animal hide.\n\nShe softly called him, “Husband?”>"
}