{
	"url": "https://www.novelupdates.com/series/when-the-mad-emperor-suddenly-becomes-sweet/",
	"title": "When the Mad Emperor Suddenly Becomes Sweet - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/07/When-the-Mad-Emperor-Suddenly-Becomes-Sweet.jpg",
	"noveltype": "(KR)",
	"genre": "Adult   Fantasy   Romance   Smut   ",
	"tags": "Beautiful Female Lead   Cold Protagonist   European Ambience   Fated Lovers   Female Protagonist   First Love   First-time Interc**rse   Handsome Male Lead   Master-Servant Relationship   Obsessive Love   R-18   Revenge   Royalty   Servants   Strong Love Interests   ",
	"rating": "(3.5 / 5.0, 37 votes)",
	"author": "Jezz   ",
	"year": "\n2021",
	"ranking": "#1795   #3694   #4693   #4157   #3176   ",
	"reviewcount": "2 Reviews sorted by",
	"description": "Lucius tied her hands tightly above her head, planting soft kisses along Freya's neck and shoulders. Freya could no longer relax as his lips brushed against the peak of her chest, which had hardened in excitement. “Oh, this feels weird,' she moaned. His hand slid toward Freya's exposed belly, and as he reached her most sensitive spot, caressing it gently, Lucius suddenly let out a low groan.\r\n\r\n“Freya, I can’t take it any longer.”\r\n\r\nHis erect manhood, threatening to spill its evident desire, penetrated her insides at once.\r\n\r\n***\r\n\r\nFreya grew up abused in her orphanage. She picked up Ruth, a beautiful boy with blonde hair and green eyes who had fallen down in the yard.\r\n\r\n‘Freya, I have only you.’\r\n‘No matter what happens, I won’t let go of your hand.’\r\n\r\nBut one day, Ruth suddenly disappeared, and that was the last memory she had of him. And three years later, Freya became a servant of the mad prince.\r\n\r\n“I will give you the honor of being my servant,” said the prince. However, things began to get strange as Freya is constantly entangled with the prince. She wants to keep distance from him, but her efforts were in vain.\r\n\r\nBlonde hair, pale skin, and thin red lips. Crown Prince Lucius held dark blue eyes, so different from the Ruth Freya knew in many ways.\r\n\r\n'He's not Ruth. But why… do I remember Ruth?’>"
}