{
	"url": "https://www.novelupdates.com/series/the-grand-secretarys-pampered-wife/",
	"title": "The Grand Secretary’s Pampered Wife - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/07/The-Grand-Secretarys-Pampered-wife.jpg",
	"noveltype": "(CN)",
	"genre": "Adventure   Comedy   Drama   Fantasy   Romance   ",
	"tags": "Adopted Children   Ancient China   Childcare   Complex Family Relationships   Confident Protagonist   Cooking   Cunning Protagonist   Devoted Love Interests   Doctors   Doting Older Siblings   Female Protagonist   Handsome Male Lead   Heartwarming   Hiding True Identity   Marriage   Modern Knowledge   Nobles   Overpowered Protagonist   Pets   Poor to Rich   Power Couple   Sibling's Care   Smart Couple   Transmigration   Tsundere   Twins   Wars   ",
	"rating": "(4.3 / 5.0, 71 votes)",
	"author": "Home Remedy   Pian Fang Fang   偏方方   ",
	"year": "\n2021",
	"ranking": "#59   #59   #1466   #128   #3496   ",
	"reviewcount": "21 Reviews sorted by",
	"description": "She was originally the young miss of the Marquis Estate, but became a peasant girl due to a mixed-up at birth. \n\nWith great difficulty, she grew up into a delicate beauty, but no one wanted to marry her.\n\nRumors said she was ugly and was born a fool, and that she was a star of disaster that brought about the tragedy of her parents.\n\nHowever, the husband she picked up midway was the future Grand Secretary. \n\nThe little monk she adopted from up the mountain was the future Godly General of the six states.\n\nEven the elderly woman she saved in passing turned out to be the Empress Dowager.\n\nA certain man said viciously, “Wife, who dares to bully you? This husband will end them for you!”\n\nThe Godly General said, “Big sister, no matter where you want to go in the territory of the six states, I’ll clear the path for you!”\n\nThe Empress Dowager said, “Did the Emperor bully Jiao Jiao? Wait here! Aijia will go dispose of him!”\n\n[A tyrannical beautiful Female Lead who can rely on luck but insists on using strength] & [A Male Lead with broken wings who hides himself deeply]\n\n>"
}