{
	"url": "https://www.novelupdates.com/series/devil-venerable-also-wants-to-know/",
	"title": "Devil Venerable Also Wants to Know - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/08/Devil-Venerable-Also-Wants-to-Know.jpg",
	"noveltype": "(CN)",
	"genre": "Adventure   Comedy   Romance   Shounen Ai   Supernatural   Xianxia   ",
	"tags": "Adapted to Drama CD   Ancient Times   Artifacts   Betrayal   Blood Manipulation   Books   Boss-Subordinate Relationship   Calm Protagonist   Character Growth   Clever Protagonist   Cold Protagonist   Cultivation   Dao Companion   Dao Comprehension   Demon Lord   Demonic Cultivation Technique   Demons   Dense Protagonist   Devoted Love Interests   Enemies Become Allies   First Love   Friendship   Ghosts   Goddesses   Gods   Handsome Male Lead   Hated Protagonist   Heavenly Tribulation   Hiding True Abilities   Hiding True Identity   Inferiority Complex   Jealousy   Leadership   Love Interest Falls in Love First   Magic Formations   Manly Gay Couple   Master-Servant Relationship   Misunderstandings   Multiple POV   Multiple Realms   Multiple Timelines   Near-Death Experience   Obsessive Love   Overpowered Protagonist   Parasites   Past Plays a Big Role   Past Trauma   Pill Based Cultivation   Playboys   Power Couple   Pragmatic Protagonist   Protagonist Strong from the Start   Reincarnation   Revenge   Seme Protagonist   S*xual Cultivation Technique   Sharing A Body   Slow Romance   Souls   Strategist   Strength-based Social Hierarchy   Strong Love Interests   Time Skip   Torture   Tragic Past   Unconditional Love   Unique Weapons   Wars   ",
	"rating": "(4.8 / 5.0, 735 votes)",
	"author": "Cyan Wings   Qing Se Yu Yi   青色羽翼   ",
	"year": "\n2019",
	"ranking": "#888   #1644   #983   #633   #447   ",
	"reviewcount": "155 Reviews sorted by",
	"description": "In a Mary-Sue novel, the readers all liked the Devil Venerable, the second male lead who devoted himself whole-heartedly to the female lead. However the female lead only loved the male lead who abused her physically and mentally.\n\nReaders: Why doesn’t the female lead like the Devil Venerable?!\n\nDevil Venerable: This Venerable also wants to know. But what I really want to know is why I even like the female lead at all.\n\nIn order to understand why the female lead wasn’t attracted to him, the self-conscious Devil Venerable brutally interrogated the entire cast of characters from the novel.\n\nBackground characters: I have so many things I want to say but I don’t dare to say it to his face!\n\n–\n\nAfter obtaining the book, the Devil Venerable discovered that the book described the world he lived in. This book said that after he sacrificed himself for the female lead, the fourth male lead, his silent and loyal subordinate Yin Hanjiang, blackened and attempted to kill her as a sacrificial offering for his lord.\n\nDevil Venerable Wenren E: Yin Hanjiang, this Venerable wants to know why you wanted to kill the female lead.\n\nYin Hanjiang was silent.\n\nWenren E: If you refuse to speak, this Venerable will cut out your tongue and have it with alcohol!\n\nYin Hanjiang: …\n\nWenren E: What the hell are you blushing for?!>"
}