{
	"url": "https://www.novelupdates.com/series/after-i-transmigrated-as-a-fake-young-master-i-became-popular/",
	"title": "After I Transmigrated As A Fake Young Master, I Became Popular - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/09/After-I-Transmigrated-As-A-Fake-Young-Master-I-Became-Popular.jpg",
	"noveltype": "(CN)",
	"genre": "Fantasy   Romance   Yaoi   ",
	"tags": "Abusive Characters   Acting   Black Belly   Caring Protagonist   Celebrities   Charming Protagonist   Clever Protagonist   Cunning Protagonist   Cute Protagonist   Doting Love Interests   Hard-Working Protagonist   Jack of All Trades   Poor Protagonist   Showbiz   Smart Couple   Transmigration   Underestimated Protagonist   Weak to Strong   ",
	"rating": "(4.3 / 5.0, 8 votes)",
	"author": "风华如故   ",
	"year": "\n2022",
	"ranking": "#2566   #4218   #11572   #11528   #11727   ",
	"reviewcount": "1 Review sorted by",
	"description": "“After Marriage With Your Ex, After Falling In Love”,\nLin Yanran transmigrated into the book as poor and beautiful cannon fodder. The cannon fodder was not only brainless but also a wealthy fake young master.\n\nBecause he bullied the protagonist, the real young master, he was kicked out of the house by the wealthy adoptive parents and suffered all kinds of slaps in the face, and finally died tragically. The whole entertainment circle regarded him as a laughing stock.\n\nWhen Lin Yanran died and transmigrated into. He was so poor that he could hardly have money to eat not only that he was abhorred by the audience. Looking at the severe abuse and the balance on the bank card, Lin Yanran smiled lightly.\n\nThe audience of the variety show called him a waste. The concept stage was immediately revamped, and the video went out of the circle and became a hot search.\n\nThe audience of the variety show believes that his IQ is low.\n\nThe director was frightened and cried begging him not to give the correct answer again.\n\nTravel variety viewers don’t want to see him. A piece of guzheng was fresh and refined, the white clothes fluttering like an exiled immortal, crying for international friends.\n\nAudience: Thank you, slap in the face was delicious!\n\nLin Yanran, who has been turning against the wind and determined not to let himself die tragically, never thought that one day, a lady would gently embrace him in her arms.\n\nThe other party was excited and burst into tears:\n\n“Son! Mom finally found you!”\n\nLin Yanran: ??\n\nIt was not until he was taken home by his biological mother that he realized that his true identity was the young master from a very wealthy family!>"
}