{
	"url": "https://www.novelupdates.com/series/isekai-nonbiri-nouka/",
	"title": "Isekai Nonbiri Nouka - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/05/Isekai-Nonbiri-Nouka.jpg",
	"noveltype": "(JP)",
	"genre": "Adventure   Comedy   Fantasy   Harem   Romance   Seinen   Slice of Life   ",
	"tags": "Academy   Adapted to Anime   Adapted to Manga   Adopted Children   Adventurers   Angels   Archery   Aristocracy   Army   Beast Companions   Beastkin   Beasts   Business Management   Calm Protagonist   Caring Protagonist   Character Growth   Cheats   Childcare   Clan Building   Cohabitation   Contracts   Cooking   Cute Children   Demi-Humans   Demon Lord   Demons   Dense Protagonist   Domestic Affairs   Dragon Riders   Dragons   Dwarfs   Early Romance   Easy Going Life   Elemental Magic   Elves   Evil Gods   Familial Love   Family   Family Business   Fantasy World   Farming   Fast Learner   First-time Interc**rse   Fox Spirits   Friendship   God-human Relationship   God Protagonist   Goddesses   Godly Powers   Gods   Guilds   Hard-Working Protagonist   Harsh Training   Heartwarming   Heroes   Hidden Abilities   Human-Nonhuman Relationship   Human Weapon   Jack of All Trades   Kind Love Interests   Kingdom Building   Kingdoms   Lack of Common Sense   Lost Civilizations   Love Interest Falls in Love First   Magic Formations   Magical Technology   Maids   Male Protagonist   Marriage   Medical Knowledge   Medieval   Mercenaries   Merchants   Mind Control   Misunderstandings   Multiple POV   Naive Protagonist   Nobles   Older Love Interests   Overpowered Protagonist   Pets   Polite Protagonist   Politics   Polygamy   Pregnancy   Priestesses   Proactive Protagonist   Prophecies   Protagonist Falls in Love First   Protagonist Strong from the Start   R-15   R*pe Victim Becomes Lover   Religions   Reverse R*pe   R*pe   Schemes And Conspiracies   Special Abilities   Strength-based Social Hierarchy   Strong Love Interests   Sudden Wealth   Sword And Magic   Teamwork   Threesome   Time Skip   Transformation Ability   Transported to Another World   Unconditional Love   Vampires   Wars   Wealthy Characters   World Tree   ",
	"rating": "(3.8 / 5.0, 386 votes)",
	"author": "Kinosuke Naito   ",
	"year": "\n2016",
	"ranking": "#1969   #1906   #63   #509   #190   ",
	"reviewcount": "57 Reviews",
	"description": "After his struggle against disease for a decade, the main character dies. However, he revives and became younger in a different world.\n\nThe main support of the main character’s heart during his battle against the disease is a TV program about leisure farming.\n\nIn his second life in a different world, he’s going to try farming.\n\nCommon things like different world transition and domestic affairs?\n\nThis will have no big climax.\n\nThis is going to be frantic.>"
}