{
	"url": "https://www.novelupdates.com/series/consort-of-a-thousand-faces/",
	"title": "Consort of a Thousand Faces - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/07/ctf_lowq.jpg",
	"noveltype": "(CN)",
	"genre": "Drama   Fantasy   Romance   ",
	"tags": "Ancient China   Aristocracy   Arrogant Characters   Beautiful Female Lead   Betrayal   Calm Protagonist   Character Growth   Charismatic Protagonist   Charming Protagonist   Clever Protagonist   Cold Love Interests   Couple Growth   Death of Loved Ones   Determined Protagonist   Devoted Love Interests   Different Social Status   Enemies Become Lovers   Female Protagonist   Handsome Male Lead   Hard-Working Protagonist   Heartwarming   Hiding True Abilities   Hiding True Identity   Imperial Harem   Jealousy   Late Romance   Love Interest Falls in Love First   Loyal Subordinates   Maids   Medical Knowledge   Mysterious Family Background   Mysterious Past   Nobles   Older Love Interests   Persistent Love Interests   Politics   Poor to Rich   Popular Love Interests   Power Struggle   Reincarnation   Royalty   Schemes And Conspiracies   Second Chance   Siblings   S*ave Protagonist   Slow Growth at Start   Slow Romance   Strong Love Interests   Tragic Past   Wars   Weak to Strong   ",
	"rating": "(3.6 / 5.0, 102 votes)",
	"author": "Qian Duoduo   千朵朵   ",
	"year": "\n2015",
	"ranking": "#3923   #4235   #1615   #7857   #3115   ",
	"reviewcount": "28 Reviews sorted by",
	"description": "Once an imperial princess, now reborn among the lowest of slaves of the nobility.\n\nAs Nanzhao’s eldest imperial princess, she received the burden of an imperial ruler and took to the battlefield in tumultuous times. Instead of being a hero, her actions were vilified by officials as meddling in court affairs. Watching her trusted confidante die as she stood among a sea of flames, her tattered heart was pierced by an arrow shot by the one she loved most.\n\nIn her previous life, she was known as Ning Rulan.\n\nResurrected as a palace maid carrying out the most menial of tasks in Beimin’s imperial palace, she is resolved to take revenge and save her younger brother. However, many devilish and vindictive nobles stand in her way as she navigates through the dangers of court politics.\n\nTravelling across nations and unravelling secrets, she carves out a new place for herself.\n\nA place for the woman now known as Su Xi-er.\n\nWill she remain shackled to her past? Or will she reach for the chance at happiness before her?\n\nNo matter if she is Ning Rulan or Su Xi-er, this time, there would be no more regrets!>"
}