{
	"url": "https://www.novelupdates.com/series/zhanxian/",
	"title": "Zhanxian - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/09/zhanxian.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Harem   Martial Arts   Mature   Xianxia   ",
	"tags": "Affair   Alchemy   Arrogant Characters   Artifact Crafting   Artifacts   Beast Companions   Beasts   Beautiful Female Lead   Body Tempering   Clever Protagonist   Confident Protagonist   Cultivation   Cunning Protagonist   Dao Companion   Demonic Cultivation Technique   Demons   Determined Protagonist   Dragons   Famous Protagonist   Female Master   Friendship   Gods   Hard-Working Protagonist   Heavenly Tribulation   Hiding True Abilities   Hot-blooded Protagonist   Immortals   Lucky Protagonist   Maids   Male Protagonist   Marriage   Master-Disciple Relationship   Multiple Realms   Mythical Beasts   Mythology   Older Love Interests   Overpowered Protagonist   Phoenixes   Pill Based Cultivation   Pill Concocting   Polygamy   Previous Life Talent   Revenge   Romantic Subplot   Ruthless Protagonist   Schemes And Conspiracies   Second Chance   Secretive Protagonist   Sect Development   S*xual Cultivation Technique   Slow Romance   Student-Teacher Relationship   Sword Wielder   Tragic Past   Underestimated Protagonist   Unique Cultivation Technique   Wars   Weak to Strong   ",
	"rating": "(4.1 / 5.0, 776 votes)",
	"author": "Ren Yuan   任怨   ",
	"year": "\n2011",
	"ranking": "#379   #524   #128   #317   #254   ",
	"reviewcount": "95 Reviews sorted by",
	"description": "Gripes have their origins and debts have their debtors. We haven’t crossed each other in days past or present, nor formed any grudges. I am but duty-bound to carry this out, so apologies in advance!\r\n\r\nIn his past life, Yang Chen was a gentle person who was oppressed for his whole life.\r\n\r\nNow that he’s reborn, he chose to become an executioner and severs ties and grudges with his executioner’s blade, killing all that climb onto the Immortal Executioner’s Platform!\r\n\r\nHeads will roll! Humans’ in the human realm, demons’ in the demon realm, devils’ in the devil realm and immortals’ in the immortal realm!>"
}