{
	"url": "https://www.novelupdates.com/series/miniature-medical-goddess/",
	"title": "Miniature Medical Goddess - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2018/06/MiniatureMedicalGoddess.png",
	"noveltype": "(CN)",
	"genre": "Adventure   Comedy   Harem   Historical   Josei   Martial Arts   Romance   Wuxia   ",
	"tags": "Ancient China   Beautiful Female Lead   Calm Protagonist   Clever Protagonist   Doctors   Farming   Female Protagonist   Genius Protagonist   Handsome Male Lead   Poisons   Politics   Polyandry   Reverse Harem   Transmigration   Ugly to Beautiful   ",
	"rating": "(4.1 / 5.0, 42 votes)",
	"author": "Little Apple   苹果儿   ",
	"year": "\nN/A",
	"ranking": "#2000   #2000   #8769   #8527   #6105   ",
	"reviewcount": "2 Reviews sorted by",
	"description": "The purple star appears, the land under the heavens is shaken into disorder! Here and now in this chaotic world, who will rule in this rise and fall of fortunes?\r\n\r\nHe, insidious and callous, the lord of the Western Chu who pledged to seize the entire world — XiMen QingTian?\r\n\r\nHe, of heroic passion and ten thousand battles, the crown prince of the Northern Yan with a heart connected to the world — BeiTang JiFeng?\r\n\r\nHe, of demonic charm and abounding evil, the monarch of the Southern Zhu who plays with the whole world — NanGong GuYue?\r\n\r\nHe, cultured and refined, the prince of the Eastern Qi who forsook the world — DongFang MingXu?\r\n\r\nHe, sword courageous and qin heartful, the first gentleman of the jianghu who is brave and talented, confident and free — ShangGuan YuChen?\r\n\r\nWhen they met the steady and unperturbed, calm and collected her, the her without desire and demand, everything seemed to change!\r\n\r\nShe let them understand a fact of objective existence that had yet been ignored by the people of the world:\r\n\r\nWho said that women are not equal to men?\r\n\r\nWho said that women rely on the peach blossom face of beauty?\r\n\r\nWho said that women are unable to support this side of the sky?\r\n\r\nShe, Jun BingLing, the reborn ugly-duckling who bore the memories of previous generations. Before the age of ten she wore a veil to cover her ugliness, her fate bizarre and bumpy. After the age of ten she wore a veil to cover her beauty, her life becoming beautiful and dazzling, brimming with legendary color!\r\n\r\nYet, watch how she transforms into a butterfly, roaming the jianghu, galloping on battlefields, stemming the raging tides?\r\n\r\nYet, watch how she does not rely on her appearance, merely using the inherent qualities of daughters to handle a crowd of smart and talented overlords?>"
}