{
	"url": "https://www.novelupdates.com/series/the-first-kindergarten-in-the-universe/",
	"title": "The First Kindergarten in the Universe - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/09/The-First-Kindergarten-in-the-Universe.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Mecha   School Life   Sci-fi   Slice of Life   Supernatural   ",
	"tags": "Abandoned Children   Beautiful Female Lead   Childcare   Cute Children   Cute Protagonist   Cute Story   Female Protagonist   Futuristic Setting   Game Elements   Genetic Modifications   Handsome Male Lead   Heartwarming   Outer Space   Time Skip   Time Travel   ",
	"rating": "(4.0 / 5.0, 46 votes)",
	"author": "长乐思央   ",
	"year": "\n2020",
	"ranking": "#822   #1129   #3703   #3215   #5141   ",
	"reviewcount": "11 Reviews sorted by",
	"description": "Start with a dilapidated kindergarten, upgrades all depend on fluffy!\n\nThree thousand years after waking up, Xu Qiu, who was judged to be an unregistered resident, was exiled to a barren star with nothing.\n\nThe only building on the barren star was a dilapidated kindergarten.\n\nThe cubs in it are all dangerous elements sent from the major planets.\n\nShe only needs to serve in the kindergarten for one year to obtain the status of interstellar citizenship.\n\nAlthough desolate kindergarten has nothing, it doesn’t matter, her system mall is coming along with her.\n\nAs long as the cubs were raised properly, she will get a new batch of cubs.\n\nXu Qiu: No matter what kind of strange cub, as long as it is fluffy, it will be all right!\n\n***\n\nBlack Star built a kindergarten specifically to abandon all kinds of tenacious and dangerous cubs.\n\nIt’s called a kindergarten, but it’s actually a special prison\n\nThere has never been a childcare worker who can live to see the sun on the third day.\n\nLater, people discovered that all the nouveau riche in the universe came from this forgotten kindergarten.\n\nHis Royal Highness the Crown Prince who was a national idol, the Justice of the Blood Presbyterian Church, the general who hears the wind and loses gall.\n\nWhen they mentioned Xu Qiu, no matter how cold their eyes were, it would turn into a warm sun: She is super cute!\n\n***\n\nSystem hint:\n\nWelcome to three thousand years later.\n\nIt has been detected that you have arrived at the barren Star.\n\nThe host has been bound to the kindergarten. Please name your kindergarten.\n\nYou currently have ten cubs in total.\n\nYour cub is hungry, please feed it.\n\nYou have a cub in a blackened state. Please give it a hug.\n\nBuild this barren planet into a dream home, girl!>"
}