{
	"url": "https://www.novelupdates.com/series/im-really-just-an-ordinary-person/",
	"title": "I’m Really Just an Ordinary Person - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/02/Im-Really-Just-an-Ordinary-Person.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Fantasy   Mystery   Psychological   Shounen Ai   Supernatural   ",
	"tags": "Absent Parents   Apathetic Protagonist   Calm Protagonist   Childhood Friends   Childhood Love   Cold Protagonist   Complex Family Relationships   Conditional Power   Couple Growth   Death   Death of Loved Ones   Devoted Love Interests   Game Elements   Godly Powers   Gore   Handsome Male Lead   Late Romance   Lazy Protagonist   Lovers Reunited   Male Yandere   Manly Gay Couple   Mismatched Couple   Modern Day   Modern Knowledge   Monsters   Mystery Solving   Obsessive Love   Past Plays a Big Role   Possessive Characters   Power Couple   Romantic Subplot   Strong to Stronger   Survival Game   Terminal Illness   Time Manipulation   Time Travel   Underestimated Protagonist   Unlucky Protagonist   ",
	"rating": "(4.3 / 5.0, 198 votes)",
	"author": "Lifting The Curtain Lights   帷幕灯火   ",
	"year": "\n2020",
	"ranking": "#2352   #2356   #2212   #860   #1536   ",
	"reviewcount": "55 Reviews sorted by",
	"description": "Shen Si was an ordinary person, living an ordinary life, until one day, the unlimited flow world collapses and all the Survivors returned to reality, setting off a ripple.\n\nHis gentle neighbor, Bai JunYi, was the God of Light in the other world, with the strength of faith that could shake the world’s rules.\n\nHis affectionate ex-boyfriend, Jian Nian, was the God of Killing that even ghosts and gods fear, and the rumors are more frightening than each other.\n\nHis distant cousin, Xi Luo, whom he has never met, was the unlimited flow world dark boss, leading countless ghosts and monsters.\n\nOrdinary person Shen Si: ????\n\nOnlooker crowd: So many big brothers have relations with him, he must be the hidden most powerful person!>"
}