{
	"url": "https://www.novelupdates.com/series/castle-of-black-iron/",
	"title": "Castle of Black Iron - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2017/03/castleofblackiron.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Comedy   Ecchi   Fantasy   Harem   Mature   School Life   Sci-fi   Wuxia   ",
	"tags": "Army Building   Artifacts   Character Growth   Cultivation   Cunning Protagonist   Death of Loved Ones   Demons   Depictions of Cruelty   Determined Protagonist   First-time Interc**rse   F*llatio   Game Elements   Gods   Handsome Male Lead   Hard-Working Protagonist   Harem-seeking Protagonist   Hot-blooded Protagonist   Kingdom Building   Love Interest Falls in Love First   Magic   Magical Space   Male Protagonist   M*sturbation   Monsters   Naive Protagonist   Nationalism   Nobles   Perverted Protagonist   Politics   Polygamy   Poor to Rich   Post-apocalyptic   Pragmatic Protagonist   Pregnancy   Racism   Reverse R*pe   Romantic Subplot   Shameless Protagonist   Time Skip   Wars   Weak to Strong   Zombies   ",
	"rating": "(3.4 / 5.0, 582 votes)",
	"author": "Drunk Tiger   Drunken Tiger   醉虎   ",
	"year": "\n2013",
	"ranking": "#2000   #2000   #180   #7856   #1112   ",
	"reviewcount": "102 Reviews sorted by",
	"description": "After the Catastrophe, every rule in the world was rewritten.\n\nIn the Age of Black Iron, steel, iron, steam engines and fighting force became the crux in which human beings depended on to survive. \n\nA commoner boy by the name Zhang Tie was selected by the gods of fortune and was gifted a small tree which could constantly produce various marvelous fruits. At the same time, Zhang Tie was thrown into the flames of war, a three-hundred-year war between the humans and monsters on the vacant continent. Using crystals to tap into the potentials of the human body, one must cultivate to become stronger. \n\nThe thrilling legends of mysterious clans, secrets of Oriental fantasies, numerous treasures and legacies in the underground world — All in the Castle of Black Iron!>"
}