{
	"url": "https://www.novelupdates.com/series/you-look-like-youre-drawing-me/",
	"title": "You Look Like You’re Drawing Me - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/08/You-Look-Like-Youre-Drawing-Me.jpg",
	"noveltype": "(CN)",
	"genre": "Fantasy   Gender Bender   Mystery   Supernatural   ",
	"tags": "Cross-dressing   Demons   Female Protagonist   Modern Day   Secret Identity   ",
	"rating": "(4.6 / 5.0, 5 votes)",
	"author": "December Snow   腊七小雪   ",
	"year": "\n2017",
	"ranking": "#5262   #2233   #11409   #6801   #12243   ",
	"reviewcount": "1 Review sorted by",
	"description": "This is a story about a demon and a manga. \n\nPreviously a human, Yuan Yuan Yuan had accidentally became a half-demon. As a half-demon, she abided by the rules of the Demons, and wholeheartedly attempted to keep her identity as a half-demon under wraps. \n\nHowever, her peaceful life came to a halt after that one night — she disguised herself and saved a human from a demon. \n\nOne week later, when she was flipping through her favourite manga that she had been following, she suddenly discovered that the plot contained a disconcertingly familiar sight. \n\nA black haired demon… had saved a human from another demon…\n\nWith his extraordinary abilities, strikingly handsome, aristocratic face and enigmatic background, the male demon quickly rose in fame as a 2D fiction character. Yuan Yuan Yuan looked at the latest chapter of the manga, flabberghasted, before she decided to quietly chomp on some chips and choose to selectively close both eyes — none of this is real!\n\nSoon, she realised there was a pattern to this. Ever since that night, there was a very high chance that the things she did would appear in the manga.\n\nIn fact, whatever occured in the manga were things that had happened in reality as well. Therefore, in order to stay alive, Yuan Yuan Yuan had to try her best to hide her identity\n\nAs time passed, those that were interested in such unsolved mysteries came to realise the uncanny similarities between the manga and reality, and the pattern that it appeared to follow. And so, they started searching for these 2D characters in the real world.>"
}