{
	"url": "https://www.novelupdates.com/series/please-have-a-cup-of-green-tea/",
	"title": "Please Have a Cup of Green Tea - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/09/Please-Have-a-Cup-of-Green-Tea.jpg",
	"noveltype": "(CN)",
	"genre": "Adventure   Drama   Supernatural   ",
	"tags": "Academy   Acting   Cold Protagonist   Female Protagonist   Manipulative Characters   Modern Day   Multiple Identities   Multiple Reincarnated Individuals   Ruthless Protagonist   Showbiz   System Administrator   Transmigration   World Hopping   ",
	"rating": "(3.1 / 5.0, 7 votes)",
	"author": "虹桃子   ",
	"year": "\n2021",
	"ranking": "#331   #276   #11221   #4038   #12227   ",
	"reviewcount": "2 Reviews sorted by",
	"description": "As a senior Green Tea, Bi Ming recently became addicted to watching love variety shows and she found a very interesting phenomenon:\n\nAs long as the girls are more popular and people can’t find any real black spots, they like to call them “Green Tea”.\n\nAs long as you don’t like a girl, using “Tea” to describe the other party seems to be able to win back a city and humiliate her maliciously.\n\nNo matter what the character of the girl is; innocent, lively, gentle, kind, or bright and generous, as long as they use the word “Tea” to label the other party, they can scold her to their heart’s content.\n\n“She is also green tea?” Bi Ming watched the sour netizens in the comment area jumping up and down to scold the most beautiful and well behaved girl in the show as ‘Green tea girl,’ and she couldn’t help sneering, “I still have too little knowledge.”\n\nReal green tea can make you cry without crying. As a green tea herself, Bi Ming was well versed in the ‘tea art’. Even if she changed men like she changes clothes, whenever she hooked her finger, someone will lick it. Moreover, she could also render the lemon essences who were jealous of her speechless.\n\nJust when she sighed, a light sphere calling itself the “Green tea system” appeared.\n\n“Congratulations on seeing through the essence and summoning this system.”\n\n“As we all know, ‘green tea’ has become the best way to stigmatize attractive girls in today’s society. ”\n\n“Some girls, who do not meet the standard of green tea at all, are framed as green tea and have no power to fight back, which greatly reduces the reputation of green tea.”\n\n“Ms. Bi Ming, as a senior green tea in this world, would you like to go to other worlds and let some ignorant frogs at the bottom of the well, who have wronged good people, experience the real tea art?”\n\nBi Ming smiled lightly: “It sounds very interesting.”>"
}