{
	"url": "https://www.novelupdates.com/series/the-protagonists-are-murdered-by-me/",
	"title": "The Protagonists Are Murdered by Me - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/03/The-Protagonists-Are-Murdered-by-Me.jpg",
	"noveltype": "(KR)",
	"genre": "Action   Drama   Fantasy   Harem   Mature   Romance   ",
	"tags": "Ability Steal   Alternate World   Antihero Protagonist   Appearance Different from Actual Age   Beautiful Female Lead   Calm Protagonist   Clingy Lover   Cold Protagonist   Comedic Undertone   Demons   Fantasy World   Game Elements   Gate to Another World   Guilds   Gunfighters   Hunters   Interdimensional Travel   Level System   Limited Lifespan   Love Rivals   Magic   Magical Technology   Male Protagonist   Mob Protagonist   Monsters   Multiple Timelines   Obsessive Love   Overpowered Protagonist   Parallel Worlds   Past Plays a Big Role   Popular Love Interests   Returning from Another World   Romantic Subplot   Ruthless Protagonist   Skill Assimilation   Special Abilities   Spirits   Strategist   Strong Love Interests   Sword And Magic   Sword Wielder   Technological Gap   Time Manipulation   Time Paradox   Time Skip   Time Travel   Tragic Past   Transported to Another World   Unconditional Love   Weak to Strong   World Hopping   World Travel   ",
	"rating": "(3.9 / 5.0, 311 votes)",
	"author": "은밀히   ",
	"year": "\n2020",
	"ranking": "#2318   #3076   #646   #773   #1024   ",
	"reviewcount": "66 Reviews sorted by",
	"description": "Regressor, Reincarnator, Possessor, Traveler, or Predestined. I will hunt down the protagonists that exist in the countless worlds and absorb their abilities.\n\nHere lies the protagonist.\n\nThe continent’s hope.\n\nThe hero who will save the world.\n\nThe hero who currently has a hole through his chest!\n\nWith the Spirit of Earth, freed the Dwarfs and gained their trust.\n\nPurified the contaminated Forest of Spirits and became the Fairies’ benefactor.\n\nResealed the Ancient Stone statues found in one of the ruins.\n\nExterminated the giant sea serpent that emerged from the sea.\n\nDefeated the 47th Demon Lord of the underworld…\n\n“Aside from assaults and murders there were other death related incidents as well as vandalism, arson, and etc…”\n\n“S-spare me…”\n\nPsh!\n\nThat was the protagonist.\n\nBut now, he has died by my hands.>"
}