{
	"url": "https://www.novelupdates.com/series/am-i-a-saint-no-im-the-villainess/",
	"title": "Am I a Saint? No, I’m the Villainess! - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/03/Am-I-a-Saint-No-Im-the-Villainess_1647498130.jpg",
	"noveltype": "(JP)",
	"genre": "Comedy   Drama   Fantasy   Romance   Shoujo   ",
	"tags": "Adapted to Manga   Brother Complex   European Ambience   Fantasy World   Female Protagonist   Otome Game   Reincarnated in a Game World   Royalty   Saints   Villainess Noble Girls   ",
	"rating": "(4.0 / 5.0, 7 votes)",
	"author": "Aiue Iota   藍上イオタ   ",
	"year": "\n2020",
	"ranking": "#6970   #6364   #11810   #8981   #9419   ",
	"reviewcount": "No Reviews",
	"description": "Iris woke up from a nightmare and realized that she had been reborn as a villainess in an otome game that had only merry but bad endings.\n\nMoreover, the game was devilish in which if the heroine’s love was fulfilled, she became a baddie, and if not, the heroine was stabbed to death by the villainess without omission.\n\nIf this situation continued, her brother, the person she would capture, would grow up to become a domination training bondage knight, and he himself would meet his doom as a rival of the heroine, the saint. Moreover, in the worst-case scenario, the true ending, could result in the burning of the royal city.\n\nI’m the villainess! No matter how much the heroine insists on being happy, I will prevent the Meriva ending!\n\nIris was determined. She had to prevent the heroine’s happy ending (aka Meriva) as a villainess, while fighting her own death flags.\n\nHoping for her brother to grow up happy, Iris decided to interfere with the heroine’s love flag (planned) with the psychopathic mage in the royal city which is on fire, while avoiding her engagement to the future yandere imprisoned prince. However, because of these actions, he was unwillingly fêted as a rival of the saint.\n\nHowever, becoming the saint would lead to an engagement with the prince. That was Iris’s hassle. She could never become a saint.\n\nSo, I’m the villainess! I’m not the saint!>"
}