{
	"url": "https://www.novelupdates.com/series/the-prohibited-isekai-life-of-a-certain-transmigrating-brother-and-sister/",
	"title": "The Prohibited Isekai Life of a Certain Transmigrating Brother and Sister - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/05/toaru.jpg",
	"noveltype": "(JP)",
	"genre": "Fantasy   Josei   Mature   Psychological   Romance   Smut   Tragedy   ",
	"tags": "Beautiful Female Lead   Brother Complex   C*nnilingus   Confinement   Doting Love Interests   Fantasy World   Female Protagonist   First-time Interc**rse   F*llatio   Handsome Male Lead   Incest   Love Interest Falls in Love First   Magical Technology   Male Yandere   Manipulative Characters   Master-Servant Relationship   Multiple Reincarnated Individuals   Nobles   Obsessive Love   Overprotective Siblings   Persistent Love Interests   Possessive Characters   R-18   Reincarnated in Another World   R*pe   Siblings   Sister Complex   Twins   Yandere   ",
	"rating": "(3.6 / 5.0, 94 votes)",
	"author": "Nagi Yuuki   凪 夕貴   ",
	"year": "\n2018",
	"ranking": "#2000   #2000   #3423   #2482   #2834   ",
	"reviewcount": "13 Reviews",
	"description": "One day, my twin brother confessed to me.  “I’ve liked you since a long time ago. I want you to break up with your boyfriend and choose me.” \n\nHowever, right after the unexpected confession, we were both caught up in an accident and our short lives came to an end… or that was how it was supposed to be.  For some reason, we were reincarnated in different world as twins.  \n\nThe world we reincarnated in was a world with Magical Supremacy. People with magical power dominated people without magic. \n\nAs twins, we were given the names of Ceres and Licht, and we grew up quickly. \n\nHowever, I- who was born without magical power, was about to be sent to an isolation facility where non-magical people were held.  \n\nThere was only one way around it.  To make a s*ave contract with someone who possessed high magical power.  At that time, Licht, my brother who was an elite magician, made a proposition to help me.  “If you don’t want to be sent to the facility, form a s*ave contract with me.”  \n\nJust like that, our relationship as twins, which had turned to master- servant relationship, was the beginning of this twisted story.>"
}