{
	"url": "https://www.novelupdates.com/series/red-packet-server/",
	"title": "Red Packet Server - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2018/06/Red-Packet-Server.png",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Harem   Tragedy   Xuanhuan   ",
	"tags": "Adopted Children   Arrogant Characters   Beautiful Female Lead   Betrayal   Celebrities   Character Growth   Chat Rooms   Cheats   Cooking   Cultivation   Demons   Early Romance   Eye Powers   Famous Protagonist   Fast Cultivation   Fast Learner   Firearms   Game Elements   Ghosts   Goddesses   Gods   Handsome Male Lead   Hell   Immortals   Jack of All Trades   Long Separations   Love Interest Falls in Love First   Lucky Protagonist   Male Protagonist   Medical Knowledge   Modern Day   Modern Knowledge   Multiple Realms   Nationalism   Older Love Interests   Past Plays a Big Role   Perverted Protagonist   Polygamy   Poor to Rich   Popular Love Interests   Racism   R*pe   Ruthless Protagonist   Singers   Slow Growth at Start   Special Abilities   Tsundere   Underestimated Protagonist   Weak to Strong   ",
	"rating": "(3.1 / 5.0, 574 votes)",
	"author": "Zhi Xin   知新   ",
	"year": "\n2016",
	"ranking": "#6970   #2000   #237   #8980   #905   ",
	"reviewcount": "105 Reviews sorted by",
	"description": "Ye Zichen was just a normal university student. Or so he thought.\r\n\r\nUpon a 'chanced' invitation into a deities' chat group filled with deities from the Heavenly Court, Ye Zichen found out that there was much more to the world than what meets the eye. The Heavenly Court, the Underworld, and immortal cultivators which only exists in Chinese mythology... They are all real.\r\n\r\nAs Ye Zichen becomes more and more involved in that world filled with unworldly beings, the wheels of destiny began to turn. What sort of destiny awaits him? Will he be able to prevent the tragedies that are to unfold? Will he be able to forge a new path; or will he succumb to wills of the greater beings that guide his life?>"
}