{
	"url": "https://www.novelupdates.com/series/100000-hour-professional-stand-in/",
	"title": "100,000/Hour Professional Stand-in - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/02/Professional-Standin-With-an-Hourly-Salary-of.jpg",
	"noveltype": "(CN)",
	"genre": "Drama   Fantasy   Psychological   ",
	"tags": "Acting   Adapted to Manhua   Beautiful Female Lead   Betrayal   Business Management   Calm Protagonist   Celebrities   Charming Protagonist   Cold Protagonist   Complex Family Relationships   Confident Protagonist   Cruel Characters   Cunning Protagonist   Devoted Love Interests   Female Protagonist   Genius Protagonist   Handsome Male Lead   Late Romance   Love Interest Falls in Love First   Manipulative Characters   Modern Day   Money Grubber   Past Plays a Big Role   Proactive Protagonist   Psychopaths   Revenge   Reverse Harem   Romantic Subplot   Ruthless Protagonist   Shameless Protagonist   Transmigration   Transported to Another World   Twins   Wealthy Characters   Younger Love Interests   ",
	"rating": "(4.4 / 5.0, 400 votes)",
	"author": "Yuan Yao   渊爻   ",
	"year": "\n2020",
	"ranking": "#803   #124   #565   #303   #1342   ",
	"reviewcount": "119 Reviews sorted by",
	"description": "Ji Fanyin realized the moment she transmigrated over that she was a stand-in, a substitute for her younger twin sister, Ji Xinxin.\n\n“Sure, I can be her stand-in. Here is my list of prices. Take a look at it first, and make sure to reserve a slot in advance. I won’t accept any last-minute calls, and do take note that it’ll only be a platonic relationship. Thank you for your cooperation,” she said.\n\nIn a western restaurant, a rich young master looked at her with eyes filled with affection as he said, “Xinxin, I would like to ask you out for a movie tomorrow night…”\n\nAn alarm suddenly went off.\n\nJi Fanyin took a glance at her phone before reining in her business smile, saying, “Time’s up. I need to rush for my next appointment. Make sure to foot the tab, and farewell.”\n\nThe rich young master’s smile froze up. “I’ll reserve four hours for tomorrow’s movie.”\n\nIn the middle of the night, a drunk, tyrannical young master dialed her number and whined, “Big sis, when will you come over to meet me?”\n\n“In order to ensure the quality of service, this call will be recorded. It’s four in the morning right now, and my services will be ten times the usual price. Are you certain you want to proceed?” asked Ji Fanyin.\n\n“… Hurry up and start acting!”\n\nJi Fanyin’s phone suddenly rang in the midst of a date with a domineering CEO at Tokyo’s tower. With a smile on her lips, she rejected the call and said, “Sorry, it’s another customer.”\n\n“… I’ll pay you ten times the price. Switch off your phone.”\n\n…\n\nBy the time Ji Xinxin finally returned back to the country, Ji Fanyin successfully retired from the scenes with the massive fortune she had amassed.\n\nHeh, bad women will never get hurt!>"
}