{
	"url": "https://www.novelupdates.com/series/beloved-at-the-door/",
	"title": "Beloved at the Door - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/10/Beloved-at-the-Door.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Martial Arts   Romance   Shoujo   ",
	"tags": "Appearance Changes   Bickering Couple   Boss-Subordinate Relationship   Devoted Love Interests   Doting Love Interests   Female Protagonist   Handsome Male Lead   Investigations   Jealousy   Love Interest Falls in Love First   Persistent Love Interests   Secret Identity   ",
	"rating": "(4.3 / 5.0, 54 votes)",
	"author": "Mo Yan   莫顏   ",
	"year": "\nN/A",
	"ranking": "#2000   #2000   #6154   #5194   #6559   ",
	"reviewcount": "5 Reviews sorted by",
	"description": "*The Four Great Female Constables – Book 4/4\n\n\nTo work as a constable, it was inevitable for enemies to take revenge, so Shangguan Yan never gave others the opportunity to seek revenge.\n\n“Miss looks a bit familiar.”  The cold and handsome Gongzi stared at her.\n\n“I never venture out the main door nor cross over the threshold of the side door.  Gongzi must be mistaken.”  She replied shyly.\n\nWhen both of them met again the second time, the cold and handsome Gongzi stared at her.\n\n“For someone who doesn’t venture out of the main door nor cross over the threshold of the side door, how come you have started to do business?”\n\n“My family is in difficulties and there are elders and young in the family.  It’s beyond my control.”\n\nThe third time they met, the cold and handsome Gongzi stared at her.\n\n“Miss is decked in expensive finery from head to toe.  Your family doesn’t seem to be in difficulties.”\n\n“Don’t just look at my glamorous appearance, in fact, I am not favored in my family.”  She said tearfully with grievance.\n\nWhen the criminal case was brought to court, it was only then she saw the Lord Imperial Commissioner sitting on his high seat and she finally understood what it meant by ‘being crushed to death by government officials’.\n\n“Constable Shangguan, what else do you have to say?”  The cold and handsome Gongzi stared at her.\n\nShe was dumbfounded and screamed in her heart.\n\nThis fellow is indeed here to seek revenge!>"
}