{
	"url": "https://www.novelupdates.com/series/genjitsushugi-yuusha-no-oukoku-saikenki/",
	"title": "Genjitsushugi Yuusha no Oukoku Saikenki - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/07/Genjitsushugi-Yuusha-no-Oukoku-Saikenki.jpeg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Drama   Fantasy   Harem   Romance   Seinen   ",
	"tags": "Adapted to Anime   Adapted to Manga   Aristocracy   Army Building   Arranged Marriage   Average-looking Protagonist   Beastkin   Beautiful Female Lead   Calm Protagonist   Charismatic Protagonist   Clever Protagonist   Comedic Undertone   Cooking   Cunning Protagonist   Demi-Humans   Demons   Dolls/Puppets   Domestic Affairs   Dragons   Elves   Famous Protagonist   Fantasy World   First-time Interc**rse   Hard-Working Protagonist   Heroes   Human-Nonhuman Relationship   Industrialization   Kingdom Building   Kingdoms   Leadership   Male Protagonist   Management   Marriage   Mercenaries   Modern Knowledge   Monsters   Nobles   Politics   Polygamy   Power Struggle   Pregnancy   Puppeteers   Romantic Subplot   Royalty   Schemes And Conspiracies   S*aves   Slow Romance   Strategic Battles   Summoned Hero   Sword And Magic   Transported to Another World   Wars   Weak Protagonist   ",
	"rating": "(4.3 / 5.0, 1286 votes)",
	"author": "Dojyomaru   どぜう丸   ",
	"year": "\n2014",
	"ranking": "#3314   #251   #243   #651   #23   ",
	"reviewcount": "147 Reviews sorted by",
	"description": "“O, Hero!” With that cliched line, Kazuya Souma found himself summoned to another world and his adventure–-did not begin. After he presents his plan to strengthen the country economically and militarily, the king cedes the throne to him and Souma finds himself saddled with ruling the nation! What’s more, he’s betrothed to the king’s daughter now…?! In order to get the country back on its feet, Souma calls the wise, the talented, and the gifted to his side. Five people gather before the newly crowned Souma. Just what are the many talents and abilities they possess…?! What path will his outlook as a realist take Souma and the people of his country down? A revolutionary transferred-to-another-world administrative fantasy series starts here!>"
}