{
	"url": "https://www.novelupdates.com/series/release-that-witch/",
	"title": "Release that Witch - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2017/07/Release-that-Witch.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Comedy   Fantasy   Harem   Mature   Mystery   Seinen   Slice of Life   Supernatural   ",
	"tags": "Adapted to Manhua   Army   Army Building   Beautiful Female Lead   Calm Protagonist   Caring Protagonist   Charismatic Protagonist   Clever Protagonist   Crafting   Demons   Depictions of Cruelty   Discrimination   Early Romance   Economics   Enemies Become Allies   Engineer   Fantasy World   Firearms   Hard-Working Protagonist   Industrialization   Kind Love Interests   Kingdom Building   Kingdoms   Knights   Leadership   Lost Civilizations   Love Interest Falls in Love First   Loyal Subordinates   Magic   Male Protagonist   Management   Manipulative Characters   Marriage   Mature Protagonist   Medieval   Modern Knowledge   Monsters   Multiple POV   Nobles   Past Plays a Big Role   Politics   Pragmatic Protagonist   Religions   Righteous Protagonist   Romantic Subplot   Royalty   Schemes And Conspiracies   Stoic Characters   Strategic Battles   Strong Love Interests   Technological Gap   Transmigration   Wars   Weak Protagonist   Witches   ",
	"rating": "(4.5 / 5.0, 2886 votes)",
	"author": "Er Mu   二目   ",
	"year": "\n2016",
	"ranking": "#4265   #960   #6   #896   #10   ",
	"reviewcount": "346 Reviews",
	"description": "Chen Yan travels between worlds, ending up becoming an honorable prince in a medieval fantasy world. Yet this world was not quite as simple as he thought. Witches with magical powers abound, and fearsome wars between churches and kingdoms rage throughout the land.\n\nRoland, a prince regarded as hopeless by his own father and assigned to the worst fief, spends his time developing a poor and backward town into a strong and modern city, while fighting against his siblings for the throne and absolute control over the kingdom. Join Roland as he befriends and allies with witches and, through fighting and even farming, pushes back invaders coming from the realm of evil.>"
}