{
	"url": "https://www.novelupdates.com/series/everyday-i-get-up-to-see-the-villain-stealing-the-show/",
	"title": "Everyday I Get Up To See The Villain Stealing The Show - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2018/12/stealshow2.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Fantasy   Romance   Shounen Ai   Wuxia   ",
	"tags": "Animal Characteristics   Character Growth   Cultivation   Demonic Cultivation Technique   Destiny   Dishonest Protagonist   Evil Organizations   Gods   Handsome Male Lead   Hiding True Identity   Immortals   Love Interest Falls in Love First   Loyal Subordinates   Misunderstandings   Mystery Solving   Narcissistic Protagonist   Overpowered Protagonist   Personality Changes   Playful Protagonist   Power Couple   Quirky Characters   Schemes And Conspiracies   Second Chance   Secrets   Sect Development   Seme Protagonist   Slow Romance   Sudden Strength Gain   ",
	"rating": "(4.1 / 5.0, 189 votes)",
	"author": "Zhong Xiaosheng   钟晓生   ",
	"year": "\n2014",
	"ranking": "#5262   #6316   #1778   #2659   #1387   ",
	"reviewcount": "44 Reviews sorted by",
	"description": "The wrong way to act as a villain no.1: Get rid of the protagonist while he still hasn’t become powerful.\n\nThe wrong way to act as a villain no.2: Take the limelight from the protagonist at the key moment.\n\nThe wrong way to act as a villain no.3: Make the protagonist fall in love with you, thus making him incapable of completing the final step – eliminating the major villain.\n\nHan Changsheng, Head of the Demonic Cult, is the major villain who’s employed all three incorrect methods.\n\n—————\n\nAs the leader of the first Demonic Cult in the underground world of martial arts and cultivation, Tianning Cult, Han Changsheng carried on the long-standing tradition of an unstable mind and a refusal to seek any treatment.\n\nOriginally, his life should have passed by quickly and simply, but one day he kicked a descended Immortal Lord off a cliff. In order to make up for this mistake, he must aid the Immortal Lord in ascending back to his position… but why does this mistake keep growing? Hey, Lao zi doesn’t need you as a younger brother, you should look for An Yuan! Don’t chase after Lao zi, you’re destined to be An Yuan’s wife! Don’t worship Lao zi as a martial arts lord, lao zi is the genuine leader of the Demonic Cult! Hey, Hey Lao zi is obviously the major villain! What the hell are you doing?!>"
}