{
	"url": "https://www.novelupdates.com/series/her-430-million-years/",
	"title": "Her 430 Million Years - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/06/43Omillionyears.jpg",
	"noveltype": "(CN)",
	"genre": "Fantasy   Horror   Mystery   Romance   School Life   Shoujo   Supernatural   Tragedy   ",
	"tags": "Academy   Female Protagonist   Handsome Male Lead   Hidden Abilities   Hiding True Identity   Mysterious Past   Power Couple   Secret Identity   ",
	"rating": "(3.2 / 5.0, 10 votes)",
	"author": "君子以泽   ",
	"year": "\n2020",
	"ranking": "#2000   #2000   #10656   #9891   #10928   ",
	"reviewcount": "2 Reviews sorted by",
	"description": "On Fan Li’s 18th birthday, her father told her: “actually your mom has genes which may not be that of an ‘ordinary’ person’s.”\n\nUpon waking, Li-zi discovered she has transformed into a mermaid and is even attending a top university in the deep ocean.\n\nShe also met a group of perceptive boys who were a delight to the eyes.\n\nHowever, its leader is a mixed-race carnivorous mer-shark with racial discrimination.\n\nShe thinks, how is an irascible shark who loses control at the slightest whiff of blood qualified to discriminate against a princess who hails from the civilized world like me?\n\nHowever, a mermaid’s innate inferiority can never compete with a shark.\n\nThe mer-shark’s little bro says to her: “once you make him your child’s father, he will no longer bully you.”\n\nFan Li: “You want me to marry a fish? You are f**king kidding.”\n\n“You don’t need to marry. Only the Haiyangzu marries, marriage is never a part of us shark people’s culture. When we enter the reproduction cycle, we will start to breed exponentially. We are the species with genes at the top of the food chain. If you are lucky enough to be his female fish, your weak genes will be improved, and he can give you a group of shark babies who dominate the ocean.”\n\n“…Thank you for sympthazing with my inferior genes but I want to get married.” To a human.\n\nOnly after she was traumatized by the ethics of these sharks, did she find out her mom actually isn’t dead.\n\nAnd just like these sea creatures, she too has no concept of marriage.\n\nFurthermore, her mom’s real identity is….>"
}