{
	"url": "https://www.novelupdates.com/series/according-to-god-death-is-salvation-and-killing-is-a-good-deed-the-source-is-me/",
	"title": "According to God, Death Is Salvation and Killing Is a Good Deed. The Source Is Me. - Novel Updates",
	"image": "https://www.novelupdates.com/img/noimagefound.jpg",
	"noveltype": "(JP)",
	"genre": "Fantasy   Mature   Psychological   Seinen   Supernatural   Tragedy   ",
	"tags": "Antihero Protagonist   Aristocracy   Cannibalism   Cold Protagonist   Corruption   Cruel Characters   Dark   Depictions of Cruelty   Evil Protagonist   Fantasy World   Language Barrier   Magic   Male Protagonist   Multiple POV   Politics   R-15   Religions   Ruthless Protagonist   Schemes And Conspiracies   Secretive Protagonist   S*aves   Special Abilities   Strategic Battles   Transported to Another World   Wars   ",
	"rating": "(3.1 / 5.0, 7 votes)",
	"author": "無道   ",
	"year": "\n2018",
	"ranking": "#2686   #2092   #11980   #8982   #12617   ",
	"reviewcount": "No Reviews",
	"description": "―One day, a man was transported to a different world to a nation that had a firm belief in one religion, and that nation was changed…\n\nOne day, Kaneki Ryo was transported to another world’s religious nation, the St. Arnold Empire, and became a citizen of that country.\n\nOn the battlefield, he wielded his baton as a commander, and on the front lines, he massacred all the enemy forces with his mysterious power.\n\nWhen he took time off, he went around the churches of each city, ministering the word of God, which people believed in, and saving the distressed with his adroit eloquence and winning the hearts of many people.\n\nHe saved people and was endeared by all, but the truth escaped the people. In his first world, Earth, he was feared as one of the worst criminals in history and was on death row.\n\nAnd in the second world, he was a dangerous man who taught students at a magic school, but behind the scenes abducted, imprisoned, and tortured many of his students!\n\nWhat will this overwhelmingly “evil” man encounter in the third world, the country he now resided in, and what will he bring forth? The new series of “Death Row” has begun.>"
}