{
	"url": "https://www.novelupdates.com/series/let-me-game-in-peace/",
	"title": "Let Me Game in Peace - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/09/Let-Me-Game-in-Peace.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Mystery   School Life   Sci-fi   Xuanhuan   ",
	"tags": "Absent Parents   Academy   Adapted to Manhua   Anti-social Protagonist   Apathetic Protagonist   Army   Beast Companions   Beasts   Calm Protagonist   Cautious Protagonist   Cheats   Comedic Undertone   Cultivation   Dense Protagonist   Depictions of Cruelty   Dungeons   Fantasy Creatures   Fast Cultivation   Game Elements   Gamers   Genius Protagonist   Hard-Working Protagonist   Hidden Abilities   Lucky Protagonist   Male Protagonist   Misunderstandings   Modern Day   Money Grubber   Mutated Creatures   Poor Protagonist   Post-apocalyptic   Quirky Characters   Schemes And Conspiracies   Special Abilities   System Administrator   Time Skip   Underestimated Protagonist   Weak to Strong   Wealthy Characters   ",
	"rating": "(3.7 / 5.0, 125 votes)",
	"author": "Twelve-Winged Dark Seraphim   十二翼黑暗炽天使   ",
	"year": "\n2019",
	"ranking": "#6970   #4873   #3424   #4224   #5246   ",
	"reviewcount": "46 Reviews sorted by",
	"description": "1 drop of blood = 1-Up\n\n\nOther people game overnight, I game overnight and bleed.\n\n\nEver since the dimensional storms descended upon Earth, numerous dimensional zones have appeared, bringing with them all kinds of dimensional creatures—Immortals, Buddhas, Devils, Angels, Elves, etc.\n\n\nYet, all these strange dimensional zones can turn into dungeon instances on my phone. Other people risk their lives adventuring, I spend all my time gaming.\n\n\nMonsters drop dimensional crystals that boost stats, imbue new skills, and join me as Companion Beasts. These Companion Beasts fight alongside me or alone, augmenting me with their skills and strength. Rare monsters in real life? I’ll just restart the game with a drop of blood to grind it.\n\n\nI really need a blood transfusion.>"
}