{
	"url": "https://www.novelupdates.com/series/godly-stay-home-dad/",
	"title": "Godly Stay-Home Dad - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2018/03/stay-home-dad.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Comedy   Drama   Fantasy   Martial Arts   Romance   Sci-fi   Slice of Life   Supernatural   Xuanhuan   ",
	"tags": "Arrogant Characters   Beautiful Female Lead   Caring Protagonist   Character Growth   Childcare   Clan Building   Cooking   Cultivation   Cute Children   Devoted Love Interests   Doting Parents   Familial Love   Farming   Handsome Male Lead   Male Protagonist   Marriage   Modern Day   Multiple Realms   Music   Overpowered Protagonist   Poor to Rich   Protagonist Strong from the Start   Returning from Another World   Ruthless Protagonist   Second Chance   Showbiz   Store Owner   Time Skip   Wealthy Characters   World Travel   Younger Sisters   ",
	"rating": "(4.0 / 5.0, 275 votes)",
	"author": "Shan Wang Zhang   单王张   ",
	"year": "\n2017",
	"ranking": "#3567   #2000   #698   #9323   #1931   ",
	"reviewcount": "52 Reviews sorted by",
	"description": "Hero Zhang Han was frustrated in life originally, but he stepped into the Cultivation World by a stroke of luck. Possessing divine natural gifts, he ascended into the disaster-crossing period step by step. He had imagined his life would not have any hardships anymore, but unfortunately incurred the god thunder since he violated the fate. After he woke up, he was surprised to find that he was reborn, going back a few years ago. He found that the world was different from what it used to be after his rebirth and he had a lovely daughter.\n\nZhang Han’s fate thus underwent a huge transformation. In the fast-paced urban life, he opened up a place for his daughter to have fun. Because of his daughter’s enthusiasm for food, he opened a restaurant, which attracted countless diners. His business was booming and money did roll in. In his spare time, he also wrote songs to earn extra income. At the same time, he performed a sweet love story with his daughter’s mother…\n\nAfter his rebirth, he became a godly stay-home dad in the accumulation of experience. “Dote on my daughter and love my daughter” became his life creed. Although a few nasty guys occasionally appeared in his life, they were all beaten off by virtue of his mightiness.\n\nLet’s take a look at how this godly stay-home dad lived in the city and how Zhang Han led his happy life.>"
}