{
	"url": "https://www.novelupdates.com/series/the-hated-wife-wants-to-divorce-the-hero-general-i-dont-believe-in-suddenly-returning-and-become-doting/",
	"title": "The Hated Wife Wants to Divorce the Hero General! I Don’t Believe in Suddenly Returning and Become Doting - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/12/The-Hated-Wife-Wants-to-Divorce-the-Hero-General-I-Dont-Believe-in-Suddenly-Returning-and-Become-Doting.jpg",
	"noveltype": "(JP)",
	"genre": "Comedy   Romance   ",
	"tags": "Arranged Marriage   European Ambience   Female Protagonist   Handsome Male Lead   Misunderstandings   Nobles   ",
	"rating": "(4.2 / 5.0, 21 votes)",
	"author": "Hiiragi Ichiha   柊 一葉   ",
	"year": "\n2020",
	"ranking": "#2000   #2000   #8376   #4879   #6480   ",
	"reviewcount": "1 Review sorted by",
	"description": "Soaris is a 22-year-old countess who works at the castle.\n\nShe got married 10 years ago.\n\nAnyway, it was a contract marriage between a famous count family that needed money and a Viscount family who wanted “honor”.\n\nAt the time of marriage, her husband Alendio was a 15-year-old son of Earls, and Soaris, a 12-year-old daughter of Viscounts.\n\n“Why you?”\n\n“… Yes, I think so too”\n\nThe conversation did not continue, and I had a long time to drink tea silently.\n\nWithout knowing each other, only three months later Alendio set out as a knight on the battlefield.\n\n“He was an heir, so was exempt from military service as long as he pays, but he hated marrying me that much…?”\n\nAnd for ten years, formal letters only came every six months, and they still don’t know anything about each other.\n\nSoaris is now 22 years old, she started to work in the castle due to the downfall of his parents’ family.\n\nHer husband, Alendio, played an active role as a general and made numerous military achievements during the war.\n\nAnd there are rumors that they will win the long-standing war and will return to the Arc de Triomphe.\n\nSoaris, who suddenly remembers being married, relieves, “I can divorce.”\n\nFor the past ten years, she’s been working hard and become firmly trusted as the princess’s safe keeper at the castle.\n\nI thought “it’s okay, soon, we’ll be finally free.”\n\n“He, who has become a Hero of the War, should have a better match.”\n\nBut when he appeared, he met Soaris and said, “Let’s have our wedding celebrations soon.”\n\nWithout having time to hand over the divorce petition she was holding, he took her to his huge mansion that was part of the reward obtained, and an unexpected doting life began.\n\n“You are as cute as 10 years ago”\n\n“Sir, did you lose your eyes on the battle?”\n\nIt is a story of a man who became a good husband suddenly and his wife who wants to divorce somehow.>"
}