{
	"url": "https://www.novelupdates.com/series/when-i-fell-madly-in-love-with-the-heroine-the-world-changed-%ef%bd%9ethe-strongest-gamer-in-the-world-becomes-the-strongest-knight-in-the-game-world/",
	"title": "When I Fell Madly in Love With the Heroine, the World Changed. ～the Strongest Gamer in the World Becomes the Strongest Knight in the Game World - Novel Updates",
	"image": "https://www.novelupdates.com/img/noimagefound.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Comedy   Fantasy   Harem   Mature   Mecha   Romance   ",
	"tags": "Average-looking Protagonist   Beautiful Female Lead   Discrimination   Earth Invasion   Gamers   Harem-seeking Protagonist   Hikikomori   Love Rivals   Love Triangles   Male Protagonist   Obsessive Love   Otaku   Protagonist Falls in Love First   Protagonist Strong from the Start   Reincarnated in a Game World   Royalty   S*aves   Survival Game   Transmigration   Transported into a Game World   Wars   ",
	"rating": "(4.0 / 5.0, 63 votes)",
	"author": "かずーた   ",
	"year": "\n2022",
	"ranking": "#4265   #4230   #4066   #9696   #5718   ",
	"reviewcount": "4 Reviews sorted by",
	"description": "Q: Can’t I fall in love with the heroine of the game… I feel like I spent more time in that world than in the real world.\n\nA boy, abandoned by his parents, became absorbed in the world of video games.\n\n“Knight of The Giant” is a globally popular title.\n\nSo much so that he became the world champion of the VR robot fighting game. He devoted his entire youth to the game, even falling madly in love with the two heroines of the game.\n\nBut only one of them could be saved.\n\n“I lost one of them in this shitty scenario.\n\nI want to save them both.\n\nEven if it’s a predetermined scenario.”\n\nIt was this obsession that made Kenya complete a quest that had been deemed impossible. With the manipulation skills he devoted his youth to, Kenya creates a new route for the heroine who has fallen madly in love with him.\n\nSuddenly, a congratulatory message appeared on the screen.\n\n“Congratulations on a fantastic victory!\n\nNEW route has been released, would you like to try it?”\n\nYes\n\nNo.\n\nAnd so the story began. \n\nThe story of a socially awkward high school student who is just good at games. A boy who could have been a hero if the world had been different.\n\n“Good Luck!”\n\nWith that message, the vision went dark.\n\n.\n\n.\n\nWhen I woke up, I was standing in the world of “Knight of the Giant” game. The flag flying over the school where the game takes place. But they were not flying the Japanese flag.\n\nAt that moment, Kenya remembered the setting of the game.\n\n“…Right, Japan in this world. It is being invaded.”>"
}