{
	"url": "https://www.novelupdates.com/series/justice-across-the-dimensions/",
	"title": "Justice Across The Dimensions - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/12/Justice-Across-The-Dimensions.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Fantasy   Martial Arts   Mystery   Sci-fi   Supernatural   ",
	"tags": "Ancient China   Apathetic Protagonist   Clever Protagonist   Detectives   Handsome Male Lead   Interdimensional Travel   Jack of All Trades   Male Protagonist   Modern Day   Police   Previous Life Talent   Proactive Protagonist   Protagonist Strong from the Start   Revenge   Righteous Protagonist   Seeing Things Other Humans Can't   Special Abilities   System Administrator   Technological Gap   Transmigration   Transported to Another World   World Hopping   ",
	"rating": "(3.9 / 5.0, 39 votes)",
	"author": "梦廊雨   ",
	"year": "\n2019",
	"ranking": "#2000   #2000   #5994   #8226   #7681   ",
	"reviewcount": "8 Reviews sorted by",
	"description": "Once a famous police detective, Qi Wang lost his life during the course of his duty, but instead of meeting his ultimate end, he became linked to a strange system that detects injustice and evil across different dimensions. From then on, it became a string of adventures for Qi Wang across the diverse dimensions in existence to right all wrongs in the philosophies, worldviews, and value systems of societies everywhere beyond the conventional mores of Space and Time.\n\nA Game of Prestige -\n\nUngrateful Ingrates: We love each other truly, Father. But since you object to us being together, how about you make way for your son and heir?\n\nQi Wang: Well, of course. But the company carries a debt of hundreds of millions. So, good luck.\n\nA Taste of Chaos -\n\nProtégé: The position as Chieftain of the Wulin is mine by right, Teacher. You’re old now, so please give way.\n\nQi Wang: Well, of course. I hear the forces of Evil will be attacking tomorrow. I wish you good fortune in the wars to come.\n\nDoppelganger in the Stars - \n\nSnobbish Daughter and her Doppelganger: We are the distinguished offsprings of the Marshal. Go away, you useless wretch.\n\nQi Wang: Well, of course. I heard the Race of Arthropods want a marriage-alliance with you. I wish you a happy marriage then.\n\nGive me any scum and I’ll mete out retribution upon them. I am Qi Wang, the harbinger of Justice at your service, and this is my specialty.>"
}