{
	"url": "https://www.novelupdates.com/series/reborn-as-the-ex-wife-of-the-paranoid-male-lead/",
	"title": "Reborn As the Ex-wife of the Paranoid Male Lead - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/01/Reborn-As-the-Exwife-of-the-Paranoid-Male-Lead.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Romance   School Life   Slice of Life   Tragedy   Yaoi   ",
	"tags": "Bullying   Caring Protagonist   Child Abuse   Childhood Love   Cold Love Interests   Complex Family Relationships   Cute Protagonist   Dead Protagonist   Death   Different Social Status   Familial Love   Fat to Fit   Handsome Male Lead   Helpful Protagonist   Male Yandere   Misunderstandings   Mob Protagonist   Modern Day   Multiple POV   Past Plays a Big Role   Past Trauma   Popular Love Interests   Possessive Characters   Proactive Protagonist   Righteous Protagonist   Slow Romance   Stoic Characters   Strong Love Interests   Time Skip   Tragic Past   Virtual Reality   Wealthy Characters   ",
	"rating": "(4.0 / 5.0, 155 votes)",
	"author": "Zhi Tang   稚棠   ",
	"year": "\n2020",
	"ranking": "#172   #323   #2458   #855   #2994   ",
	"reviewcount": "58 Reviews sorted by",
	"description": "Jian Shiwu was reborn. In the previous life, relying on his family background, he forced the male protagonist Shen Cheng to get engaged to him.\n\nOnly after his death did he realize that Shen Cheng was terrifying.\n\nThe man’s power was overwhelming, and he retaliates against everyone by means of brutality, and single-handedly built a business empire.\n\nThis taciturn man in everyone’s eyes has never been a soft persimmon, but a dormantly waiting wolf.\n\nAfter the rebirth, Jian Shiwu decided to stay away from Shen Cheng to keep his peace\n\nAt the beginning:\n\nParents: “I heard that you like Shen Cheng, do you want to get engaged to him?”\n\nJian Shiwu: “I’m afraid you want me to die!”\n\nFriends: “I heard you still like Shen Cheng?”\n\nJian Shiwu was shocked: “It’s fake, don’t believe in rumors, don’t spread rumors!!”>"
}