{
	"url": "https://www.novelupdates.com/series/sunset-boulevard/",
	"title": "Sunset Boulevard - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/11/Sunset-Boulevard.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adult   Mature   Mystery   Romance   Slice of Life   Smut   Yaoi   ",
	"tags": "Adapted to Drama CD   Adapted to Manhua   Calm Protagonist   Caring Protagonist   Cautious Protagonist   Devoted Love Interests   Doting Love Interests   Dreams   Engagement   Fated Lovers   First Love   First-time Interc**rse   F*llatio   Handsome Male Lead   Inferiority Complex   Kind Love Interests   Marriage   Military   Misunderstandings   Mpreg   Multiple POV   Mysterious Past   Mystery Solving   Obsessive Love   Omegaverse   Politics   Quiet Characters   Seme Protagonist   Strong Love Interests   Unconditional Love   Unrequited Love   ",
	"rating": "(4.4 / 5.0, 125 votes)",
	"author": "Ka Bi Qiu   卡比丘   ",
	"year": "\n2018",
	"ranking": "#1658   #3506   #4784   #4788   #4263   ",
	"reviewcount": "21 Reviews",
	"description": "On the run from the government despite being one of the most successful and attractive alphas in the entire League, Chen Boqiao unexpectedly has to spend time with Zhang Jue, one of his admirers from middle school. As they get to know each other better, he realizes that Zhang Jue seems to still have feelings for him after all these years. However, was Zhang Jue really an alpha as he had always claimed? \n\nWhy is it that Colonel Chen, who has made great achievements in the war, has been jailed and sentenced to death? Is it true that he conspired with the enemy and reneged on the country and killed his father for profit, as reported in the news?\n\nIn an expected jail delivery, an unexpected person appeared.\n\nThe former alumnus, Zhang Jue, who had confessed love to Chen Boqiao once, gave him a chance-of- a-lifetime on the pretext of unlocking a gene lock.\n\nZhang Jue– meek, timid, humble, and honest.\n\nChen Boqiao– with fortitude, prideful, gentleman, alienation.\n\nAfter all the changes in Bangkok, they began to understand and slowly fall in love with each other.>"
}