{
	"url": "https://www.novelupdates.com/series/tanky-mage-system/",
	"title": "Tanky Mage System - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/01/Tanky-Mage-System.jpg",
	"noveltype": "(CN)",
	"genre": "Fantasy   ",
	"tags": "",
	"rating": "(3.1 / 5.0, 11 votes)",
	"author": "Black Sky   ",
	"year": "\nN/A",
	"ranking": "#2000   #2000   #11519   #13810   #13120   ",
	"reviewcount": "1 Review sorted by",
	"description": "While a certain young man hides in a certain Ruins City, wanting to become a tanky mage through passive farming. \r\n\r\nMages should focus on learning more spells and magic? There is no time to invest in body strengthening? Mages are defenseless when they run out of mana? None of these are a problem for Gurney and his Passive Farming System. Through the system, Gurney trains both his body and mind at the same time, he goes beyond the limits and logic of an ordinary mage. This is a mage who casts spells while tanking hits, his recovery speed surpasses even warriors and knights. This is the journey of a vigilant and careful mage who grows tankier and tankier. \r\n\r\n… \r\n\r\nWith the rising waves of darkness, the steampunk steel ship sets sail on a journey and adventure. \r\n\r\nWhales sink to the depths of the sea, sirens sing with beautiful voices, calling out to the Transcendent sailors who hunt for mermaids. \r\n\r\nThe mysterious Time Hunters who obey the ancient rules search for their prey. \r\n\r\nHe who bears the title of “Hero” carries the burden of fate as he steps on the road to write a new page of history. \r\n\r\nAncient “Sealed Ones” rush to break out of their imprisonment, wanting to create and release new “Supernatural Memetics”. \r\n\r\nThe combination of steam technology and supernatural powers bring forth the era of “Transcendent Genetic Warriors”. \r\n\r\nInfant dragons who have just hatched watch as the Dragon Slayer digs out their mother’s heart from her body. \r\n\r\nCalamity level lifeforms sharpen their blades, stepping into the stage of this extraordinary era. \r\n\r\nThe tides of the era surge and swirl, bringing along the mysterious fog of darkness… \r\n\r\nThe indescribable existence nurtures and grows… \r\n\r\nAlong with the stare of the Abyss… \r\n\r\n… \r\n\r\nWelcome to the Supernatural Steampunk Era!>"
}