{
	"url": "https://www.novelupdates.com/series/the-ladys-sickly-husband/",
	"title": "The Lady’s Sickly Husband - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2018/04/Ladys-Sick-Husband.jpeg",
	"noveltype": "(CN)",
	"genre": "Adventure   Drama   Fantasy   Historical   Romance   ",
	"tags": "Ancient Times   Arranged Marriage   Beautiful Female Lead   Business Management   Businessmen   Character Growth   Cooking   Determined Protagonist   Early Romance   Farming   Female Protagonist   Handsome Male Lead   Hard-Working Protagonist   Leadership   Love Interest Falls in Love First   Love Triangles   Modern Knowledge   Multiple POV   Mysterious Family Background   Mysterious Illness   Poor to Rich   Previous Life Talent   Schemes And Conspiracies   Special Abilities   Tragic Past   Transmigration   Underestimated Protagonist   ",
	"rating": "(4.0 / 5.0, 144 votes)",
	"author": "Xiào Māo Yān Rán   笑猫嫣然   ",
	"year": "\n2014",
	"ranking": "#4265   #2000   #1107   #7727   #1811   ",
	"reviewcount": "34 Reviews sorted by",
	"description": "Transmigration? A Chong Xi Marriage? Sickly husband? How worse can this get? \n\nMo Qian Xue now lives in a soddy, destitute, small house with broken furnitures. The grass had grown wild and unruly from lack of proper care. The rice pot in the kitchen, it’s left empty. Well, this mess seemed quite manageable, however, why is it they only have one quilt in the house? \n\nNot only does she serve her husband food and refreshments during the day, does she need to make sure he’s well “fed” at night too?\n\n“It’s getting late now… we should go to bed. Said the sickly husband. She simply closed the door, turned off the lights, and went straight to sleep.\n\n“If you dare move, I’ll kick you out of the bed!” She threatened.\n\nIn the end, the man still managed to wrap himself around her no matter how she resisted. The sickly husband wasn’t as weak as he appeared to be!\n\nMo Qian Xue worked hard to become rich. She built workshops, opened factories, one aided by her sickly husband towards prosperity. Fortunately, she could live a peaceful life far from bickering relatives, but then, much to her dismay, she still had to deal with the villagers knocking on her door.\n\nSo they want her money? They want her position as a wife? Since when was she, Mo Xian Que easy to bully?! They want to make her lose face? Alright, let them come a little closer then… give them a…. slap!>"
}