{
	"url": "https://www.novelupdates.com/series/gate-jietai-kare-no-chi-nite-kaku-tatakeri/",
	"title": "Gate – Jietai Kare no Chi nite, Kaku Tatakeri - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2015/08/gate-.png",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Comedy   Drama   Fantasy   Harem   Seinen   Supernatural   Tragedy   ",
	"tags": "Adapted to Anime   Adapted to Manga   Animal Characteristics   Aristocracy   Beastkin   Dragons   Elves   Firearms   Gate to Another World   JSDF   Kingdoms   Magic   Male Protagonist   Medieval   Military   Modern Knowledge   Nationalism   Otaku   Parallel Worlds   Politics   Romantic Subplot   R*pe   S*aves   Strong Love Interests   Technological Gap   Wars   ",
	"rating": "(4.1 / 5.0, 173 votes)",
	"author": "Yanai Takumi   ",
	"year": "\n2006\n",
	"ranking": "#2000   #2000   #3087   #9323   #1023   ",
	"reviewcount": "11 Reviews sorted by",
	"description": "In August of 20XX, a portal to a parallel world, known as the “Gate”, suddenly appeared in Ginza, Tokyo. Monsters and troops poured out of the portal, turning the shopping district into a bloody inferno.\n\nThe Japan Ground-Self Defence Force immediately took action and pushed the fantasy creatures back to the “Gate”. To facilitate negotiations and prepare for future fights, the JGSDF dispatched the Third Reconnaissance Team to the “Special Region” at the other side of the Gate.\n\nYouji Itami, a JSDF officer as well as a 33-year-old otaku, was appointed as the leader of the Team. Amid attacks from enemy troops the team visited a variety of places and learnt a lot about the local culture and geography.\n\nThanks to their efforts in humanitarian relief, although with some difficulties they were gradually able to reach out to the locals. They even had a cute elf, a sorceress and a demigoddess in their circle of new friends. On the other hand, the major powers outside the Gate such as the United States, China and Russia were extremely interested in the abundant resources available in the Special Region. They began to exert diplomatic pressure over Japan.\n\nA suddenly appearing portal to an unknown world – to the major powers it may be no more than a mere asset for toppling the international order. But to our protagonists it is an invaluable opportunity to broaden knowledge, friendship, and ultimately their perspective towards the world.>"
}