{
	"url": "https://www.novelupdates.com/series/because-she-had-a-time-limit-she-became-the-villains-daughter-in-law/",
	"title": "Because She Had A Time Limit, She Became The Villain’s Daughter-in-law - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/12/181448.jpg",
	"noveltype": "(KR)",
	"genre": "Comedy   Fantasy   Romance   ",
	"tags": "Acting   Adapted to Manhwa   Aristocracy   Arranged Marriage   Beautiful Female Lead   Character Growth   Child Protagonist   Childcare   Cunning Protagonist   Cute Children   Cute Protagonist   Female Protagonist   Love Interest Falls in Love First   Male Yandere   Marriage   Mob Protagonist   Nobles   Poor Protagonist   Quiet Characters   Schemes And Conspiracies   Shy Characters   Sickly Characters   Single Parent   Transmigration   Tsundere   Weak Protagonist   Wealthy Characters   ",
	"rating": "(4.2 / 5.0, 109 votes)",
	"author": "Yoo Na Jin   유나진   ",
	"year": "\n2020",
	"ranking": "#308   #445   #2009   #1140   #1182   ",
	"reviewcount": "15 Reviews sorted by",
	"description": "The final villain is being deceived by his young time-limited daughter in law who was possessed.\n\nIf I die at the right time, I will marry his son.\n\nThe problem is, I already know the cure! And I don’t want to die, but if I don’t get killed now, then I won’t die quietly.\n\n“Daddy, I love you so much. You are the most handsome man in the world. Cough, cough!”\n\n“Evan, shall we read a fairy tale book together until we fall asleep?”\n\nShe will have to act a little better to let his guard down. Then, she would be able to do a great job.\n\nI think I’ll have to leave secretly after I get better.\n\nI have to make a lot of money and buy land under borrowed names—\n\n“Call all the council members on the continent. My daughter-in-law has to live.”\n\nFather? Shouldn’t I be thrown away?\n\n“If you die, I’ll follow you unconditionally. I can’t live in a world without you.”\n\nHusband? You’re also acting strange. You don’t love anyone, do you?\n\nEven—\n\n“Who is this, Kyle Ravonis? The man who seduced my daughter-in-law deserves to die.”\n\n“Even if you cheated on me with another man, I will never break up with you.”\n\nYou must have misunderstood my other name!\n\n“When did this start, huh? You said you wanted to live as a sweet couple, but you tried to run away by creating a new identity behind our back?”\n\nI want to quietly disappear, not die!\n\nI didn’t know my husband, who has been like a friend to me ever since we were young, would come to me with such sore eyes.\n\n“You’re still my wife on paper. Live as my wife, and die as my wife.”\n\n“Evan?”\n\n“You’ve shown me both heaven and hell…”\n\nHis reddened eyes locked me up.\n\n“You’ll never get away from me no matter where you go.”>"
}