{
	"url": "https://www.novelupdates.com/series/the-male-leads-wife-in-the-80s/",
	"title": "The Male Lead’s Wife in the ’80s - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/03/FDW-cover-2.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Drama   Fantasy   Historical   Romance   Slice of Life   ",
	"tags": "Arranged Marriage   Beautiful Female Lead   Carefree Protagonist   Clever Protagonist   Cohabitation   Cute Protagonist   Cute Story   Devoted Love Interests   Early Romance   Female Protagonist   Handsome Male Lead   Heartwarming   Love Interest Falls in Love First   Marriage   Multiple Reincarnated Individuals   Pregnancy   Soul Power   Transmigration   ",
	"rating": "(3.7 / 5.0, 54 votes)",
	"author": "萧枝惜   ",
	"year": "\n2019",
	"ranking": "#3923   #3264   #3167   #8667   #3961   ",
	"reviewcount": "15 Reviews sorted by",
	"description": "Su Man-er had transmigrated into a period novel and became the male lead’s newly wedded wife in the '80s. He had spent every dime in his possession and more to marry her. The little delicate wife had previously heard that the male lead was impotent from the female lead. And so, she made a scene on her wedding day and had an affair on the third day!\n\nSu Man-er transmigrated to the point in the story when the original owner was hiding in a hut with a man while the male lead and the villagers were waiting outside to catch them red-handed.\n\nAs the elite of the flower demon clan, Su Man-er didn’t even hesitate before she knocked the man out. Humph, a man like that wasn’t even worthy enough to touch her feet!\n\n***\n\n“Do you want your official female lead back?” asked Su Man-er. For some odd reason, when the words “official female lead” left her mouth, she felt a sense of unease, as though… as though there was a thorn stuck in her heart.\n\nChi YunChen looked at her profoundly and said, “If she was the one that I wanted to be with, I wouldn’t have sided with you during the hut incident. Su Man-er, now that I have married you, I will be responsible for you for the rest of my life. Unless you don’t want to be with me and don’t want to be my wife anymore.”\n\nAs long as she stayed, he’d be her loyal husband for life.\n\nSu Man-er was touched by his words. Biting her lip, she hesitated on what to say.\n\nOn the other hand, he suddenly reached out, grabbed her on her shoulder, and said, “I have been frank with you. Isn’t it your turn now to do the same?”>"
}