{
	"url": "https://www.novelupdates.com/series/no-pollution-no-public-harm/",
	"title": "No Pollution, No Public Harm - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2018/12/Screen-Shot-2018-11-30-at-8.33.41-PM.png",
	"noveltype": "(CN)",
	"genre": "Drama   Josei   Wuxia   ",
	"tags": "Apartment Life   Character Growth   Late Romance   Modern Day   Mysterious Past   Mystery Solving   Outcasts   Pragmatic Protagonist   Revenge   Tsundere   ",
	"rating": "(4.2 / 5.0, 46 votes)",
	"author": "Priest   ",
	"year": "\n2018",
	"ranking": "#5262   #4796   #6295   #5349   #6179   ",
	"reviewcount": "7 Reviews sorted by",
	"description": "'When I was young, whenever I wrote essays, my last line was frequently 'I am determined to become someone useful to society.' On average, I made this resolve twenty to thirty times per school term. I was very thoughtless.'\n\n'Only when I grew up did I realise that to become someone who brought no harm to society was already the biggest accomplishment I would have in my life.'\n\nDue to working through the night and putting in overtime until his liver was going bust, the leader of the Martial Arts Alliance was in a bad mood. He refused to organise the yearly Martial Arts General Assembly.\n\nThe descendant of the previous Sect Leader of the Beggars' Sect was someone addicted to swiping the phone and online shopping; Tang Qian Yan who left no marks when stepping on snow produced a wretched shut-in with severe social anxiety disorder…\n\nLike the water in the rivers flowing away, the state of the world became worse day by day. Only the followers of the demonic cults preserved their original aspirations. As ever, they shouted their slogans every day and worked hard to sell health supplements made by black market suppliers, carefully and seriously disturbing the public peace.\n\nAnd, among the jianghu people mentioned above, whether they belonged to the righteous or the evil, not a single one of them could fight.\n\nKindness repaid with kindness, evil repaid with evil? White Horse Neighs in the Western Wind? Such things did not exist. Everyone still had to pay their credit card bills and house loans.\n\nThere were four ways to write 'anise' in 'anise beans,' and five levels of 'grief.'>"
}