{
	"url": "https://www.novelupdates.com/series/fake-holy-sword-story-%ef%bd%9ei-was-taken-along-when-i-sold-my-childhood-friend%ef%bd%9e/",
	"title": "Fake Holy Sword Story ～I Was Taken Along When I Sold My Childhood Friend～ - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/03/7aorkwpqm84ya3ebrbf4qhz8roe_k7d_1cz_1xo_s7xh.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Comedy   Fantasy   Psychological   ",
	"tags": "Acting   Adapted to Manga   Apathetic Protagonist   Arrogant Characters   Artifacts   Beautiful Female Lead   Black Belly   Conditional Power   Depictions of Cruelty   Famous Protagonist   Fantasy World   Forced into a Relationship   Forced Living Arrangements   Forced Marriage   Handsome Male Lead   Heroes   Knights   Legends   Magic   Male Protagonist   Mind Control   Misunderstandings   Multiple POV   Narcissistic Protagonist   Near-Death Experience   Nobles   Possession   Reluctant Protagonist   Saints   Secrets   Sentient Objects   Sharing A Body   S*aves   Sword And Magic   Sword Wielder   Twisted Personality   Unique Weapon User   Unique Weapons   Unlucky Protagonist   Unreliable Narrator   Unrequited Love   ",
	"rating": "(3.5 / 5.0, 141 votes)",
	"author": "Mizokami Ryou   Suisei   水星   溝上良   ",
	"year": "\n2019",
	"ranking": "#5262   #6161   #1913   #5097   #2192   ",
	"reviewcount": "28 Reviews sorted by",
	"description": "【Hero Alistar, a legendary hero who has saved many people with the Holy Sword ■■■■■■. There was a person who was always with him, Saint Magali. The two of them, with a bottomless kindness and benevolent spirit, no matter what danger befalls them, they saved many people that suffered hardships and injustice. This book describes the history of the legend of the greatest Hero and Saint of all time.】\n\nExcerpt from the preface of 『Holy Sword Legend』.\n\nMy childhood friend, Magali was chosen as a saint.\n\nFrom now on, it seems that she has to keep smiling to everyone in the capital, and has to live in a terrifyingly strict world that has things like manners and dance.\n\nWe’ve been together since birth. As expected, there is something left in my mind.\n\nWhile feeling a little lonely… I held down my childhood friend who no matter what was trying to escape and turned her over to the knight who came to pick her up.\n\n「Alistaaaaaaaaaaaaar!!」\n\nI could hear a resentful voice, but that was probably my imagination.\n\nI was taken along to the capital to see her off as a last struggle… but, it ended without any problems.\n\n「Now, I’m going home. Good luck ^^」\n\nI turned my back to my childhood friend who looked at me with resentful eyes. And when I was on my way home… I was being chased by goblins.\n\n「Noooooooo!! Someone help meeeeeeeeeee!!」\n\nThis is a misunderstood legend of a hero and saint with the worst personalities that’re pulling each other’s leg while pursuing a happy life.>"
}