{
	"url": "https://www.novelupdates.com/series/the-conjuror-xena/",
	"title": "The Conjuror Xena - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/10/2e2eb9389b504fc2bed99224e6dde71190ef6d08.jpeg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Comedy   Josei   Xuanhuan   ",
	"tags": "Female Protagonist   Magic   Magic Beasts   Reincarnation   ",
	"rating": "(3.7 / 5.0, 3 votes)",
	"author": "翦羽   ",
	"year": "\nN/A",
	"ranking": "#2000   #2000   #12484   #10269   #12673   ",
	"reviewcount": "No Reviews",
	"description": "An unscrupulous girl named “Xena” was possessed by a Dark orb and transmigrated the second time.\r\n\r\nShe was the little tramp brought up by a lunatic. Nonetheless, she was someone who possessed the “rubbish” negative Lingen*.\r\n\r\nAffected by the side effects of the dark orb, she was the infamous “Demoness” hated by the world.\r\n\r\nThe MoYun clan wanted to engulf her, “Let your powers be of use to me!”\r\n\r\nThe Light camp wanted to assassinate her, “Demoness! Don’t try to run!”\r\n\r\nPowerful gods of war had wanted to mug her, “You are not worthy of this weapon!”\r\n\r\nLight or Dark, the world denied her existence!\r\n\r\nGood or evil, who would accompany her through chaos?\r\n\r\n“Those who wanted to engulf me! Hand over your treasures!”\r\n\r\n“Those who wanted to assassinate me! I’ll refine you all into human pills with my Reincarnator!”\r\n\r\n“Those who wanted to mug me! I’ll show you who is the real smuggler!”\r\n\r\nWearing the king of peony on her head! Riding on the scarlet flamer! Holding the murderous Reincarnator…… \r\n\r\nContracting spirit beasts! Taming demon servants!\r\n\r\nConjure! All beasts below God-tier can move out of the way!\r\n\r\n“With the Suzaku flame, I shall revolutionize this world!”\r\n\r\nTL’s Note: Lingen is a root in Conjurors. Without it, one cannot become a conjuror. Lingen determines a Conjuror’s potential and also their element. The “rarest” Lingen is the Negative Lingen, meaning the person has no future as a Conjuror. The most powerful Lingen is the Six-Element Lingen where the user has all six elements: Fire, Water, Wind, Light, Dark, and Earth.>"
}