{
	"url": "https://www.novelupdates.com/series/ancient-foodie-survival-guide/",
	"title": "Ancient Foodie Survival Guide - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/07/unnamed-2.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Josei   Romance   Slice of Life   ",
	"tags": "Ancient China   Beautiful Female Lead   Carefree Protagonist   Cooking   Couple Growth   Court Official   Cute Children   Doting Love Interests   Easy Going Life   Family Business   Female Protagonist   Forced Marriage   Handsome Male Lead   Heartwarming   Love Interest Falls in Love First   Mismatched Couple   Nobles   Pregnancy   Slow Romance   Transmigration   Wealthy Characters   ",
	"rating": "(4.5 / 5.0, 236 votes)",
	"author": "Coke Ginger Soup   Kělè jiāng tāng   可乐姜汤   ",
	"year": "\n2020",
	"ranking": "#2384   #6381   #1856   #1070   #1989   ",
	"reviewcount": "65 Reviews sorted by",
	"description": "Jiang Shuyao transmigrated and became a vicious lady with a flamboyant appearance and gaudy clothes. She married the most charming young man in the capital by relying on a scheme.\n\nThe husband disliked her, mother-in-law loathed her, brother-in-law despised her, Jiang Shuyao wanted to cry without tears.\n\nHowever, there is nothing in the world that cannot be solved by a hot and spicy meal. If there is, then add hot pot, iron plate barbecue, skewers, milk tea, grilled chicken wings, custard wrap, shrimp dumplings, fried chicken, hot and sour noodles, curry rice, hand cake, fish cake stew, mashed potatoes, preserved eggs, lean meat porridge, and shrimp porridge.\n\nAfter a period of time:\n\nPicky mother-in-law: Shuyao is indeed a filial child.\n\nSisters-in-law: Younger sister-in-law is really cute.\n\nStern eldest brother-in-law and second-brother-in-law: Hard work, sister-in-law.\n\n……\n\nLooking at the people who have been defeated because of food, Xie Xun hates the iron for not becoming steel. Jiang Shuyao’s mind is very cruel and bad, I will… definitely not eat it… so fragrant!>"
}