{
	"url": "https://www.novelupdates.com/series/the-returnee-noble-lady-attacks-his-majesty-the-dragon-emperor/",
	"title": "The Returnee Noble Lady Attacks His Majesty the Dragon Emperor - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/02/やり直し令嬢は竜帝陛下を攻略中.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Comedy   Fantasy   Romance   Shoujo   ",
	"tags": "Adapted to Manga   Age Regression   Aristocracy   Beautiful Female Lead   Betrayal   Broken Engagement   Child Protagonist   Clumsy Love Interests   Curses   Devoted Love Interests   Doting Love Interests   Dragons   Engagement   Female Protagonist   Gods   Handsome Male Lead   Magic   Nobles   Older Love Interests   Protagonist Strong from the Start   Reincarnation   Righteous Protagonist   Royalty   Schemes And Conspiracies   Second Chance   Strong Love Interests   Tomboyish Female Lead   Villainess Noble Girls   ",
	"rating": "(3.7 / 5.0, 108 votes)",
	"author": "Nagase Sarasa   永瀬さらさ   ",
	"year": "\n2019",
	"ranking": "#2917   #2851   #1489   #3814   #1139   ",
	"reviewcount": "16 Reviews sorted by",
	"description": "–after a combo of Detainment -> Broken Engagement -> Execution, I thought I was dead…\r\n\r\n…however, Jill’s time got rewound to six years ago, when she was but ten, just about to be engaged with the Prince.\r\n\r\nJill, who knew what will happen six years later, was eager to change her fate.\r\n\r\nThe face didn’t matter–she would marry another man.\r\n\r\nIt was the young emperor of the neighboring country (who would fall into darkness six years later) who responded to her.\r\n\r\nShe was courted by the Emperor, subsequently kidnapped, and later stuck with him.\r\n\r\n“I still have six years! If I manage to rehabilitate the Emperor by then, all will be solved! (Or so I would like to think).”\r\n\r\nThis is a tale of a returnee young lady whom was also known as the Battle Maiden, whom, as she avoided the Prince’s persistent courtship, got reunited with former subordinates, solve cases with physics, and became a real couple with the cursed Emperor.>"
}