{
	"url": "https://www.novelupdates.com/series/worlds-best-martial-artist/",
	"title": "World’s Best Martial Artist - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/12/4B376DEB-0056-475F-B444-C7C78DEC0490.jpeg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Comedy   Martial Arts   School Life   Shounen   Supernatural   Xuanhuan   ",
	"tags": "Adapted to Manhua   Age Regression   Arrogant Characters   Body Tempering   Business Management   Character Growth   Cheats   Childish Protagonist   Cultivation   Game Elements   Handsome Male Lead   Late Romance   Male Protagonist   Mature Protagonist   Military   Modern Day   Money Grubber   Nationalism   Parallel Worlds   Poor Protagonist   Poor to Rich   Racism   Rich to Poor   Second Chance   Sect Development   Shameless Protagonist   System Administrator   Transmigration   Unreliable Narrator   Weak to Strong   ",
	"rating": "(3.9 / 5.0, 91 votes)",
	"author": "Eagle Eats The Chick   老鹰吃小鸡   ",
	"year": "\n2018",
	"ranking": "#6970   #2000   #4619   #11077   #6739   ",
	"reviewcount": "30 Reviews",
	"description": "Fang Ping finally settled an issue after wasting half an hour of his life. He wasn’t dreaming nor acting —for God’s sake, if acting in a movie could restore his youth, then the film crew deserved a trip to heaven immediately!\n\nAfter verifying that he had reincarnated, Fang Ping felt a wave of panic before settling down and accepting the truth.\n\nWhat was the truth? It was that he had indeed reincarnated into a younger version of himself, and since he was equipped with his knowledge of the future, he was going to seize the day and become the next-big-thing in the business world! He was going to be rich!\n\nThat was that, until his friend interrupted him.\n\n“So are you signing up for the martial sciences exam?”\n\nWhat? Was this a joke? Or had he been handed the wrong script? Was this even the right universe? What was martial sciences? Why did the exam cost 10 thousand yuan to sign up? Loaded with questions, Fang Ping will soon realize that he might not have struck the jackpot as he had initially thought…>"
}