{
	"url": "https://www.novelupdates.com/series/these-lunatics-are-obsessed-with-me/",
	"title": "These Lunatics are Obsessed With Me - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/05/These-Lunatics-are-Obsessed-With-Me.jpg",
	"noveltype": "(KR)",
	"genre": "Comedy   Fantasy   Harem   Yaoi   ",
	"tags": "Cruel Characters   Dungeons   Fantasy Creatures   Guilds   Handsome Male Lead   Hunters   Love Interest Falls in Love First   Mob Protagonist   Modern Day   Monsters   Multiple POV   Possessive Characters   Special Abilities   Strong Love Interests   Survival   Transmigration   Weak Protagonist   Weak to Strong   ",
	"rating": "(4.5 / 5.0, 74 votes)",
	"author": "블랙필   ",
	"year": "\n2021",
	"ranking": "#1969   #1563   #4579   #1579   #4483   ",
	"reviewcount": "6 Reviews sorted by",
	"description": "“Han… Yi Jin? The dual-class loser villain bastard, Han Yi Jin?”\n\nHan Yi Jin had reincarnated as an insignificant villain in a male-oriented modern fantasy novel.\n\nHan Yi Jin, the small-fry villain who hung around the main character, Kang Yoo Hyun, and died at the beginning of the story.\n\n“Aren’t you acting a little strange today?”\n\n“What’s strange? F*ck off if you don’t have any business with me.”\n\nTo avoid suspicion, he acts like Han Yi Jin from the original story. This rather attracts the attention of the gongs, and Yi Jin is looked upon with suspicion.\n\n[Synchronisation is complete.]\nShake the Catnip (S): All stats of the designated opponent +20%\n\nIn the meantime, he had acquired the “Catnip Skill” from nowhere.\n\nBecause of this skill, which becomes more effective the higher the intensity of the skinship, Yi Jin begins to attract the obsession and interest of the other characters…\n\n“I love it when you curse.”\n\n“Hyung, would you like to go out on a date with me?”\n\n“You wouldn’t think of that if I cut off at least one of your legs.”\n\n“Keep running away like that. I’m curious how far you can go.”\n\nThese crazy bastards are obsessed with me.\n\n“Why are you all staring at me with those eyes? Get the f*ck out of here, you crazy bastards!”\n\nWill Yi Jin be able to escape safely from the clutches of the gongs?\n\nWill he be able to escape death?>"
}