{
	"url": "https://www.novelupdates.com/series/the-lady-i-served-became-the-master/",
	"title": "The Lady I Served Became The Master - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/07/The-Lady-I-Served-Became-The-Master.jpg",
	"noveltype": "(KR)",
	"genre": "Drama   Fantasy   Gender Bender   Psychological   Romance   ",
	"tags": "Adapted to Manhwa   Beautiful Female Lead   Childcare   Childhood Love   Clingy Lover   Cross-dressing   European Ambience   Female Protagonist   Handsome Male Lead   Love Interest Falls in Love First   Maids   Misunderstandings   Reincarnated in Another World   Strong Love Interests   Younger Love Interests   ",
	"rating": "(4.0 / 5.0, 60 votes)",
	"author": "태비의별   ",
	"year": "\n2019",
	"ranking": "#2000   #2000   #6616   #10065   #3771   ",
	"reviewcount": "1 Review sorted by",
	"description": "Nine years after I had a minor role, the lady I served, became a master and came to find me.\n\nIt’s been four years since the original heroine ended her married life. But a handsome man came to see me.\n\nI used to serve him in the past.\n\n“I’m here to for you to keep your word, Blair. You said you’d be with me for the rest of your life.”\n\n“You can’t be… Miss?”\n\nAt one point, she had a twinkle in the man’s red eyes.\n\nHe bowed his head and kissed my hair.\n\nAnd whispered in a very sweet, beautiful voice\n\n“You should call me Master now.”\n\n***\n\nBut there was one big secret in the original novel that stopped being serialized.\n\nWhat if the heroine turns out to be a man?\n\n“Claude, is it okay if you don’t have to go to your family?”\n\n“I told you, I don’t need it.”\n\n“Then the man from last time.”\n\n“Are you going to talk about another man in front of me?”\n\nThese are the main characters that should have been connected to you.\n\n“I just need you. Nothing else matters.”\n\nThe one who was supposed to be the main character, declared that he would drop everything and be with me.\n\n“So Blair, just look at me.”\n\nThere was an obsession in his eyes that was getting brighter and brighter.>"
}