{
	"url": "https://www.novelupdates.com/series/the-guide-to-capturing-a-black-lotus/",
	"title": "The Guide to Capturing a Black Lotus - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/04/D20FF212-87A3-4b43-BEC2-3BBFFFC16177.png",
	"noveltype": "(CN)",
	"genre": "Adventure   Fantasy   Mystery   Romance   ",
	"tags": "Adapted to Drama   Adapted to Drama CD   Adapted to Manhua   Aggressive Characters   Ancient China   Caring Protagonist   Cautious Protagonist   Character Growth   Charming Protagonist   Clingy Lover   Cruel Characters   Demons   Devoted Love Interests   Distrustful Protagonist   Female Protagonist   Handsome Male Lead   Male Yandere   Misunderstandings   Non-linear Storytelling   Obsessive Love   Past Plays a Big Role   Past Trauma   Possessive Characters   Siblings Not Related by Blood   Sister Complex   Slow Romance   Stoic Characters   Strong Love Interests   System Administrator   Transmigration   Tsundere   Unconditional Love   Unrequited Love   Villainess Noble Girls   Weak Protagonist   ",
	"rating": "(4.4 / 5.0, 200 votes)",
	"author": "Bai Yu Zhai Diao Gong   White-Feather Eagle Bow   白羽摘雕弓   ",
	"year": "\n2018",
	"ranking": "#1504   #556   #1901   #1577   #1347   ",
	"reviewcount": "36 Reviews sorted by",
	"description": "The demons of this world run amok; it’s time for the children of heroes to fill in their own legends.\n\nUnfortunately, you’re not the cold and incorruptible female lead. You’re not even the high-status, delicate and charming second female lead: You’re just the detestable cannon fodder female number three!\n\nThe original host was secretly in love with the male lead while a fanatic in harming the female lead from the dark. Till the very end, she was merely a stumbling block for the love between the male lead and female lead. She let herself get stepped all over by the second male lead and lived a life that could only described as ‘s*upid’.\n\n“So you’re saying… as long as I steal the female lead’s man, I’ll succeed?”\n\n“Apologies, your target partner is… the female lead’s little brother.”\n\n“Little brother?”\n\n“Yes, it’s exactly that little brother who’s hopelessly in love with his older sister. The one with a twisted heart and evil tendencies, vicious and merciless… that little brother.”>"
}