{
	"url": "https://www.novelupdates.com/series/the-1-pretty-boy-of-the-immortal-path/",
	"title": "The #1 Pretty Boy of the Immortal Path - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/02/The-Pretty-Boy-of-the-Immortal-Path.jpg",
	"noveltype": "(CN)",
	"genre": "Adventure   Comedy   Gender Bender   Mystery   Romance   Sci-fi   Shounen Ai   Supernatural   Xianxia   ",
	"tags": "Academy   Adapted to Drama CD   Ancient Times   Androgynous Characters   Calm Protagonist   Cold Protagonist   Cross-dressing   Cultivation   Dao Companion   Dao Comprehension   Death   Dense Protagonist   Devoted Love Interests   Doting Love Interests   Engagement   Handsome Male Lead   Heavenly Tribulation   Kind Love Interests   Loner Protagonist   Long Separations   Love Interest Falls in Love First   Misunderstandings   Older Love Interests   Poor Protagonist   Popular Love Interests   Royalty   Secret Identity   S*xual Cultivation Technique   Slow Romance   Straight Seme   Straight Uke   Strong Love Interests   Sword Wielder   Time Loop   Time Travel   War Records   Wars   Weak to Strong   ",
	"rating": "(4.4 / 5.0, 169 votes)",
	"author": "Yi Shi Si Zhou   一十四洲   ",
	"year": "\n2018",
	"ranking": "#946   #3890   #1829   #8372   #1608   ",
	"reviewcount": "27 Reviews sorted by",
	"description": "I belong to a good sect that has never turned its back on me for my poor potential, has never forced me to study martial arts, and even helped arrange a betrothal for me when I was young.\n\nMy fiancée is a much renowned hot-tempered young miss. She’s beautiful, strong, and deeply loves me. Upon my start down the path of the Jianghu, I entirely relied on her to provide cover for me and before long, I became renowned as the #1 Pretty Boy of the Immortal Path.\n\nYet one day, I discovered that this person is apparently a man. A man in drag!\n\nMore unforgivable is that he thought I was a woman dressing as a man!\n\nMe, as if my liver and guts are being cut to pieces: “Brother, what have you done with my fiancée?”\n\nHim, as if a knife has been twisted in his heart: “Brother, what have *you* done with my fiancée?”\n\nThe waters of the Jianghu are indeed murky. Even if I am starving, even if I’m dying far from home, from this point on, I will not eat even a mouthful of rice prepared by him.\n\n—So fragrant.>"
}