{
	"url": "https://www.novelupdates.com/series/shrank-to-a-3-years-old-child/",
	"title": "Shrank to a 3-Years-Old Child - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/01/Shrank-to-a-yearsold-child.jpg",
	"noveltype": "(CN)",
	"genre": "Fantasy   Romance   Slice of Life   ",
	"tags": "Absent Parents   Age Regression   Beautiful Female Lead   Child Abuse   Complex Family Relationships   Divorce   Familial Love   Family   Family Conflict   Female Protagonist   Handsome Male Lead   Kidnappings   Misunderstandings   Modern Day   Past Plays a Big Role   ",
	"rating": "(4.0 / 5.0, 50 votes)",
	"author": "悲剧初始化   ",
	"year": "\n2020",
	"ranking": "#2210   #4061   #3628   #4148   #4781   ",
	"reviewcount": "19 Reviews sorted by",
	"description": "Gu Qingqing was born into a wealthy family, married into a wealthy family, and gave birth to a wealthy heir.\n\nHer husband is respectful, her son is filial, and her brother is prosperous. Her life is a model of a top-class lady, and her life is boundless.\n\nThis is Gu Qingqing in the eyes of outsiders.\n\nIn fact, Gu Qingqing actually felt that her life was a failure, the relationship between husband and wife was cold, the relationship between mother and child is stiff, and the siblings always quarreled at first sight, and her life was not going very well.\n\nThe day before yesterday, she threw a check to her second son’s girlfriend. When she woke up the next day, she shrank into a three-year-old milky child.\n\nHer husband, sons, and brother who heard the news rushed home, and they surrounded the pink dumpling on the sofa hugging the stuffed bear and were silent.\n\nGu Qingqing blinked her big watery eyes and said with a milky voice: “Uncle, who are you?”\n\nPresident No. 1: “I am your husband.”\n\nPresident No. 2: “I am your eldest son.”\n\nPresident No. 3 :”I am your second son.”\n\nPresident No.4: “I am your brother.”\n\n“You are a liar! Mom and Dad have promised Qingqing to not have a second child!”\n\nShould this be the focus of attention?\n\nThe point is my wife/mum/sister has become a three-years-old child!>"
}