{
	"url": "https://www.novelupdates.com/series/tower-of-karma/",
	"title": "Tower of Karma - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/09/towerofkarma_v1d.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Drama   Mature   Psychological   Supernatural   Tragedy   ",
	"tags": "Antihero Protagonist   Cannibalism   Clever Protagonist   Confinement   Evil Protagonist   Handsome Male Lead   Hard-Working Protagonist   Male Protagonist   Military   Multiple Personalities   Nobles   Personality Changes   Possession   Revenge   Ruthless Protagonist   S*aves   Tragic Past   Twisted Personality   Weak to Strong   ",
	"rating": "(3.7 / 5.0, 192 votes)",
	"author": "Fujita Keyaki   富士田けやき   ",
	"year": "\n2014",
	"ranking": "#2000   #2000   #3926   #12115   #2582   ",
	"reviewcount": "22 Reviews sorted by",
	"description": "Al was a s*ave born from a prostitute. Constantly being bullied and degraded, Al’s life was hard but as long as his elder sister, the only family he had, was with him, he felt like he could withstand anything. But one day, his older sister sold herself to a noble to obtain money to free Al. Despairing, Al was ready to give up, but with his friends’ encouragement, he started working, hoping that one day he could buy back his sister.\n\nHowever, a few days later, a servant of that noble came to him and handed him a bag, claiming he was delivering the body back to its place because disposing of it was troublesome. At the very moment Al looked inside the bag, his mind broke.\n\n“Why are we, despite also being human, being treated like tr*sh by people? We all have the same ears and same eyes, and the same color of blood, but it doesn’t matter to anyone. Are we not human?”\n\nHe needed to know. He needed to prove them. Al had decided. From now on, Al and his sister would always be together.\n\nAs he gently rubbed his belly, Al made a vow.\n\n– The next time, it will be their turn to pay the price.\n\nWith those words in his heart, he devoted his whole life improving himself and planning for this single goal.\n\nKnowledge, power, deceit, bribing, betrayal; everything was valid. The first step was to rise through the ranks of the military, no matter the means.\n\nIt was going to be him the one to stand at the top of this unsightly world full of madmen.>"
}