{
	"url": "https://www.novelupdates.com/series/summoning-the-holy-sword/",
	"title": "Summoning the Holy Sword - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/01/Summoning-the-Holy-Sword.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adult   Adventure   Fantasy   Harem   Mature   ",
	"tags": "Adapted to Manhua   Alchemy   Androgynous Characters   Angels   Army   Army Building   Calm Protagonist   Childhood Friends   Clever Protagonist   Cold Protagonist   Cunning Protagonist   Death of Loved Ones   Demi-Humans   Demon Lord   Demons   Depictions of Cruelty   Determined Protagonist   Devoted Love Interests   Dragons   Dungeons   Elves   Famous Protagonist   Fantasy World   F*llatio   Game Elements   God Protagonist   Godly Powers   Gods   Guilds   Handsome Male Lead   Hard-Working Protagonist   Hated Protagonist   Humanoid Protagonist   Incest   Kingdom Building   Kingdoms   Level System   Loli   Lucky Protagonist   Male Protagonist   Mature Protagonist   Mind Break   Misunderstandings   Monsters   Multiple POV   Multiple Realms   Mysterious Family Background   Mysterious Past   Mystery Solving   Netori   Or*y   Overpowered Protagonist   Past Plays a Big Role   Politics   Polygamy   Race Change   Romantic Subplot   Royalty   R*pe   Ruthless Protagonist   Schemes And Conspiracies   Shameless Protagonist   Sister Complex   Spirit Users   Spirits   Strength-based Social Hierarchy   Strong Love Interests   Strong to Stronger   Summoning Magic   Sword And Magic   Teamwork   Tentacles   Threesome   Transported into a Game World   Transported to Another World   Twins   Underestimated Protagonist   Vampires   Wars   Weak to Strong   Younger Sisters   ",
	"rating": "(3.5 / 5.0, 143 votes)",
	"author": "Siberian Cat   西贝猫   ",
	"year": "\n2012",
	"ranking": "#2000   #2000   #2348   #2922   #3264   ",
	"reviewcount": "28 Reviews sorted by",
	"description": "During this chaotic era, the darkness engulfs all.\r\nIn a struggle of fire and death, despair shrouds the continent.\r\nThe line between fantasy and reality becomes blurred as a speckle of starlight penetrates the night sky.\r\nBut is it enough to reverse the downfall and fate? To regain the lost glory?\r\n\r\nRhode is a famed player in the game 'Dragon Soul Continent'. There, he leads the strongest player guild in the game, the Starlight Guild. Just as he defeats the last BOSS, the Void Dragon, he unexpectedly awoke in a world identical to the game.\r\n\r\nAs the Summoner Swordsman returns to the continent, waves will be cast in the rivers of fate. Can he face the coming chaos and avert the destruction of the continent?>"
}