{
	"url": "https://www.novelupdates.com/series/im-pregnant-with-a-wealthy-old-mans-child/",
	"title": "I’m Pregnant With a Wealthy Old Man’s Child - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/11/IMPWOMC.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Fantasy   Romance   Slice of Life   Yaoi   ",
	"tags": "Acting   Childcare   Cold Love Interests   Doting Love Interests   Farming   Handsome Male Lead   Magical Space   Misunderstandings   Modern Day   Mpreg   Older Love Interests   Reverse R*pe   Shameless Protagonist   Showbiz   Transmigration   Transported to Another World   Wealthy Characters   ",
	"rating": "(4.0 / 5.0, 93 votes)",
	"author": "Sweet And Greasy Millet Porridge   甜腻小米粥   ",
	"year": "\n2018",
	"ranking": "#6970   #4691   #4135   #3292   #2867   ",
	"reviewcount": "21 Reviews sorted by",
	"description": "When he woke up, Zu Qi found himself miraculously transmigrated into a weird novel and became cannon fodder.\n\nIn the early days of that cannon fodder, he used some tricks and climbed onto the Second Male Lead’s bed. After he got pregnant, he became a rich and powerful family’s “Rich Wife”. But, in the later part, he was tortured and abandoned, and the ending was really miserable.\n\nThe only way to change that tragic ending was to prevent the Second Male Lead from falling in love with the Female Lead.\n\nBut, Zu Qi believed that he didn’t have such a great ability and charm\n\nSo, he quickly packed his luggage and with a big belly of being pregnant for more than six months….. He ran away!\n\n**\n\nComing from a rich and powerful family, the big boss, Xue Jue was handsome and wealthy, and his personal life was very clean. He was rumored to have a fiancee in captivity at home and their feelings were on the verge of breaking up! Thus, countless men and women were looking forward to it, to have a chance themselves.\n\nOne day, the steward called: “Master, it’s not good! Madam left the house!”\n\nIn that afternoon, at his own holiday resort, the angry and gloomy Xue Jue found Zu Qi, who was in his swimming trunks and proudly showing off his big belly, both hands holding roasted chicken legs each and eating them with an oily mouth.\n\nZu Qi issued the conditions: “Give me 10 million! I promise to disappear without a trace with the child.”\n\nXue Jue sneered: “In your dreams!”\n\nIn the end, Zu Qi was taken back.\n\nZu Qi: “?????”\n\n“The plot should not develop in this way!”>"
}