{
	"url": "https://www.novelupdates.com/series/rescuing-the-beautiful-and-strong-yet-miserable-second-lead-character/",
	"title": "Rescuing the Beautiful and Strong yet Miserable Second Lead Character - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/07/Rescuing-the-Beautiful-and-Strong-yet-Miserable-Second-Lead-Character.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Comedy   Romance   Xianxia   ",
	"tags": "Adapted to Manhua   Beasts   Beautiful Female Lead   Caring Protagonist   Cold Love Interests   Cultivation   Devoted Love Interests   Doting Love Interests   Dragons   Family Conflict   Fast Cultivation   Female Protagonist   Gods   Handsome Male Lead   Heavenly Tribulation   Love Interest Falls in Love First   Magic   Older Love Interests   Power Couple   Slow Romance   Strong Love Interests   Time Loop   Time Manipulation   Time Travel   Tragic Past   Transmigration   Transported to Another World   Weak to Strong   Wealthy Characters   ",
	"rating": "(4.5 / 5.0, 57 votes)",
	"author": "September Flowing Fire   九月流火   ",
	"year": "\n2020",
	"ranking": "#4617   #4832   #5770   #8806   #5873   ",
	"reviewcount": "20 Reviews sorted by",
	"description": "Luo Han read a xianxia novel in which everyone is in love and sacrifices everything for love. Later, she was summoned and transmigrated into the book. She then learned that she was actually the incarnation of the Heavenly Law in the novel.\n\nIn the later part of the novel, the protagonists waged war for love and almost destroyed the world. In order to save herself, she had to embark on the journey to save the world. The best way to stop the war was to prevent the blackening of the second male lead character.\n\nLing Qingxiao, the second male character, was the most beautiful and strong yet miserable in the entire book. He was originally the legal son, but was exchanged with the illegitimate son, the male lead. Ling Qingxiao grew up as an illegitimate son and suffered from extensive abuses. Later, their identity was revealed, but his biological mother and adoptive mother all protected the male lead, and even the female lead stabbed Ling Qingxiao fatally for the male lead.\n\nLing Qingxiao fell into the abyss with a slight chance of survival, he literally crawled back from hell. From then on, he blackened and thoroughly dominated the whole world.\n\nIt was too late when Luo Han transmigrated, Ling Qingxiao had fallen into the abyss. She could only rescue Ling Qingxiao and talk to him about truth, kindness and beauty every day, trying to get him to do a good job in his career and not to fall in love.\n\nLater… Ling Qingxiao indeed did a good job in his career, unifying the six realms, dominating heaven and earth, yet she was detained.\n\n“I heard that if someone wants a child, they need to plead a wish to the Heavenly Law?”\n\n“I want to stay together for a long time, with generations of offspring filling the house. I don’t know whether Heavenly Law will allow it or not.”\n\n******\n\nLuo Han was the incarnation of the consciousness of the Heavenly Law. In the six realms, she could hear all kinds of swearing to heaven every day. Such as–\n\nThe original male lead: “The Heavenly Law is not fair, I want to go against the heaven!”\n\nLuo Han: Don’t be a scam, I don’t even know who you are.\n\nSome random male character: “If anyone under the heaven dares to bully her, I will kill everyone in the world!”\n\nLuo Han: What did you say? Say that again?!\n\nThe beautiful and strong yet miserable second lead character: “I only wish my heaven to be safe, happy, in good health, and well.”\n\nYou are the only thing I want in my whole life.>"
}