{
	"url": "https://www.novelupdates.com/series/im-8-million-poor/",
	"title": "I’m 8 Million Poor - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/07/Im.jpg",
	"noveltype": "N/A",
	"genre": "Comedy   Josei   Romance   ",
	"tags": "Beautiful Female Lead   Businessmen   Celebrities   Cold Love Interests   Cute Protagonist   Female Protagonist   Handsome Male Lead   Love Interest Falls in Love First   Modern Day   Showbiz   Transmigration   Wealthy Characters   ",
	"rating": "(4.0 / 5.0, 29 votes)",
	"author": "青镜里   ",
	"year": "\n2019",
	"ranking": "#2000   #2000   #7017   #8230   #7929   ",
	"reviewcount": "8 Reviews sorted by",
	"description": "   In the cliché romance novel, “I‘ve been in love with you for a million years”, Jiang Baiyun, a second generation rich female villainess, committed suicide after her family went bankrupt. When she died, all she had left was a bank card with $8 million in it and a small villa in her name…\r\n\r\n    The white-collar worker Jiang Baiyun woke up to find herself transmigrated as that rich second generation who had just began to swallow sleeping pills!\r\n\r\n   And when she checked the number in the bank card, the newly transmigrated bankrupt rich girl almost fainted with excitement…\r\n\r\n   God! Eight Million! I’m rich!\r\n\r\n   As the big BOSS who controls the lifeline of the global economy, Ji Chen feels that life is not challenging. \r\n\r\n   He watched on with indifference as the Jiang family went bankrupt. He could even watch his former fiancée Jiang Baiyun, whom he had never met, live on the streets because of the bankruptcy and it wouldn’t cause any ripples in his cold heart.\r\n\r\n   Until one day, Ji Chen saw his former fiancée walking down the street, treating an LV as a fish basket while chewing on a fruit pancake in her hand. \r\n\r\n……How can this woman be so leisurely!\r\n\r\n1-\tHilarious writing, the author’s logic is dead\r\n2-\tThe woman is responsible for being handsome and dashing, the man is responsible for being funny. [not]\r\n3-\tIt’ll involve the entertainment industry, but the main character is a mudslide.\r\n>"
}