{
	"url": "https://www.novelupdates.com/series/its-actually-not-easy-wanting-to-be-a-supporting-male-lead/",
	"title": "It’s Actually Not Easy Wanting to be a Supporting Male Lead - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/04/cover-mijia-Its-Actually-Not-Easy-Wanting-to-be-a-Supporting-Male-Lead.jpg",
	"noveltype": "(CN)",
	"genre": "Adult   Adventure   Comedy   Drama   Fantasy   Historical   Romance   Tragedy   Yaoi   ",
	"tags": "Acting   Alternate World   Ancient China   Animal Characteristics   Appearance Changes   Beast Companions   Beasts   Bestiality   Black Belly   Cultivation   Dense Protagonist   Devoted Love Interests   Engagement   Episodic   Fantasy World   First-time Interc**rse   Futuristic Setting   Game Elements   Gamers   Handsome Male Lead   Hard-Working Protagonist   Love Interest Falls in Love First   Male Yandere   Manipulative Characters   Misunderstandings   Modern Day   Multiple Realms   Non-humanoid Protagonist   Obsessive Love   Omegaverse   Possessive Characters   Post-apocalyptic   Royalty   R*pe   Showbiz   Strong Love Interests   System Administrator   Transmigration   Unconditional Love   World Hopping   World Travel   Yandere   Zombies   ",
	"rating": "(4.0 / 5.0, 629 votes)",
	"author": "mijia   ",
	"year": "\n2018",
	"ranking": "#3802   #3733   #461   #380   #273   ",
	"reviewcount": "116 Reviews sorted by",
	"description": "In this period where countless supporting lead actors always attempt to counterattack, turn over a new leaf or simply refuse to take up the role, his purpose of existing is to fill the role of a good supporting male lead and uphold his duty to the best of his ability. To add the needed lustre to storylines and this world. Only, it’s a pity that even those unafraid of god-like enemies will be afraid of pig-like teammates.\n\nBitterly, he realises that for some unfathomable reason, he is being bothered time and again by a bastard who refuses to follow the script… \n\nIn order to walk the path of a good supporting male lead, he engages in a battle of wits and courage with that person. Loving each other and killing each other, one ultimately cannot escape fate’s teasing– why is it so difficult wanting to be a responsible and diligent supporting male lead?! QAQ>"
}