{
	"url": "https://www.novelupdates.com/series/even-so-we-are-living-in-the-present/",
	"title": "Even So, We Are Living in the Present - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/03/Even-so-we-are-living-in-the-present.jpg",
	"noveltype": "(JP)",
	"genre": "Drama   Psychological   School Life   Yaoi   ",
	"tags": "Androgynous Characters   Brother Complex   Childhood Friends   College/University   Complex Family Relationships   Dark   Death of Loved Ones   Incest   Living Alone   Modern Day   Multiple Protagonists   Possessive Characters   R-15   R*pe   Shoujo-Ai Subplot   Shy Characters   Tsundere   Younger Brothers   ",
	"rating": "(3.4 / 5.0, 13 votes)",
	"author": "Kaname   枢   ",
	"year": "\n2021",
	"ranking": "#2000   #2000   #10010   #11529   #10766   ",
	"reviewcount": "2 Reviews sorted by",
	"description": "Ichinose Kyosuke is in his second year of high school. He is taciturn and proficient in both literary and military arts. Although he may seem to be a perfect person at first glance, he is dealing with a circumstance that nobody else can grasp. That is a matter that he doesn’t want anyone to interfere with. Therefore, he is averse to forming deep bonds with others.\n\nWith the exception of his childhood friend, Yuu​───\n\nOn that day, there were dark clouds hanging in the sky. The sky was gray and it seemed as if it would be raining. Kyosuke hastily made his way home.\n\nAt night, he received a call from a friend.\n\n“Ichinose! Sonohara is…!”\n\nThe call was promptly disconnected, possibly due to radio interference.\n\n──What exactly has happened to Yuu?\n\nFeeling a vague sense of uneasiness, Kyosuke stormed out of the house ────\n\nWithin the world, there exist various kinds of people, who have accumulated a wide range of experiences and are advancing towards their future, each choosing their own path.\n\nOne’s future is a relic of the past that one has amassed. The present is also shifting into the past, and the past is a relic of the present, which is the future. We, humans, live in the present, choosing our choices.\n\nHowever, even though we seem to have the freedom to choose, there are times when we are compelled to make choices in the present. Even if one is heading for a bright future, the eventual outcome is never assured. Sometimes the future, which was previously bright, is abruptly struck by darkness.\n\nNevertheless, we are neither living in the past nor the future, but in the undisputed “present”. Whether one halts or looks back, one must eventually face forward and move on.\n\nThis is the story of Kyosuke, the protagonist, and other high school students who live in the invisible time known as the present.>"
}