{
	"url": "https://www.novelupdates.com/series/if-i-cant-be-your-wife/",
	"title": "If I Can’t Be Your Wife - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/12/If-I-Cant-Be-Your-Wife.jpg",
	"noveltype": "(KR)",
	"genre": "Drama   Fantasy   Romance   ",
	"tags": "Aristocracy   Arrogant Characters   Beautiful Female Lead   Cold Love Interests   Empires   European Ambience   Fairies   Female Protagonist   Handsome Male Lead   Hidden Abilities   Hiding True Identity   Maids   Marriage   Marriage of Convenience   Misunderstandings   Mysterious Family Background   Mysterious Illness   Obsessive Love   Personality Changes   Possessive Characters   Pregnancy   Royalty   R*pe   Second Chance   Secret Identity   Stoic Characters   Tragic Past   ",
	"rating": "(3.2 / 5.0, 72 votes)",
	"author": "Park Rokjoo   박록주   ",
	"year": "\n2021",
	"ranking": "#3133   #3778   #3866   #4001   #4781   ",
	"reviewcount": "13 Reviews sorted by",
	"description": "I married him because of a one-night mistake.\r\n\r\n'I'll give you the position of Duchess. But nothing more.'\r\n\r\n\r\nAt first, I was relieved by the cold eyes, but as time passed, my expectations grew.\r\n\r\n\r\nThinking about it now, it was a vain hope that one day he will look back at me.\r\n\r\n\r\n-\r\n\r\n\r\n“Are you coming back today?”\r\n“Why are you curious about that?”\r\n\r\nDuke Walten looked at Kathleen with expressionless eyes.\r\n\r\n“Do you want me to come back and be by your side?”\r\n“… Yes, I wish you would.”\r\n\r\n\r\nAt her brave words, he laughed out loud. He wrapped his arms around her waist and pulled her closer and whispered.\r\n\r\n\r\n“Then, like a contract marriage, give birth to an heir first.”\r\n\r\nKnowing that she couldn't...\r\nKathleen couldn't contain her tears and pushed him away.\r\nHe turned around expressionlessly, even as he saw her tear-soaked face. She looked at her husband and thought.\r\n\r\n\r\n'If I can't really be your wife,\r\nThen I really have to leave now.'>"
}