{
	"url": "https://www.novelupdates.com/series/addicted-to-boundlessly-pampering-you/",
	"title": "Addicted to Boundlessly Pampering You - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/03/165373.jpg",
	"noveltype": "(CN)",
	"genre": "Drama   Harem   Historical   Josei   Mature   Romance   Wuxia   ",
	"tags": "Age Progression   Ancient Times   Assassins   Beautiful Female Lead   Business Management   Calm Protagonist   Childhood Love   Devoted Love Interests   Doctors   Doting Love Interests   Doting Older Siblings   Female Protagonist   Genius Protagonist   Handsome Male Lead   Hiding True Identity   Incest   Love Interest Falls in Love First   Love Triangles   Male Yandere   Medical Knowledge   Modern Knowledge   Murders   Older Love Interests   Persistent Love Interests   Poisons   Politics   Polyandry   Possessive Characters   Reincarnation   Reverse Harem   Sister Complex   Stockholm Syndrome   Strong Love Interests   Time Skip   Transmigration   Twins   Unconditional Love   ",
	"rating": "(3.9 / 5.0, 103 votes)",
	"author": "Jing Lan   景兰   ",
	"year": "\nN/A",
	"ranking": "#5262   #4193   #3214   #3541   #3125   ",
	"reviewcount": "18 Reviews sorted by",
	"description": "The enchanting and beautiful big brother’s mouth lifted up into a demonic smile, spitting out cruel and sorrowful words. “Take it out, don’t leave an intact corpse!”\r\n\r\nThe cold second brother with the icy eyes continuously bled alongside the dying and suffering man.\r\n\r\nTheir eyes were purple and enchanting. They were this world’s devils, banished by the people.\r\n\r\nWhen they gained strength, they retaliated by destroying the heavens and exterminating the earth.\r\n\r\nShe was a girl who mistakenly entered another world. She’s their salvation and is the only one that must be obtained at all costs.\r\n\r\nOverbearingly possessive and absolutely unrestrained indulgent pampering as long as she stayed by their side.\r\n\r\nA gentle as jade man, a faint and dedicated guard.\r\n\r\nThere were those who liked it silent.\r\n\r\nWhat is the type of love?>"
}