{
	"url": "https://www.novelupdates.com/series/bluebird-lady-and-the-white-lion-family/",
	"title": "Bluebird Lady and The White Lion Family - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/08/Bluebird-Lady-and-The-White-Lion-Family.jpeg",
	"noveltype": "(KR)",
	"genre": "Fantasy   Romance   ",
	"tags": "Age Progression   Arranged Marriage   Beasts   Child Protagonist   Childhood Friends   Childhood Love   European Ambience   Female Protagonist   Handsome Male Lead   Late Romance   Marriage   Misunderstandings   Reincarnation   Shapeshifters   Villainess Noble Girls   ",
	"rating": "(4.0 / 5.0, 40 votes)",
	"author": "김로니   ",
	"year": "\n2021",
	"ranking": "#3133   #2885   #4754   #5746   #3704   ",
	"reviewcount": "2 Reviews sorted by",
	"description": "In a 19-gold-waste novel, I possessed the character of villainess.\n\nSophina, the bluebird and former wife of the white lion male lead, who was obsessed with him and was thrown away.\n\nA character who was stoned to death because of angry public sentiment?\n\n‘Let’s get a divorce after grazing enough!’\n\nAs a result of my efforts, I became friends with the male lead instead of obsessing with him.\n\nIn the meantime, I became close to my mother-in-law and other family members of the male lead, and I gained recognition from helping in managing the estate, and my business also became a big hit!\n\nEverything was perfect.\n\nIt’s time for the male lead who went to war to bring the heroine, so all he has to do is divorce me now.\n\nBut the problem was…\n\n“I don’t want to divorce.”\n\nIt was because he became so attached.\n\nMaybe I have arrhythmia? My heart kept beating fast or it seems I’m a bit excited?\n\nSo I was thinking of seducing the male lead…\n\n***\n\n“While I was away from the mansion for a while, I guessed you were thinking of running away from me.”\n\nRicardo’s dangerous and low voice, unlike his beautiful childish voice from my memory, rang in my ears.\n\nIt seems that the male lead, who has grown up as a sexy adult, has a useless misunderstanding.\n\nAnd…\n\n“Don’t leave, and don’t pretend that you don’t know me if you happen to throw away your husband.”\n\n“This brother-in-law would educate his  ugly brother. Please just don’t leave.”\n\n“Okay, well thought out. Just live with me!”\n\nEven my in-laws misunderstood and kept clinging to me.\n\nWhy does everyone keep misunderstanding?\n\nExcuse me. I wasn’t thinking of getting divorced?>"
}