{
	"url": "https://www.novelupdates.com/series/after-the-full-level-boss-entered-the-infinite-game-by-mistake/",
	"title": "After the Full-Level Boss Entered the Infinite Game By Mistake - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/08/After-the-FullLevel-Boss-Entered-the-Infinite-Game-By-Mistake.jpg",
	"noveltype": "(CN)",
	"genre": "Horror   Mystery   Romance   Supernatural   Yaoi   ",
	"tags": "Androgynous Characters   Calm Protagonist   Cunning Protagonist   Game Ranking System   Gods   Monsters   Mystery Solving   Possessive Characters   Protagonist Strong from the Start   R*pe   Special Abilities   Strength-based Social Hierarchy   Strong to Stronger   Survival Game   Transported to Another World   Underestimated Protagonist   Unlimited Flow   Unlucky Protagonist   ",
	"rating": "(4.0 / 5.0, 31 votes)",
	"author": "牧白   ",
	"year": "\n2021",
	"ranking": "#255   #140   #4623   #187   #4669   ",
	"reviewcount": "5 Reviews sorted by",
	"description": "Bai Lixin was caught in a strange game.\n\n[Ding! Welcome players to the immersive escape game.]\n[Ding! Let’s begin the luck detection. The luck will be linked to the player’s copy selection.]\nAs the other players’ tests were A,B,B..the detection system slowly pulsed on Bai Lixin’s head.\n\n[Ding! Congratulations player; your luck is F-, and the universe deems you unlucky!]\n[Ding! Congratulations to the player. You have obtained the special title – “God of Bad Luck” (unique).]\nBai Lixin: “???”\n\nCongratulations? Where’s the joy in that?\n\nSoon after, the players trapped in the escape game found that there was an incredibly beautiful but tragic player in the game.\n\nThe face is unbelievable, the strength is unbeatable, but the luck is so bad that the copy he gets either has a bug or is a horror S level.\n\nJust when everyone thought that the little beauty would certainly die, he broke through countless levels and embarked on the road to immortality.\n\nBai Lixin, the full-level boss, mistakenly strayed into a strange game to find his husband.\n\nLater, he found that his old attacker had become all kinds of bosses in the copy and these big bosses were most often not human.\n\nA water body, true ancestor of the vampire clan, an undead knight, a dragon….\n\nWell, he had to admit that each had its own advantages>"
}