{
	"url": "https://www.novelupdates.com/series/tondemo-skill-de-isekai-hourou/",
	"title": "Tondemo Skill de Isekai Hourou Meshi - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2017/02/17-26-01-12.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Comedy   Fantasy   Seinen   Slice of Life   ",
	"tags": "Adapted to Drama CD   Adapted to Manga   Adventurers   Beast Companions   Cheats   Comedic Undertone   Cooking   Cowardly Protagonist   Dense Protagonist   Easy Going Life   Familiars   Game Elements   Goddesses   Gods   Guilds   Male Protagonist   Management   Merchants   Monsters   Multiple Transported Individuals   Naive Protagonist   R-15   S*aves   Special Abilities   Summoned Hero   Sword And Magic   Transported to Another World   Weak Protagonist   ",
	"rating": "(3.7 / 5.0, 413 votes)",
	"author": "Eguchi Ren   江口連   ",
	"year": "\n2016",
	"ranking": "#49   #81   #136   #79   #149   ",
	"reviewcount": "80 Reviews sorted by",
	"description": "I, Mukouda Tsuyoshi, was caught up in a summoning circle into a different world where sword and magical skills are the norm.\n\nHowever, when the summoners cast ‘Status Appraisal’ on us, the three other people who were summoned with me had [Heroes from Another World] in the occupation box, whereas I was the [Random Guy Caught Up in the Summoning Spell].\n\nAs for our ‘Skill Set’, the three Heroes had outrageous sounding skills rolling after their names like [Holy Sword Technique], [Holy Spear Technique] and [Sacred Magic].\n\nIn fact, I too have a skill you know? My one skill is called… [Net Super]…\n\nBecause it’s clearly not a combat skill, I am automatically treated like garbage.\n\nFurthermore, the King of the country who had summoned us looked really shady.\n\nAs a veteran lightnovel reader, I can read the atmosphere well enough to come to the conclusion that ‘This is a bad world to be summoned into’.\n\nThus, it is decided. No matter what, I must get out of this castle as soon as possible and escape from this rotten country!>"
}