{
	"url": "https://www.novelupdates.com/series/the-max-leveled-princess-is-bored-today-as-well/",
	"title": "The Max-Leveled Princess is Bored Today As Well - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/01/The-MaxLeveled-Princess-is-Bored-Today-As-Well.jpg",
	"noveltype": "(KR)",
	"genre": "Action   Comedy   Fantasy   Romance   Slice of Life   ",
	"tags": "Adapted to Manhwa   Age Progression   Apathetic Protagonist   Aristocracy   Beautiful Female Lead   Bickering Couple   Calm Protagonist   Carefree Protagonist   Charismatic Protagonist   Child Protagonist   Childhood Friends   Clever Protagonist   Cold Protagonist   Comedic Undertone   Coming of Age   Dense Protagonist   Devoted Love Interests   Doting Older Siblings   Doting Parents   European Ambience   Familial Love   Family   Famous Protagonist   Fearless Protagonist   Female Protagonist   First Love   Former Hero   Harsh Training   Kingdoms   Lazy Protagonist   Low-key Protagonist   Loyal Subordinates   Master-Disciple Relationship   Nobles   Past Plays a Big Role   Power Couple   Previous Life Talent   Protagonist Strong from the Start   Reincarnation   Royalty   Slow Romance   Smart Couple   Strong Love Interests   Student-Teacher Relationship   Sword Wielder   Teachers   Time Skip   Tomboyish Female Lead   Tsundere   Twins   Underestimated Protagonist   Wealthy Characters   ",
	"rating": "(4.2 / 5.0, 53 votes)",
	"author": "Royal B   로열B   ",
	"year": "\n2019",
	"ranking": "#1614   #1440   #4524   #2257   #4366   ",
	"reviewcount": "8 Reviews sorted by",
	"description": "Dante Renatus, who took the throne with her excellent swordsmanship skill,\n\nis reincarnated as ‘Helena’, the daughter of Duke Peresca, 500 years later.\n\n‘The second life I don’t want.\n\nI’ve enjoyed everything I’ve had in my previous life, and I’ve tried everything I could do.\n\nBeing reborn is just cumbersome and everything is boring.’\n\nMeanwhile, Prince Caesar visits the duke’s residence to avoid a power struggle.\n\nHelena, who recognizes Caesar’s talent, decides to become his swordsmanship teacher.\n\n“I will make you emperor.”\n\nShe started it just to appease her boring life, using the skills of her previous life to train younger student…\n\n“If it is for Master’s sake, I can destroy this world as well.”\n\n‘To like is to like, but somehow, it seems like he likes me too much?’>"
}