{
	"url": "https://www.novelupdates.com/series/how-the-male-lead-treats-the-terminally-ill-young-lady/",
	"title": "How the Male Lead Treats the Terminally-ill Young Lady - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/09/How-the-Male-Lead-Treats-the-Terminallyill-Young-Lady.jpg",
	"noveltype": "(KR)",
	"genre": "Comedy   Fantasy   Romance   Shoujo   ",
	"tags": "Beautiful Female Lead   Betrayal   Calm Protagonist   Charming Protagonist   Cold Love Interests   Contracts   Curses   Doting Love Interests   Engagement   European Ambience   Family Conflict   Female Protagonist   Handsome Male Lead   Limited Lifespan   Magic   Magical Technology   Nobles   Schemes And Conspiracies   Transmigration   Wealthy Characters   ",
	"rating": "(3.7 / 5.0, 38 votes)",
	"author": "Saesil   새실   ",
	"year": "\n2020",
	"ranking": "#5262   #4873   #6265   #5750   #5351   ",
	"reviewcount": "4 Reviews sorted by",
	"description": "She was possessed by the novel's extra 'Yvette Blanche'.\r\n\r\nA curse was placed on her, one that 'caused death if a person didn't meet their fated one by their twentieth anniversary'.\r\n\r\nHowever, in the end, she possessed this extra a week before her twentieth anniversary, and it was already the day before. \r\n\r\nSince I'm going to die, it'd be better to pass out drinking...\r\n\r\nThe morning on her birthday shone brightly, and Yvette lived on.\r\n\r\n~\r\n\r\n'Are you awake?'\r\n\r\nAn unknown man's voice could be heard from behind her back.\r\n\r\n'Last night, you attacked me.”\r\n\r\nDespite his shocking words, Yvette rushed to the bathroom, more concerned whether she survived because of this man.\r\n\r\nThe curse flower tattoo on her back bloomed.\r\n\r\nWhich means this man was destined to be her partner!\r\n​\r\n'Noelle, you're a nobleman, aren't you?'\r\n\r\n'I never thought someone wouldn't recognize the face of Duke Averon.'\r\n\r\nWhat? This guy is the main character in the novel?!\r\n\r\nI can't believe I, a mere extra, attacked the male protagonist...\r\n\r\n'If you're looking for a person, could we indulge in physical contact for a few minutes?'\r\n\r\nBut original or whatnot, I'll have to live first!\r\n\r\nWill Yvette survive the curse?>"
}