{
	"url": "https://www.novelupdates.com/series/survive-as-the-villains-cousin/",
	"title": "Survive As the Villain’s Cousin - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/05/Survive-As-the-Villains-Cousin.jpeg",
	"noveltype": "(KR)",
	"genre": "Adult   Fantasy   Romance   Smut   ",
	"tags": "Abandoned Children   Aristocracy   Caring Protagonist   Childcare   Cousins   Cute Children   European Ambience   Familial Love   Female Protagonist   Handsome Male Lead   Mob Protagonist   Nobles   Obsessive Love   Previous Life Talent   R-18   Reincarnated in Another World   Reincarnation   Villainess Noble Girls   ",
	"rating": "(3.8 / 5.0, 37 votes)",
	"author": "신록보다푸른   ",
	"year": "\n2019",
	"ranking": "#4617   #3331   #5262   #3074   #3065   ",
	"reviewcount": "5 Reviews sorted by",
	"description": "The criminal who appeared in the novel and turned the villain evil!\n\nWho would’ve known I would be reincarnated as her?\n\nI took a deep sigh and made a resolution.\n\n‘Let’s raise the twins with love to prevent them from turning evil!’\n\nHowever, after seeing the twins, the villains of this novel, sleeping peacefully in a cradle, I felt healed.\n\n‘Alright. No matter what, let’s all live in the Duke’s house together...’\n\nI won’t care about the novel, and get along with the twins, but the sub-male lead who shouldn’t have gotten involved is starting to get obsessed with me!\n\n                                                                                                                ***\n\n“……Why are you avoiding me?”\n\nSirius’ pink eyes shone in the moonlight.\n\nI was so fascinated by his eyes that I couldn’t answer right away.\n\n“Is it because I’m cursed?”\n\nThe husky voice sounded sorrowful.\n\nI had to say that it wasn’t, but strangely, no sound came out of my mouth.\n\nIt was true I avoided you, but it was for your sake.\n\n“Are you running away from me? You were the one who showed me the light, and now you’re scared?”\n\nAlthough he spoke politely, his eyes were that of a beast who was looking for his prey.\n\nI instinctively felt that he wasn’t putting up a pretense like usual. He was being serious. The feelings that came from my heart were hitting me honestly.\n\n“Please, please, don’t take another step back. I don’t know how much more I can take.”\n\nAh. Where did I go wrong?\n\nI just tried to stop the villain from turning evil, but why did the sub-male lead become black?>"
}