{
	"url": "https://www.novelupdates.com/series/abandoned-bastard-of-the-royal-family/",
	"title": "Abandoned Bastard of the Royal Family - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/04/Abandoned-Bastard-of-the-Royal-Family_1617415702.jpg",
	"noveltype": "(JP)",
	"genre": "Adult   Adventure   Ecchi   Fantasy   Harem   Mature   Romance   Seinen   ",
	"tags": "Abandoned Children   Adapted to Manga   Adventurers   Aristocracy   Charismatic Protagonist   Charming Protagonist   Clever Protagonist   Confident Protagonist   Different Social Status   Fantasy Creatures   Fantasy World   First-time Interc**rse   Harem-seeking Protagonist   Knights   Lucky Protagonist   Male Protagonist   Mercenaries   Nudity   Or*y   Outdoor Interc**rse   Overpowered Protagonist   Perverted Protagonist   Polygamy   Protagonist Strong from the Start   R-18   Reincarnation   Royalty   Strong Love Interests   Strong to Stronger   Sword And Magic   Sword Wielder   ",
	"rating": "(2.9 / 5.0, 60 votes)",
	"author": "Ikuhito   イクヒト   ",
	"year": "\n2017",
	"ranking": "#789   #502   #2723   #2420   #3369   ",
	"reviewcount": "3 Reviews sorted by",
	"description": "Schild was raised as a bastard, not knowing the identity of his father.\n\nBecause of his mother persistently keeping the secret of his identity, he and his mother were looked down on with contempt in the village. Harsh treatment and cold eyes followed them one after the other, and Schild, who was constantly treated that way, grew up to be a bad, yet a tough child. Out of patience for his misbehavior, however, many of the villagers started to encourage Schild’s mother to marry, and when he was 13 years old, her mother decided she couldn’t take it anymore and finally joined the arms of another man.\n\nAfter remarrying, her mother’s new partner declared that has no intention of feeding Schild. Because of this, he was forced to leave the village, also by the unanimous decision by the villagers.\n\nFinding that she could no longer have any backing to remove their decision to evict Schild, adding the tiredness of the tribulations she had with the child, his mother gave him a sword before leaving, the only clue of his father’s identity.\n\n“This was a keepsake given to me by your father. He told me to give it to you when you grow up.\n\nTake this sword to the royal capital. Your father is there. Once you deserve his qualifications, you will naturally meet him, eye to eye.”\n\nWill he be on time to meet his father? What will happen to him right after? Schild’s adult life in the royal capital begins now!>"
}