{
	"url": "https://www.novelupdates.com/series/a-record-of-a-mortals-journey-to-immortality/",
	"title": "A Record of a Mortal’s Journey to Immortality - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2015/09/record-of-mortal-cultivating-to-immortal.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Mature   Seinen   Xianxia   ",
	"tags": "Adapted to Anime   Adapted to Manhua   Age Progression   Alchemy   Androgynous Characters   Appearance Different from Actual Age   Artifacts   Average-looking Protagonist   Beast Companions   Beautiful Female Lead   Body Tempering   Calm Protagonist   Cautious Protagonist   Character Growth   Clever Protagonist   Crafting   Cultivation   Dao Companion   Demons   Dragons   Eidetic Memory   Elemental Magic   Eye Powers   Famous Protagonist   Hard-Working Protagonist   Heavenly Tribulation   Hiding True Abilities   Immortals   Inheritance   Loner Protagonist   Long Separations   Lucky Protagonist   Magic Formations   Male Protagonist   Marriage   Mature Protagonist   Multiple Realms   Multiple Reincarnated Individuals   Older Love Interests   Phoenixes   Pill Based Cultivation   Pill Concocting   Polite Protagonist   Pragmatic Protagonist   Protagonist with Multiple Bodies   Puppeteers   R*pe Victim Becomes Lover   Romantic Subplot   R*pe   Schemes And Conspiracies   Secretive Protagonist   Slow Growth at Start   Soul Power   Souls   Spirit Advisor   Strength-based Social Hierarchy   Sword Wielder   Time Skip   Wars   Weak to Strong   World Travel   ",
	"rating": "(4.0 / 5.0, 820 votes)",
	"author": "Wang Yu   忘语   ",
	"year": "\n2007",
	"ranking": "#4080   #980   #73   #82   #234   ",
	"reviewcount": "142 Reviews sorted by",
	"description": " A poor and ordinary boy from a village joins a minor sect in Jiang Hu and becomes an Unofficial Disciple by chance. How will Han Li, a commoner by birth, establish a foothold for himself in his sect? With his mediocre aptitude, how will he successfully traverse the path of cultivation and become an immortal? \n\nThis is a story of an ordinary mortal who, against all odds, clashes with devilish demons and the ancient celestials in order to find his own path to immortality. >"
}