{
	"url": "https://www.novelupdates.com/series/my-legend-still-exists-in-the-cultivation-world/",
	"title": "My Legend Still Exists in the Cultivation World - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2018/08/My-Legend-Still-Exists-in-the-Cultivation-World.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Comedy   Shounen Ai   Xianxia   ",
	"tags": "Confident Protagonist   Cultivation   Death   Demons   Devoted Love Interests   Famous Protagonist   Fast Cultivation   Heavenly Tribulation   Hiding True Identity   Loyal Subordinates   Magic Formations   Manly Gay Couple   Multiple Realms   Overpowered Protagonist   Past Plays a Big Role   Pets   Popular Love Interests   Power Couple   Previous Life Talent   Reincarnation   Romantic Subplot   Slow Romance   Strong Love Interests   Sword And Magic   Sword Wielder   Time Travel   ",
	"rating": "(4.3 / 5.0, 91 votes)",
	"author": "Li Siwei   李思危   ",
	"year": "\n2017",
	"ranking": "#2594   #2504   #2181   #4194   #2097   ",
	"reviewcount": "18 Reviews sorted by",
	"description": "Centuries ago, Daoist Jing Yuan died from lightning. A millennium later, he comes back to life, but discovers that the stars have shifted and the world has transformed by leaps and bounds.\n\nMarketplace: Selling herbs for 10 coppers each, alleviates fevers and detoxifies, reduces swelling and relieves pain.\n\nJing Yuan: Isn’t this the main precious herb used for Foundation Establishment Pills?\n\nAuction house: Advanced level cultivation method starting at 30,000 spirit-stones!\n\nJing Yuan: Isn’t this the tr*shiest cultivation method you could find anywhere on the streets?\n\nArt gallery: “The 100 Influential Figures of the Cultivation World”\n\nJing Yuan: Aren’t these my good friends A, B, C, D and old enemies 1, 2, 3, 4?\n\nBookstore: “Jing Yuan: A Biography“, “Memoirs of Jing Yuan“, “An Intro to Daoist-Master Jing Yuan’s Legendary Life“, “Honored Master Jing Yuan Teaches You How to Guide Qi into the Body“, “The Seven Habits of Founder Jing Yuan”\n\nJing Yuan: ?? Isn’t this me? Wait, when did I gain seven habits?\n\nThe companions he once journeyed with have long passed away, and not even 1/10 of the formerly glorious cultivation legacies remain. Yet, in this world without him, his legend still exists. This kind of feeling, is a bit embarrassing…>"
}