{
	"url": "https://www.novelupdates.com/series/i-only-lived-for-three-chapters-in-a-campus-romance-novel/",
	"title": "I Only Lived For Three Chapters In A Campus Romance Novel! - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/08/8CFD9E03-921A-4D0F-A466-78C113901B36.jpeg",
	"noveltype": "(CN)",
	"genre": "Comedy   Romance   School Life   Shounen Ai   ",
	"tags": "Arrogant Characters   Brother Complex   Calm Protagonist   Carefree Protagonist   Chuunibyou   Dense Protagonist   Devoted Love Interests   Doting Love Interests   Doting Older Siblings   Doting Parents   Handsome Male Lead   Hard-Working Protagonist   Heartwarming   Love Interest Falls in Love First   Misunderstandings   Mob Protagonist   Modern Day   Popular Love Interests   Possessive Characters   Transmigration   Wealthy Characters   ",
	"rating": "(3.9 / 5.0, 90 votes)",
	"author": "Tang Shan Yue   糖山月   ",
	"year": "\n2019",
	"ranking": "#2731   #3402   #2665   #1487   #2261   ",
	"reviewcount": "25 Reviews sorted by",
	"description": "When Lin Shen transmigrated into a book he had no intention of flipping through, he found himself blocking the cute and peppy female lead in the back corner of the classroom.\n\nKabedon! (Wall slam!)\n\nBut he wasn’t the male lead!\n\nHe was just a scumbag bought by a vicious woman who wanted him to kiss and mol*st the female lead!\n\nHe still remembered that he only lived for three chapters in this book!\n\n1,000 words per chapter!\n\nThe page was about to be turned!\n\nHe was about to be kicked away by the male lead and become a tool armor to the heroic act of saving the beauty from a cannon fodder without a name!\n\nHe didn’t want to die ahhhh!!!\n\nLin Shen calmly looked down at the female protagonist and asked, “What is the coefficient of expansion of a positive cubic mass with a linear coefficient of expansion of α, when the amount of expansion is smaller?”\n\nThe female lead who never studied: “Eh?”\n\nThe male lead who was used to throwing money at people: “Huh?”\n\nLin Shen looked at the two of them and said, “You can’t even do a simple question, and you still have the heart to talk about love? I advise you to study, fellow students. This is the only way for you to improve yourself every day and become a qualified successor of socialism!”\n\nLater……..\n\nLin Shen was blocked in the back corner of the empty classroom.\n\nKabedon!\n\nThe school heartthrob, whose appearance and figure were off the charts, leaned over and blew into his ears: “I came first in the exam, do I count as a qualified boyfriend that can f*ck you every day?”\n\n“Scram!”>"
}