{
	"url": "https://www.novelupdates.com/series/supernatural-rebirth-genius-girl-diviner/",
	"title": "Supernatural Rebirth Genius Girl Diviner - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2017/12/8927s.jpg",
	"noveltype": "(CN)",
	"genre": "Fantasy   Josei   Romance   Supernatural   ",
	"tags": "Beautiful Female Lead   Daoism   Divination   Exorcism   Eye Powers   Familial Love   Female Protagonist   Feng Shui   Handsome Male Lead   Love Interest Falls in Love First   Modern Day   Older Love Interests   Poor to Rich   Reincarnation   Second Chance   Time Skip   Younger Sisters   ",
	"rating": "(4.0 / 5.0, 89 votes)",
	"author": "Yi Xi Xi   艾兮兮   ",
	"year": "\n2013",
	"ranking": "#6970   #2000   #2289   #8806   #2901   ",
	"reviewcount": "18 Reviews sorted by",
	"description": "In the previous life, she was a swindling charlatan who had neither learning nor skills and was beaten to death.\n\nUpon opening her eyes again, she had returned to when she was five years old. An impact from a clay Buddha opened her divine eyes, gave her photographic memory, astonishing talent, ability to view another’s past, able to sever the ties of disaster and fortune of life and death, a heaven defying rejuvenation technique, and a technique to recognize treasures.\n\nIn the last life, her family became ruined and she ended up a homeless wanderer.\n\nIn this life, she will defy heaven to change her fate and take back her happiness.\n\nIn the last life, she had nothing, had no education nor skills, was despised by others, and was looked at with indifference.\n\nIn this life, she exerts herself to become a real master of metaphysics, stands in the summit of the world, became a legend in the business world, sought after in the political circle, and a VIP of the underworld……\n\nThose who owe her, all will be given one’s due!\n\nHe, like a deity who shows disdain for the world not only treats her with familiarity but also guards her like a loyal dog.\n\nHer life became an unprecedented and unique existence.>"
}