{
	"url": "https://www.novelupdates.com/series/quick-transmigrating-second-female-leads-counterattack/",
	"title": "Quick Transmigrating Second Female Lead’s Counterattack - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2018/01/popo.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Comedy   Fantasy   Romance   Sci-fi   ",
	"tags": "Abandoned Children   Acting   Ancient China   Ancient Times   Appearance Changes   Beastkin   Beasts   Beautiful Female Lead   Calm Protagonist   Caring Protagonist   Celebrities   Clever Protagonist   Devoted Love Interests   Early Romance   Episodic   Female Protagonist   Gamers   Handsome Male Lead   Heartwarming   Interdimensional Travel   Love Interest Falls in Love First   Male Yandere   Marriage   Multiple Realms   Orphans   Possessive Characters   Power Couple   Pregnancy   Proactive Protagonist   Revenge   R*pe   Showbiz   Smart Couple   Strong Love Interests   System Administrator   Transmigration   Tribal Society   Unconditional Love   Vampires   Wealthy Characters   World Hopping   World Travel   Zombies   ",
	"rating": "(4.1 / 5.0, 520 votes)",
	"author": "Qing Luochen   倾落尘   ",
	"year": "\n2016",
	"ranking": "#1125   #4695   #272   #1050   #967   ",
	"reviewcount": "78 Reviews sorted by",
	"description": "After accidentally falling, she actually finds herself bound to a Second Female Lead Counter Attacking System!\n\nXun Mi: WTF is this?! (╯‵□′)╯︵┻━┻\n\nIn order to regain her memories and return to her original world, Xun Mi is forced to transmigrate to different worlds and complete missions. Fiancé stolen away? Abandoned by her family? Career ruined? Reputation slandered? No problem, I’ll just go and grab a golden thigh*, dominate the world, slap those trash scum across the face, and live true to the saying that evildoers have no worries!\n\nXun Mi: I just want to peacefully and quietly complete my missions and go.\n\nLoyal Puppy: I just want to peacefully and quietly go with you.\n\n*Note: grab a golden thigh: means to cling onto a rich or powerful person for support , usually used in a joking manner>"
}