{
	"url": "https://www.novelupdates.com/series/a-death-row-convict-teaches-at-a-school-of-magic/",
	"title": "A Death Row Convict Teaches at a School of Magic - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/09/A-Death-Row-Convict-Teaches-at-a-School-of-Magic.png",
	"noveltype": "(JP)",
	"genre": "Action   Fantasy   Horror   Mature   Psychological   School Life   Seinen   Supernatural   ",
	"tags": "Academy   Adapted to Manga   Antihero Protagonist   Apathetic Protagonist   Aristocracy   Assassins   Award-winning Work   Betrayal   Cannibalism   Cautious Protagonist   Charismatic Protagonist   Cold Protagonist   Crime   Criminals   Cruel Characters   Cunning Protagonist   Curious Protagonist   Death   Demons   Depictions of Cruelty   Dishonest Protagonist   Elemental Magic   European Ambience   Evil Protagonist   Fantasy Creatures   Fantasy World   Friends Become Enemies   Gore   Hidden Abilities   Hiding True Abilities   Hiding True Identity   Kidnappings   Magic   Magic Beasts   Magical Technology   Male Protagonist   Manipulative Characters   Multiple Identities   Multiple POV   Multiple Timelines   Murders   Non-linear Storytelling   Proactive Protagonist   R-15   Ruthless Protagonist   Schemes And Conspiracies   Secretive Protagonist   Serial Killers   Special Abilities   Teachers   Thriller   Torture   Transformation Ability   Transported to Another World   Twisted Personality   Unreliable Narrator   Wizards   ",
	"rating": "(3.5 / 5.0, 33 votes)",
	"author": "無道   ",
	"year": "\n2017",
	"ranking": "#2425   #2754   #7117   #3593   #9410   ",
	"reviewcount": "1 Review sorted by",
	"description": "As a human being, Kaneki Ryo was a broken man. Being a monster with rationality, he was finally apprehended one day and sentenced to death. From there, through twists and turns, he was now a teacher at a school of magic. After three years of teaching, his school life began to undergo a transition in the spring of his third year as a teacher when a prodigy princess enrolled at the school.\n\nThis is an action horror story that outright rejects the conventional school teacher story.>"
}