{
	"url": "https://www.novelupdates.com/series/the-green-teas-crushing-victories-in-the-70s/",
	"title": "The Green Tea’s Crushing Victories in the ’70s - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/04/The-Green-Teas-Crushing-Victories-in-the-s.jpg",
	"noveltype": "(CN)",
	"genre": "Drama   Fantasy   Romance   Slice of Life   ",
	"tags": "Beautiful Female Lead   Business Management   Child Abuse   Childcare   Clever Protagonist   Cold Protagonist   Complex Family Relationships   Confident Protagonist   Cooking   Cute Children   Doting Older Siblings   Familial Love   Female Protagonist   Handsome Male Lead   Hard-Working Protagonist   Heartwarming   Love Interest Falls in Love First   Nationalism   Overprotective Siblings   Past Trauma   Poor to Rich   Pregnancy   Reincarnation   Rich to Poor   Schizophrenia   Scientists   Shameless Protagonist   Time Skip   Transmigration   Weak to Strong   Wealthy Characters   ",
	"rating": "(4.4 / 5.0, 163 votes)",
	"author": "Yun ji jinxiu   云吉锦绣   ",
	"year": "\n2021",
	"ranking": "#32   #33   #957   #56   #1781   ",
	"reviewcount": "41 Reviews",
	"description": "Tong Xuelu had the nickname Queen of Green Tea. \n\nShe was stunning in look, has a shapely body, and had a lot of suitors though she had never been in any serious relationships. \n\nBy the time she was done being a green tea and was about to be a nice person, her retribution had caught up to her!\n\nShe had transmigrated into a book. In the 70s where materialistic goods were rare and she was a poor soul who was the fake daughter of a wealthy family!\n\nPer the story, she would be face slapped by the real daughter who was rebirthed, be married to an old man who had once been married, and finally die from domestic violence. \n\nTong XueLu: ……I’d rather continue to be a green tea. \n\nRaise three bosses of the future and be a salted fish that all she had to do was to lay around and wait for things to be handed to her [check]\n\nCheat her way into a government-ran restaurant and had good food every day. [check]\n\nUse her agility and wit to avoid being faceslapped by the real daughter. [check]\n\nAs far as an excellent green tea was concerned, she would be able to handle any scripts handed to her and still end up the winner.\n\n***\n\nWen Rugui, a physicist, was young, handsome and had his entire life ahead of him. He had, however, let his research distracted him from starting a family. \n\nAll of his bosses were eyeing him to become part of their family. \n\nUntil one day. \n\nWen Rugui brought a charming girl into his research facility and with love in his eyes. “This is my fiancee. We are here to report our upcoming matrimony.”\n\nHis bosses: Shocked beyond words.\n\nHis female colleagues: All heart broken. \n\nTong XueLu: Sorry, all. My charm is but a passive skill.>"
}