{
	"url": "https://www.novelupdates.com/series/cultivate-your-sister/",
	"title": "Cultivate Your Sister - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/11/102804_4482_54fc66a894e20379ddfe611d19abdbd1.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Comedy   Gender Bender   Martial Arts   Xuanhuan   ",
	"tags": "Abandoned Children   Age Progression   Alchemy   Alternate World   Appearance Changes   Arranged Marriage   Battle Competition   Beautiful Female Lead   Body Tempering   Cheats   Cross-dressing   Cultivation   Dao Companion   Fast Cultivation   Heavenly Tribulation   Hiding True Abilities   Hiding True Identity   Level System   Loli   Male Protagonist   Romantic Subplot   Shameless Protagonist   Shota   Transmigration   Transported to Another World   Trap   ",
	"rating": "(3.6 / 5.0, 46 votes)",
	"author": "7zip   ",
	"year": "\nN/A",
	"ranking": "#2000   #2000   #5997   #2674   #7912   ",
	"reviewcount": "3 Reviews sorted by",
	"description": "Ever since being taken into the sect, Xing Yun found that the Xianxia world he was in seemed a little different.\n\nFrom time to time, there would be disciples of the Fairy Maiden Peak racing each other in the sky on their swords, and they claimed to be a running-out-of-control tribe.\n\nThose disciples from the Refining Peak, who were known to be refining weapons, were said to be sending satellites to the sky the day after tomorrow; it seemed like they had already sent ten satellites.\n\nThe Homebody of the Sword Peak and the Normie of the Misty Peak would fight each other every three days. Whenever the two sides had many bumps on their heads, the doctors from the Miraculous Hand Peak, who wore white coats and claimed to have mastered their healing technique, would grab them for electrotherapy. It was said that after recovery, those disciples would complain to the sect, saying that they had been used as experimental mice again.\n\nThe disciples of Formless Peak seemed to have gotten into trouble again; it seemed like someone died because of their divination. The disciples of Thousand Spirits Peak were taking their spirit beasts to grind their teeth and look for trouble along the way…\n\nStrange events like this happened every day, even…\n\nAre those people really cultivators?!>"
}