{
	"url": "https://www.novelupdates.com/series/jujutsushi-wa-yuusha-ni-narenai/",
	"title": "Jujutsushi Wa Yuusha Ni Narenai - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2017/05/Jujutsushi-Wa-Yuusha-Ni-Narenai.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Fantasy   Mature   Psychological   Romance   Tragedy   ",
	"tags": "Alchemy   Androgynous Characters   Antihero Protagonist   Artifact Crafting   Betrayal   Character Growth   Clever Protagonist   Clingy Lover   Cunning Protagonist   Curses   Death   Depictions of Cruelty   Determined Protagonist   Devoted Love Interests   Divine Protection   Dolls/Puppets   Dungeons   Elemental Magic   Evil Gods   Fairies   Fantasy World   Fat to Fit   Game Elements   Goddesses   Gods   Gore   Hard-Working Protagonist   Healers   Heroes   Inferiority Complex   Leadership   Love Interest Falls in Love First   Magic Beasts   Magic Formations   Magical Space   Magical Technology   Male Protagonist   M*sturbation   Monsters   Multiple Transported Individuals   Murders   Near-Death Experience   Necromancer   Poisons   Ruthless Protagonist   Saints   Slow Growth at Start   Special Abilities   Spirit Users   Strategic Battles   Strategist   Strong Love Interests   Summoning Magic   Survival   Sword And Magic   Thieves   Transported to Another World   Underestimated Protagonist   Weak Protagonist   Yandere   ",
	"rating": "(3.9 / 5.0, 278 votes)",
	"author": "Hishi Kage Dairi   菱影代理   ",
	"year": "\n2016",
	"ranking": "#1805   #1393   #1008   #3039   #1069   ",
	"reviewcount": "45 Reviews sorted by",
	"description": "On that day, due to the outbreak of an unprecedented and abnormal event, 41 students from class 2-7 of Shiromine Academy are summoned to a different world, one full of magic.\r\n\r\nSeparated and summoned inside a vast dungeon, where the only way to escape is to head to the deepest area, they are given the power of a Divine Protection 『Vocation』 as the only means of survival.\r\n\r\nWhile some of them are brave, some just do whatever they want, and some harbor treacherous intentions, they all aim to capture the dungeon.\r\n\r\nIn this place, one person gained a 『Vocation』 whose skills are unsuitable for combat, attendance number 19, Momokawa Kotaro.\r\n\r\nA boy with a small and lean build from the Literature Club wasn’t blessed with a physical ability, swordsmanship, or strong magic, rather he only had the 『Shaman』 vocation to rely on.\r\n\r\nAfter being driven out of the group and left behind by his powerful classmates —– his survival instinct starts running at full throttle!\r\n\r\nPushed to the limit of survival in the different world’s dungeon, what starts with trusting and loving each other soon ends in killing and betrayal.\r\n\r\nThe most beautiful and gruesome battle royale has raised its curtain.>"
}