{
	"url": "https://www.novelupdates.com/series/only-i-am-a-necromancer/",
	"title": "Only I Am a Necromancer - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/11/나-혼자-네크로맨서.jpeg",
	"noveltype": "(KR)",
	"genre": "Action   Adventure   Fantasy   Shounen   Supernatural   ",
	"tags": "Adapted to Manhwa   Angels   Apocalypse   Army Building   Calm Protagonist   Cold Protagonist   Demons   Dungeons   Game Elements   Game Ranking System   Gate to Another World   Godly Powers   Gods   Golems   Grinding   Hard-Working Protagonist   Kingdom Building   Leadership   Level System   Male Protagonist   Modern Day   Monsters   Necromancer   Overpowered Protagonist   Race Change   Vampires   Wars   Weak to Strong   Werebeasts   World Travel   World Tree   ",
	"rating": "(3.1 / 5.0, 61 votes)",
	"author": "Jijumjang   지점장   ",
	"year": "\n2019",
	"ranking": "#5262   #2000   #6449   #13810   #6899   ",
	"reviewcount": "6 Reviews sorted by",
	"description": "It was just one of those ordinary college class sessions when all of a sudden, texts and quest cards started popping up in the air.\n\nWhile everybody is flustered by the strange situation, all the lights go dark and the lecture room is engulfed in pitch darkness. Panicked, everybody is afraid of reaching out and taking the quest cards, but not the main character, Seong-woo: He instinctively realizes that he has to pick a card to survive, and he chooses to become a necromancer.\n\nSoon after, a tutorial quest appears, and the entire school turns chaotic. Suddenly, goblins pop out everywhere and start slaughtering people. Survivors find it hard to adjust themselves to all the sudden changes, but Seong-woo overpowers one of the goblins by using his necromancy skill and starts to complete the quest given to him.\n\nSeong-woo continues to grow his power and so does a number of his followers. He is surrounded by the forces of death that vow loyalty to him, as well as talented followers and trustful colleagues, but he is challenged by numerous villains in addition to a system that threatens to degenerate all of humanity.\n\nIn a world that is facing a change that it has never experienced before, a necromancer destroys everything with his committed forces>"
}