{
	"url": "https://www.novelupdates.com/series/those-years-in-quest-of-honour-mine/",
	"title": "Those Years In Quest Of Honour Mine - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/01/Honour.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Comedy   Drama   Historical   Romance   Shounen Ai   ",
	"tags": "Adapted to Drama CD   Adapted to Manhua   Ancient China   Childhood Friends   Childhood Love   Clever Protagonist   Depression   Devoted Love Interests   Enemies Become Lovers   First Love   Long Separations   Misunderstandings   Nobles   Politics   Power Couple   Proactive Protagonist   Protagonist Falls in Love First   Royalty   Schemes And Conspiracies   Shameless Protagonist   Sickly Characters   Tsundere   Wealthy Characters   ",
	"rating": "(4.6 / 5.0, 490 votes)",
	"author": "Man Man He Qi Duo   漫漫何其多   ",
	"year": "\n2018",
	"ranking": "#5262   #4670   #1383   #1093   #729   ",
	"reviewcount": "116 Reviews sorted by",
	"description": "Yu Ziyou and Zhong Wan served different masters.\n\nThey had once been the closest of souls, and were the bitterest of enemies.\n\nAfter losing the fight for the throne, Zhong Wan brought his two young masters with him far toward the borders for the sake of survival. He relied on the little friendship that existed between him and Yu Ziyou when they were young. He borrowed some of his personal belongings while also dropping various hints around which made everyone think that there was something intimate going on between them.\n\nGiven the Yu Clan’s powerful authoritative presence in the imperial court, this appearance of a close tie allowed Zhong Wan to live a much better life than before. As such, the stories he cooked up began to carry more and more weight.\n\nAs rumors of their lovely romance spread a thousand miles into the horizon, Yu Ziyou, who was located in the distant capital city, eventually caught wind of his deeply moving and epic love affair. In a trance, Yu Ziyou, who had been completely brainwashed for seven years, believed in them. He guessed something special really did happen between them back in those years…>"
}