{
	"url": "https://www.novelupdates.com/series/hazure-skill-gacha-de-tsuihou-sareta-ore-wa-wagamama-osananajimi-wo-zetsuen-shi-kakusei-suru-bannou-cheat-skill-wo-getto-shite-mezase-rakuraku-saikyou-slow-life/",
	"title": "Hazure Skill “Gacha” de Tsuihou Sareta Ore wa, Wagamama Osananajimi wo Zetsuen Shi Kakusei Suru ~ Bannou Cheat Skill wo Getto Shite, Mezase Rakuraku Saikyou Slow Life!~ - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/03/Hazure-Skill-Gacha-de-Tsuihou-Sareta-Ore-wa-Wagamama-Osananajimi-wo-Zetsuen-Shi-Kakusei-Suru-Bannou-Cheat-Skill-wo-Getto-Shite-Mezase-Rakuraku-Saikyou-Slow-Life_1615742870.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Fantasy   Harem   Romance   Shounen   ",
	"tags": "Abandoned Children   Abusive Characters   Adapted to Manga   Broken Engagement   Bullying   Calm Protagonist   Child Abuse   Childhood Friends   Clever Protagonist   Complex Family Relationships   Crafting   Engagement   Fallen Nobility   Fantasy Creatures   Farming   Game Elements   Goblins   Hard-Working Protagonist   Hated Protagonist   Hidden Abilities   Human-Nonhuman Relationship   Kingdom Building   Knights   Level System   Lottery   Magic   Maids   Male Protagonist   Multiple POV   Nobles   Overpowered Protagonist   Polygamy   Siblings   Skill Creation   S*aves   Slow Growth at Start   Strong Love Interests   Sword And Magic   Sword Wielder   Tsundere   Underestimated Protagonist   Weak to Strong   Yandere   ",
	"rating": "(3.6 / 5.0, 91 votes)",
	"author": "Kijima Ryuuta   木嶋隆太   ",
	"year": "\n2020",
	"ranking": "#914   #3095   #1193   #2581   #2444   ",
	"reviewcount": "14 Reviews sorted by",
	"description": "\r\nCrest was born as the fifth son of a duke. However, as the fifth son, he was in no position to talk. His childhood friend and also his fiancée, Ellis, treated him just like a slave. And on Crest's coming-of-age ceremony, he received a skill called 'Gacha.' Yet, he wasn't able to learn how to use it and was banished away from his home. Banished into the forest full of monsters, Crest began to understand the power 'Gacha.' And then, Crest made up his mind. He will definitely survive and get back on his feet.\r\n>"
}