{
	"url": "https://www.novelupdates.com/series/rebirth-of-a-star-general/",
	"title": "Rebirth of a Star General - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/06/1093311.png",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Drama   Gender Bender   Martial Arts   Romance   ",
	"tags": "Ancient China   Army   Arrogant Characters   Beautiful Female Lead   Betrayal   Bickering Couple   Calm Protagonist   Clever Protagonist   Cold Love Interests   Confident Protagonist   Cross-dressing   Cunning Protagonist   Depictions of Cruelty   Determined Protagonist   Devoted Love Interests   Family Conflict   Female Protagonist   Flashbacks   Generals   Handsome Male Lead   Hard-Working Protagonist   Hiding True Identity   Military   Past Plays a Big Role   Past Trauma   Politics   Power Couple   Protagonist Falls in Love First   Reincarnation   Revenge   Rivalry   Schemes And Conspiracies   Shameless Protagonist   Slow Romance   Strong Love Interests   Tomboyish Female Lead   Tragic Past   Transmigration   Wars   Weak to Strong   ",
	"rating": "(4.6 / 5.0, 213 votes)",
	"author": "Qian Shan Cha Ke   千山茶客   ",
	"year": "\n2019",
	"ranking": "#857   #1370   #1553   #2069   #1433   ",
	"reviewcount": "64 Reviews sorted by",
	"description": "The ancient saying goes: Most generals come from Guan Xi, while ministers come from Guan Dong.\n\nHe Yan was born to be a Star General.\n\nShe was merely a stepping stone for her family, and was used as her brother’s substitute. She had fought on the battlefields for years, bringing peace to Xi Qiang, stopping the barbarians… When her brother recovered, she gave up her position with great laurels brought to her name. Without further ado, she was married off.\n\nDuring her married life, she was forsaken by her husband and even suffered from a strange illness, thereby losing her eyesight…\n\nThe young and pretty concubine stood in front of her, speaking softly: “The decoction you drank that made you blind was instructed by the elders of your family. As you know, the dead tell no tales. If you lived, you would be your family’s greatest threat!”\n\nA great general of her time, the heroine of the country, died pitifully in the hands of those shameless women, who only knew to fight for a man’s favor… How absurd!\n\nWhen she opened her eyes again, she had become the drill fields officer’s daughter, who was weak and arrogant, innocent and naive.\n\nThey had stolen her glory, taken her life, lead her army and betrayed her feelings! She had crawled back from the depths of hell and would take back everything she had lost, one by one.\n\nBring the world under her feet and with her beauty and nobility, overwhelm the nine prefectures!\n\nBut would she get out easily once she entered the barracks?\n\nHardly did she begin her adventures when He Yan met her arch-enemy of the previous lifetime, that young hunk whose “enemies would retreat as soon as he attacked”.\n\nThe chic and cool female general versus the handsome and ravenous young man. Two efficient generals team up to conquer the world!>"
}