{
	"url": "https://www.novelupdates.com/series/o-pretends-to-be-b-for-the-violent-admiral/",
	"title": "O Pretends to be B For The Violent Admiral - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/12/O-Pretends-to-be-B-For-The-Violent-Admiral_1609094368.jpg",
	"noveltype": "(CN)",
	"genre": "Drama   Mecha   Mystery   Romance   Sci-fi   Yaoi   ",
	"tags": "Boss-Subordinate Relationship   Calm Protagonist   Character Growth   Charming Protagonist   Fated Lovers   Futuristic Setting   Handsome Male Lead   Hard-Working Protagonist   Heartwarming   Human Experimentation   Humanoid Protagonist   Kuudere   Love Interest Falls in Love First   Lovers Reunited   Loyal Subordinates   Manly Gay Couple   Military   Misunderstandings   Mpreg   Nobles   Omegaverse   Outer Space   Past Trauma   Polite Protagonist   Politics   Power Couple   Power Struggle   Protagonist Strong from the Start   Royalty   Schemes And Conspiracies   Slow Romance   Smart Couple   Strategic Battles   Strong Love Interests   Tragic Past   Tsundere   Wars   ",
	"rating": "(4.5 / 5.0, 185 votes)",
	"author": "公子柔   ",
	"year": "\n2020",
	"ranking": "#1570   #1341   #1962   #1075   #1348   ",
	"reviewcount": "41 Reviews",
	"description": "—Breaking! Admiral Lucas of the Empire has dispatched his men, reportedly to find his date from the hotel last night!\n\nThe reporter excitedly asked a question: What would you do once you find them?\n\nLucas’ eyes glinted coldly: Kill them.\n\nThe crowd: ???\n\nWhy does he seem different from everyone else…\n\n–\n\nGong’s perspective →\n\nThere’s nothing the short-tempered Admiral Lucas looks down on more than the whiny and annoying omegas in his life.\n\nA significant other? Will never happen in this lifetime.\n\nHowever, if he is forced to elaborate… He much prefers the gentle and honest beta secretary, skilled in both combat and academia, who can brew coffee and match clothes for him.\n\n–\n\nShou’s perspective →\n\nLuo Ran is Lucas’ secretary, and what he does is the most inhumane job in the entire empire.\n\nHe has to wait on the nit-pickiest superior who sits above him, and below him, he has to deal with the entire empire who dare not interact with the admiral, the admiral’s subordinates, coworkers, admirers… etc.\n\nNot only that, but he also has to carefully hide the fact that he’s an omega, as well as his identity as the admiral’s “one night stand”… constantly facing the imminent threat of getting killed at any moment.\n\nUntil one day, he accidentally went into heat in front of Lucas, the sweet and lovely pheromone an exact match with the pheromone of the person from that night.\n\nIt’s over, he’s about to be killed now.\n\n“How brave of you.” Lucas held the back of Luo Ran’s head, the other arm looped around his waist as he smiled, “Now… I’m going to kill you.”>"
}