{
	"url": "https://www.novelupdates.com/series/scoring-the-sacred-body-of-the-ancients-from-the-get-go/",
	"title": "Scoring the Sacred Body of the Ancients from the Get-go - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/12/Scoring-the-Sacred-Body-of-the-Ancients-from-the-Getgo.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Harem   Xianxia   ",
	"tags": "Accelerated Growth   Antihero Protagonist   Appearance Different from Actual Age   Beautiful Female Lead   Body Tempering   Calm Protagonist   Carefree Protagonist   Charming Protagonist   Confident Protagonist   Cultivation   Cunning Protagonist   Doting Parents   Enemies Become Allies   Evil Protagonist   Famous Parents   Famous Protagonist   Fast Cultivation   Handsome Male Lead   Immortals   Loli   Loyal Subordinates   Lucky Protagonist   Male Protagonist   Multiple Realms   Overpowered Protagonist   Protagonist with Multiple Bodies   Romantic Subplot   Saving the World   Schemes And Conspiracies   Sharp-tongued Characters   Strength-based Social Hierarchy   Strong Love Interests   Strong to Stronger   System Administrator   Transmigration   Underestimated Protagonist   Wars   Wealthy Characters   World Travel   ",
	"rating": "(2.5 / 5.0, 24 votes)",
	"author": "God J   J神   ",
	"year": "\n2019",
	"ranking": "#2000   #2000   #7294   #12664   #12433   ",
	"reviewcount": "10 Reviews sorted by",
	"description": "Jun Xiaoyao was transported to a mystical world and became the divine child of a Clan of the Ancients. He came to possess an invincible background, unparalleled talents and even a check-in system, enabling him to acquire an Accomplished Sacred Body of the Ancients at the very beginning of his new life. \r\n\r\n \r\n\r\nHe acquired the Divine Elephant Overpowering Force, a six-star reward, checking in at the Old Tablet of Taiyue. \r\n\r\n \r\n\r\nHe acquired the Bones of Supremacy, a seven-star reward, checking in at his Ten Years Old Banquet. \r\n\r\n \r\n\r\nHe acquired the Cauldron of Maternal Qi of All Beings, an eight-star reward, checking in at the Bronze Mystical Hall. \r\n\r\n \r\n\r\nHe acquired the Grand Method of Freedom Melding, a ten-star reward, checking in at the Borderless Ocean. \r\n\r\n \r\n\r\nHe sat on the clouds countless years later, with his sword pointing at the heavens, saying, “I alone shall rule over the heavens and the earth. I shall become the pinnacle at the very end of the mystic path!”>"
}