{
	"url": "https://www.novelupdates.com/series/im-the-only-one-who-can-put-the-tyrant-to-sleep/",
	"title": "I’m the Only One Who Can Put the Tyrant To Sleep - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/06/Im-the-Only-One-Who-Can-Put-the-Tyrant-To-Sleep.jpg",
	"noveltype": "(KR)",
	"genre": "Fantasy   Romance   ",
	"tags": "Dense Protagonist   Empires   Female Protagonist   Handsome Male Lead   Love Interest Falls in Love First   Nobles   Obsessive Love   Possession   Possessive Characters   Transmigration   ",
	"rating": "(4.0 / 5.0, 2 votes)",
	"author": "이이리   ",
	"year": "\n2022",
	"ranking": "#2000   #6206   #13429   #9694   #9994   ",
	"reviewcount": "No Reviews",
	"description": "It's been one year since I possessed this body. I finally found the identity of the original story.\r\nHowever… I’m Evelyn, the maid who was later sacrificed while helping the Princess escape.\r\nThe only way for me to survive is to control Imperial Crown Prince Caesar's congestion and raise him to the throne.\r\n\r\n“We need to find your guide. If you get in contact with a guide, you can awaken your abilities without congesting.”\r\n\r\nI took action to find his guide in order for him to live at least a little longer, but…\r\nTo think that that one and only guide was me?\r\nFurthermore,\r\n\r\n“There’s no way I’d hate Your Highness, you know.”\r\n“Then, you like me?”\r\n'...Yesss?'\r\n“If you don’t hate me, then you like me, right.”\r\n\r\nI’m about to leave the Imperial Palace slowly, but he, who has become the Emperor, asks with sparkling eyes.\r\nAfter he held my two hands tightly, as if he absolutely has no intention of letting go.\r\n\r\nI simply awakened him, but why is he only chasing after me with a face like a puppy in the rain?\r\nAnd also why doesn't the congestion stop!?\r\n\r\n***\r\n\r\n“It has become the time to vomit blood, right.”\r\n'You're going to vomit blood in front of me? Why on earth?'\r\n\r\nNot knowing that I was hiding and listening, Caesar rolled his eyes languidly and whispered.\r\n\r\n“I have to congest… Because if so, Evelyn will never leave me.”\r\n\r\nAt that moment, the door I was leaning on opened and our eyes met.\r\nHis sky blue eyes were tinged with bewilderment.\r\n>"
}