{
	"url": "https://www.novelupdates.com/series/transmigrating-into-a-90s-cat-i-want-to-work-for-my-home-country/",
	"title": "Transmigrating into a 90’s Cat, I Want to Work for My Home Country - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/09/Transmigrating-into-a-s-Cat-I-Want-to-Work-for-My-Home-Country.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Comedy   Fantasy   Romance   Slice of Life   Supernatural   ",
	"tags": "Animal Characteristics   Animal Rearing   Appearance Changes   Beast Companions   Beasts   Beautiful Female Lead   Carefree Protagonist   Cold Love Interests   Cute Protagonist   Cute Story   Female Protagonist   Friendship   Handsome Male Lead   Helpful Protagonist   Heterochromia   Hiding True Abilities   Hiding True Identity   Identity Crisis   Investigations   Overpowered Protagonist   Playful Protagonist   Police   Soldiers   System Administrator   Teamwork   Transmigration   ",
	"rating": "(3.9 / 5.0, 14 votes)",
	"author": "San San Jiu Jiu   三三久久   ",
	"year": "\n2021",
	"ranking": "#371   #621   #8966   #1606   #10395   ",
	"reviewcount": "3 Reviews sorted by",
	"description": "After being heavily wounded on a mission, the dying commander of the special forces Qin Xiao was brought back to the mountain base on the back of a tiger. According to the rumors, that day, it was an extremely beautiful Persian cat that called out the guard soldier and found the commander.\n\nThis strange event was transmitted throughout the base, and it became a sensation in the whole place.\n\nAfter transmigrating into a cat, Bai Xia Xia has been extremely worried. She could understand beast language, eat fruits, and catch fish, but it was useless, her beast friends did not eat cooked food. For half a year, she did not eat a mouthful of cooked meat at all, and everything was so plain that she was going crazy.\n\nShe deliberated and pondered, thinking seriously about Cat’s remaining life—being a house cat is good, there will be a poop shovel officer (a pet owner) to serve me. A suitable poop shovel officer was not easy to find, living conditions were not guaranteed, and the risk of becoming a stray cat was high.\n\nTherefore, she found an iron rice bowl (a lifetime employment), working for her home country (in a governmental position).>"
}