{
	"url": "https://www.novelupdates.com/series/i-became-the-male-leads-pet/",
	"title": "I Became The Male Lead’s Pet - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/03/I-Became-The-Male-Leads-Pet.jpg",
	"noveltype": "(KR)",
	"genre": "Comedy   Drama   Fantasy   Josei   Mystery   Romance   Supernatural   ",
	"tags": "Aristocracy   Beautiful Female Lead   Cute Protagonist   Cute Story   Empires   European Ambience   Female Protagonist   Handsome Male Lead   Kingdom Building   Kingdoms   Magic   Magic Formations   Magical Girls   Pets   Reincarnated in Another World   Reincarnation   Royalty   Sword And Magic   Sword Wielder   Transmigration   ",
	"rating": "(4.0 / 5.0, 19 votes)",
	"author": "유은비   ",
	"year": "\n2021",
	"ranking": "#2000   #2000   #9431   #10839   #6764   ",
	"reviewcount": "1 Review sorted by",
	"description": "‘That’s how Clementz Resta Düshingen died.’\n\nWhat? The male protagonist dies at the hands of the female protagonist?\n\nAlso, the author dropped the suspension notice of the first part.\n\nI lied down with tears in my eyes, praying earnestly. I hope the second part will be there when I open my eyes.\n\nBut when I came to my senses…\n\n“I asked to be woken up after the hiatus of the novel… Have I ever asked to possess the body of a supporting character?”\n\nI became a 12-year-old Ophelia, destined to become a maid of the same age for the female lead.\n\nNow that it has become like this, I’ve decided to stop the tragedy of the two characters that I love, but…\n\nGetting caught in a battle between witches, I turned to a pet chick of the male protagonist.\n\n“Cheep! Cheep! (I wanna go back home!)”\n\n“Yeah, I feel the same as well.”\n\n“Cheep! (You read my mind.) Chee. (Wait, you’re already there.)”\n\n“There has never been such a cute being as you in my life, and there will never be. Next month let us have a ceremony with the elders of the imperial family.”\n\n“Cheep. (What do you mean?)”\n\n“I wish to spend the rest of my life with a cute little thing like you.”\n\nUhh, how did things get like this?\n\nOthers may have possessed a dark supporting role or an extra, but at least they’re human.\n\nBut isn’t everyone, not just the Crown Prince, falling for this version of me?!\n\nExperience Ophelia’s days as a magically turned little chick that captivates the Prince with her deadly cuteness that changes the original story!>"
}