{
	"url": "https://www.novelupdates.com/series/abyss-domination/",
	"title": "Abyss Domination - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2016/01/6658s.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Fantasy   Harem   Mature   Supernatural   ",
	"tags": "Abandoned Children   Antihero Protagonist   Assassins   Beautiful Female Lead   Bloodlines   Caring Protagonist   Clever Protagonist   Cold Protagonist   Confident Protagonist   Cunning Protagonist   Cute Protagonist   Demon Lord   Demons   Depictions of Cruelty   Determined Protagonist   Dragon Slayers   Dragons   Eidetic Memory   Evil Gods   Evil Religions   First-time Interc**rse   Game Elements   God-human Relationship   God Protagonist   Goddesses   Godly Powers   Gods   Handsome Male Lead   Hard-Working Protagonist   Kingdom Building   Kingdoms   Level System   Magic   Magical Technology   Male Protagonist   Monsters   Multiple Realms   Orcs   Pirates   Polygamy   Poor to Rich   Post-apocalyptic   Religions   Romantic Subplot   Ruthless Protagonist   Sealed Power   Siblings   Sister Complex   Special Abilities   Strong Love Interests   Succubus   Sword And Magic   Thieves   Transmigration   Transported into a Game World   Vampires   Wars   Weak to Strong   Witches   Wizards   Younger Sisters   ",
	"rating": "(4.0 / 5.0, 288 votes)",
	"author": "Eminent Student Of Buddha   Zhusheng Futu   诸生浮屠   ",
	"year": "\n2014",
	"ranking": "#6970   #2000   #1108   #5191   #1203   ",
	"reviewcount": "40 Reviews sorted by",
	"description": "He doesn’t know why his mind has been transferred into that of a petty thief named Soran within the VRMMO . The new ‘Soran’ though possesses both the body’s previous occupant’s memories and his own. Using his experience as a Legendary Rogue who had reached the apex known as the Realm of Legends, he will now have to survive in this world which had once been a game to him.\n\nSoran will have to grow stronger while avoiding the upcoming dangers and protect his younger sister, Vivian, from the chaotic times which will soon devastate the world. He shall eliminate everything and everyone that threatens them.\n\nWhen the demons of the Abyss rise and the gods fall, a massacre will take place across the world.\n\nDivinity has fallen, and evil is surging from beneath.\n\nThe Time of Troubles has begun.>"
}