{
	"url": "https://www.novelupdates.com/series/the-foolish-gong-was-reborn/",
	"title": "The Foolish Gong was Reborn - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/11/The-Foolish-Gong-was-Reborn.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Romance   School Life   Yaoi   ",
	"tags": "Bullying   Calm Protagonist   Clever Protagonist   Clingy Lover   Clumsy Love Interests   Cute Protagonist   Family Business   Handsome Male Lead   Hard-Working Protagonist   Marriage   Multiple POV   Multiple Protagonists   Reincarnation   Second Chance   Seme Protagonist   Shameless Protagonist   Unreliable Narrator   Wealthy Characters   ",
	"rating": "(4.5 / 5.0, 102 votes)",
	"author": "多金少女猫   ",
	"year": "\n2020",
	"ranking": "#1780   #1228   #3898   #2066   #3335   ",
	"reviewcount": "20 Reviews",
	"description": "Outsiders all say that Xie Zhongxing had hit the jackpot marrying the prince of the Qin Enterprise, Qin Zhongyue, even being treasured and favoured for five whole years. They were well-recognized as a loving couple.\n\nHowever, they didn’t know that Qin Zhongyue had a lot of dissatisfaction with this marriage. He complained to his good friend, “He micromanages everything. Won’t let me drink or smoke, won’t let me go clubbing, and he even set me a 10pm curfew!”\n\n“I have to hand over all my salary and bank cards and he would only give me a hundred yuan a day! Only if he is in a good mood, he would give me a few hundred more!”\n\nQin Zhongyue felt angry and wronged, “And I even have to wait on him!”\n\n“If I ever get the chance to do this again, I will never marry him! I used to get eight million yuan a month as spending money!” The prince said this to his friend.\n\nThe day after he said this, Qin Zhongyue found himself reborn to the time when he was seventeen.\n\nThe Xie Zhongxing at this time was eighteen years old and poor to the point where he only had one set of old clothes to wear, holes in his socks and a pair of dirty shoes with its soles peeling off. Even if he had a nice-looking face, he was despised and looked down upon, and known in the school as a pauper.\n\nWhen Xie Zhongxing’s parents came to handle the withdrawal procedures for him, Qin Zhongyue only then found out that he was a study tyrant ranked first in his grade, receiving scholarships every year, and that he was a seedling with good prospects the school had high expectations for and not the ‘useless high school dropout who didn’t like to study and only has money in his eyes’ as claimed by his younger brother.\n\nQin Zhongyue couldn’t bear the sight of this. He pulled Xie Zhongxing into his arms, angry, “Continue studying! Our Qin family has never had a top scorer before, you must keep studying!”\n\nXie Zhongxing raised his eyes and looked at him in confusion. The look in his eyes seemed to ask: Who are you?\n\nQin Zhongyue thought of Xie Zhongxing’s dictatorship after their marriage and shuddered. He then maintained a look of righteousness, “I am just a kind-hearted person who does not wish to reveal his name!”\n\nLater, Qin Zhongyue asked Xie Zhongxing shyly, “If we get married, can you give me a thousand yuan a day as spending money?”\n\nXie Zhongxing, “?”\n\nQin Zhongyue, “…..Five hundred is also okay.”\n\nNB: The actual title is literally “The Sand Sculpture Gong was Reborn”. Sand sculpture (沙雕) is a homonym for 傻屌 (Sha Diao) which is a derogatory term for an idiot/a fool. Sand sculpture is often used with a more humourous/joking intention to describe something or someone as silly or foolish.>"
}