{
	"url": "https://www.novelupdates.com/series/i-can-see-your-death/",
	"title": "I Can See Your Death - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/04/I-Can-See-Your-Death.jpg",
	"noveltype": "(KR)",
	"genre": "Fantasy   Josei   Mystery   Romance   ",
	"tags": "Adapted to Manhwa   Amnesia   Apathetic Protagonist   Aristocracy   Beautiful Female Lead   Betrayal   Calm Protagonist   Cold Protagonist   Conditional Power   Cruel Characters   Death of Loved Ones   Different Social Status   Empires   European Ambience   Eye Powers   Fated Lovers   Female Protagonist   Godly Powers   Handsome Male Lead   Hidden Abilities   Hiding True Abilities   Hiding True Identity   Kind Love Interests   Kingdoms   Loner Protagonist   Love Interest Falls in Love First   Magic   Multiple Identities   Multiple Personalities   Mysterious Past   Mystery Solving   Near-Death Experience   Nobles   Past Plays a Big Role   Personality Changes   Popular Love Interests   Power Couple   Royalty   Sealed Power   Secret Identity   Smart Couple   Strong Love Interests   Tragic Past   ",
	"rating": "(3.2 / 5.0, 18 votes)",
	"author": "단해늘   ",
	"year": "\n2019",
	"ranking": "#3567   #3130   #10575   #7856   #8044   ",
	"reviewcount": "No Reviews",
	"description": "After an accident, Eshana Ash has started seeing people’s  lifespan. The date and sign of the person’s death would appear above their head. If the letters were black, she could help, and sometimes save the villagers from danger. \n\n“It’s better not to go to the lake today. It’s too cold for going boating,” she said. \n\nThat man was to die today by drowning in the lake. She saved many of her people this way, so whenever she did, the people in her village would gather around and praise her and would tell her. \n\n“You really must be a child from heaven!” \n\nWell, I’m not particularly blessed to see death. However, if there is something that cannot be changed, it’s the lifespan shown in red.\n\n“Save me.”\n\n422 years of the imperial calendar, a peaceful evening. A bloody man lying in the front yard of the house. And clearer than that blood, is her lifespan.\n\n[427/Sign: Eshana]\nWhy is my name there?>"
}