{
	"url": "https://www.novelupdates.com/series/i-am-the-fated-villain/",
	"title": "I Am the Fated Villain - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/12/I-Am-the-Fated-Villain.jpg",
	"noveltype": "(CN)",
	"genre": "Harem   Psychological   Xuanhuan   ",
	"tags": "Adapted to Manhua   Antihero Protagonist   Apathetic Protagonist   Artifacts   Brother Complex   Calm Protagonist   Cautious Protagonist   Clever Protagonist   Cultivation   Cunning Protagonist   Demonic Cultivation Technique   Depictions of Cruelty   Enemies Become Allies   Enemies Become Lovers   Evil Protagonist   Famous Protagonist   Fast Cultivation   First-time Interc**rse   Game Elements   Genius Protagonist   Handsome Male Lead   Hiding True Abilities   Hiding True Identity   Male Protagonist   Marriage   Master-Disciple Relationship   Mind Control   Misunderstandings   Multiple POV   Multiple Reincarnated Individuals   Overpowered Protagonist   Polygamy   Proactive Protagonist   Protagonist Strong from the Start   Romantic Subplot   R*pe   Ruthless Protagonist   Sadistic Characters   Schemes And Conspiracies   S*aves   Stockholm Syndrome   Strength-based Social Hierarchy   Strong to Stronger   System Administrator   Transmigration   Tsundere   Yandere   ",
	"rating": "(4.3 / 5.0, 250 votes)",
	"author": "Fated Villain   天命反派   ",
	"year": "\n2020",
	"ranking": "#22   #24   #636   #69   #1879   ",
	"reviewcount": "46 Reviews",
	"description": "Immediately after Gu Changge realized he had transgressed into a fantasy world, the world’s protagonist, and fortune’s chosen, vowed to take revenge on him. Envied by all, he not only has the female lead head over heels for him but he’s also treated as a distinguished guest wherever he goes. Fortunately, Gu Changge’s prestige and power are superior to everyone else’s, so shouldn’t it be easy to trample on a mere fortune’s chosen?\n\nHold on… There’s a system dedicated to milking and harvesting from the protagonist? Gu Changge smirked. “Seems like even fate wants me to fulfill my destiny as the Villain of this world!”>"
}