{
	"url": "https://www.novelupdates.com/series/legend-of-fei/",
	"title": "Legend of Fei - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/10/banditfei1a.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Drama   Fantasy   Martial Arts   Romance   Wuxia   ",
	"tags": "Adapted to Drama   Adapted to Drama CD   Adventurers   Age Progression   Ancient China   Assassins   Bickering Couple   Calm Protagonist   Caring Protagonist   Clever Protagonist   Complex Family Relationships   Confident Protagonist   Couple Growth   Cruel Characters   Determined Protagonist   Devoted Love Interests   Fast Learner   Fearless Protagonist   Female Protagonist   Friendship   Handsome Male Lead   Hard-Working Protagonist   Hiding True Identity   Kind Love Interests   Limited Lifespan   Mystery Solving   Past Plays a Big Role   Poisons   Royalty   Sharp-tongued Characters   Sickly Characters   Slow Romance   Stoic Characters   Strong to Stronger   Sword Wielder   Time Skip   Wars   World Travel   Writers   ",
	"rating": "(4.3 / 5.0, 71 votes)",
	"author": "Priest   ",
	"year": "\n2016",
	"ranking": "#2000   #2000   #5626   #11314   #4380   ",
	"reviewcount": "9 Reviews sorted by",
	"description": "Twenty years earlier, the ‘Blade of the South’ Li Zhi was condemned a bandit by imperial decree for establishing the 48 Strongholds of the Shu Mountains to shelter the destitute refugees of the world. \n\nTwenty years later, a young man going by the name of Xie Yun, carrying an ‘Anping Command’, barges into the 48 Strongholds by night. Sir Gan Tang receives the command and descends the mountain, henceforth setting into motion the gears of fate.\n\nZhou Fei, a descendant of the ‘Blade of the South’, is born and raised within the 48 Strongholds, but has yet to experience the martial world. She begins to stray from this straight road after she encounters Xie Yun.\n\nHowever, the current martial arts world is embroiled in turbulence, those once carefree and worry-less youths are swept without warning into the midst of turmoil and unrest; and ‘that’ secret which has been buried for 20 years, is about to be uncovered…\n\n“There will come a day–you will cross the tranquil and noiseless waters of the Inkwash River; you will depart from this haven sheltered by mountains; and you will find yourself under a vast and shrouded night sky. When you witness in succession the collapse of countless colossal mountains and the evaporation of fathomless seas into desert, you must always remember: your fate rests on the tip of your blade, and the tip of your blade must always point forward.”\n\n“I pray that by the cold steel of your sword, you will be able to cut through the darkness of night for a glimpse of the day.”>"
}