{
	"url": "https://www.novelupdates.com/series/i-raised-him-modestly-but-he-came-back-obsessed-with-me/",
	"title": "I Raised Him Modestly, But He Came Back Obsessed With Me - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/10/I-Raised-Him-Modestly-But-He-Came-Back-Obsessed-With-Me.png",
	"noveltype": "(KR)",
	"genre": "Comedy   Fantasy   Romance   Supernatural   ",
	"tags": "Aristocracy   Beautiful Female Lead   Clever Protagonist   European Ambience   Female Protagonist   Handsome Male Lead   Lovers Reunited   Low-key Protagonist   Magic   Maids   Male Yandere   Master-Servant Relationship   Nobles   Obsessive Love   Possessive Characters   Protagonist Strong from the Start   Royalty   S*aves   Transmigration   Villainess Noble Girls   Wealthy Characters   Witches   ",
	"rating": "(3.8 / 5.0, 117 votes)",
	"author": "초암   ",
	"year": "\n2020",
	"ranking": "#1583   #1410   #2037   #1535   #788   ",
	"reviewcount": "5 Reviews sorted by",
	"description": "Cersinia possessed the body a villain who will die by guillotine.\n\nFortunately, she came three years before the story began.\n\nShe hit a jackpot at a gambling house where she wanted to get money to change her fate because she never wanted to die like that way. But why is that? The boss of gambling came out because he had no money… With a 19-year-old s*ave boy as collateral… \n\n“Your name. How about Ben?”\n\n“Okay. Then, Ben it is.”\n\nShe named Ben to a child who didn’t even have a name. She thought she met a friend in a world where there was no one to rely on.\n\n“I want to be with you.”\n\n“What?”\n\n“Please be with me, Cersinia.\n\nBut he disappeared without a word.\n\nThere is a familiar scent from a man standing in front of her. Cersinia knew it was a completely different person, that it was nonsense.\n\nBut she still opened her mouth unconsciously at that familiar look.\n\n“Ben?”\n\nHe was so satisfied by how his name passed her red lips, that he smiled ever so gently.\n\n“My Cersinia, I’ve missed you. “>"
}