{
	"url": "https://www.novelupdates.com/series/pleasing-start-over/",
	"title": "Pleasing Start-Over - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/08/AC.jpg",
	"noveltype": "(CN)",
	"genre": "Adult   Adventure   Fantasy   Historical   Mature   Mecha   Romance   Sci-fi   Slice of Life   Yaoi   ",
	"tags": "Ancient Times   Apocalypse   Artificial Intelligence   Artists   Clever Protagonist   Clingy Lover   Complex Family Relationships   Cross-dressing   Cunning Protagonist   Death of Loved Ones   Devoted Love Interests   Doctors   Episodic   Fated Lovers   First Love   Handsome Male Lead   Hidden Abilities   Hospital   Lovers Reunited   Male Yandere   Medical Knowledge   Mpreg   Multiple Realms   Music   Outer Space   Overpowered Protagonist   Post-apocalyptic   Previous Life Talent   Revenge   Royalty   Second Chance   Smart Couple   Souls   Special Abilities   System Administrator   Terminal Illness   Transmigration   Tsundere   World Hopping   World Travel   Zombies   ",
	"rating": "(4.0 / 5.0, 409 votes)",
	"author": "Tangerine Boat   橘子舟   ",
	"year": "\n2016",
	"ranking": "#535   #340   #804   #801   #716   ",
	"reviewcount": "122 Reviews sorted by",
	"description": "Qiao Chen was mysteriously transmigrated to the interstellar era. As an adult from his original world, he was forced to grow up all over again in this new one. Now, out of nowhere, he was requested (forced to take on) with the inexplicable task of jumping from world to world to save the high general’s soul.\r\n\r\nThroughout his journey, Qiao Chen finds that these worlds and bodies he’s jumping in and out of are his previous reincarnations. Whether or not these all culminate into coincidences or a predetermined destiny, there’s things that must be done while completing the main task:\r\n\r\n-Avenge his past life\r\n\r\n-Take revenge\r\n\r\n-Fulfill past regrets\r\n\r\n-Realize those lost dreams\r\n\r\n-Make up for past failures\r\n\r\nSince God has given him these opportunities to rewrite his fate, why wouldn’t he be pleased to start-over?>"
}