{
	"url": "https://www.novelupdates.com/series/honeyed-marriage/",
	"title": "Honeyed Marriage - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/09/20200429183920.jpg",
	"noveltype": "(CN)",
	"genre": "Drama   Josei   Romance   ",
	"tags": "Acting   Beautiful Female Lead   Blind Protagonist   Businessmen   Devoted Love Interests   Disabilities   Female Protagonist   Handsome Male Lead   Love Interest Falls in Love First   Marriage of Convenience   Modern Day   Popular Love Interests   Possessive Characters   Pregnancy   Wealthy Characters   ",
	"rating": "(3.8 / 5.0, 66 votes)",
	"author": "慕义   ",
	"year": "\n2020",
	"ranking": "#3017   #6315   #2584   #1710   #3357   ",
	"reviewcount": "15 Reviews sorted by",
	"description": "Ruan family was on the verge of bankruptcy. The little princess Ruan Yan, who was their most beloved, fell from the status of a celebrity overnight and became temporarily blind. \r\n\r\nOn a rainy night, she was kicked out of the house and crouched by the roadside with nowhere to go. Until a black car stopped in front of her. A series of footsteps approaching sounded and then the rain did not fall on her again. It was then she heard a low male voice above her head.\r\n\r\n'Are you not the little princess of the Ruan family? How about becoming my wife?' A few months later, the Ruan corporation was acquired and Ruan Yan became its sole heir.\r\n\r\n***\r\n\r\nBecause of her blindness, Ruan Yan never saw the appearance of the man who married her.\r\n\r\nHe had been taking her to treat her eyes and after a few months, she finally got better. One morning, she woke up feeling the light in front of her eyes. She was pleasantly surprised to realize that her sight had been restored.\r\n\r\nShe vaguely saw the man lying on her side. His eyebrows were like swords and eyes were like stars.\r\n\r\nAs her sight shifted, her pupils shook. Wasn't this once Ruan family's biggest competitor, Zhou Mengyan, who was worth tens of billions in financial circles?\r\n\r\nShe shrank back in fright, 'You, you...'\r\n\r\nThe man opened his eyes to look at her with a smile in his eyes, 'Mrs. Zhou, it was not like this when you stuck to your husband last night.'>"
}