{
	"url": "https://www.novelupdates.com/series/poisoning-the-world-the-secret-service-mysterious-doctor-is-a-young-beastly-wife/",
	"title": "Poisoning the World: The Secret Service Mysterious Doctor is a Young Beastly Wife - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2016/06/cb_56c514a7746ea.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Comedy   Drama   Fantasy   Harem   Josei   Martial Arts   Mature   Romance   Tragedy   Xuanhuan   ",
	"tags": "Adapted to Manhua   Amnesia   Arranged Marriage   Beautiful Female Lead   Black Belly   Broken Engagement   Cautious Protagonist   Clever Protagonist   Cultivation   Cunning Protagonist   Death   Doctors   Female Protagonist   Genius Protagonist   Handsome Male Lead   Jealousy   Love Interest Falls in Love First   Misunderstandings   Money Grubber   Mythical Beasts   Poisons   Pregnancy   Reverse Harem   Royalty   Secrets   Selfish Protagonist   Shameless Protagonist   Slow Romance   Suicides   Torture   Transmigration   Weak to Strong   ",
	"rating": "(3.8 / 5.0, 337 votes)",
	"author": "Mu Dan Feng   穆丹枫   ",
	"year": "\n2015",
	"ranking": "#2000   #2000   #322   #7142   #651   ",
	"reviewcount": "42 Reviews sorted by",
	"description": "She is a top-class spy, a poison specialist, but also a young and cute girl with a sinister temperament. In spite of her sweet and innocent appearance, she can complete any tasks without the slightest hesitation. One day because of an incomplete black magic, she was sent into the body of a girl who was deemed as a good-for-nothing. What kind of change will she bring to this continent?\n\nA Prince said with bitter hatred, “I thought she was weak and easily bullied, therefore I broke off the engagement. I really didn’t expect she is such a shrewd girl. I made an error of judgment.”\n\nThe Crown Prince deeply sighed, “She is such a sexy evildoer! Obviously, she has a frail and tender body, but I am not able to overwhelm her…”\n\nFinally, an Emperor hit the nail on the head, “She is just a bit two-faced!”\n\nShe answered, “You’re just a big pervert!”\n\nThe Emperor carried her into the room and said, “You are predestined to be mine! A two-faced girl and a pervert are a perfect match, right?!”>"
}