{
	"url": "https://www.novelupdates.com/series/if-you-dont-go-to-hell-who-will/",
	"title": "If You Don’t Go To Hell, Who Will? - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2018/06/hell_cropped.png",
	"noveltype": "(CN)",
	"genre": "Comedy   Romance   School Life   Shoujo   ",
	"tags": "Acting   Arrogant Characters   Bickering Couple   Character Growth   Charismatic Protagonist   Charming Protagonist   Childish Protagonist   Clingy Lover   Clubs   College/University   Comedic Undertone   Confident Protagonist   Contracts   Cunning Protagonist   Cute Protagonist   Cute Story   Dense Protagonist   Determined Protagonist   Devoted Love Interests   Dishonest Protagonist   Doting Love Interests   Early Romance   Enemies Become Lovers   Female Protagonist   First Love   First-time Interc**rse   Friendship   Handsome Male Lead   Heartwarming   Hot-blooded Protagonist   Jealousy   Kuudere   Lazy Protagonist   Love at First Sight   Love Interest Falls in Love First   Love Triangles   Mismatched Couple   Misunderstandings   Modern Day   Naive Protagonist   Orphans   Past Trauma   Playboys   Playful Protagonist   Poor Protagonist   Popular Love Interests   Proactive Protagonist   Protagonist Strong from the Start   Quirky Characters   Revenge   Roommates   Shameless Protagonist   Slow Romance   Strong Love Interests   Stubborn Protagonist   Teamwork   Tragic Past   Unlucky Protagonist   Wealthy Characters   ",
	"rating": "(4.2 / 5.0, 85 votes)",
	"author": "Jiu Xiao Qi   酒小七   ",
	"year": "\n2010",
	"ranking": "#6970   #4238   #4143   #10269   #3721   ",
	"reviewcount": "16 Reviews sorted by",
	"description": "In all my life, I’ve only made two mistakes that I regret. The first was filling out my entrance exam application wrong, and the second was offending Zhong Yuan. If I had to use an idiom to describe the impact of my mistake, it would be simply, ‘Life is no better than death’. And if I had to use an idiom to describe Zhong Yuan’s offenses to me, it would be simply, ‘Too many crimes to record’. And yet, for as evil and wicked as he was, he attracted girls the way that flowers attracted bees and butterflies.\r\n\r\nIt happened that one day, for some reason, I taunted Zhong Yuan, “The King of Hell sent you to torture some more people, didn’t he?” Without a change in expression, he replied, “In order to torture fewer people, I decided to just choose one person to torture for the rest of my life.” I asked him, “What do you mean?” He smiled at me and answered, “If you don’t go to hell, who will?”>"
}