{
	"url": "https://www.novelupdates.com/series/pampering-big-cat-wife/",
	"title": "Pampering Big Cat Wife - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2018/09/image0.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Historical   Romance   Shoujo   ",
	"tags": "Ancient China   Beautiful Female Lead   Black Belly   Divorce   Female Protagonist   Generals   Handsome Male Lead   Marriage   Misunderstandings   Politics   Transmigration   Wealthy Characters   ",
	"rating": "(4.0 / 5.0, 114 votes)",
	"author": "Feng Guang   风光   ",
	"year": "\n2017",
	"ranking": "#4617   #6305   #4312   #4351   #3916   ",
	"reviewcount": "13 Reviews sorted by",
	"description": "Expressing their love verbally? Oh, Lu You and Tang Wan were really old-fashioned.\tLook as she opened her tiger mouth and eat him whole! She was famous in heaven for being a gluttonous tiger. In order to find a partner for the marathon, she actually transmigrated into the body of Tang Wan, who was delicate and gentle. She was also taken by Lu You to live in a secret residence as his mistress and not to be seen publicly. Furthermore, she even lived life like a vegetarian, making her wish she could tear open her fingertips and write the bloody 'tragic' word.\tHowever, she reckoned Lu You still had a conscience, bringing her to a scholar’s gathering to eat meat. It's just that before she could start eating, she saw a delicious “big, fresh meat” before her. She really should praise her good eyesight.  Zhao Shi Cheng was a man of striking appearance and integrity.\n\n\n\tWhen the prime minister’s daughter made things difficult for her, a few words from him made the prime minister's daughter lose face. When her ex-mother-in-law hurled insults to her, he simply proposed marriage in public and immediately promoted her to a general’s wife. Not to mention, he was also the owner of a 5-star restaurant chain. In the future, she could eat all meat she wanted until she was full.\n\n\n\tMoreover, when he learned her strength was a little bit stronger than the average girl and that her appetite was also a little bit bigger （just a little?), although he was a bit shocked, he still wants her to be herself and said that he likes this side of her. This man was simply too amazing. Of course she will protect him properly and not let him leave her…\n\n\nWhat? There’s someone who dared to pick fur near a tiger’s mouth, creating a trap to kill him while he was leading troops to suppress bandits!? Hmph! She will let these villains remember this tigress are definitely not easy to mess with…>"
}