{
	"url": "https://www.novelupdates.com/series/wifes-color-is-addicting/",
	"title": "Wife’s Color is Addicting - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2018/07/753366.jpg",
	"noveltype": "(CN)",
	"genre": "Adventure   Comedy   Drama   Romance   School Life   Slice of Life   ",
	"tags": "Academy   Appearance Changes   Beautiful Female Lead   Black Belly   Calm Protagonist   Celebrities   College/University   Cunning Protagonist   Determined Protagonist   Devoted Love Interests   Doting Love Interests   Famous Protagonist   Female Protagonist   Genius Protagonist   Handsome Male Lead   Hard-Working Protagonist   Heartwarming   Hiding True Identity   Jealousy   Misunderstandings   Modern Day   Power Couple   Revenge   Schemes And Conspiracies   Showbiz   Strong Love Interests   Transmigration   Underestimated Protagonist   Weak to Strong   ",
	"rating": "(3.6 / 5.0, 24 votes)",
	"author": "Chen Muer   辰慕兒   ",
	"year": "\n2016",
	"ranking": "#2000   #2000   #8318   #7991   #7190   ",
	"reviewcount": "2 Reviews sorted by",
	"description": "She was the most dazzling actress in the entertainment industry, but she was sadly framed by her scum boyfriend and killed in an explosion.\n\nOpening her eyes again, she became an 18-year-old wallflower student in a media college. More importantly, she surprisingly discovers there’s an ugly human skin mask on her face hiding her true features.\n\nShe kept wearing the human mask and endured the vicious remarks and bullying of all sides.\n\nBut once she made her mind, she removed the disguise amidst a wave of surprise, stepped on her enemies with 10cm heels and became an untouchable gem dazzling the world, loved by men and hated by women.\n\nWhen her unyielding soul took over that small and frail body, she vowed to stand on the Oscar podium and become a superstar in the film industry!\n\nAfter three years of disguise in the industry, she removed her silver mask at a concert and shocked the world with her unmatched beauty.\n\n…\n\nOnce she got back into the entertainment circle, she started investigating the cause of her death in her previous body, while enduring the stalking of a very persistent yet caring fellow.\n\nWhen a scandal involving her broke out, he blocked the bad gossip for her.\n\nWhen she was framed, he domineeringly declared “She’s my woman, let’s see who has the courage to touch her!”\n\nWhen she went abroad to film, he left his business to follow after her and decided to be the leading actor.\n\nSong Chumo: “…” Can this man just not cause trouble everywhere?>"
}