{
	"url": "https://www.novelupdates.com/series/i-became-the-wicked-beastmans-catnip/",
	"title": "I Became the Wicked Beastman’s Catnip - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/12/I-Became-the-Wicked-Beastmans-Catnip_1639902592.jpeg",
	"noveltype": "(KR)",
	"genre": "Drama   Fantasy   Romance   ",
	"tags": "Age Regression   Beasts   European Ambience   Fantasy Creatures   Fantasy World   Female Protagonist   Magic   Reincarnation   Royalty   Second Chance   ",
	"rating": "(3.8 / 5.0, 21 votes)",
	"author": "체르티   ",
	"year": "\n2021",
	"ranking": "#2000   #2000   #9044   #12294   #7718   ",
	"reviewcount": "1 Review sorted by",
	"description": "Yernian, the princess of a ruined kingdom, ended her short life as a victim of a magic experiment.\n\n…Is what everyone thought of. But when she opened her eyes, to her surprise, she returned to 18 years ago.\n\n“I found you. The Messiah of the Myo people.”\n\nAfter meeting the head of the Myo Clan, Yernian’s life changed 180 degrees. Somehow, Yernian, who was adopted into the royal family of Myo Clan, grew up as quietly as possible and decided to escape, but…\n\n“If a pudding and I fell into the water, who would you save first?”\n\n“I’m not going to save you both.”\n\n“I’ll give you a hundred of puddings, so save me too.”\n\nFrom the arrogant head of the Myo Clan, who had no interest in everything in the world except for the safety of his clan,\n\n“So, I mean, I’ve been thinking about this, you know?”\n\n“About your shitty personality?”\n\n“No. About when I can monopolize you.”\n\nUntil the Second Prince who was known as the most free spirited of the Myo Clan, the princes all became strange.\n\n“I’m curious.”\n\n“Hm? About what?”\n\n“How you will turn my feet into rags.”\n\nFollowing the cat that grew up after picking it up,\n\n“It’s not long before the mana finally fully blooms. You’ll be the most perfect thing among the things that I’ve ever made, Yernian.”\n\nEven an unidentified man who was obsessed with words without meaning appeared…!\n\nThen, will Yernian be able to safely escape from the wicked beastmen?>"
}