{
	"url": "https://www.novelupdates.com/series/yabai-kimochi/",
	"title": "Yabai Kimochi - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2015/08/yabaikimochi.png",
	"noveltype": "(JP)",
	"genre": "Romance   School Life   Yaoi   ",
	"tags": "Adapted from Manga   Love Triangles   S*x Friends   Unrequited Love   ",
	"rating": "(3.1 / 5.0, 18 votes)",
	"author": "Kazumi Maki   ",
	"year": "\n2004\n",
	"ranking": "#2000   #2000   #11262   #13807   #11800   ",
	"reviewcount": "No Reviews",
	"description": "The story is about Toru, an extremely quiet and shy high school student who has a crush on Ryoji, a popular member of the high school swimming team known for his sexual escapades. Further complicating this matter is that Toru and Ryoji are very close friends, thus forcing Toru to hide his real feelings for Ryoji and pretend to be just one of his good friends, while being torn between his love for Ryoji and the facade he has to keep up when he sees him every day.\n\nBut all that changes one day when Ryoji makes an indecent proposal to Toru, asking him if he would like to experiment with him sexually, and admitting that he had been aroused by thoughts of him during sexual interc**rse with his girlfriend. Toru unhappily accepts, pressured by his feelings for Ryoji, but as time passes Toru becomes even more aggravated as he realizes that his sexual affair with Ryoji was just a fling based on Ryoji’s sexual curiosity, and not on actual romantic attraction.\n\nToru is so depressed about the one-sided situation between him and Ryoji that he confides with a close friend named Kashiwazaki about his emotional turmoil. Together, they come up with a plan to discover Ryoji’s true intentions by secretly deciding to lie to him about them being in a romantic relationship together.\n\nAfter learning of this, Ryoji becomes very angry and jealous about Toru and Kashiwazaki’s alleged relationship, and tries to break them up. The plan apparently has worked, but Toru is now in a serious love triangle between Ryoji and Kashiwazaki when he begins to realize that Kashiwazaki has been in love with him for a very long time. As the story progresses, he begins to understand that he and Ryoji were not the only ones that were hiding their true feelings.>"
}