{
	"url": "https://www.novelupdates.com/series/the-villain-will-become-stupid-if-he-doesnt-pamper-me/",
	"title": "The Villain Will Become Stupid If He Doesn’t Pamper Me - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/12/becomestupidpamper1.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Shounen Ai   ",
	"tags": "Adopted Protagonist   Businessmen   Calm Protagonist   Celebrities   Complex Family Relationships   Cousins   Cute Story   Death   Doting Love Interests   Doting Parents   Economics   Inheritance   Lack of Common Sense   Misunderstandings   Modern Day   Money Grubber   Multiple Reincarnated Individuals   Murders   Older Love Interests   Personality Changes   Pets   Playful Protagonist   Reincarnation   Schemes And Conspiracies   Showbiz   Siblings Not Related by Blood   Sudden Wealth   Transmigration   Wealthy Characters   ",
	"rating": "(3.6 / 5.0, 42 votes)",
	"author": "weddingcandy123   喜糖123   ",
	"year": "\n2019",
	"ranking": "#976   #1608   #5458   #3328   #4353   ",
	"reviewcount": "12 Reviews sorted by",
	"description": "Pei Xian, who looks like the white moonlight (unattainable love) of the Villain, was going to be gifted to the Villain by his lover, Zhou Kai. Unable to withstand the betrayal by Zhou Kai, Pei Xian threatened to jump from the window of a 20 story building.\n\nSi Yang, who died in the hospital full of wishes for a simple life, transmigrated into the body of Pei Xian. Pei Xian is a character in the 3rd rate novel he read above. He transmigrated at the scene where Pei Xian in the novel was about to jump from the window.\n\nGu Han, the “villain” in the novel somehow gained a system after his tragic end, returned to the same scene in the novel. The system helps him combat the protagonist’s halo of making the “villains” like him lose their IQ. Pei Xian is chosen as the system’s “battery”, so in order to charge the system, Gu Han must maintain physical contact with Pei Xian. Gu Han has no choice but to try and stop “Pei Xian” from killing himself.\n\nSo begins the story of a reluctant ML, pampering the MC.>"
}