{
	"url": "https://www.novelupdates.com/series/im-the-evil-lord-of-an-intergalactic-empire/",
	"title": "I’m the Evil Lord of an Intergalactic Empire! - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/07/81ztizejzvL.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Comedy   Fantasy   Harem   Mecha   Sci-fi   Shounen   ",
	"tags": "Abandoned Children   Adapted to Manga   Age Progression   Androids   Antihero Protagonist   Aristocracy   Army Building   Artificial Intelligence   Assassins   Betrayal   Boss-Subordinate Relationship   Butlers   Calm Protagonist   Carefree Protagonist   Dense Protagonist   Determined Protagonist   Divine Protection   Empires   Famous Protagonist   Futuristic Setting   Godly Powers   Handsome Male Lead   Hard-Working Protagonist   Knights   Lack of Common Sense   Leadership   Loyal Subordinates   Lucky Protagonist   Magic   Maids   Male Protagonist   Management   Marriage   Marriage of Convenience   Master-Disciple Relationship   Merchants   Military   Misunderstandings   Multiple POV   Nobles   Past Trauma   Polygamy   Pregnancy   Proactive Protagonist   R-15   Reincarnated in Another World   Reincarnation   Romantic Subplot   Royalty   Schemes And Conspiracies   Selfish Protagonist   Soldiers   Strategic Battles   Strong Love Interests   Sword And Magic   Sword Wielder   Time Skip   Tragic Past   Transmigration   Tsundere   Underestimated Protagonist   Unique Weapon User   Unique Weapons   Wars   Weak to Strong   ",
	"rating": "(4.4 / 5.0, 1042 votes)",
	"author": "Mishima Yomu   Wai   わい／三嶋　与夢   ",
	"year": "\n2018",
	"ranking": "#2352   #751   #144   #678   #68   ",
	"reviewcount": "165 Reviews sorted by",
	"description": "Liam Sera Banfield is a reincarnator.\n\nHe had reincarnated into a fantasy world of magic and swords, but at the time the civilization had already been making advancements into outer space. \n\nThe setting takes place in an intergalactic empire, a space opera-like universe where humanoid weapons and spaceships battle.\n\nLiam, who had been reborn into an aristocratic family in a monarchic society, has the ambition to one day become an evil lord.\n\nIn his previous life, Liam had unfortunately lost everything and died in despair.\n\n— It’s foolish to live for others.\n\n— I will live for myself.\n\nKeeping those feelings in his heart, he has decided to fulfil his goal, but is instead worshipped as a virtuous ruler due to his difference in values.\n\nWill Liam be able to become an evil lord?>"
}