{
	"url": "https://www.novelupdates.com/series/i-became-a-humans-daughter/",
	"title": "I Became a Human’s Daughter - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/09/I-Became-a-Humans-Daughter.jpg",
	"noveltype": "(KR)",
	"genre": "Fantasy   Romance   ",
	"tags": "Aristocracy   Beautiful Female Lead   Child Protagonist   Childcare   European Ambience   Family   Female Protagonist   God Protagonist   Goddesses   Misunderstandings   Royalty   ",
	"rating": "(4.7 / 5.0, 12 votes)",
	"author": "홍다온   ",
	"year": "\n2022",
	"ranking": "#763   #1996   #10548   #2838   #10374   ",
	"reviewcount": "1 Review sorted by",
	"description": "Ariel is a little goddess who cannot use divine powers. \r\n\r\nWhen she woke up from her nap, she found herself on the ground in the middle of a street! So she grabbed the Grand Duke’s trousers, who she met by chance, and hung onto it.\r\n\r\n“Take me with you!”\r\n\r\n***\r\n\r\nShe intended to stay at the Grand duchy until she could find her way back to the realm.\r\n\r\n“I got hurt here!”\r\n\r\nAfter she said that, unknowingly, she became the Grand Duke’s daughter.\r\n\r\n“Heartless! I can’t get up right now!”\r\n\r\nThis time, even the Emperor clings to her, claiming her as his adopted daughter, causing the two brothers to quarrel.\r\n\r\n“You’re going to take away my younger sister. How can I speak to you nicely?”\r\n“Who’s your sister? She’s my sister!”\r\n“Yes, Ariel is going to be my sister now!”\r\n\r\nThe second generation has turned themselves into enemies.\r\n\r\nEven the Pope, who has to mediate between them, wants to covet Ariel.\r\n\r\n“I will take over Ariel until you two reach an agreement.”\r\n\r\nWhat the hell is going on here?\r\n\r\nSoon after, people she doesn’t know appeared and said they would repay her. Do they even know her?\r\n\r\n“I’ve been waiting for you to call for me for a long time.”\r\n“You saved my life, my lord.” – Subordinates 1, 2, 3.\r\n\r\nAriel just wanted to regain her lost memory and strength to return to the realm, but the world wouldn’t let her go…?>"
}