{
	"url": "https://www.novelupdates.com/series/as-a-captain-you-must-be-cold/",
	"title": "As a Captain, You Must Be Cold - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/07/As-a-Captain-You-Must-Be-Cold.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Romance   Slice of Life   Sports   Yaoi   ",
	"tags": "Arrogant Characters   Clubs   Cold Protagonist   Comedic Undertone   Cute Protagonist   Dense Protagonist   Devoted Love Interests   Doting Love Interests   e-Sports   First Love   Gamers   Handsome Male Lead   Hard-Working Protagonist   Narcissistic Protagonist   Power Couple   Younger Love Interests   ",
	"rating": "(4.3 / 5.0, 20 votes)",
	"author": "芝芝猫猫   ",
	"year": "\n2022",
	"ranking": "#2071   #2300   #8602   #3450   #6906   ",
	"reviewcount": "3 Reviews sorted by",
	"description": "As the youngest captain of the league team, Yu Zhaohan knew that if he wanted to establish his prestige, he must establish a stable personality. His eyes were indifferent, he has a cold face, and he always used a full stop when sending messages. Especially in front of Shi Du, the new transfer, who was too much to handle.\r\n\r\nEveryone thought Yu Zhaohan is a beautiful and cold flower, and so did Shi Du. He has never been interested in Bking, and he was too lazy to interact with Yu Zhaohan. Until one day, Shi Du ended his vacation early and returned to the base.\r\n\r\nHe saw Yu Zhaohan wearing a little dinosaur’s plush pajamas, sitting cross-legged on the sofa watching “Ultraman”, battling an unopenable canned fruit, and even using his teeth.\r\n\r\nThe two looked at each other, and the scene was very awkward.\r\nYu Zhaohan’s face was still cold, but his ears were red: “It’s a misunderstanding, I’m not a fool.”\r\n\r\n“I see.” Shi Du smiled and approached Yu Zhaohan with full aggression, “Then, does the captain need help?”\r\n\r\nAfter the two dated -\r\nShi Du: “Do you know baby, you don’t need to pretend to be in front of your boyfriend.”\r\n\r\nYu Zhaohan pondered for a long time, then slowly raised his head: “Oh… can that boyfriend touch my head?”\r\n\r\nNote: Bking : Something like a “bking” is a king of “装逼“ which is someone who does cool stuff effortlessly or everything they do is unusually “cool”.>"
}