{
	"url": "https://www.novelupdates.com/series/after-the-villainous-supporting-male-had-raised-the-wrong-canary/",
	"title": "After the Villainous Supporting Male Had Raised the Wrong Canary - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/04/After-the-villainous-supporting-male-had-raised-the-wrong-canary.png",
	"noveltype": "(CN)",
	"genre": "Romance   Shounen Ai   ",
	"tags": "Autism   Caring Protagonist   Cute Protagonist   Doting Love Interests   Doting Parents   Heartwarming   Hiding True Identity   Misunderstandings   Mysterious Past   Naive Protagonist   Secret Identity   Secret Relationship   Showbiz   Transmigration   Wealthy Characters   ",
	"rating": "(3.9 / 5.0, 28 votes)",
	"author": "Shí Hái Dú Wǒ Shū   时还读我书   ",
	"year": "\n2020",
	"ranking": "#3314   #2000   #8150   #11072   #8809   ",
	"reviewcount": "7 Reviews sorted by",
	"description": "Lu Bai had transmigrated into the novel 'Gu Xue'. In this domineering pure love novel, he became the vicious supporting character who chased after the protagonist gong. \n\nJust like countless other villains in novels, Lu Bai did all kinds of plot and schemes in order to obstruct (assist) the protagonist gong, Qin Gu, and the protagonist shou, Qu Xueyu from being together and eventually caused ruin to himself. \n\nBut Lu Bai, this villain, is a little special — he had a twisted mind and the way he courted disaster on himself was unusual. \n\nWhen other villains would raise canaries and support substitutes, they would raise a substitute of their white moonlight. \n\nHowever, Lu Bai raised the lover of his white moonlight– that is– a body double of the protagonist shou, Qu Xueyu—- He raised a canary that looked very similar to Qu Xueyu to, in nicer words, humiliate his love rival. In the end, he only brought himself to ruin. \n\nAfter transmigrating, Lu Bai took a look at the tooth rotting plot and got a headache. But in order to return home after the story line was completed, he still braced himself for it—– \n\n“Are you Ruan Jiangjiu,” He blocked the handsome young man who was a head taller than himself in an alley and threw a card in front of him: “You’re broke ba—-” Lu Bai grit his teeth and just spat out the words: “As long as you…. this one million is yours!” \n\nRuan Jiangjiu looked at the person with a reddened face trying hard to appear strong in front of him. The youth looked like a fierce angry kitten. A dangerous smile filled with intrigue formed on Ruan Jiangjiu’s face. \n\n—- \n\nThe film emperor Qu Xueyu took on a somewhat special role: A poor student with a warped mentality that eventually blackened. So, in order to take on this role, he disguised himself as Ruan Jiangjiu and went to work a part time job to experience the character’s life. \n\nThe only thing he never expected was that the little dandy that always followed his childhood friend, Qin Gu’s, back would provoke himself in that kind of way. He also didn’t expect to be moved by his provocation and become addicted to the other party. \n\n— \n\nLu Bai said bitterly: Xiao Ruan, as long as you can anger that Qu Xueyu you can ask Laozi to give you any resource you want. Laozi will even buy your way to become film emperor. Someone more amazing than Qu Xueyu! \n\nXiao Ruan the canary: Smile.jpg>"
}