{
	"url": "https://www.novelupdates.com/series/i-told-you-im-not-%e3%80%87%e3%80%87-when-i-helped-out-the-most-beautiful-girl-in-my-class-my-identity-got-found-out/",
	"title": "I Told You I’m Not 〇〇!! ~When I Helped Out the Most Beautiful Girl in My Class, My Identity Got Found Out~ - Novel Updates",
	"image": "https://www.novelupdates.com/img/noimagefound.jpg",
	"noveltype": "(JP)",
	"genre": "Comedy   Romance   School Life   Slice of Life   ",
	"tags": "Appearance Changes   Beautiful Female Lead   Cooking   Dense Protagonist   Famous Protagonist   Handsome Male Lead   Hiding True Identity   Love Interest Falls in Love First   Male Protagonist   Mob Protagonist   Models   Modern Day   Multiple POV   Part-Time Job   Popular Love Interests   Secret Identity   Secretive Protagonist   Showbiz   ",
	"rating": "(3.7 / 5.0, 158 votes)",
	"author": "NaHCO3   ",
	"year": "\n2019",
	"ranking": "#4080   #2884   #1148   #3230   #2329   ",
	"reviewcount": "12 Reviews sorted by",
	"description": "I told you I’m not 〇〇!! ~When I helped out the most beautiful girl in my class, my identity got found out~\n\nI, Hiura Seiya aim to live like a mob.\n\nHow much of a mob I want to be? The grade will affect my future so I am doing my best on that but I came to school early so that no one would notice me and keep my head buried in the book so that I can blend into the background! I only have one friend in my class! it might be bad for me to say this but the guy I talk to is not a handsome guy or anything, he’s just a single frame in the classroom……..I have been living such a plain life like that but I actually have a secret, I am in a modelling business.\n\nMy daily life began to crumble one day when I am heading back home from work and saved Ehashi Reika, a girl in my class who was being hit on in the street.\n\n[What are you reading?],\n\n[Want to head home together?].\n\nWas I found out? At school, my face is always being hidden by my bangs so there shouldn’t be any trace that links me to my original appearance, how did she know? At this rate I will change class from a mob into an annoying guy instead!\n\n[No, you must have confused me with someone else].\n\nA story of a sneaky boy eluding a girl……at least he intends to.>"
}