{
	"url": "https://www.novelupdates.com/series/my-captain/",
	"title": "My Captain - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/08/My-Captain.jpg",
	"noveltype": "(CN)",
	"genre": "Drama   Romance   ",
	"tags": "Beautiful Female Lead   Cold Love Interests   Female Protagonist   Handsome Male Lead   Modern Day   Multiple POV   Pilots   Playful Protagonist   Strong Love Interests   World Travel   ",
	"rating": "(4.0 / 5.0, 6 votes)",
	"author": "Yuan Xiao Bei   圆小北   ",
	"year": "\n2022",
	"ranking": "#2000   #2000   #12366   #11905   #12394   ",
	"reviewcount": "1 Review sorted by",
	"description": "Life is simply too short to have fun.\n\nYan An agreed with this saying and decided to seek some sort of fun during her lonely trip.\n\nAnd now, in the present, inside the cramped airplane cabin, the skydiving instructor is sitting next to her.\n\nWith an upright face and long and toned legs, the instructor overall has a striking and abstinent impression.\n\nIndeed it is an abundantly beautiful spring; spring is now in the human world.\n\n“Hey, handsome, my life is now in your hands now, so why don’t you give me your phone number, huh?”\n\n*\n\nAs the first ray of sunlight penetrates the receding darkness of the night, Shan Yi slowly gets up, his rugged and sensual figure laid bare for all to see.\n\nBut room is so dead and quiet as if there hasn’t been any trace of any living person.\n\nThen the phone under the pillow vibrates: There is a sudden emergency, so I’m returning to China first. Thank you for your kindness, and see you in the rivers and lakes soon! Bye-bye, handsome.\n\nShan Yi silently smiled at the message; while morning rays of the sun strangely felt like it didn’t bring any warmth.\n\n*\n\nIn Beitong Airlines, a new batch of trainee pilots has been recently dispatched.\n\nYan An, who was assigned to follow the new captain of the aircraft, heard that he is one of the most competent and punctual captains in the entire civil aviation industry.\n\nAnd around that time, she heard the clacking sound of leather shoes approaching the door, Yan An decided sneakily stretched her neck to take a quick look, where she was left utterly dumbfounded.\n\nThe man is in a crisp and pristine uniform. He has broad shoulders, narrow waist, and tall, upright body, that is seemingly bursting with testosterone.\n\nThe gaze of the two collided, and with his black eyes so piercing and deep, Shan Yi raised his thin lips into a smile yet not like a smile, he gently pressed a hundred-euro bill onto the table, and calmly stated,\n\n“Returning it to its rightful owner.”\n\nThe man declared in a cold-clipped tone: “My worth, when compared to this amount of money, is far from close.”\n\nYan Dog: F*ck, you have lost your future by being wild like this!>"
}