{
	"url": "https://www.novelupdates.com/series/miracle-doctor-abandoned-daughter-the-sly-emperors-wild-beast-tamer-empress/",
	"title": "Miracle Doctor, Abandoned Daughter: The Sly Emperor’s Wild Beast-Tamer Empress - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2016/09/19251s.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Fantasy   Martial Arts   Mature   Romance   Shoujo   Xuanhuan   ",
	"tags": "Adapted to Manhua   Alchemy   Beast Companions   Beasts   Beautiful Female Lead   Black Belly   Bullying   Cheats   Cultivation   Cunning Protagonist   Determined Protagonist   Devoted Love Interests   Doctors   Doting Love Interests   Familial Love   Farming   Female Protagonist   Genius Protagonist   Handsome Male Lead   Hard-Working Protagonist   Loli   Love Interest Falls in Love First   Love Triangles   Lucky Protagonist   Magic Beasts   Magical Space   Male Yandere   Multiple Personalities   Obsessive Love   Phoenixes   Pill Concocting   Poisons   Poor to Rich   Possessive Characters   Revenge   R*pe   S*xual Abuse   Strong Love Interests   Transmigration   Weak to Strong   ",
	"rating": "(4.2 / 5.0, 279 votes)",
	"author": "MS Lotus   MS Phù Tử   MS芙子   ",
	"year": "\n2015",
	"ranking": "#6970   #4835   #213   #4723   #840   ",
	"reviewcount": "40 Reviews sorted by",
	"description": "One day the mentally disabled 13 year old daughter of the Ye family is reborn! Ruling over the Omnipotent God’s Cauldron and possessing a spirit cultivation space, she’s no longer the good-for-nothing, abandoned girl who everyone bullies on sight!\n\nWith her incomparable poisons, even miracle doctors have to move to the side.\n\nSpirit beasts beg for contracts, but even the God of Beasts has to call her Boss. \n\nScum father abandons his wife and daughter, she will surely make him destitute and homeless.\n\nPeople of the world bully and insult her, then she will definitely pay them back a hundredfold.\n\nReborn again into the world, she returns as a sovereign, but who knew she would attract the nefarious-blood-thirsty-demon him.\n\nHe’s definitely the sly emperor who doesn’t hesitate to kill and cut down anyone, but he transforms into a harmless foolishly cute prisoner prince of an enemy country……>"
}