{
	"url": "https://www.novelupdates.com/series/ye-ningxi/",
	"title": "Ye Ningxi - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/03/Ye-Ningxi.jpg",
	"noveltype": "(CN)",
	"genre": "Drama   Romance   Shoujo   Tragedy   ",
	"tags": "Betrayal   Female Protagonist   Friends Become Enemies   Limited Lifespan   Misunderstandings   Modern Day   Organized Crime   Secret Organizations   Sickly Characters   Survival   Terminal Illness   ",
	"rating": "(4.6 / 5.0, 5 votes)",
	"author": "飞烟   ",
	"year": "\n2009",
	"ranking": "#2000   #2000   #12325   #12114   #12028   ",
	"reviewcount": "1 Review sorted by",
	"description": "More than a decade ago, in a conspiracy to overthrow the the leader of the Dutch underworld organization “The Red Room” (Chi Yu), his then 12-year-old illegitimate daughter Xuanyuan Ningxi, was secretly trafficked to a horrible and bloody killer training-base- “Rebirth Island” (Wangsheng Island)\r\n\r\nOn this isolated hell of an island, she met a man who changed her life – Xuan Siye who was 8 years her senior and is an instructor on the island. He has excellent ability but a violent temperament. However he only has a soft spot for her- treating her with special preference. Finally, when she was 16 years old, Xuan Siye forcibly already occupied her for a killing job.\r\n\r\nTwo years later, in order to break away from the control of the island base, the 18-year-old Ningxi made use of Xuan Siye to destroy it. She pierced his chest with a blade having the desperate, sad and indignant Xuan Siye fall into the deep sea.\r\n\r\nAfter that, Ningxi left the Rebirth Island with her training partners Yuan Xu, Teng Jun and several others. They returned to the Netherlands to set up the “Shadow hall” (Ying Tang), to revive the power of the Xuanyuan’s family\r\n\r\nUnexpectedly, four years later, “The Red Room” repeatedly received attacs from a secret organization from Asia, with the same modus as that of Xuan Siye therefore making it a battle of love and hate, a contest of blood and fire, and a subversion of schemes and conspiracies. Since then, her heroic picture of redemption and destruction started to unfold.>"
}