{
	"url": "https://www.novelupdates.com/series/the-prime-ministers-wife-is-the-richest-woman/",
	"title": "The Prime Minister’s Wife Is The Richest Woman - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/11/The-Prime-Ministers-Wife-Is-The-Richest-Woman.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Drama   Fantasy   Romance   Slice of Life   ",
	"tags": "Ancient China   Arrogant Characters   Beautiful Female Lead   Calm Protagonist   Carefree Protagonist   Clever Protagonist   Doting Older Siblings   Familial Love   Family Business   Female Protagonist   First Love   Love Interest Falls in Love First   Politics   Power Couple   Royalty   Schemes And Conspiracies   Smart Couple   Strong Love Interests   Transmigration   ",
	"rating": "(4.4 / 5.0, 116 votes)",
	"author": "插柳成荫   ",
	"year": "\n2021",
	"ranking": "#114   #131   #1802   #212   #2667   ",
	"reviewcount": "26 Reviews sorted by",
	"description": "Ji Yunxi transmigrated into a book and accidentally became the richest person. In order to save her family, she decided to choose a thigh as her husband.\n\nThe vision she has for choosing a husband is very different from that of others. She likes a man with a deep mind and ruthless in his scheming. It doesn’t matter what he looks like.\n\nShe found that the Wu family has an unpopular Young Master that suits her taste well.\n\nAlthough he looks ordinary, Ji Yunxi likes it very much.\n\nShe naturally has to find a way to get the thigh she likes into her hands. He is just an unpopular Young Master now so of course it is not difficult for her to get him.\n\nAll the noble ladies in every family think that Ji Yunxi must be blind.\n\nMany years later, all the noble ladies in every family regretted it very much.\n\nPrime Minister Wu’s temperament in ruling and opposition is simply the most handsome one in the world!\n\nJi Yunxi herself also regretted it very much: “I don’t want it anymore now. Whoever wants this thigh, just come and drag it away.”\n\nPrime Minister Wu slowly wiped his hands with the handkerchief: “That’s not what you said when you smashed me with money at that time.”>"
}