{
	"url": "https://www.novelupdates.com/series/siertas-archduke-capture-operation/",
	"title": "Sierta’s Archduke Capture Operation - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/06/Siertas-Archduke-Capture-Operation.jpg",
	"noveltype": "(KR)",
	"genre": "Comedy   Drama   Fantasy   Josei   Romance   ",
	"tags": "Aristocracy   Beautiful Female Lead   Betrayal   Character Growth   Charismatic Protagonist   Charming Protagonist   Clever Protagonist   Contracts   Curses   Engagement   European Ambience   Female Protagonist   Helpful Protagonist   Knights   Love Interest Falls in Love First   Maids   Male Protagonist   Marriage of Convenience   Nobles   Past Trauma   Reincarnation   Royalty   Shameless Protagonist   ",
	"rating": "(2.9 / 5.0, 12 votes)",
	"author": "탈레이아   ",
	"year": "\n2018",
	"ranking": "#3567   #2000   #12193   #10839   #6967   ",
	"reviewcount": "No Reviews",
	"description": "In her previous life, she became the crown princess, but she was betrayed by the prince and her family was annihilated.\r\n\r\nShe was killed by the prince’s sword, and when she opened her eyes, she had returned to the past. In order to survive, Sierta, who will never become a crown princess again, will somehow protect her family, and be sure to be happy, proposes a three-year marriage to Archduke Harrace Heidwig in order to survive.\r\n\r\nHarrace, a hero of the empire, called the empire’s guardian sword, has power that even the emperor cannot easily control after the blood of a dragon.\r\n\r\nHe accepts a marriage proposal to use Sierta to break the imperial curse on him.\r\n\r\n“I am going to marry my Majesty the Grand Duke.”\r\n\r\n“Duke? Are you talking about Grand Duke Hedwig?”\r\n\r\n“Yes, father. He’s the only Grand Duke in the Empire, Harrace Heidwig, right?”\r\n\r\n“Your Majesty the Grand Duke? Where are we going now?”\r\n\r\n“Where are we going? To the bedroom. You said that the Marquis’ wife decorated your room?”\r\n\r\n“What?”\r\n\r\nOn the first night of their marriage, they think that they should pretend to be calm in their hearts and minds, but their bodies aren’t.\r\n\r\nBut, should we continue to use oriental medicine like this for 3 years?\r\n\r\nThe enterprising ’new destiny pioneering project’ of the sexy man Harrace who tries to escape the bondage of the brave and lovely Sierta, who is not frustrated in front of his sad fate, and the cursed family.>"
}