{
	"url": "https://www.novelupdates.com/series/undercover-infiltration-duchess/",
	"title": "Undercover Infiltration Duchess - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/04/Undercover-Infiltration-Duchess.png",
	"noveltype": "(KR)",
	"genre": "Adult   Drama   Fantasy   Romance   Slice of Life   Smut   ",
	"tags": "Aristocracy   Arranged Marriage   BDSM   Beautiful Female Lead   Character Growth   Charming Protagonist   Cold Love Interests   Contracts   Devoted Love Interests   Doting Love Interests   European Ambience   Family   Female Protagonist   First Love   First-time Interc**rse   Forced Living Arrangements   Handsome Male Lead   Jealousy   Love Interest Falls in Love First   Male Yandere   Marriage of Convenience   Masochistic Characters   Misunderstandings   Nobles   Obsessive Love   Possessive Characters   R-18   Royalty   Strong Love Interests   ",
	"rating": "(3.4 / 5.0, 59 votes)",
	"author": "금은하   ",
	"year": "\n2019",
	"ranking": "#1957   #1319   #3222   #3281   #3156   ",
	"reviewcount": "4 Reviews sorted by",
	"description": "Erit, Ezet’s older sister, runs away after three years of signing a contract marriage. In the place of her runaway sister, she entered the Duke of Jaxen’s castle.\n\nUnable to afford the penalty for breaching the contract, she unintentionally pretends to be a fake wife.\n\nHowever, Duke Edmond Jaxen is a sad*st with a tremendous desire for monopoly. At first, she was amazed by her shameful play with her husband, and now she realized that she had a masochist instinct.\n\n* * *\n\n“Does shaking your ass mean you want me to hit more?” Again without her ever answering! She heard a fricative sound and weeping as she buried her face in the sheet.\n\nIt was thrilling rather than hurting. Even though she was having an absurd experience of being hit by her husband, Ezet’s body gave strength to her belly and raised her hips higher by raising her knees. The friction spread from the hips to the thighs.\n\n“You said you didn’t want to be forced to do it, but it seems it feels good to get a hit on your butt.”\n\n“Ah, no!”\n\n“Then what is the reason you shake your hips in front of me?”\n\n“Haa!”\n\nSlap, slap. A sensation of excitement and heat continued to pour out, and even though the affected area was swollen red, the buttocks continued to tingle. The trembling didn’t stop as if she was addicted to the hitting sensation. Not knowing that her legs were starting to get wet, she moaned and shook her ass.>"
}