{
	"url": "https://www.novelupdates.com/series/complete-martial-arts-attributes/",
	"title": "Complete Martial Arts Attributes - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/07/Complete-Martial-Arts-Attributes.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Comedy   Fantasy   Martial Arts   Xuanhuan   ",
	"tags": "Adapted to Manhua   Alchemy   Aliens   Alternate World   Archery   Beast Companions   Beautiful Female Lead   Black Belly   Blacksmith   Body Tempering   Cheats   Cultivation   Dense Protagonist   Elemental Magic   Fantasy World   Fast Cultivation   Game Elements   Gate to Another World   Handsome Male Lead   Hiding True Abilities   Jack of All Trades   Male Protagonist   Modern Day   Monsters   Mythical Beasts   Nationalism   Overpowered Protagonist   Parallel Worlds   Racism   Shameless Protagonist   Slow Romance   Strength-based Social Hierarchy   Sudden Strength Gain   Sword And Magic   Unique Weapon User   Weak to Strong   ",
	"rating": "(3.4 / 5.0, 44 votes)",
	"author": "莫入江湖   ",
	"year": "\n2019",
	"ranking": "#2000   #2874   #6999   #13807   #10498   ",
	"reviewcount": "11 Reviews sorted by",
	"description": "The dimensional rifts link the earth to the Xingwu continent. This is the dawn of the martial arts era!\n\nI will be useless if I don’t practice martial arts? Don’t worry, I have a system that allows me to pick up attributes. When other people drop attributes during their training, I can pick them up secretly.\n\nHuh? Did you just say that beating up people will make them drop attributes too? In that case…\n\nYou defeated a sword skill genius. He dropped Enlightenment×2, Sword Talent×1… You’ve picked them up. Your insights have improved and you’ve gained a beginner stage sword talent!\n\nYou defeated a blade skill talent. He dropped Blade Battle Technique×1, Malicious Blade Intent×1… You picked them up and learned a rare blade battle technique! You’ve also figured out Malicious Blade Intent and have become extremely fierce!\n\nYou defeated a physique talent. He dropped Physique Scripture×1, Holy-Blood Dominant Physique×1… You picked them up and learned a new top-grade scripture! You are exceptionally lucky to have received the Holy-Blood Dominant Physique. It can change your physique completely and you earned a god-level title ‘Endless Health’.\n\nSomeone killed a powerful star beast and dropped Spiritual Sight×1 and Blank Attribute×60… You picked them up secretly and receive a spiritual eye talent as well as 60 points to add to any of your current attributes!\n\nYou defeat many opponents in your life. You accidentally kill an innocent devil and split the universe into two when you’re practicing your blade at home. You burst the sun with your fist and the world is engulfed in darkness…\n\nThat’s when you realize… You’re invincible!>"
}