{
	"url": "https://www.novelupdates.com/series/how-to-win-my-husband-over/",
	"title": "How To Win My Husband Over - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/11/How-to-Get-My-Husband-on-My-Side.jpg",
	"noveltype": "(KR)",
	"genre": "Drama   Fantasy   Mature   Psychological   Romance   Tragedy   ",
	"tags": "Abusive Characters   Adapted to Manhwa   Aristocracy   Beautiful Female Lead   Bullying   Character Growth   Child Abuse   Complex Family Relationships   Cruel Characters   Death of Loved Ones   Depression   Distrustful Protagonist   Emotionally Weak Protagonist   European Ambience   Family Conflict   Fantasy Creatures   Fantasy World   Female Protagonist   First-time Interc**rse   Forced Marriage   Handsome Male Lead   Hated Protagonist   Incest   Jealousy   Knights   Love Interest Falls in Love First   Magic   Manipulative Characters   Monster Tamer   Monsters   Multiple POV   Nobles   Past Trauma   Politics   Possessive Characters   Psychopaths   Reincarnation   Religions   Sadistic Characters   Siblings Not Related by Blood   Slow Romance   Special Abilities   Suicides   Survival   Transmigration   Tsundere   Unreliable Narrator   Villainess Noble Girls   ",
	"rating": "(4.4 / 5.0, 172 votes)",
	"author": "냥이와 향신료   ",
	"year": "\n2019",
	"ranking": "#2510   #3144   #1894   #4460   #1117   ",
	"reviewcount": "36 Reviews sorted by",
	"description": "I became the Villainess who died at the hands of her husband in the novel.\n\nTo be exact, as a supporting role who dies after being used by her father and brother as a tool for political marriage.\n\nOne day, my goddamn father crawled out and brought my fifth groom.\n\nThe problem is that he is the husband who will kill me, and is the best paladin in the north who will bring down my family in the future.\n\nFirst of all, I have to find a way to live.\n\nBefore I find a way to save my sister-in-law,\n\nIn the original story, before I find a way to save my sister-in-law whom I was supposed to kill, there are many difficulties, such as my husband’s coldness, the northerners’ contempt and check, but if I seems harmless to the people here—\n\nWon’t he save my life later on?\n\n“I have a crush on you!”\n\nSo please save me!>"
}