{
	"url": "https://www.novelupdates.com/series/the-villainess-is-a-millionaire-solver/",
	"title": "The Villainess is a Millionaire Solver - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/05/The-Villainess-is-a-Millionaire-Solver.jpg",
	"noveltype": "(KR)",
	"genre": "Drama   Fantasy   Romance   ",
	"tags": "Aristocracy   European Ambience   Female Protagonist   Hated Protagonist   Transmigration   Villainess Noble Girls   ",
	"rating": "(3.7 / 5.0, 6 votes)",
	"author": "정연   ",
	"year": "\n2022",
	"ranking": "#2000   #2000   #13239   #12295   #11363   ",
	"reviewcount": "No Reviews",
	"description": "One of the wealthiest people in the Empire, the Duke of Rosen has only one blemish.\n\nThe fact that Aristina, the worst villain in the Empire, is the only daughter of the Duke!\n\nIn the end, she is imprisoned in her home in an attempt to poison the prince’s fiancée, and the moment she is murdered by an unknown criminal, ‘I’ takes hold of her body.\n\nFortunately, the frame was cleared, but more importantly…\n\n‘Who was the killer of Aristina?’\n\nThanks to her personality that is not strange even if she is stoned along the way; everyone who is crushed is suspected of being a preliminary murderer.\n\n‘Never die twice!’ She restored the trust of the sickly Duke, who had been rotting all his life because of his daughter, and went around doing good deeds with impure intentions.\n\n“Aristina! You have to lighten the mood of this prom!” Starting with the 2nd prince, who acts as a large loyal dog without opening the open front.\n\n“You say you’re going to lose your hair and run after the girls? That’s what we need right now.” The crown Prince breaks down his polite and respectful mask only in front of me.\n\n“Who did you go to that day after you left me?” Even the head of the holy church only reveals secrets the more she digs.\n\nEven the most probable suspects turned to me and twisted too far. But the peace is short-lived, and the real killer is finally revealed.>"
}