{
	"url": "https://www.novelupdates.com/series/your-regrets-are-late/",
	"title": "Your Regrets Are Late - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/08/Your-Regrets-Are-Late.jpg",
	"noveltype": "(KR)",
	"genre": "Fantasy   Romance   Tragedy   ",
	"tags": "Aristocracy   Beautiful Female Lead   European Ambience   Family Conflict   Female Protagonist   Handsome Male Lead   Multiple Reincarnated Individuals   Nobles   Reincarnation   Revenge   Royalty   Second Chance   Tragic Past   ",
	"rating": "(4.4 / 5.0, 14 votes)",
	"author": "잔우리   ",
	"year": "\n2020",
	"ranking": "#862   #833   #7528   #1038   #8736   ",
	"reviewcount": "3 Reviews sorted by",
	"description": "She wanted to be loved when she was young, and to be recognized when she grew up.\r\n\r\nThe ground that buried her mother’s body hadn’t dried up enough, but her father already brought in his illegitimate child as her sister.\r\n\r\n“...You did a good job, Charelize.”\r\n\r\nWhen she heard that she did a good job for the first time, she thought from then on she was going to live a happy life.\r\n\r\nHowever, that was her mistake. Charelize thought about what had happened for a while.\r\n\r\nThat illegitimate child drinks poisoned tea on her own to bring her down.\r\n\r\n“All the time I've spent with you is terrible.”\r\n\r\nBeing betrayed by her fiancé, whom she loved with all her heart.\r\n\r\n“Since you bring down our family dignity, our relationship is no longer a relationship between father-daughter.”\r\n\r\nHer father didn’t recognize her as his daughter nor successor until the very end.\r\n\r\nShe gave up the child in her belly in the cold prison and chose to die.\r\n\r\nIt was only then that she was able to let go of the relationship that had been severe since a long time.\r\n\r\nShe ridiculed herself who had been struggling in her lonely life.\r\n\r\n* * *\r\n\r\nWhen she opened her eyes, the spring when she was 17 years old came to her again.\r\n\r\nHer fiancé, who remembered everything about the past, weeps and begs for her forgiveness. \r\n\r\nHer father came to her because she made a different action than what she had been doing before.\r\n\r\n“Don’t be happy, and don’t laugh too. Just live your life in hell.”\r\n\r\n“If you couldn’t be a father, then you shouldn’t have given birth to me.”\r\n\r\nAt the sad regrets that coming late, this time she let go of their hand first. >"
}