{
	"url": "https://www.novelupdates.com/series/ouroboros-record-circus-of-oubeniel/",
	"title": "Ouroboros Record ~Circus of Oubeniel~ - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2016/12/Ouroboros1.jpg",
	"noveltype": "(JP)",
	"genre": "Drama   Fantasy   Mature   Psychological   Seinen   Supernatural   Tragedy   ",
	"tags": "Alchemy   Aristocracy   Brainwashing   Calm Protagonist   Clever Protagonist   Cold Love Interests   Death   Depictions of Cruelty   Determined Protagonist   Distrustful Protagonist   Drugs   Elves   Evil Protagonist   Family Conflict   Gore   Human Experimentation   Kingdom Building   Knights   Loyal Subordinates   Magic   Maids   Male Protagonist   Master-Servant Relationship   Mind Control   Multiple POV   Murders   Nobles   Quiet Characters   Reincarnated in Another World   Reincarnation   Royalty   R*pe   Ruthless Protagonist   S*aves   Stockholm Syndrome   Stoic Characters   Twisted Personality   Unrequited Love   Vampires   Wealthy Characters   Yandere   ",
	"rating": "(4.5 / 5.0, 541 votes)",
	"author": "Yamashita Minato   山下湊   ",
	"year": "\n2015",
	"ranking": "#3017   #3736   #892   #3606   #445   ",
	"reviewcount": "56 Reviews sorted by",
	"description": "[This is an everlasting love story.]\n\nThe second son of the Count family, Tullius Shernan Oubeniel, was a person who reincarnated from modern day Japan. That is, a person who has a single experience of death. With no understanding as to how he was reincarnated, he thought that perhaps, he might be reincarnated next time in the same way. Yet, his fear of death was greater than anything – above that, he could only do things such that he avoids death. Peculiar to this world were certain kinds of magic and one of them was alchemy. Choosing this class of magic, he was said to be able to attain perpetual youth and longevity. With that as his only salvation and goal, he had to reach out his hand towards the deepest secrets of alchemy and did so as though it was the only way for him to live. Even if there were sacrifices to be made for that end.\n\nA slave maid admired him from his youth. A Count family. Adventurer. slave. Citizen. Aristocrat. Country. Humans. Other beings that were not human…… Just because of one man’s delusional obsessions, many lives were changed, warped, torn apart. Even then, Tullius’s footsteps never knew pause. Everything was so that he could reach the forever he longed for.>"
}