{
	"url": "https://www.novelupdates.com/series/i-rely-on-beauty-to-stabilize-the-country/",
	"title": "I Rely on Beauty to Stabilize the Country - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/09/relyonbeauty2.jpg",
	"noveltype": "(CN)",
	"genre": "Fantasy   Romance   Yaoi   ",
	"tags": "Adapted to Manhua   Aggressive Characters   Ancient China   Androgynous Characters   Bisexual Protagonist   Character Growth   Charming Protagonist   Cold Protagonist   Court Official   Cunning Protagonist   Depictions of Cruelty   Economics   Empires   Eunuch   Generals   Handsome Male Lead   Kingdom Building   Kingdoms   Leadership   Love Interest Falls in Love First   Loyal Subordinates   Male Yandere   Masochistic Characters   M*sturbation   Military   Nobles   Older Love Interests   Politics   Possessive Characters   Rebellion   Royalty   Ruthless Protagonist   Schemes And Conspiracies   Sickly Characters   Slow Romance   Strong Love Interests   Transmigration   Wars   Weak Protagonist   Yandere   ",
	"rating": "(4.6 / 5.0, 140 votes)",
	"author": "Wàng Sānshān   望三山   ",
	"year": "\n2020",
	"ranking": "#3923   #3581   #2741   #2854   #1618   ",
	"reviewcount": "27 Reviews sorted by",
	"description": "Gu Yuanbai transmigrated into a BL novel as a weak, sickly emperor who barely had any sense of presence in the plot. The novel was a story of the struggle to gain the political power and love between the future regent and the first beauty in the capital, and he was supposed to serve just as a backdrop board.\n\nGu-wildly ambitious-Yuanbai: Don’t make me laugh.\n\nHe was the emperor—why would he let go of his power instead of expanding the national borders and leaving his name in the annals of history?\n\n*\n\nXue Yuan, the son of the current supreme general and the future regent, hiding a burning ambition, accompanied his father into the palace for the first time. That day, he looked up, hidden among the crowd of courtiers, and caught a glimpse of the young emperor’s face.\n\nNaturally rebellious, he sneered, thinking contemptuously that the little emperor looked prettier than the palace ladies. With this too-beautiful appearance and weak body, how was he planning to rule the country?\n\nBy making people take pity on his frailty?>"
}