{
	"url": "https://www.novelupdates.com/series/ghost-emperor-wild-wife-dandy-eldest-miss/",
	"title": "Ghost Emperor Wild Wife: Dandy Eldest Miss - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2016/09/cover-dandy-miss.png",
	"noveltype": "(CN)",
	"genre": "Action   Drama   Josei   Martial Arts   Romance   Shoujo   Xuanhuan   ",
	"tags": "Ancient China   Based on a Song   Beautiful Female Lead   Bestiality   Broken Engagement   Delinquents   Doctors   Early Romance   Female Protagonist   Galge   Homunculus   Loyal Subordinates   Magical Space   Modern Knowledge   Nationalism   Pets   Politics   Power Couple   Racism   Revenge   Ruthless Protagonist   S*x S*aves   S*xual Abuse   Shameless Protagonist   Slow Romance   Strong Love Interests   Time Skip   Transmigration   Transported to Another World   Trap   Weak to Strong   World Travel   ",
	"rating": "(4.0 / 5.0, 392 votes)",
	"author": "Xiao Qi Ye   萧七爷   ",
	"year": "\n2016",
	"ranking": "#2000   #2000   #312   #1277   #911   ",
	"reviewcount": "78 Reviews sorted by",
	"description": "Yun Luo Feng, Hua Xia Medicial School’s genius, died from an accident and her soul attached to Long Xia mainland’s General family’s useless eldest miss.\n\nThis waste of an eldest miss not only can’t read or practice martial arts, but is big chested, has no brain, is arrogant and self-willed.\n\nSince having the crown prince as a perfect fiance isn’t enough, she actually snatched a pretty boy in public, leading to the crown prince annulling the marriage.\n\nBut she couldn’t stand the annulment and hanged herself.\n\nOpening her eyes again, she is no longer the previous useless miss.\n\nShe contracted a God’s puppet and carries a spiritual space. With wonderful hands that can rejuvenate and medical skills that overturn the world!\n\nBoth the the royal descendants and nobles above and the merchants below, all compete to curry her favor. Even His Royal Highness, the crown prince,who previously broke the engagement, came knocking on the door wanting to reconcile.\n\nIn regard to this, a mysterious man finally couldn’t endure: “Whoever dares to come and harass my woman, let them come but never return!”>"
}