{
	"url": "https://www.novelupdates.com/series/i-matched-100-with-six-alphas/",
	"title": "I Matched 100% with Six Alphas - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/07/I-Matched-Six-Alphas_1626498112.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Harem   Mecha   Sci-fi   Shounen Ai   Yaoi   ",
	"tags": "Black Belly   Carefree Protagonist   Charming Protagonist   Clever Protagonist   Confident Protagonist   Futuristic Setting   Handsome Male Lead   Love Interest Falls in Love First   Omegaverse   Proactive Protagonist   Reverse Harem   Stubborn Protagonist   ",
	"rating": "(4.0 / 5.0, 81 votes)",
	"author": "Gu Zheng   故筝   ",
	"year": "\n2021",
	"ranking": "#1288   #1617   #3880   #1074   #2680   ",
	"reviewcount": "7 Reviews sorted by",
	"description": "Qin Yi was born an omega, but his pheromones could not attract alphas. People in his family laughed at him because of this.\n\nHowever, he doesn’t care, he would much rather never get married and wait until he’s of age to inherit his mother’s 800 million inheritance and pursue his dream life in show business!\n\nUntil the day he turned 18, and he did a pheromone match detection.\n\nAfter the detection system worked hard for 3 minutes: “The match between you and alpha: General Zhou Yiqing, whose pheromone number is AI6650, is 100%.”\n\nEveryone was shocked. How is that possible?!\n\nQin Yi: “Is this thing broken?”\n\nThe system ran three more times, and the sound said again: “The match between you and alpha: His Royal Highness Halls, is 100%.”\n\nThis is the f—ing crown prince of the enemy country!\n\nThe system did not stop: “The match between you and alpha: Sir Lu Ji, is 100%.”\n\nThis is the f—ing celebrity who has 3.3 billion fans that just changed his career to a pirate captain!\n\n“The match between you and alpha: Sir Zheng Yian, is 100%.”\n\nThis is the f—ing diplomat of the Federation!\n\n“The match between you and alpha: Sir Jing, is 100%”\n\nThis is the f—ing king of the Kayabi clan!\n\n“The match between you and alpha: Sir Wu Hong, is 100%”\n\nWho the f—?\n\n“…”\n\n“……” Everyone’s jaws were dislocated.\n\nQin Yi expressed the behavior of slipping away: “…It might really be broken.”\n\nRule of the Federation: Alpha/Omega pairs with matching rates of 100% must get married immediately.\n\nSo the question is…\n\nQin Yi: “Who must I marry?”\n\nSystem: “The recommendation is all, together.”>"
}