{
	"url": "https://www.novelupdates.com/series/yes-its-me-sub-yandere/",
	"title": "Yes, It’s Me. Sub Yandere - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/01/Yes-Its-Me-Sub-Yandere-R.jpg",
	"noveltype": "(KR)",
	"genre": "Comedy   Drama   School Life   Slice of Life   Yaoi   ",
	"tags": "Comedic Undertone   Handsome Male Lead   R-15   Reincarnated in Another World   Transmigration   Unlucky Protagonist   ",
	"rating": "(4.0 / 5.0, 20 votes)",
	"author": "Namin   나민   ",
	"year": "\n2021",
	"ranking": "#2686   #2000   #10093   #9320   #8572   ",
	"reviewcount": "1 Review sorted by",
	"description": "“Choi Sunwoo. Are you good at kissing?”\r\n\r\nChoi Sun-woo quietly looks at him in response to his gentle question. He looked to see if he was drunk, but there was no sign of drunkenness at all, so he looked suspicious.\r\n\r\n“Are you curious?”\r\n\r\n“Yes.”\r\n\r\n“Why are you curious about that?”\r\n\r\nChoi Sun-woo answered his question very calmly. The body, disconnected from its brain, folded its eyes finely and smiled at Choi Sun-woo.\r\n\r\n“I was thinking about kissing you.”\r\n\r\nHonestly, I thought about it. Whenever I saw Yoo Ha-jin floundering after falling in love with Choi Sun-woo in the webtoon, I wondered how good Choi Sun-woo was. I wondered if Yoo Ha-jin, who had been very temperamental throughout the kiss, was real or not.\r\n\r\nBut that didn’t mean I had to ask the parties myself to confirm.\r\n\r\n“Why are you thinking about that?”\r\n\r\n“It’s my taste. It’s you.”\r\n\r\nNo, no, no. It’s not my taste, but Yoo Ha-jin’s taste.\r\n\r\nIf Yoo Ha-jin’s evil spirit is possessed by me right now, I hope he will leave only the best part of his brain behind. However, when you see him smiling, there’s no way he’s Yoo Ha-jin. That b*stard had an illness that he couldn’t smile. So now, this was my subconscious murmur.\r\n\r\n“Really? You have a unique taste.”\r\n\r\n“I want to kiss you.”\r\n\r\n“Now?”\r\n\r\n“Yeah. I want to try it. Can’t I?'>"
}