{
	"url": "https://www.novelupdates.com/series/youll-regret-it/",
	"title": "You’ll Regret It - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/03/Youll-Regret-It.jpg",
	"noveltype": "(KR)",
	"genre": "Drama   Fantasy   Mystery   Romance   Tragedy   ",
	"tags": "Abandoned Children   Abusive Characters   Arranged Marriage   Beautiful Female Lead   Betrayal   Character Growth   Child Abuse   Childcare   Cold Love Interests   Complex Family Relationships   Cruel Characters   Curses   Death   Death of Loved Ones   Depictions of Cruelty   European Ambience   Female Protagonist   Handsome Male Lead   Mysterious Family Background   Near-Death Experience   Past Trauma   Second Chance   Tragic Past   Wealthy Characters   ",
	"rating": "(3.4 / 5.0, 32 votes)",
	"author": "Gi Gugryang   기국량   ",
	"year": "\n2021",
	"ranking": "#6970   #2000   #7358   #6801   #7172   ",
	"reviewcount": "2 Reviews sorted by",
	"description": "Abandoned by her family, Yuri lived in a temple. \r\n\r\nOne day, the darkness spoke to her.\r\n\r\n“Baby. I don’t hate you. I just want to give you a chance.” \r\n\r\n“ A…..chance.”\r\n\r\n“Yes. You’ll be married to the frontiersman soon. If you can get him to promise, you will win. I’ll listen to whatever you want.”\r\n\r\n“….”\r\n\r\n“But if you can’t, you’ll have to give me everything.”\r\n \r\n How long had it been since she had accepted the bet? Yuri fell in love with the northern man.\r\n \r\n “If I, I…….looked a little more like that woman. Would you have loved me…?”\r\n\r\n“No, I swear. Even if I died, I wouldn’t love you.”\r\n\r\n “Eddie….I, I.”\r\n\r\n “You’re not my mother.”\r\n\r\n She eventually surrendered to the darkness on the day she was abandoned once again by the people she loved. Yuri closed her eyes as the curse took everything from her. And when she woke up, \r\n\r\n“I’ve been waiting for you, for years. I missed you.” (Husband)\r\n\r\n “Mother. I’ve never regretted saying that word.”  (Child)\r\n\r\n“Yuri, if you agree. I want you to come back to the Duchy.” (Father)\r\n\r\n‘Why are you saying that now? If I were then, I would have forgiven you. And I could have been happy saying thank you.’\r\n\r\nTears came out. \r\n\r\n‘It’s too late to apologize. I am no longer the person I was then.’>"
}