{
	"url": "https://www.novelupdates.com/series/game-making-the-latest-chapter-begins-with-healing-the-player/",
	"title": "Game Making: The Latest Chapter Begins With Healing the Player - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/04/Game-Making-The-Latest-Chapter-Begins-With-Healing-the-Player.jpg",
	"noveltype": "(CN)",
	"genre": "Adventure   Sci-fi   ",
	"tags": "Comedic Undertone   Fanfiction   Game Elements   Gamers   Male Protagonist   Nationalism   System Administrator   Transmigration   ",
	"rating": "(3.8 / 5.0, 12 votes)",
	"author": "喝一杯红酒   ",
	"year": "\nN/A",
	"ranking": "#3314   #2000   #10564   #7726   #12412   ",
	"reviewcount": "No Reviews",
	"description": "Chen Xu traveled to the parallel world, and was surprised to find that many classic and excellent games in the previous life did not appear in the parallel world.\r\n\r\nI wanted to make a big picture, but why did I still have an ’emotion collection system’, and the emotions such as happiness, sadness, excitement, fear, anger and other emotions provided by players who have played games made by themselves can make them stronger?\r\n\r\nBut why is it so much easier to get resentment than happiness?\r\n\r\nLooking at his points harvest, Chen Xu expressed puzzlement.\r\n\r\nAs a result, Chen Xu’s career as a game designer gradually turned crooked.\r\n\r\nIn “Under the Legend”, countless players beat the table and shout: I was played by this game!\r\n\r\nIn “Escape”, countless players shouted, my cabinet moved, and I stopped playing.\r\n\r\nIn “Dark Souls”, when countless players entered the game with a smile, “Go away, please go away, leave the fire girl behind and go out with your fire, we don’t want to spread this fire!”\r\n\r\nSoap, Xiaoqiang, and Ghost sacrificed in “Call of Duty”; Zack was killed and Alice was killed in “Final Fantasy 7”; Arthur and John were betrayed in “Red Dead Redemption”;\r\n\r\nCountless players went berserk: Nima Chen Xu old thief, can’t we be kinder to the protagonist?\r\n\r\nQ: How do I feel about players’ anger towards themselves?\r\n\r\nFacing the reporter’s question, Chen Xu smiled slightly: What kind of verbal criticism is this, this is the encouragement of players around the world to me, this is love! Thank you all, I will keep up the good work!\r\n\r\n>"
}