{
	"url": "https://www.novelupdates.com/series/i-reincarnated-into-an-otome-game-as-a-villainess-with-only-destruction-flags/",
	"title": "I Reincarnated into an Otome Game as a Villainess With Only Destruction Flags… - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2017/05/乙女ゲームの破滅フラグしかない悪役令嬢に転生してしまった…5.jpg",
	"noveltype": "(JP)",
	"genre": "Comedy   Drama   Fantasy   Harem   Romance   School Life   Shoujo   Slice of Life   ",
	"tags": "Adapted to Anime   Adapted to Manga   Age Progression   Aristocracy   Arranged Marriage   Awkward Protagonist   Beautiful Female Lead   Carefree Protagonist   Charming Protagonist   Cute Story   Dense Protagonist   Doting Love Interests   Engagement   Fantasy World   Female Protagonist   Forgetful Protagonist   Friendship   Handsome Male Lead   Heartwarming   Honest Protagonist   Lack of Common Sense   Love Interest Falls in Love First   Love Rivals   Magic   Multiple POV   Naive Protagonist   Nobles   Otome Game   Possessive Characters   Reincarnated in a Game World   Reverse Harem   Royalty   Villainess Noble Girls   Weak Protagonist   ",
	"rating": "(4.5 / 5.0, 935 votes)",
	"author": "Yamaguchi Satoru   山口 悟   ",
	"year": "\n2014",
	"ranking": "#5262   #6308   #581   #3196   #71   ",
	"reviewcount": "116 Reviews sorted by",
	"description": "My memories of my past life returned when I hit my head on a rock. I am Katarina Claes, the eight-year-old daughter of a Duke. While I was struggling with a high fever, it was decided that I would become a prince’s fiancée. I have now realized that this is the world of an otome game I played in my previous life.\n\nI also realized that I had become the villainous noble girl who got in the way of the protagonist and her capture target… if the protagonist got a good ending, I would be exiled from the country with only the clothes on my back, while in the bad ending, I would be killed by the capture target… where’s my good ending!? Do I only get bad endings!? \n\nI want to overcome all the destruction flags somehow and reach old age!>"
}