{
	"url": "https://www.novelupdates.com/series/screaming-cycle-infinite-flow/",
	"title": "Screaming Cycle (Infinite Flow) - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/08/Screaming-Cycle-Infinite-Flow.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Comedy   Fantasy   Horror   Mystery   Psychological   Romance   Sci-fi   Shounen Ai   Supernatural   ",
	"tags": "Aliens   Alternate World   Amnesia   Apocalypse   Black Belly   Calm Protagonist   Cautious Protagonist   Couple Growth   Death   Depictions of Cruelty   Doting Love Interests   Episodic   Fated Lovers   Game Elements   Game Ranking System   Gods   Handsome Male Lead   Hard-Working Protagonist   Loyal Subordinates   Multiple POV   Multiple Realms   Multiple Transported Individuals   Murders   Mysterious Past   Mystery Solving   Mythical Beasts   Near-Death Experience   Power Couple   Protagonist Falls in Love First   Slow Romance   Smart Couple   Special Abilities   Spirits   Strategist   Strong Love Interests   Survival Game   Teamwork   Thriller   Time Manipulation   Time Travel   Transported into a Game World   Unlimited Flow   Unlucky Protagonist   Weak to Strong   World Hopping   World Travel   ",
	"rating": "(4.2 / 5.0, 38 votes)",
	"author": "Lu Jiji   吕吉吉   ",
	"year": "\n2019-2020",
	"ranking": "#6970   #6142   #6094   #1327   #5497   ",
	"reviewcount": "6 Reviews sorted by",
	"description": "In an era when holographic films are popular, the World Youth Championship's recurve bow archery champion, Ji Dong, saw a strange thriller trailer in the cinema.\n\nAfter the movie was over, the maglev rail he was riding in was involved in a bridge accident.\n\nWhen Ji Dong opened his eyes again, he found himself in the thriller world of the movie trailer he had just seen.  What’s more, he has to do everything he can to survive before the playback bar reaches 100% progress.\n\nFortunately, he has a strong heart, and even though he is only a novice village player, he dares to participate at the top level.\n\nTraveling around this strange world, even if you can’t win, you can at least bluff. No matter what you encounter, you are not afraid!\n\n…Just this friend, what’s the matter with you?\n\nAs a horror film player, you are so delicate and weak that you vomit blood and faint at every turn, but you are handsome and beautiful, and you are also very charming…\n\nFaced with such “baggage,” Ji Dong, a patient with severe facial paralysis, said—— I! Can’t! Throw! It! Away! Ah!\n\nThis is actually a story of [returning amnesia, the essence of the unknown. A full-level master at attack Ren Jianmo × A fast-growing rookie pretending to be a master Ji Dong.]>"
}