{
	"url": "https://www.novelupdates.com/series/high-school-dxd/",
	"title": "High School DxD - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2016/08/DxDLN01.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Comedy   Ecchi   Harem   Mature   Romance   School Life   Shounen   Supernatural   ",
	"tags": "Adapted to Anime   Adapted to Manga   Angels   Battle Competition   Beautiful Female Lead   Betrayal   Bloodlines   Breast Fetish   Brotherhood   Childhood Friends   Childhood Love   Clingy Lover   Cohabitation   Conditional Power   Curses   Death   Demons   Dense Protagonist   Determined Protagonist   Dragons   Enemies Become Allies   Enemies Become Lovers   Evil Gods   Evil Organizations   Eye Powers   Fallen Angels   Famous Protagonist   Fantasy Creatures   Friends Become Enemies   Golems   Hard-Working Protagonist   Harem-seeking Protagonist   Heaven   Hell   Honest Protagonist   Kuudere   Loli   Male Protagonist   Masochistic Characters   Master-Servant Relationship   Multiple POV   Mythical Beasts   Mythology   Nudity   Older Love Interests   Onmyouji   Perverted Protagonist   Polygamy   Popular Love Interests   Race Change   Senpai-Kouhai Relationship   Sentient Objects   Shameless Protagonist   Strong Love Interests   Strong to Stronger   Student-Teacher Relationship   Sword And Magic   Sword Wielder   Time Manipulation   Tsundere   Unique Weapon User   Unique Weapons   Valkyries   Wars   Weak to Strong   Youkai   Younger Love Interests   ",
	"rating": "(4.3 / 5.0, 230 votes)",
	"author": "Ichiei Ishibumi   ",
	"year": "\n2008\r\n",
	"ranking": "#6970   #2000   #2340   #1546   #1187   ",
	"reviewcount": "22 Reviews sorted by",
	"description": "I, Hyoudou Issei, am a 2nd Year High school student and my age is equal to the number of years I haven’t had a girlfriend. And, someone like me got a girlfriend! I’m sorry buddies, I will walk the path of becoming an adult before you guys! – That’s how it was supposed to be, but why did I get killed by my girlfriend!?\n\nI still haven’t done anything yet! Are there no Gods in this World!?\n\nAnd, the person who saved me is the most beautiful girl in my school, Rias Gremory-senpai. I learned the shocking truth from her who isn’t a God but a Devil. “You have reincarnated as a Devil! Work for me!”\n\nLured by Senpai’s breasts and treats, my life as a reincarnated Devil began.\n\nSo the “Academy×Love Comedy×Battle Fantasy” starts here with just aggressive and worldly desires! >"
}