{
	"url": "https://www.novelupdates.com/series/surviving-as-the-villains-childhood-friend/",
	"title": "Surviving As The Villain’s Childhood Friend - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/05/Surviving-As-The-Villains-Childhood-Friend.jpeg",
	"noveltype": "(KR)",
	"genre": "Fantasy   Romance   ",
	"tags": "Age Progression   Beautiful Female Lead   Childcare   Childhood Friends   Childhood Love   European Ambience   Female Protagonist   Handsome Male Lead   Love Interest Falls in Love First   Protagonist Strong from the Start   Reincarnated in Another World   Reincarnation   ",
	"rating": "(3.8 / 5.0, 29 votes)",
	"author": "에기사   ",
	"year": "\n2021",
	"ranking": "#2318   #3880   #6418   #7590   #4753   ",
	"reviewcount": "5 Reviews sorted by",
	"description": "I was reincarnated in a novel where the villain would destroy the world, and I had to stop the horrible villain for my family. At the age of 11, I entered the villain’s house. There, I met him…\n\n“I—I’m not a child. I’m taller and my arms and legs are bigger than the others. I eat a lot of vegetables, like carrots, and I’ve even caught a demon all by myself.”\n\nHe had smoothly folded eyes, plump pink cheeks, and glossy lips.\n\nIt’s not what I was expecting, I think he’s very handsome.\n\n***\n\nI taught the villain about love and peace, and raised him well and beautifully.  When we met again 9 years later.\n\n“Yuria said the faster the progress, the better.”\n\nThat….It was a story about the speed of development of the book we read together…\n\nHe said, brazenly flirting with me.\n\n“I studied a lot.”\n\n“I will somehow try to win back Yuria’s heart. I tried…Meanwhile, I persevered.”\n\nHis eyes, folded neatly in half, looked just like the face I had seen when I was a child on a picnic. But the feverish look in his eyes belonged not to my cute childhood friend, but to the villain Roger Evelian.\n\n“So I want to hear it, Yuria. How far can we go after holding hands?”\n\nWhere did my sweet childhood friend go?>"
}