{
	"url": "https://www.novelupdates.com/series/the-spearmaster-and-the-black-cat/",
	"title": "The Spearmaster and the Black Cat - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2017/02/Yaritsukai.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Ecchi   Fantasy   Harem   Martial Arts   Mystery   Romance   Shounen   Supernatural   ",
	"tags": "Accelerated Growth   Adapted to Manga   Adventurers   Age Progression   Antihero Protagonist   Artifacts   Assassins   Average-looking Protagonist   Beast Companions   Beastkin   Beasts   Blood Manipulation   Bloodlines   Breast Fetish   Calm Protagonist   Charismatic Protagonist   Charming Protagonist   Cheats   Clingy Lover   Cold Protagonist   Cooking   Corruption   Demi-Humans   Demon Lord   Demons   Depictions of Cruelty   Devoted Love Interests   Discrimination   Dragon Riders   Dragon Slayers   Dragons   Dungeons   Dwarfs   Elves   Enemies Become Allies   Enemies Become Lovers   Evil Gods   Evil Organizations   Evil Religions   Evolution   Eye Powers   Fantasy Creatures   Fantasy World   Fearless Protagonist   First-time Interc**rse   Game Elements   Genetic Modifications   Goblins   God-human Relationship   Goddesses   Gods   Golems   Guilds   Hard-Working Protagonist   Heroes   Hiding True Abilities   Hiding True Identity   Human-Nonhuman Relationship   Humanoid Protagonist   Immortals   Interdimensional Travel   Kind Love Interests   Knights   Loyal Subordinates   Lucky Protagonist   Magic   Magic Beasts   Magical Space   Magical Technology   Maids   Male Protagonist   Master-Servant Relationship   Modern Knowledge   Monsters   Multiple POV   Multiple Realms   Multiple Transported Individuals   Murders   Naive Protagonist   Nobles   Organized Crime   Perverted Protagonist   Polygamy   Protagonist Strong from the Start   R-15   Race Change   Religions   Royalty   Ruthless Protagonist   Schemes And Conspiracies   Secrets   S*xual Abuse   Shameless Protagonist   S*aves   Slow Growth at Start   Spatial Manipulation   Spear Wielder   Special Abilities   Spirit Advisor   Spirit Users   Spirits   Strong Love Interests   Strong to Stronger   Sudden Strength Gain   Sword And Magic   Threesome   Time Skip   Torture   Transported to Another World   Tsundere   Unique Weapon User   Unique Weapons   Vampires   Weak to Strong   Younger Love Interests   ",
	"rating": "(3.8 / 5.0, 524 votes)",
	"author": "Kenkō   健康   ",
	"year": "\n2016",
	"ranking": "#637   #464   #191   #840   #199   ",
	"reviewcount": "58 Reviews sorted by",
	"description": "After a tear in reality pulls Kagari Shuya into a white room he discovers a futuristic interface for reincarnating in a different world. After looking through the different races and skills he unlocks a new race, Lucivault, a type of vampire with none of its characteristic weaknesses. All set to start his life in a new world, Shuya is confused to discover that he is enveloped in darkness. As it turns out something went wrong when he was transported and instead of appearing where he was supposed to, he appeared in an underground cave. Shuya faces untold dangers, runs for his life, before finding his way out of the underground world. After escaping he meets his Shishou and begins to learn to fight with a spear. There is also a cute black cat named Rollo.>"
}