{
	"url": "https://www.novelupdates.com/series/the-death-mage-who-doesnt-want-a-fourth-time/",
	"title": "The Death Mage Who Doesn’t Want a Fourth Time - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2016/11/image.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Comedy   Fantasy   Harem   Mature   Seinen   Supernatural   ",
	"tags": "Academy   Accelerated Growth   Adapted to Manga   Adventurers   Age Progression   Androgynous Characters   Antihero Protagonist   Apathetic Protagonist   Appearance Different from Actual Age   Betrayal   Bloodlines   Body Tempering   Brainwashing   Calm Protagonist   Character Growth   Cheats   Child Protagonist   Complex Family Relationships   Corruption   Curses   Cute Protagonist   Dark   Death of Loved Ones   Demi-Humans   Discrimination   Divine Protection   Dragons   Dungeons   Elves   Enemies Become Allies   Evil Gods   Evolution   Familial Love   Familiars   Family   Famous Parents   Fantasy World   Fast Learner   Friendship   Game Elements   Ghosts   God-human Relationship   God Protagonist   Goddesses   Godly Powers   Gods   Guilds   Hard-Working Protagonist   Harsh Training   Hated Protagonist   Heroes   Heterochromia   Human Experimentation   Human-Nonhuman Relationship   Humanoid Protagonist   Hunters   Insects   Interdimensional Travel   Kingdom Building   Kingdoms   Leadership   Level System   Loli   Loyal Subordinates   Male Protagonist   Manipulative Characters   Mind Break   Mind Control   Monster Society   Multiple POV   Multiple Realms   Multiple Reincarnated Individuals   Necromancer   Orphans   Overpowered Protagonist   Parent Complex   Past Plays a Big Role   Personality Changes   Politics   Polygamy   Pregnancy   Proactive Protagonist   Prophecies   Protagonist with Multiple Bodies   R-15   Race Change   Reincarnated in Another World   Resurrection   Revenge   Ruthless Protagonist   Saving the World   Schemes And Conspiracies   Seeing Things Other Humans Can't   Shota   Slow Growth at Start   Souls   Spirit Advisor   Spirit Users   Spirits   Stoic Characters   Strategist   Strong to Stronger   Sword And Magic   Transported to Another World   Twisted Personality   Unlucky Protagonist   Vampires   Weak to Strong   World Hopping   Zombies   ",
	"rating": "(4.2 / 5.0, 2204 votes)",
	"author": "Densuke   デンスケ   ",
	"year": "\n2015",
	"ranking": "#157   #14   #15   #36   #4   ",
	"reviewcount": "332 Reviews sorted by",
	"description": "Amamiya Hiroto is unlucky. His life consisted of misfortune after misfortune, culminating in an unlucky death during an incident on a school boat trip, trying to save a girl he barely knew. After death, he met a god of reincarnation who requested that the hundred or so dead passengers—one of them being the girl he tried in vain to save—be reincarnated into another world.\n\nYet a series of unfortunate events forced Hiroto to reincarnate with even less luck than before, starting with nothing but a tremendous amount of Mana. His second life, far worse than his first, came to a cruel end.\n\nHowever, upon meeting the god a second time, he was informed that there would be yet another reincarnation—one that had already been set in motion and could not be stopped. Not wanting Hiroto to live long, the god cursed him before he was reborn in the hopes that he would either die quickly or commit suicide.\n\nHiroto was reborn once more as a half-Vampire, half-Dark Elf. A Dhampir. Not wanting a fourth life, he is determined to live this third life with the only things remaining from his previous lives—death-attribute magic and his enormous Mana pool.>"
}