{
	"url": "https://www.novelupdates.com/series/magic-revolution-of-a-young-noblewoman-starting-over-the-executed-villainess-restores-her-ruined-family-restraint-prudence-im-more-interested-in-magic-tools-than-that/",
	"title": "Magic Revolution of a Young Noblewoman Starting Over ~ The Executed Villainess Restores Her Ruined Family ~ Restraint? Prudence? I’m More Interested in Magic Tools Than That! - Novel Updates",
	"image": "https://www.novelupdates.com/img/noimagefound.jpg",
	"noveltype": "(JP)",
	"genre": "Fantasy   Josei   Romance   ",
	"tags": "Age Regression   Alternate World   Aristocracy   Artifact Crafting   Cheats   Clever Protagonist   Crafting   Dolls/Puppets   Doting Parents   Engineer   Fantasy World   Female Protagonist   Firearms   Genius Protagonist   Kingdoms   Magic   Magical Technology   Modern Knowledge   Nobles   Past Plays a Big Role   Previous Life Talent   Reincarnated in Another World   Reincarnation   Returning from Another World   Revenge   Royalty   Schemes And Conspiracies   Scientists   Second Chance   Sword And Magic   Time Loop   ",
	"rating": "(5.0 / 5.0, 2 votes)",
	"author": "二八乃端月   ",
	"year": "\n2022",
	"ranking": "#3017   #1388   #13252   #6416   #12340   ",
	"reviewcount": "No Reviews",
	"description": "Framed for attempting to assassinate the crown prince, Countess Leticia was executed along with her entire household. When she wakes up, she has unexpectedly rewound to her 12-year-old self prior to her engagement. \r\n\r\nMemories of the 'future' of her magic-toolmaker family dying to the guillotine. Memories of living as a woman in another world as an engineer in Japan. When she recalls these two memories, the magic-toolmaker girl decided. If she becomes engaged to the prince, she and her family will be headed on a path straight for destruction. King's order or not, she'll definitely resist getting engaged!\r\n\r\nFor the sake of restoring her declining House and protecting her dear family, this returnee noblewoman  will begin a magic revolution!>"
}