{
	"url": "https://www.novelupdates.com/series/the-strongest-dull-princes-secret-battle-for-the-throne/",
	"title": "The Strongest Dull Prince’s Secret Battle for the Throne - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/10/321911000113.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Drama   Fantasy   Harem   Seinen   ",
	"tags": "Adapted to Manga   Adapted to Manhua   Adventurers   Beautiful Female Lead   Carefree Protagonist   Clever Protagonist   Comedic Undertone   Cunning Protagonist   Demi-Humans   Demons   Depictions of Cruelty   Dragon Slayers   Dwarfs   Elves   Empires   Family Conflict   Famous Protagonist   Fantasy World   Guilds   Handsome Male Lead   Heroes   Hiding True Abilities   Hiding True Identity   Human Experimentation   Kingdoms   Magic   Magic Beasts   Male Protagonist   Misunderstandings   Monsters   Nobles   Overpowered Protagonist   Politics   Protagonist Strong from the Start   Romantic Subplot   Royalty   Schemes And Conspiracies   Secret Identity   Secretive Protagonist   Secrets   Sibling Rivalry   Siblings   Slow Romance   Special Abilities   Spirit Advisor   Sword And Magic   Twins   Underestimated Protagonist   Younger Brothers   ",
	"rating": "(3.8 / 5.0, 363 votes)",
	"author": "Tamba   タンバ   ",
	"year": "\n2019",
	"ranking": "#4617   #1012   #183   #853   #554   ",
	"reviewcount": "53 Reviews sorted by",
	"description": "The Adrasia empire on the Vogel continent. There is a battle over the throne of such an empire that possesses powerful military and vast territory.\r\n\r\nWith the successor undecided, the children of the emperor are vying to expand their power. However, there was one prince that everyone says will definitely not become the emperor.\r\n\r\nThe seventh prince, Arnold Lakes Adler. The young man who was inferior to his younger twin brother in every way, the dull prince.\r\n\r\nIncompetent and lethargic, Arnold wastes everyday just playing around. However, behind the scenes, he is one of the only five SS-Class adventurers called ‘Silver’.\r\n\r\nSeeing the intensifying battle for the throne he decided “I don’t want to die so let’s have my little brother become the emperor…”\r\n\r\nThis is the tale of absurd secret manoeuvres of the prince who is uninterested in the title of the emperor.>"
}