{
	"url": "https://www.novelupdates.com/series/tears-all-over-the-place-cold-rulers-only-love/",
	"title": "Tears All Over The Place: Cold Ruler’s Only Love - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2017/05/0d338744ebf81a4c096b28c0d42a6059252da65a.jpg",
	"noveltype": "(CN)",
	"genre": "Drama   Fantasy   Romance   Tragedy   ",
	"tags": "Ancient China   Beautiful Female Lead   Female Protagonist   Handsome Male Lead   Imperial Harem   R*pe   Schemes And Conspiracies   Transmigration   ",
	"rating": "(3.9 / 5.0, 16 votes)",
	"author": "七夏浅秋   ",
	"year": "\n2013",
	"ranking": "#2000   #2000   #10997   #13810   #10110   ",
	"reviewcount": "2 Reviews sorted by",
	"description": "She is stubborn and tough. He is cold and indifferent. In difficult times, she and he went through life and death. In his arms, he embraced another woman. In this life, she is his most hated woman; In this lifetime, he toppled her feelings of this whole life. Because of this desperate love, tears are all over the place, enough to unite seven summers and autumns. Old clothes are weak, red lotus has fallen. In the end who for whom covered each other’s younger years? Suddenly realizing in a dream that they are separated by the other end of the world. So it turned out that some love has long ago entered the bones……\r\n\r\nSu Qing Qian’s gentle yet tenacious courage went in a battle of wits with a loved one through the autumn’s wind and the monthly flowers. Plotting and calculating to help the loved one reign the world. Cold emperor became an affectionate husband. Unable to distinguish if the enemy’s country hostage prince is a friend or a foe, is it exploitation or protection? Even with an oppressive heart and deep feeling is not enough to describe this story.\r\n\r\nHe is standing with his sword, his eyes are full of cold murderous aura. In the moment between life and death, a few words from the woman beside him saved her. This woman is his favorite fei and also the only one in his heart over these past years.\r\n\r\nIt turned out that she is someone who keeps hanging on her brother in law without any sense of shame and is a woman being disgusted by the world.\r\n\r\nShe has the appearance enough to cause the fall of a land and has been identified by the people as a demoness.\r\n\r\nHe is cold to the absolute, a lone person with fierce ambitions. Because of one catastrophe, feelings have been planted in her heart for him. Touching love, went through life and death together, but she was still unable to break the ice in his heart.\r\n\r\nShe is his most obscure secret; she is also the woman he hates the most. All his love he gave to another woman, except he was reluctant to let her leave…….\r\n\r\nInside the dragon curtain, he is embracing the woman he loves the most while she is silently waiting outside the chamber.\r\n\r\nDesire or temptation? Addiction or monopolizing? Meeting by chance or consigned to eternal damnation?\r\n\r\nIn this life, she accompanied two men. One took her life with one strike. The other pushed her in the abyss of deception……>"
}