{
	"url": "https://www.novelupdates.com/series/i-became-the-cure-for-the-villain/",
	"title": "I Became the Cure for the Villain?! - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/01/I-became-the-cure-for-the-villain_1610014165.jpg",
	"noveltype": "(CN)",
	"genre": "Josei   Romance   Slice of Life   ",
	"tags": "Body Swap   Cold Love Interests   Complex Family Relationships   Female Protagonist   Handsome Male Lead   Sibling Rivalry   Siblings Not Related by Blood   Sickly Characters   Slow Romance   System Administrator   Transmigration   Wealthy Characters   ",
	"rating": "(2.9 / 5.0, 14 votes)",
	"author": "姜时一   ",
	"year": "\n2020",
	"ranking": "#2000   #2000   #9720   #7856   #8478   ",
	"reviewcount": "2 Reviews sorted by",
	"description": "Lu Huan became the fake daughter who was wrongly took in a wealthy family. When the true daughter returned, she had to give up her position.\n\nIn order to give her gratitude to the family who took care of her, she volunteered to marry a dying sick businessman.\n\nLu Huan’s eyes lit up: I will do it! I will definitely can!\n\nGu Zhendong, a dying sick child, was judged by the doctor that he will lived for less than thirty years~\n\nLu Huan: After marrying, I will wait until I become a widow. Live in his big house, spend his money, open parties, find fresh meats and travel around the world ! ! ! !\n\nWhile she was calculating how much inheritance she will get from the sick man…someone’s body slowly got better?\n\nAble to walk and jump and he also asked her to bear his child! This is simply too much! ! !\n\nLu Huan: I’m sorry, I don’t need the money. Let’s just get a divorce!\n\nGu Zhendong: Give birth to a child, and all the property belongs to you!\n\nLu Huan: QAQ~ I just want to be a quiet widow, don’t come over!\n\n[Male P.O.V.]\nGu Zhendong wakes up and binds to a system.\n\nSystem: Host, please kiss a woman within five minutes, otherwise you will die. The countdown will begin in…\n\nGu Zhendong: I refuse!\n\nWithin five minutes, Gu Zhendong suddenly had difficulty breathing, and his eyes turned black.\n\nGu Zhendong: Wait, I will do it!\n\nSuddenly a woman was thrown over his arms, Gu Zhendong caught her and kissed her.\n\nSystem: Congratulations to the host for completing the task, please marry the woman you just kissed!\n\nGu Zhendong: Ha ha, let’s wait just wait for my death!\n\nLater,Gu Zhendong discovered that Lu Huan’s voice could heal his headache. After getting married, his health even got better and better!\n\nLu Huan: Oh, you don’t love me at all, you just want my voice\n\nGu Zhendong: Be good, I will smack your ass if you don’t listen to me~\n\nLu Huan: Huh? ? ?>"
}