{
	"url": "https://www.novelupdates.com/series/the-evil-prince-and-his-precious-wife-the-sly-lady/",
	"title": "The Evil Prince and his Precious Wife: The Sly Lady - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2016/10/23655s.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Comedy   Fantasy   Martial Arts   Mature   Mystery   Romance   Shoujo   ",
	"tags": "Ancient China   Beautiful Female Lead   Black Belly   Broken Engagement   Calm Protagonist   Clever Protagonist   Cultivation   Cunning Protagonist   Dense Protagonist   Doctors   Doting Love Interests   Female Protagonist   Handsome Male Lead   Love Interest Falls in Love First   Modern Knowledge   Poisons   Politics   Possessive Characters   Power Couple   Previous Life Talent   Protagonist Strong from the Start   Revenge   Royalty   Ruthless Protagonist   Schemes And Conspiracies   Slow Romance   Special Abilities   Strong Love Interests   Strong to Stronger   Transmigration   Twins   Underestimated Protagonist   ",
	"rating": "(4.0 / 5.0, 365 votes)",
	"author": "Hua Jian Xue   花间雪   ",
	"year": "\n2015",
	"ranking": "#2000   #2000   #503   #4189   #913   ",
	"reviewcount": "40 Reviews sorted by",
	"description": "A story of time-travel. Sly and cunning, she unexpectedly became a sickly noble lady whose fiancé is merciless and demotes her to a lowly concubine. She sneers and bravely breaks off the engagement. To hell with scumbags, marry heirs to lords, blind the courts with her brilliance.\n\nBut, my Lord, we agreed that we are only partnering to scheme against others, when did you start to treat acting as real? Hey, hey, don’t touch me.\n\nThe Lord smiled slyly, “Your hands are too cold, let me help you warm them… Your feet are cold too, let me help you warm them.”\n\n “Why don’t you just say that my whole body is cold and you need to warm it all up”, Murong Xue said indignantly.\n\nThe Lord nodded, “Good idea!”\n\nMurong Xue – speechless. Hey hey hey, where, where are you putting your hands?>"
}