{
	"url": "https://www.novelupdates.com/series/marked-by-a-tyrant-after-transmigrating/",
	"title": "Marked by a Tyrant After Transmigrating - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/10/267D8C8E-8693-468D-A180-9816A9EFF063.jpeg",
	"noveltype": "(CN)",
	"genre": "Fantasy   Mystery   Romance   Yaoi   ",
	"tags": "Acting   Ancient China   Betrayal   Bickering Couple   Childhood Promise   Cold Love Interests   Court Official   Devoted Love Interests   Doting Love Interests   Fated Lovers   Imperial Harem   Love Interest Falls in Love First   Misunderstandings   Mpreg   Omegaverse   Royalty   Transmigration   Transported to Another World   ",
	"rating": "(3.9 / 5.0, 124 votes)",
	"author": "Chi Ling   池翎   ",
	"year": "\n2020",
	"ranking": "#3314   #6374   #2613   #7047   #1616   ",
	"reviewcount": "13 Reviews sorted by",
	"description": "Ye Shu transmigrated into the book he had just read and became the first cannon fodder minister who was brought down by the tyrannical male lead, suffering a death by a thousand cuts, turned into dust, that kind of thing.\n\nYe Shu resolutely packed up and decided to abscond before this could happen. On the road, feeling that he had been drugged, he accosted someone for help.\n\nWho would have expected that he would wake up the next day with the tyrant smiling beside him. “Did you sleep well?”\n\nYe Shu: “……”\n\nTo survive, Ye Shu was forced to enter the palace as a consort, and henceforth, lived a harsh life of being ordered around and squeezed by the tyrant.\n\nWhen the tyrant annotated folding memorials[1], he refilled his tea and ground more ink.\n\nWhen the tyrant ate, he tested his dishes for hidden drugs.\n\nWhen the tyrant retired for the night, he was even responsible for warming his bed.\n\nIt wasn’t until his belly started to grow that Ye Shu noticed that the book he had transmigrated into seemed to be a bit buggy……\n\nThis f*cking world was actually ABO.\n\nHe hadn’t been drugged, previously… That was the first differentiation period as he became a Kunjun!\n\nTyrant: “This Qianjun’s rut period is coming, my beloved consort……”\n\nYe Shu slammed the bedchamber’s door in front of the tyrant. “Heh, not a chance.”\n\n—\n\nNote: [1] Folding memorial – Memorials were an official communication to the Emperor of China. A “Folding Memorial”, for instance, was to be written on pages small enough for the emperor to hold them in his hand and read without being observed.>"
}