{
	"url": "https://www.novelupdates.com/series/di-huang-shu/",
	"title": "Di Huang Shu - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/09/Di-Huang-Shu.jpeg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Drama   Historical   Martial Arts   Mature   Mystery   Romance   ",
	"tags": "Adapted to Drama   Ancient China   Beautiful Female Lead   Clever Protagonist   Cunning Protagonist   Depictions of Cruelty   Devoted Love Interests   Family Conflict   Handsome Male Lead   Investigations   Military   Nobles   Past Plays a Big Role   Politics   Power Couple   Power Struggle   Protagonist Strong from the Start   Revenge   Royalty   Schemes And Conspiracies   Secrets   Smart Couple   Strong Love Interests   Tragic Past   Wars   ",
	"rating": "(3.9 / 5.0, 23 votes)",
	"author": "Star Zero   Xing Ling   星零   ",
	"year": "\n2014",
	"ranking": "#6970   #2000   #9947   #10839   #9802   ",
	"reviewcount": "2 Reviews sorted by",
	"description": "In his life, Crown Prince Han Ye of Great Jing once asked two questions –\n\n    “Ren Anle, do you wish to join me in the imperial court and create a prosperous era for Great Jing?”\n\n     She replied, “No. Your Highness’s rivers and mountains, His Highness’s own to keep.”\n\n    “Di Ziyuan, will you give up your grudges and join me in this life?”\n\n    She replied, “No. The Di family has been executed. My enmity with Your Majesty is as deep as the sea.”\n\n    The most difficult moments in her life was drawn with the greatest of ease.  She has never forgotten that ten years ago, a royal edict brought the Di family to its knees. They sent her away to the south of Jin with her blood relatives gone. Ten years later, she became a surrendered general on the southern border. \n\n    He let her sit in the seven formations and protect the six armies, and let her wield the sun with her sword and defend the stars.\n\n    Both he and she have been chased by the crimson past for too long. In the circle with secrets and power schemes, they ignored the inner beauty of the spring times.\n\n     It turns out that what he admires is just the same woman; it turns out that love is so pale and blue that there is no need for words or proof.\n\n    Di Ziyuan, your ten years of tumultuous memories with Han Ye are being forged into the bitter smoke of the Three Kingdoms. \n\n    And the imperial song you sang in the sands of blood, with the dust of the battle, will your sword be brimming or a sword succumbed to death?>"
}