{
	"url": "https://www.novelupdates.com/series/i-have-decided-to-go-look-for-my-father/",
	"title": "I Have Decided to Go Look for My Father - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/08/I-Have-Decided-to-Go-Look-for-My-Father.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Drama   Fantasy   Romance   School Life   Slice of Life   ",
	"tags": "Abusive Characters   Beautiful Female Lead   Child Abuse   Child Protagonist   Childcare   Childhood Friends   Doting Older Siblings   Doting Parents   Familial Love   Family   Family Conflict   Female Protagonist   Genius Protagonist   Handsome Male Lead   Heartwarming   Late Romance   Mob Protagonist   Modern Day   Past Plays a Big Role   Romantic Subplot   Second Chance   Single Parent   Tragic Past   Weak Protagonist   ",
	"rating": "(4.1 / 5.0, 170 votes)",
	"author": "公子商   ",
	"year": "\n2021",
	"ranking": "#448   #2209   #466   #309   #1561   ",
	"reviewcount": "57 Reviews sorted by",
	"description": "Lin Xi spent fourteen years at this family and never did figure out why she had always been mistreated. \n\nShe finally learned that she was living in a cliché novel with radical moral standards.\n\nHer mother was the female lead and her 'father' was the male lead. Before the male lead fell in love with the female lead, he had belittled and abused her in all sorts of ways. He even offered her up to others and, finally, the female lead had intimate relationship with a strange man. \n\nThe male lead fell head over heels in love with the female lead after that and expressed that he did not mind the child. Nevertheless, the existence of said child was a like a thorn in male and female leads’ hearts and it reminded them of their past constantly. \n\nUnfortunately, Lin Xi was this child that should never had been born. \n\nIn the extra, Lin Xi tried to set up her sister out of envy but it backfired on herself and she ended up strangled. The male lead was able to locate the man who had intimacy with the female lead and ruined both his reputation and family fortune. \n\nAfter 10 seconds of hesitation, Lin Xi decided to leave the family where she was not loved and go live with her own father.>"
}