{
	"url": "https://www.novelupdates.com/series/the-virtuous-omega-disguised-as-the-vicious-colonel/",
	"title": "The Virtuous Omega Disguised as the Vicious Colonel - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/05/The-Virtuous-Omega-Disguised-as-the-Vicious-Colonel.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Fantasy   Mecha   Mystery   Romance   Sci-fi   Yaoi   ",
	"tags": "Acting   Amnesia   Bickering Couple   Body Swap   Calm Protagonist   Charismatic Protagonist   Childhood Friends   Childhood Love   Cute Children   Cute Protagonist   Death of Loved Ones   Devoted Love Interests   Doting Love Interests   Enemies Become Lovers   First Love   First-time Interc**rse   Futuristic Setting   Hiding True Identity   Investigations   Love Interest Falls in Love First   Military   Mpreg   Omegaverse   Orphans   Outer Space   Past Plays a Big Role   Popular Love Interests   Power Couple   Prison   Protagonist Strong from the Start   Rivalry   Royalty   Schemes And Conspiracies   Secrets   Showbiz   Strong Love Interests   Transmigration   ",
	"rating": "(4.4 / 5.0, 328 votes)",
	"author": "Little Baldy   秃子小贰   ",
	"year": "\n2020",
	"ranking": "#730   #663   #1677   #721   #1096   ",
	"reviewcount": "68 Reviews sorted by",
	"description": "Colonel K is a legend of the Omar Empire. He single-handedly destroyed the Star Pirates Warship, with mercilessness and cruelty, and everybody trembled at the mention of him. Lan Yu, dignified and elegant, the model of thousands of Omegas, mistakenly became the black-hearted Colonel K. \n\nIn order to keep the persona from falling apart, from then on he punches the intergalactic beasts and kicks the bandits’ out of their nests, tore a mecha to pieces with his bare hands, and the corners of his lips picked up in a cold smile. As an Omega who is thinking about getting a husband and having a child, Lan Yu feels like he’s suffocating.\n\nBut the good thing is that he was once a movie star, with his amazing acting skills, no one noticed any difference between him and Colonel K, whose name was used to stop children from crying.\n\nExcept for his nasty rival, Lu RanKong.\n\nLu RanKong could always find the “Interstellar Butcher” Colonel K’s unnoticeable changes.\n\nWith the corpses of Star Pirates under his feet, the ion gun leaning on his shoulder, his hand on his hand-knitted woolen holster. With the wind still in his face, a corner of his uniform’s shirt lifted, showing an embroidered yellow flower. With skin scuffed fingers, a grim, bloodthirsty smile, his eyes filled with tears.\n\nAt night, he would only fall asleep if he was holding a teddy bear? He drank the nutritional supplements with no expression, but the bottle was labeled with ‘orange’ and ‘mango’ flavors.\n\nLu RanKong slightly narrowed his eyes. Why did this black-hearted K become more and more like a ♥ K?\n\nYet he found the other man f*cking attractive!>"
}