{
	"url": "https://www.novelupdates.com/series/the-villainess-is-now-a-single-mother/",
	"title": "The Villainess Is Now a Single Mother - Novel Updates",
	"image": "https://www.novelupdates.com/img/noimagefound.jpg",
	"noveltype": "(JP)",
	"genre": "Comedy   Drama   Fantasy   Romance   Shoujo   ",
	"tags": "Adopted Children   Beautiful Female Lead   Broken Engagement   Caring Protagonist   Childcare   Cute Children   Cute Story   Dense Protagonist   Devoted Love Interests   Doting Love Interests   Family Conflict   Famous Protagonist   Female Protagonist   Friendship   Handsome Male Lead   Hiding True Identity   Kind Love Interests   Love Interest Falls in Love First   Magical Technology   Multiple POV   Multiple Reincarnated Individuals   Nobles   Otome Game   Pretend Lovers   Reincarnated in a Game World   Reluctant Protagonist   Restaurant   Royalty   Store Owner   Strong Love Interests   Sword And Magic   Time Skip   Underestimated Protagonist   Villainess Noble Girls   Younger Love Interests   ",
	"rating": "(3.6 / 5.0, 30 votes)",
	"author": "Kitasato Noe   北里のえ   ",
	"year": "\n2021",
	"ranking": "#6970   #6194   #7984   #3727   #8799   ",
	"reviewcount": "No Reviews",
	"description": "Esther, who was born with recollections of her previous life as a Japanese woman, is unaware that she has been reborn in the world of an Otome game.\r\n\r\nEsther is a so-called villainess, but she becomes the Crown Prince’s fiancée without knowing anything, and her engagement is terminated and she is banished at the Magic Academy’s graduation ceremony.\r\n\r\nEsther, on the other hand, is overjoyed that the unfortunate crown prince has called off their engagement. She would work as hard as she had in her previous life and live a normal life as a commoner from now on.\r\n\r\nHowever, the benefactor who saved Esther from deportation, dies soon after the birth of her newborn twin daughters.\r\n\r\nEsther adopts the twins and works hard to raise them, but then a young man who appears to be a nobleman appears at her tavern.\r\n\r\nThe wheels of her fate began to turn from that point forward.>"
}