{
	"url": "https://www.novelupdates.com/series/get-to-know-about-wife-fan/",
	"title": "Get to Know about Wife Fan - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/10/44556532._UY560_SS560_.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Romance   Slice of Life   ",
	"tags": "Acting   Beautiful Female Lead   Celebrities   Doting Love Interests   Familial Love   Family   Female Protagonist   Friendship   Handsome Male Lead   Heartwarming   Modern Day   Popular Love Interests   Showbiz   Time Travel   Transmigration   Weak to Strong   ",
	"rating": "(4.3 / 5.0, 96 votes)",
	"author": "Chun Dao Han   春刀寒   ",
	"year": "\n2018",
	"ranking": "#4080   #3266   #3297   #3734   #2845   ",
	"reviewcount": "29 Reviews sorted by",
	"description": "As a wife fan of the popular idol Huo Xi, Qiao Qiao’s most hated person is Sheng Qiao, an actress who gets involved with Huo Xi for hype.\n\nBesides taking camera to join some activities, her major daily task is to diss this white lotus sincerely.\n\nWhat she didn't expect is that she would become Sheng Qiao after she hit her head one day.\n\nDuring the shooting process of her first love drama with Huo Xi, the first scene was NG'd 27 times.\n\nHuo Xi: Sheng Qiao, can you do it or not? If you can’t , you can be replaced!\n\nQiao Qiao: Husband, don’t be angry, I can do it!\n\nHuo Xi: ? ? ?\n\nMedia: Sheng Qiao Leaks Out a Close Appellation, Huo Xi’s Hidden Marriage Exposure\n\nFans: You f*cking shit, Sheng Qiao, you lotus b*tch, come out quickly and apologize and clarify!\n\nThe next day, Sheng Qiao explains in Weibo: Well… I'm a Wife fan, get to know?\n\nFighting back in a desperate condition, she held the throne.\n\n[From being sneered at by all netizens to being supported and liked by them, the heroine also falls in love with her idol along the way.]\n\nPopular star Sheng Qiao has recently been photographed dating the Film Emperor.\n\nIn an interview with the media, Huo Xi is asked to send his wishes to this fan in the entertainment circle.\n\nHe looks coldly at the camera: Fake.\n\nSheng Qiao dispels the rumors on Weibo hurriedly: I only adore my idol. I’m not double-minded. Thank you.\n\nAt night, a certain idol gnashes his teeth in anger and says next to her ear: Announce our relationship. Immediately! Right now!>"
}