{
	"url": "https://www.novelupdates.com/series/mortal-enemy-dressed-as-the-apex-baby__trashed-503/",
	"title": "Mortal Enemy Dressed as the Apex Baby - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/09/Mortal-enemy-dressed-as-the-apex-baby.jpg",
	"noveltype": "(CN)",
	"genre": "Drama   Fantasy   Romance   Yuri   ",
	"tags": "Beautiful Female Lead   Business Management   Modern Day   Protagonist Falls in Love First   Transmigration   Tsundere   ",
	"rating": "(5.0 / 5.0, 4 votes)",
	"author": "南云北去   ",
	"year": "\n2020",
	"ranking": "#6970   #4717   #12353   #6964   #13049   ",
	"reviewcount": "No Reviews",
	"description": "Rong Jin, the president of the Rong Group is a newcomer in the business world. On the way to negotiate business abroad, She suddenly encounters a car accident, and her soul pierces the body of a five-year-old girl who is fostered in the house of her nemesis Su Qingqiu. Su Qingqiu, the chief executive of the Su Group, and Rong Jin are deadly enemies. But she pampers and caresses the five-year-old girl in foster care, treating her as her own daughter, a darling of the heart.\r\n\r\nRong Jin used to be a big boss in business. Now not only do she have to go to primary school every day, but when she comes back at night, she has to face the noble and glamorous face of her dead enemy, and she will kiss her on the forehead. Su Qingqiu: Are you having a good time, baby? Rong Jin:  …\r\n\r\nWhen I get back to my body, I will definitely kill you. Later, Rong Jin really went back. After that, the staff of Rong's was horrified to find that the boss was actually pursuing President Su next door. But aren't they enemies?!\r\n \r\nCopy two:\r\nRong Jin had been in love with Su Qingqiu for three years. The love was deeply painful and tragic. Since the other party was heartless and ruthless, she left freely. Later, by chance, they lived under the same roof. Only then did she know that it’s not that Su Qingqiu did not love her, but she loved her too much, so much that she could not express her love, so much that she did not know what to do. She looks indifferent and yet so soft. Soft inside and out. Rong Jin thought, it doesn't matter. She will teach her how to love someone. The future is still long, and they can make up for the missed ten years of time little by little.\r\n>"
}