{
	"url": "https://www.novelupdates.com/series/my-possession-became-a-ghost-story/",
	"title": "My Possession Became a Ghost Story - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/08/My-Possession-Became-a-Ghost-Story.jpg",
	"noveltype": "(KR)",
	"genre": "Fantasy   Horror   Mystery   Romance   ",
	"tags": "Comedic Undertone   Demons   European Ambience   Female Protagonist   Ghosts   Obsessive Love   Possessive Characters   Summoning Magic   Thriller   Tragic Past   Transmigration   Unreliable Narrator   Unrequited Love   ",
	"rating": "(4.8 / 5.0, 13 votes)",
	"author": "설탕후루   ",
	"year": "\n2022",
	"ranking": "#1473   #2000   #10033   #5569   #9532   ",
	"reviewcount": "2 Reviews sorted by",
	"description": "‘Anyhow… I think I got possessed into a rofan novel.’\n\nThe problem is—I opened my eyes in a wake room. Within a coffin. At the funeral of this body's owner. To make matters worse, I had read so many novels that I couldn’t remember which one I was in.\n\n‘Ta-da~ you thought I was dead, right? I was not!’\n\nOn the other hand, I think I’m a villainess. My family is cold-hearted, and the servants shrink and shun me, often crying while looking at the air next to me. But it doesn’t matter! I’ll exploit my master in Rofan to get rid of my villainess tag!\n\nBut then, I found a strange pattern.\n\n“What exactly is this?”\n\n{How to summon •••}\n\n‘Is it summoning magic to summon something like spirits or dragons? That’s good. A villainess needs at least one ability to protect herself.’\n\n“Meow~”\n\n‘But why did she choose a three-eyed leopard-patterned cheese cat, rather than a spirit or a dragon? Well, it doesn’t matter because it’s cute!’\n\n***\n\nA monster lives in Count Rohanson’s household. A creature lurking beneath the skin of the late Lady Evangeline.\n\n“I’m Gabriel, commander of the Fararos knights. I’d like to know more about Rohanson’s esteemed daughter.”\n\n‘Knight commander, pitch black hair, azure eyes… Gabriel must be the male lead!’\n\n“Fool. Don’t you know your place? I’m not interested in you.”\n\n“It doesn’t matter; I’m merely curious about you.”\n\n‘How come? Aren’t I the villainess? Go find your partner, the female lead!’\n\nMy aim is to use my summoning abilities to protect myself! I’ll also look after Pudding the cat and Jelly the werewolf.\n\n“By the way… why does everyone keep trembling whenever they see me?”\n\nA story about a heroine who thinks she’s in a Rofan novel and the unsettling events that happen to those around her.>"
}