{
	"url": "https://www.novelupdates.com/series/the-cubs-father-pretends-to-be-poor-everyday/",
	"title": "The Cub’s Father Pretends to Be Poor Everyday - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/07/The-Cubs-Father-Pretends-to-Be-Poor-Everyday.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Fantasy   Romance   Sci-fi   Slice of Life   Yaoi   ",
	"tags": "Artificial Intelligence   Calm Protagonist   Childcare   Cute Children   Devoted Love Interests   Handsome Male Lead   Hiding True Identity   Lovers Reunited   Misunderstandings   Modern Day   Strong Love Interests   Wealthy Characters   ",
	"rating": "(3.9 / 5.0, 40 votes)",
	"author": "哒哒哒哒哒哒哒   ",
	"year": "\n2020",
	"ranking": "#2000   #2000   #5804   #8802   #4305   ",
	"reviewcount": "6 Reviews sorted by",
	"description": "Xie Yishu was an outstanding student and the 7,621st graduate of Nanxi University. On the day of graduation, he wanted to propose to his boyfriend, but he ended up transmigrating unexpectedly. He transmigrated to Ancient Blue Planet and lived there for five years before he returned back.\n\nAt first glance, nothing seemed to have changed. It was just hard to find a job and they discovered that his boyfriend had disappeared.\n\nXie felt like he was played by fate: …\n\nIn order to live, Xie Yishu became a nursery school activity teacher.\n\nThere was a child in the nursery school named Bo Zai. He was chubby, cute, and soft. He looked like him when he was a child. The other teachers told Xie Yishu that the little child’s life was very pitiful.\n\n“He comes from a single-parent household. Only his dad takes care of him; he has no mother.”\n\n“His father seems to be a car mechanic.”\n\n“I heard that his father owed other people money. So, he had to often move from house to house and change nursery schools for the little one.”\n\nXie Yishu’s heart was about to melt after learning the little one’s background.\n\nUntil one night…\n\nThe little child video called him and asked him in tears to accompany him to find his father.\n\nXie Yishu looked at the picture sent by the little child. The man in the photo looked exactly like his college boyfriend.>"
}