{
	"url": "https://www.novelupdates.com/series/be-crazy-demon-survival-system/",
	"title": "BE Crazy Demon Survival System - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/01/BE-Crazy-Demon-Survival-System.jpg",
	"noveltype": "(CN)",
	"genre": "Romance   School Life   Yaoi   ",
	"tags": "Acting   Adapted to Drama CD   Animal Characteristics   Artificial Intelligence   Books   Bookworm   Caring Protagonist   Character Growth   Clingy Lover   Couple Growth   Cute Protagonist   Doctors   Doting Love Interests   First Love   Flashbacks   Genius Protagonist   Hackers   Handsome Male Lead   Hiding True Identity   Human-Nonhuman Relationship   Introverted Protagonist   Love at First Sight   Love Interest Falls in Love First   Master-Servant Relationship   Misunderstandings   Modern Day   Past Plays a Big Role   Past Trauma   Programmer   Quiet Characters   Shapeshifters   Showbiz   System Administrator   Time Skip   Timid Protagonist   Transmigration   Vampires   Wealthy Characters   World Hopping   Writers   ",
	"rating": "(4.2 / 5.0, 87 votes)",
	"author": "Zhìchǔ   稚楚   ",
	"year": "\n2018",
	"ranking": "#3923   #1005   #2652   #4781   #2115   ",
	"reviewcount": "12 Reviews sorted by",
	"description": "Xu Qichen, who has made a habit of receiving blades from his readers, dies suddenly.\n\nDing! Your survival system has appeared out of the blue: transmigrate into all your bad ending novels and be the main character.\n\nIt wants him to change the ending? And it’s even asking him, an emotional defect, to personally date?\n\nSystem: The deeper the emotional plot line between the gong and shou, the higher the probability of successful task completion!\n\nXu Qichen: It’s impossible to write a sweet novel, it’s impossible in all of this life\n\nSystem: Very well, the host has decided to maintain the state of sudden death and not…\n\nXu Qichen: I’ll transmigrate! I’ll personally make a sweet biscuit [kneel]\n\n#it’s my survival instinct that made the move#\n\nXu Qichen: You’re really like a certain person…\n\nOld Gong: Open your mouth, eat this candy.\n\nXu Qichen: You’re really not…\n\nOld Gong: Even a candy can’t stop your mouth!\n\nXu Qichen: You bit me>"
}