{
	"url": "https://www.novelupdates.com/series/im-a-bug-in-a-thriller-game/",
	"title": "I’m A BUG In A Thriller Game - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/10/Im-A-BUG-In-A-Thriller-Game.jpg",
	"noveltype": "(CN)",
	"genre": "Mystery   Psychological   Romance   Shounen Ai   Supernatural   Yaoi   ",
	"tags": "Amnesia   Calm Protagonist   Love Interest Falls in Love First   Overpowered Protagonist   Prison   Survival Game   System Administrator   Unlimited Flow   ",
	"rating": "(4.8 / 5.0, 5 votes)",
	"author": "痴嗔本真   ",
	"year": "\n2021",
	"ranking": "#1899   #602   #12483   #10840   #11850   ",
	"reviewcount": "1 Review sorted by",
	"description": "In the infinite horror game, there were two players, the entire game framework collapsed and fell apart, they became legendary in the ears of all players.\n\nUntil one day, a new player was bound in the game –\n\n“System binding: Feng Huai (near death) (the same sound “Feng Huai”).”\n\nMission Objective : \n1. To end a serial m-urder case in a death row prison.\n2. Decipher the source of the legend of horror in the Phantom of the Opera.\n3. Create a new era in a post-radiation wasteland\n\n“Breakthrough stage reward: random extractable items/skills – Blessing Agent x1, Summoning Heavenly Thunder lv1, Ecstasy x1 ……”\n“Mission final reward: stay alive.”\n\nFeng Huai touched the bloody hole opened in his chest – in order to stay alive, he had to use a weak mortal body.\n\nThe first night Feng Huai entered the game, the game NPC was ki-lled ……\n\nGame: I seem to have put in some kind of arch enemy, shivering\n\nFeng Huai stepped on the NPC’s neck and tilted his head: Isn’t that how the game is played?\n\nThe legendary Feng Huai the Great, his greatest weakness was claustrophobia and fear of the dark, which wasn’t known to anyone, but the bound system always threw him into those copies.\n\nFortunately, in the darkness, there was always someone waiting for him.\n\nWarden: “I know you’re afraid of the dark, so I’m here earlier than you.”\nChorus Leader: “I’ve come to bring you to the light.”\nThe Orderly of the Waste World: “I’ll light up the whole city for you forever.”\nThe Elven King of the Old Forest in the Far Country: “The sun of this forest will never set for you.”>"
}