{
	"url": "https://www.novelupdates.com/series/around-the-kingdom-of-kistler/",
	"title": "Around the Kingdom of Kistler - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/12/Around-the-Kingdom-of-Kistler.jpg",
	"noveltype": "(JP)",
	"genre": "Fantasy   Romance   Shoujo   ",
	"tags": "Adapted to Manga   European Ambience   Female Protagonist   Nobles   Otome Game   Reincarnated in a Game World   Villainess Noble Girls   ",
	"rating": "(3.3 / 5.0, 12 votes)",
	"author": "華宮ルキ (扇レンナ)   ",
	"year": "\n2020",
	"ranking": "#3017   #2483   #10313   #6710   #9817   ",
	"reviewcount": "No Reviews",
	"description": "Rikako, a 20-year-old woman, was reincarnated into the otome game “Candy, The Saint, and The Mystic Rose,” which was her sister’s favorite game. She was now Anastasia, the villainess who stood in the heroine’s way.\n\nHowever, this otome game had an overwhelming amount of random elements to it, and by the time her memories as Rikako were restored, the heroine had too much bad luck and had met a bad end.\n\nIn other words, the main story of the otome game had already ended. Anastasia was married to her fiancé, the crown prince, but their relationship was cold.\n\nRikako was not discouraged by this and decided to divorce her husband as soon as she could… But, it’s okay to show off Anastasia’s capabilities, right? It’s okay to make the kingdom a better place, right? When I acted with this in mind, for some reason, people started to come to me… Moreover, even the crown prince, who hadn’t shown interest in Anastasia until now, has started to flirt with her.\n\nShe managed her territory, gave away sweets, and got involved in plots and schemes.\n\nThe heroine who experienced a bad ending resented me, but that’s none of my concern, right?\n\nThis was a story about a villainous young lady who had finished an otome game and was trying to get divorce her husband. But before she knew it, her circle was filled, and she was doted on and worshipped by those around her.>"
}