{
	"url": "https://www.novelupdates.com/series/a-serious-person-who-writes-a-diary/",
	"title": "A Serious Person Who Writes A Diary - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/11/A-Serious-Person-Who-Writes-A-Diary.jpg",
	"noveltype": "N/A",
	"genre": "Romance   Shounen Ai   Slice of Life   Yaoi   ",
	"tags": "Clingy Lover   Cold Love Interests   Devoted Love Interests   First Love   Flashbacks   Handsome Male Lead   Love Interest Falls in Love First   Marriage of Convenience   Misunderstandings   Tsundere   ",
	"rating": "(4.1 / 5.0, 41 votes)",
	"author": "酒弋   ",
	"year": "\n2021",
	"ranking": "#2000   #4786   #7431   #10477   #6804   ",
	"reviewcount": "1 Review sorted by",
	"description": "Wen Xia's childhood love is a kaolin flower, and the way that kaolin flower treats him, there are basically three types of attitudes:\r\n\r\n'Don't touch me.'\r\n\r\n'Don't look at me.'\r\n\r\n'Stay away from me.'\r\n\r\nWen Xia has been busy pleasing him but the other person is indifferent, and he is discouraged. I'm not doing it, can't I not like you anymore?\r\n\r\nHowever, many years later, Wen Xia, who was once the proud son of heaven, fell with his family. At this time, the flower of Kaolin came to the door and wanted to marry him.\r\n\r\nWen Xia sneered: 'Are you humiliating me?'\r\n\r\nThe cold face Kaolin flower said indifferently: 'This is work, I will pay.'\r\n\r\nWen Xia agreed.\r\n\r\nAfter marriage, the flower of kaolin is still the flower of kaolin, and the two of them did not offend the river water until one day, Wen Xia found a diary at home —\r\n\r\nx year x month x day,\r\nWen Xia talked to me, I was too nervous to answer him properly.\r\n\r\nx year x month x day,\r\nThe girl from the class next door put a love letter to Wen Xia's desk. I saw it. I was very annoyed. I wanted to take it out and throw it away...but no, it was someone else's wish.\r\nI accidentally said something serious to him, will he hate me?\r\nAlas, I like him.\r\n\r\nx year x month x day\r\nWen Xia hugged me! QAQ\r\nHe is so cute.\r\n\r\nx year x month x day, sunny,\r\nI can't let him touch me anymore, my heart can't stand it, I will die.\r\nIs there any way to make him not so cute?\r\n\r\nWen Xia: '...?'\r\n\r\nWho are you?>"
}