{
	"url": "https://www.novelupdates.com/series/the-transmigration-missions-are-not-scientific/",
	"title": "The Transmigration Missions Are Not Scientific - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/02/notscientific1.jpg",
	"noveltype": "(CN)",
	"genre": "Adventure   Comedy   Fantasy   Romance   School Life   Yuri   ",
	"tags": "Apocalypse   Beautiful Female Lead   Cultivation   Determined Protagonist   Devoted Love Interests   Episodic   Female Protagonist   Hackers   Heartwarming   Interdimensional Travel   Modern Day   Multiple Protagonists   Multiple Realms   Non-humanoid Protagonist   Protagonist Falls in Love First   Shounen-Ai Subplot   System Administrator   Transmigration   Unconditional Love   Wealthy Characters   World Hopping   Zombies   ",
	"rating": "(4.4 / 5.0, 95 votes)",
	"author": "Qiān Lǐ Rì Hé   千里日和   ",
	"year": "\n2017",
	"ranking": "#3710   #6194   #3249   #7988   #4091   ",
	"reviewcount": "9 Reviews sorted by",
	"description": "Gu Anran looked up to the heavens and gave a mournful cry: 'Ahhhh! I am a woman, so why must I attack and capture the female lead?!' \n\nMu Qingli's expression was cold: 'You have objections? Do you not like women?' \n\nGu Anran nervously fidgeted with her hands, but without having the chance to say anything, the Hong Qingyi who was on the side cracking melon seeds, interrupted. 'How can that be possible? Ever since she was a child, she loved hanging out with all the cute girls at the orphanage! I know because I have been observing this for a long time!' \n\nMu Qingli sneered and pulled Gu Anran by the ear, dragging her towards the room. \n\n'Wuwu! Dear wife, it hurts!' Gu Anran screamed loudly. Then, spotting something from the corner of her eyes, she suddenly had a mischievous expression. With a 'low' voice, she loudly said, 'Hong Qingyi, those I had approached were all once pursued by you!'\n\n*Peng!* ...the door to the room closed. \n\n'Eh...? So that's how it is...ah, wait!' Hong Qingyi realized something and gulped. \n\nShe mechanically turned around to see Chi Mengyan, who had been standing to the side, narrowing her eyes. Damn that Gu Anran! Even if she had the words, she wouldn't be able to explain herself clearly, ah ah ah!>"
}