{
	"url": "https://www.novelupdates.com/series/my-wife-king-arthur/",
	"title": "My Wife, King Arthur - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2017/04/arthur.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Drama   Fantasy   Gender Bender   Harem   Historical   Romance   Shounen   ",
	"tags": "Age Progression   Alternate World   Ancient Times   Aristocracy   Army Building   Beautiful Female Lead   Books   Bookworm   Brotherhood   Calm Protagonist   Caring Protagonist   Character Growth   Child Protagonist   Childhood Love   Coming of Age   Couple Growth   Court Official   Cousins   Devoted Love Interests   Early Romance   European Ambience   First Love   Handsome Male Lead   Industrialization   Kingdom Building   Kingdoms   Knights   Leadership   Legends   Male Protagonist   Mature Protagonist   Medieval   Modern Knowledge   Parody   Politics   Popular Love Interests   Protagonist Falls in Love First   Reincarnated in Another World   Strong Love Interests   Time Travel   Unconditional Love   Wealthy Characters   ",
	"rating": "(3.2 / 5.0, 99 votes)",
	"author": "Bowl of Braised Pork   半碗红烧肉著   ",
	"year": "\n2011",
	"ranking": "#2000   #2000   #4879   #9696   #5948   ",
	"reviewcount": "3 Reviews sorted by",
	"description": "“Are you my knight?” The silver-haired youth looked at the blonde girl before him and asked, his cheeks flushed red. This was their first encounter when he was only ten years of age.\r\n\r\n“Are you my bride?” He held her in his arms, embraced the girl who had accompanied him for ten years straight. He was sixteen years of age.\r\n\r\n“Are you my king?” He knelt before the throne, smiling foolishly as he looked at the girl holding the sword victoriously. At this moment, he looked like the boy he was when they first met.\r\n\r\n“I’m fine without having eyes for you. The entirety of Camelot is for your taking.” Smiling soft and gently, he gave his eyes to the girl who lost her eyes due to the curse of the red dragon. He doesn’t regret it, he thinks. He was twenty years of age.\r\n\r\n“So… Arthur… Artoria Pendragon, are you willing… are you willing to spend the rest of your life with me?” His voice was soft and clear as he reached out to touch her hand.\r\n\r\nThis was their legend.>"
}