{
	"url": "https://www.novelupdates.com/series/the-bastard-called-brave-and-the-former-fiancee-i-will-crush-all-of-them/",
	"title": "The Bastard Called Brave And The Former Fiancée, I Will Crush All Of Them - Novel Updates",
	"image": "https://www.novelupdates.com/img/noimagefound.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Fantasy   Romance   ",
	"tags": "Antihero Protagonist   Apathetic Protagonist   Beautiful Female Lead   Betrayal   Calm Protagonist   Evil Gods   Evil Religions   Magic   Male Protagonist   Netorare   Netori   Nobles   Revenge   Sword And Magic   Unique Weapon User   ",
	"rating": "(2.8 / 5.0, 62 votes)",
	"author": "Satou   さとう   ",
	"year": "\n2018",
	"ranking": "#2000   #6320   #5789   #9149   #6578   ",
	"reviewcount": "5 Reviews sorted by",
	"description": "The continent’s largest kingdom, the Kingdom of Westphalia.\r\n\r\nThe boy Light who lived there had the lesson of the sword from his father who was a former knight of the kingdom, together with his childhood friend Lyrica and Sere.\r\n\r\nBoth Lyrica and Light being childhood lovers, promise to be engaged with each other. Sere also being in love with Light decided to be Light’s mistress.\r\n\r\nBecause you have to be a knight to have a mistress, Light s*aved himself to point of death in order to be a knight of the kingdom of Westphalia.\r\n\r\nAnd, in order to receive the special ability called “gift” which everyone has, when Light, Lyrica, and Sere become 16 years old, they go to the cathedral of the Westphalia kingdom in order to appraise their “gifts”.\r\n\r\nHowever the cruel reality is revealed, when Lyrica and Sere both receive great gifts and Light receives a talent called “???”\r\n\r\nAn Unknown Power.\r\n\r\nA man called Brave came from another world with two women and told both of the women:\r\n\r\n“Are you the girls of my destiny?”\r\n\r\nThey were gathering girls with great gifts to combine their power and kill the Demon King that was recently revived.\r\n\r\nLyrica and Sera, together with the man called Brave and the two girls, journey together in order to kill the Demon King.\r\n\r\nOne year later…\r\n\r\nLyrica and Sere came back, as the wives of the Brave rage…\r\n\r\nFor the two of them, Light, which became a knight in order to marry them, is simply deserted.\r\n\r\nBetrayed by both of his dearest Fiancees, Light, broken by sadness wandered aimlessly, weeping…\r\n\r\nBut his sorrowful emotions are killed soundlessly as anger consumed him… All of them… KILL!>"
}