{
	"url": "https://www.novelupdates.com/series/cursed-sword-master/",
	"title": "Cursed Sword Master - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2016/10/CtVusHnUMAAy2MH-1.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adult   Adventure   Fantasy   Harem   Romance   Shounen   ",
	"tags": "Adapted to Manga   Demi-Humans   First-time Interc**rse   F*llatio   Game Elements   Gods   Harem-seeking Protagonist   Maids   Male Protagonist   Master-Servant Relationship   Modern Knowledge   Polygamy   Protagonist Strong from the Start   Reincarnated in Another World   Ruthless Protagonist   Sentient Objects   Sword And Magic   Sword Wielder   World Travel   ",
	"rating": "(3.5 / 5.0, 127 votes)",
	"author": "Fukuryuu   伏竜   ",
	"year": "\n2015",
	"ranking": "#1809   #4169   #2304   #2714   #1786   ",
	"reviewcount": "5 Reviews sorted by",
	"description": "An ever-righteous sword-lover was your ordinary high schooler, Fujinomiya Soujirou. On a certain evening, he had his life cut short when he was stabbed by a robber in his home.\n\nHowever, in the mysterious space Soujirou appeared in afterwards, there was a certain being that introduced itself as a [God] of a world. This [God] asked if Soujirou was interested in living a bit longer.\n\nAt that moment, together with his beloved katana, Soujirou consented to living in another world.\n\nHowever, when it concerned getting the cheat ability commonly bestowed by an otherworld God– he was simply told, “there aren’t any cheats.” Sent to the other world, he was able to bring with him the talking sword, [Hotarumaru/Little Firefly], and the sword that took his life, [Sakura]. In addition, the only thing the [God] chose to bestow him was a button down shirt and parachute pants.\n\nAnd so, in this other world, Soujirou was given a job called [Cursed Sword Master].\n\nThe [Cursed Sword Master], one who has the ability to bring out the personality of a sword.\n\nSoujirou with his beloved swords in another world were able to meet with a beautiful girl named Sistina, who held the unique job of [Acolyte] a type of combat priest-maid.\n\nHe aims to raise a harem of katanas, while hunting monsters for his daily necessities.\n\nThough Soujirou fights, he also enjoys having a relaxing time building an onsen, capitalizing on creating new items taken from the vast knowledge of Earth’s many light novels, starting up a new organization, and daring to try developing new and convenient items.\n\nBeing taught myriads of things by his swords, Soujirou, an otherworldly traveller without a cheat ability, learns about his own power gradually through fighting.\n\nDoing nothing. Looking forward to the time when that life is possible. Setting that goal, interacting with the townspeople and going to the tower. Though he tries to live normally while fighting, he gets dragged into problem after problem, or ends up doing bandit subjugation and getting involved with a troublesome self-proclaimed rival. Even with all that, he seems to enjoy living his newfound everyday life in the other world.>"
}