{
	"url": "https://www.novelupdates.com/series/im-in-charge-of-scp/",
	"title": "I’m In Charge of SCP - Novel Updates",
	"image": "https://www.novelupdates.com/img/noimagefound.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Psychological   Romance   Sci-fi   ",
	"tags": "Ability Steal   Amnesia   Apocalypse   Cheats   Confident Protagonist   Early Romance   Fanfiction   Gods   Hiding True Abilities   Male Protagonist   Monsters   Multiple Timelines   Mysterious Past   Overpowered Protagonist   Parallel Worlds   Protagonist Strong from the Start   Secret Organizations   Souls   Strong to Stronger   Time Paradox   Time Travel   World Travel   ",
	"rating": "(3.0 / 5.0, 26 votes)",
	"author": "Walnut Again   又来的核桃   ",
	"year": "\n2021",
	"ranking": "#2000   #6308   #5519   #11077   #9809   ",
	"reviewcount": "3 Reviews sorted by",
	"description": "Object Class: Keter\n\nDescription: SCP-X is a humanoid that calls himself “Zhang Jue” and came from a parallel universe with traits that are unaffected by most SCP anomalous objects.\n\nLong-term observational studies reveal that he has a mildly antisocial personality and loves to tr*sh-talk.\n\nSCP-X can obtain the ability of a particular SCP anomalous object through physical contact, and the ability obtained will be adjusted accordingly to his condition.\n\nSpecial Containment Procedures:\n\nSpecial attention needs to be paid to the containment of SCP-X. (Special precautions towards themself)\n\nSCP-X should be contained in a single villa designed by a French designer, not less than 50 x 50 x 20 meters, with a garden on the top floor and a swimming pool with no less than 200 square meters in the courtyard.\n\nThe Foundation shall assign a male staff member over 50 years of age, trained in British royal etiquette, who shall wear a wig 24 hours a day to assist in the management of the villa.\n\nThe staff monitoring the SCP-X behavior must undergo a monthly psychological evaluation. There have been cases where staff had quit the Foundation because they could not stand the tr*sh talk.>"
}