{
	"url": "https://www.novelupdates.com/series/after-marrying-the-empress/",
	"title": "After Marrying the Empress - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/10/After-Marrying-the-Empress.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Comedy   Fantasy   Martial Arts   Romance   ",
	"tags": "Adapted to Manhua   Beautiful Female Lead   Cultivation   Cute Story   Hidden Abilities   Leadership   Male Protagonist   Overpowered Protagonist   Power Couple   Protagonist Strong from the Start   Rebellion   Secret Identity   Transported to Another World   ",
	"rating": "(4.0 / 5.0, 25 votes)",
	"author": "Old Dog   老狗   ",
	"year": "\n2019",
	"ranking": "#2000   #2000   #10103   #11074   #10718   ",
	"reviewcount": "1 Review sorted by",
	"description": "Li Yun never thought, that the first thing he would do after being transported into this world, was to be forced to join the rebellion army. \n\nDa Gan, Year 976, right in the heart of the mainland, finally suppressed the mainland’s largest and most influential rebellion state in the last thousand years, calming the four kingdom. In the same year, Da Gan’s old emperor passed and a new emperor was throned. The fate of the entire world was in the hands of this newly found supreme power, and no one could escape it. At the same time, Li Yun finally escaped the world’s spiral. \n\nGoing according with his idea of being hidden, he came to the enemy capital, Da Gan, and married a beautiful wife. His wife’s family is not rich, but expresses plainly when faced with treasures of the world, yes, I’m a foreigner, not recognising them isn’t out of the ordinary. \n\nFive years later, a news that would shake Li Yun appeared, the new emperor was pregnant. What? That dog emperor is a female, and is also rumoured to be the world’s most beautiful? Goes without saying she’s definitely not as beautiful as my wife! Whoever married the dog emperor will be unlucky for his next lifetime, the most important thing is that she’s also pregnant, the same time my wife is, how unlucky! With this thought, Li Yun returned home with the flowers for his wife in his hands. \n\nBefore he could open the door, he heard a voice from inside: ” Your Majesty, it’s time for you to go to court!”>"
}