{
	"url": "https://www.novelupdates.com/series/i-rely-on-kisses-to-clear-survival-games/",
	"title": "I Rely on Kisses to Clear Survival Games - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/09/download.jpg",
	"noveltype": "(CN)",
	"genre": "Horror   Mystery   Psychological   Romance   Supernatural   Yaoi   ",
	"tags": "Black Belly   Bullying   Comedic Undertone   Death   Devoted Love Interests   Different Social Status   Dreams   Episodic   Flashbacks   Ghosts   Gore   Handsome Male Lead   Hospital   Love at First Sight   Love Interest Falls in Love First   Male Yandere   Misunderstandings   Modern Day   Monsters   Multiple Identities   Multiple Personalities   Multiple Realms   Murders   Obsessive Love   Past Plays a Big Role   Past Trauma   Possessive Characters   Psychopaths   Sadistic Characters   Straight Uke   Survival Game   Unconditional Love   Unlimited Flow   Unlucky Protagonist   World Hopping   ",
	"rating": "(4.3 / 5.0, 494 votes)",
	"author": "啾咪啾咪兔   ",
	"year": "\n2019",
	"ranking": "#3710   #3908   #1044   #879   #611   ",
	"reviewcount": "111 Reviews sorted by",
	"description": "Cheng Zhi Chu was pulled into an infinite stream of horror games. If he didn’t clear them, he would die.\n\nBut can someone tell him why others clear the games using violence and force but his method of clearing the game is by kissing the boss?!\n\nCheng Zhi Chu: I am a straight man. Even if I kill myself or am killed by monsters, I will not kiss the boss!\n\nBoss: Be good. Kiss me and I’ll let you go.\n\nBai Yi had been trapped in the game for many years.\n\nRather than exploding in anger in the silence, he had turned crazy. And so…….he split himself. His soul was broken into many pieces and each of them became the boss in the games.\n\nBut, regardless of how the soul was split, from the beginning to the end there was one thing that didn’t change —–He, likes Cheng Zhi Chu.\n\nEvery fragment of his soul was utterly in love with him.\n\nIt was also because of this that he and every fragment of his couldn’t stand seeing people other than himself getting close to Cheng Zhi Chu —- Even if the other party used to be a part of himself.\n\nDark desire gradually surged inside him.\n\nAnyone who gets between him and Cheng Zhi Chu——even if it’s himself —– he would kill them all.\n\n“The person who you should really kiss……is me.”>"
}