{
	"url": "https://www.novelupdates.com/series/my-senior-brother-is-too-steady/",
	"title": "My Senior Brother is Too Steady - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/08/sbts.png",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Comedy   Fantasy   Harem   Xianxia   ",
	"tags": "Adapted to Manhua   Age Progression   Alchemy   Ancient Times   Artifacts   Beautiful Female Lead   Calm Protagonist   Caring Protagonist   Cautious Protagonist   Clever Protagonist   Cultivation   Cunning Protagonist   Dao Companion   Dao Comprehension   Death   Demons   Dragons   Handsome Male Lead   Hard-Working Protagonist   Heavenly Tribulation   Hiding True Abilities   Immortals   Low-key Protagonist   Magic Formations   Male Protagonist   Master-Disciple Relationship   Misunderstandings   Multiple POV   Older Love Interests   Pill Concocting   Poisons   Polygamy   Protagonist Strong from the Start   Reincarnated in Another World   Reincarnation   Romantic Subplot   Saints   Schemes And Conspiracies   Strong to Stronger   Time Skip   Underestimated Protagonist   Unique Weapons   ",
	"rating": "(4.0 / 5.0, 174 votes)",
	"author": "Get To The Point   Yan gui zheng chuan   言归正传   ",
	"year": "\n2019",
	"ranking": "#4617   #3696   #3677   #8372   #4554   ",
	"reviewcount": "43 Reviews sorted by",
	"description": "After being reborn in the ancient times before the Great God-Conferment War, Li Changshou becomes a minor cultivator. He is neither destined for great things nor great woe. His only dream is to live a long life as a cultivator. In order to survive in the cruel Primordial Times, Li Changshou tries hard not to accumulate any karma—killing inevitably leads to feuds.\n\nThus, he always plans thoroughly before doing anything and never allows himself to walk into dangerous situations. He hides his trump cards well, trains himself in escape techniques, refines poisonous pills, and masters his mystical abilities. Before making any moves, he takes on an extremely steady demeanor. Yet, every move of his ends up earth-shattering. Once he is done, he will disappear without a trace.\n\nLi Changshou originally plans to remain hidden and safe in the mountain. There, he is supposed to cultivate until he ascends to immortality. However, everything changed one year when his master seems to think that their lives are too peaceful… He takes in a junior sister…>"
}