{
	"url": "https://www.novelupdates.com/series/i-was-admitted-to-the-villain-school/",
	"title": "I Was Admitted To The Villain School - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/09/I-Was-Admitted-To-The-Villain-School.jpg",
	"noveltype": "(CN)",
	"genre": "Adventure   Comedy   Fantasy   Mystery   Psychological   Romance   School Life   Sci-fi   ",
	"tags": "Beautiful Female Lead   Calm Protagonist   Charming Protagonist   Cheats   Clever Protagonist   Confident Protagonist   Determined Protagonist   Devoted Love Interests   Female Protagonist   Futuristic Setting   Handsome Male Lead   Hard-Working Protagonist   Love Interest Falls in Love First   Lucky Protagonist   Multiple Realms   Multiple Transported Individuals   Previous Life Talent   Proactive Protagonist   Reverse Harem   Second Chance   Shameless Protagonist   Slow Romance   Special Abilities   Strong Love Interests   Survival   Transported to Another World   Underestimated Protagonist   Unlimited Flow   World Hopping   ",
	"rating": "(4.7 / 5.0, 170 votes)",
	"author": "Dan Ying   淡樱   ",
	"year": "\n2020",
	"ranking": "#263   #212   #1646   #425   #2283   ",
	"reviewcount": "42 Reviews sorted by",
	"description": "Lin Xinghe, who used to be the villain of a Mary Sue novel, received an acceptance letter from the Modern Era Department of the Villain School.\n\nOn the first day of school, her deskmate told her-\n\n“Every new villain that comes here thinks that they’re f*cking amazing. At best, Modern villains like us know how to earn money through murder and cause trouble for the male and female leads.”\n\n“Whatever you do, don’t provoke the Western Fantasy Department. Before coming here to reform, those big brothers would wipe out half the world with a snap of their fingers.”\n\n“Also, don’t hang out with students from the Ancient Era Department. Those villains are always conspiring to overthrow the throne and become principal.”\n\n“And you absolutely cannot have any fantasies about the Xian Xia Department’s grass, Xie Wuan! That! Guy! Is! A! Big! Pervert!” (1)\n\nSoon after.\n\nLin Xinghe’s deskmate saw the big brother from the Fantasy Department using his fire magic to dry clothes for Lin Xinghe. The big brother from the Ancient Era Department had Lin Xinghe’s cat lying on his shoulder and the grass of the Xian Xia Department was placing vegetables into Lin Xinghe’s bowl.\n\nLin Xinghe’s deskmate: …\n\nNote:\n(1) Grass: recognized as the most handsome and attractive boy>"
}