{
	"url": "https://www.novelupdates.com/series/my-cats-are-all-bigshots/",
	"title": "My Cats are All Bigshots - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/12/My-Cats-are-All-Bigshots.jpg",
	"noveltype": "(CN)",
	"genre": "Fantasy   Romance   ",
	"tags": "Beautiful Female Lead   Female Protagonist   Handsome Male Lead   Modern Day   Showbiz   Transmigration   ",
	"rating": "(3.9 / 5.0, 29 votes)",
	"author": "白夜未明   ",
	"year": "\n2019",
	"ranking": "#6970   #2000   #7482   #11074   #7980   ",
	"reviewcount": "3 Reviews sorted by",
	"description": "Wen Xin transmigrated into a lucky koi novel set in the entertainment world as the female supporting character who served as a contrasting image for the female lead.\r\n\r\nWith the help of her lucky koi blood¹, the female lead’s career in the entertainment industry was smooth-sailing. On the other hand, as the older sister, the female supporting character shared the same blood but not the good fortune. Gradually, she grew jealous of the female lead – the classic vicious second female lead setting.\r\n\r\nHowever, as a reader with the omnipotent view, Wen Xin knew that it wasn’t that the female supporting character didn’t have good fortune; it was just that her good fortune came from her cats. The female supporting character had five cats, each which seemed ordinary but were actually transmigrated into by big-shots of various spheres.\r\n\r\nAs long as she took good care of these five big shots, the life that awaited her would be a breeze! But the Wen Xin in the story had no idea. She whose mind was only filled with thoughts of making it big neutered bigshot #1, disdained bigshot #2 for eating too much, and threw the newly born bigshot#4 into the tr*sh can.\r\n\r\nAfterwards, the bigshots regained their human form and formed an alliance. In one night, Wen Xin (in the novel) went bankrupt, became the most hated person on the internet, and lost her reputation. After transmigrating into the novel, Wen Xin expressed that although she supported neutering the cat, that didn’t mean that she wanted to experience the same fate! Thus, Wen Xin decided to save herself. First, she would start with canceling the neutering surgery for Bigshot #1….>"
}