{
	"url": "https://www.novelupdates.com/series/i-became-the-childhood-friend-of-the-obsessive-second-male-lead/",
	"title": "I Became The Childhood Friend of the Obsessive Second Male Lead - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/12/I-Became-The-Childhood-Friend-of-the-Obsessive-Second-Male-Lead.jpg",
	"noveltype": "(KR)",
	"genre": "Comedy   Fantasy   Romance   ",
	"tags": "Aristocracy   Beautiful Female Lead   Caring Protagonist   Charming Protagonist   Child Abuse   Child Protagonist   Childcare   Childhood Friends   Childhood Love   Cute Children   Cute Protagonist   Cute Story   Dense Protagonist   European Ambience   Familial Love   Family   Fantasy World   Female Protagonist   Handsome Male Lead   Love Interest Falls in Love First   Nobles   Reincarnation   Royalty   Shy Characters   Smart Couple   Tsundere   ",
	"rating": "(4.1 / 5.0, 114 votes)",
	"author": "류희온   ",
	"year": "\n2020",
	"ranking": "#611   #623   #1302   #788   #740   ",
	"reviewcount": "21 Reviews sorted by",
	"description": "The ducal house to which the second male lead belonged to is a military family.\n\nShe thought she should repay them for giving her free food and a place to sleep.\n\nShe told the second male lead about this and that. All so that he could win the heart of the female lead later.\n\nAt this rate, he would become a good man and win her love in the future. (Proud)\n\n*\n\n“And most importantly.”\n\nRieta looked around and whispered in Noel’s ear.\n\n“Only be polite and friendly to your most special person.”\n\nOnly tell her that she is pretty and that you love her.\n\nRieta thought he must have understood, right? When she asked, Noel grinned with confidence.\n\nOh, I’ve taught you everything.\n\nFrom the age of nine until now before the coming-of-age ceremony…It was very hard to teach her childhood friend who had a terrible bad temper.\n\nBut now, Noel wouldn’t be called the unlucky second lead anymore. Maybe he would really push the male lead away and take the female lead to his side.\n\nRieta grinned as she thought of a different future from the original.\n\nThen Noel swept up her hair down and said,\n\n“You’re pretty, Rieta Liz.”\n\n“?”\n\n“…You asked me to say you were pretty right?”\n\nShe, when did she?! You’re not supposed to say that to your friend!>"
}