{
	"url": "https://www.novelupdates.com/series/rebirth-of-the-craziest-female-student/",
	"title": "Rebirth of the Craziest Female Student - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/07/Rebirth-of-the-Craziest-Female-Student.jpg",
	"noveltype": "(CN)",
	"genre": "Adventure   Fantasy   Martial Arts   Mystery   Romance   ",
	"tags": "Academy   Age Regression   Aliens   Beasts   Beautiful Female Lead   Business Management   Businessmen   Character Growth   Cheats   Cold Love Interests   Cold Protagonist   Complex Family Relationships   Doting Love Interests   Doting Older Siblings   Doting Parents   Enemies Become Allies   Fallen Nobility   Family Business   Fantasy Creatures   Female Protagonist   Friendship   Game Elements   Handsome Male Lead   Hidden Abilities   Love Interest Falls in Love First   Loyal Subordinates   Marriage   Military   Nobles   Pets   Power Couple   Power Struggle   Protagonist Strong from the Start   Righteous Protagonist   Second Chance   Secret Identity   Slow Romance   Soldiers   Special Abilities   Strong to Stronger   System Administrator   ",
	"rating": "(3.6 / 5.0, 24 votes)",
	"author": "Eighteen Nights   十八夜   ",
	"year": "\nN/A",
	"ranking": "#1481   #941   #7220   #2782   #7631   ",
	"reviewcount": "6 Reviews sorted by",
	"description": "In an empty classroom, a group of youths in battle fatigues surround a gasping girl as they hurl insults at her. A hand viciously grabbs her long hair, yanking it back to reveal a bloodied face. \r\n\r\nWhat is going on? Why am I here, surrounded by…students… when I'm supposed to be Yan Kingdom's strongest lone warrior! \r\n\r\nYe Yunxi furrows her brow briefly as the pain forces her eyes to snap open. Now, she resembles angry red spider lilies blooming with a vengeance. \r\n\r\nYe Yunxi, successor to the Ye clan, is considered a piece of trash, a disgrace to the clan. The bullying she’s suffering now is by no means Ye Wanting’s first attempt to oust her, to gain the position of the Ye clan successor for herself. \r\n\r\nOnly, now, it is more than Ye Yunxi in this shell of a third year middle school student… \r\n\r\nYe Yunxi is rendered speechless. Character Attribute? Is she still in a dream?>"
}