{
	"url": "https://www.novelupdates.com/series/the-male-protagonists-daughter/",
	"title": "The Male Protagonist’s Daughter - Novel Updates",
	"image": "https://www.novelupdates.com/img/noimagefound.jpg",
	"noveltype": "N/A",
	"genre": "Romance   School Life   Slice of Life   ",
	"tags": "Age Progression   Beautiful Female Lead   Character Growth   Child Protagonist   Childcare   Childhood Friends   Childhood Love   Clever Protagonist   Cute Protagonist   Cute Story   Doting Parents   Familial Love   Female Protagonist   Handsome Male Lead   Heartwarming   Love Interest Falls in Love First   Modern Day   Poor to Rich   Slow Growth at Start   Slow Romance   Wealthy Characters   ",
	"rating": "(3.9 / 5.0, 11 votes)",
	"author": "林绵绵   ",
	"year": "\n2020",
	"ranking": "#1125   #2677   #10660   #7355   #11163   ",
	"reviewcount": "3 Reviews sorted by",
	"description": "As luck would have it, Luo Shuyan unintentionally found out that she’s a character from a male protagonist novel, and she happened to be the only child of the male protagonist.\r\n\r\nThe male protagonist had intimate encounters with countless women. He rose from being one of the poorest to one of the richest in the entire kingdom. He was a man that was above all others.\r\n\r\nWell known to all, his only weakness was his dear daughter, who had sadly passed away early on in life. Even the female protagonist, who was placed at the pinnacle of his heart, didn’t dare to mention the name of his daughter.\r\n\r\nLuo Shuyan, who was destined to die early, was perplexed with the setting of the story.\r\n\r\nAdditionally, she found out an even more intriguing fact — The mother and son duo who lived next door to her was the heroine and son from the novel,  “Child Prodigy: Story of a Delicate Mama Fleeing with Her Child”.\r\n\r\n#A story where the male protagonist is my father. Plus, an unbelievably cliche side-story of my childhood best friend’s mother who ran away from home#\r\n\r\n#A melting pot of stereotypical plot points between male-centered and female-centered novels#\r\n\r\n#Sigh, what on earth is happening?#>"
}