{
	"url": "https://www.novelupdates.com/series/second-hand-love-letter-2/",
	"title": "Second Hand Love Letter - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/05/Second-Hand-Love-Letter.jpeg",
	"noveltype": "(CN)",
	"genre": "Drama   Romance   Shoujo Ai   Yuri   ",
	"tags": "Beautiful Female Lead   ",
	"rating": "(3.7 / 5.0, 41 votes)",
	"author": "鸽子不会咕咕咕   ",
	"year": "\n2021",
	"ranking": "#1160   #2336   #6773   #4875   #9654   ",
	"reviewcount": "No Reviews",
	"description": "When Shi Ran was twenty-five years old, she broke up with her girlfriend, Song Yi, whom she had been in love with for the past five years, because she saw Song Yi chatting with other people.\r\n\r\nEveryone knew that Song Yi had made Shi Ran miserable, but how could she let go of it after five years of hard work? Even Song Yi thought that Shi Ran was just bluffing and soon she would lick her face with gifts and ask for reconciliation.\r\n\r\nBut Shi Ran didn’t.\r\n\r\nShe neatly moved out of the house she shared with Song Yi and came to the company dressed up coquettishly, ready to welcome her new leader with a beautiful face.\r\n\r\nThe new leader was resolute and decisive; an ascetic beauty.\r\n\r\nShi Ran was about to shout in her heart that she was okay, but found that the new leader seemed to be her old classmate, the old classmate who had just spent the night with her.\r\n\r\nShe seemed to be fine this time.\r\n\r\n***\r\n\r\nEveryone in the class knew that Shi Ran and Chen Ruoyu didn’t deal with each other. Mainly because of the second-hand love letter that Shi Ran threw to Chen Ruoyu when she failed to confess to Song Yi in the third year of high school.\r\n\r\nLater, when Chen Ruoyu returned to China, her classmates organized a class reunion for her. Chen Ruoyu replied calmly, secretly clasping Shi Ran's approaching hand.\r\n\r\nLater, Chen Ruoyu moved into Shi Ran’s new home in front of Song Yi. In the empty cardboard box, a large box of certain supplies fell out of the 'unsatisfactory'.\r\n\r\nNo one knew that the second-hand love letter was hidden in a drawer by Chen Ruoyu.\r\n\r\nNo one knew that Shi Ran was Chen Ruoyu’s dream all these years.>"
}