{
	"url": "https://www.novelupdates.com/series/cloud-raising-dragon-cub-app/",
	"title": "Cloud Raising Dragon Cub App - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/07/Cloud-Raising-Dragon-Cub-App.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Fantasy   Shounen Ai   Supernatural   ",
	"tags": "Academy   Appearance Different from Actual Age   Caring Protagonist   Childcare   Clingy Lover   Death   Doting Love Interests   Dragons   Game Elements   Human-Nonhuman Relationship   Lack of Common Sense   Love Interest Falls in Love First   Magic   Reincarnated in a Game World   Strong Love Interests   Transformation Ability   Transmigration   ",
	"rating": "(4.0 / 5.0, 37 votes)",
	"author": "Moon View Tea   月见茶   ",
	"year": "\n2021",
	"ranking": "#246   #361   #4635   #280   #6140   ",
	"reviewcount": "2 Reviews sorted by",
	"description": "Ning Chu downloaded a western fantasy app called “Dragon Island” during winter break, in which you can raise various small dragons.\n\nThe game was beautifully drawn and unique, and the little dragon cubs are super cute and lovable, so Ning Chu quickly got hooked and raised a dozen of them with crazy funds.\n\nThe little dragon cubs vary in character and preferences, and Ning Chu works early and late every day, hunting and cooking, cutting down trees and building houses, sewing clothes for the little dragon cubs, playing with them, and singing children’s songs to put them to sleep.\n\nUnfortunately, before the little dragon cubs grew up, Ning Chu met with an accident.\n\nWhen he opened his eyes again, Ning Chu transmigrated.\n\nHe came to a strange and different world where there were wizards, dwarves, elves, half-therians, and… giant dragons.\n\nNing Chu was unlucky to have just crossed into a dragon slaying battle, where the huge creature raised its claws at him in the dusty atmosphere.\n\nBut… the red scales, the curved horns, and the hot flames coming out of its mouth…\n\nThis dragon, how come it was so similar to the cub he raised?\n\n——\n\nLegend says that dragons are the product of God’s creation.\n\nGod favored the dragons, gave them great strength, a long life, and raised them personally. But from a certain day, the miracle disappeared and God abandoned the dragons.\n\nThe young dragon cubs lost their love and care, wailing in the cold night, stumbling to grow up, and eventually became ferocious and tyrannical dragons.\n\nLater, God came again.\n\nNing Chu: oooh my cubs, daddy is back!>"
}