{
	"url": "https://www.novelupdates.com/series/gu-fang-bu-zi-shang/",
	"title": "Gu Fang Bu Zi Shang - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/05/Gu-Fang-Bu-Zi-Shang.jpg",
	"noveltype": "(CN)",
	"genre": "Drama   Historical   Josei   Romance   Tragedy   ",
	"tags": "Abusive Characters   Adapted to Drama   Adapted to Manhua   Ancient China   Betrayal   Bickering Couple   Character Growth   Clever Protagonist   Conflicting Loyalties   Couple Growth   Cruel Characters   Cunning Protagonist   Determined Protagonist   Devoted Love Interests   Different Social Status   Doting Love Interests   Enemies Become Allies   Enemies Become Lovers   Female Protagonist   Friends Become Enemies   Generals   Genius Protagonist   Handsome Male Lead   Hard-Working Protagonist   Hated Protagonist   Jealousy   Love Interest Falls in Love First   Lovers Reunited   Manipulative Characters   Misunderstandings   Multiple Protagonists   Music   Nobles   Obsessive Love   Politics   Popular Love Interests   Possessive Characters   Power Couple   Proactive Protagonist   Protagonist Strong from the Start   R*pe   Schemes And Conspiracies   Secret Identity   Smart Couple   Strategic Battles   Strategist   Strong Love Interests   Unconditional Love   Wars   Wealthy Characters   ",
	"rating": "(4.3 / 5.0, 340 votes)",
	"author": "Feng Nong   風弄   ",
	"year": "\n2005\n",
	"ranking": "#2000   #6242   #2944   #4970   #1590   ",
	"reviewcount": "46 Reviews sorted by",
	"description": "Bai Pingting has always been contrary the saying, “A woman’s virtue is ignorance.' \n\nAlthough she serves the Marquess of Jing-An as a maid, she leads a life far richer than most women. Her plain appearance is not what defines her — but her intelligence, far beyond many wise men. \n\nAlthough Chu Beijie was an enemy general, she still cannot help being attracted to this man, despite the many lies and conspiracies…but between love and loyalty, she must make a choice. She can only hope that man’s love for her isn’t as deep as she thought.\n\nOne is a soul who seemingly destroys peace while the other aspires to be the sword that saves. Between them, lies a mountain of hate…\n\nWho of the two most cunning people on earth cast the trap and just who captured the other?>"
}