{
	"url": "https://www.novelupdates.com/series/princess-and-the-general/",
	"title": "Princess and the General - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/03/927788.jpg",
	"noveltype": "(CN)",
	"genre": "Drama   Romance   ",
	"tags": "Ancient China   Beautiful Female Lead   Caring Protagonist   Charming Protagonist   Clever Protagonist   Cute Protagonist   Devoted Love Interests   Doting Love Interests   Doting Parents   Familial Love   Family   Female Protagonist   Generals   Handsome Male Lead   Medical Knowledge   Nobles   Older Love Interests   Poisons   Royalty   Sister Complex   Slow Romance   ",
	"rating": "(3.7 / 5.0, 91 votes)",
	"author": "伊人归   ",
	"year": "\n2017",
	"ranking": "#2731   #4061   #1819   #8803   #2689   ",
	"reviewcount": "8 Reviews sorted by",
	"description": "The Immortals Valley’s little medicine fairy Yu Fu, who descended the mountain at twelve years old, encountered an Eastern Ling soldier seeking for medicine outside the mountain gate. Due to various reasons, she got taken back to an army camp to treat the poisoned Eastern Ling’s Great General Marquis. \n\nLittle Yu Fu said with a pitiful look, “It’s correct that my master is the god of medicine, but I’m a little poison fairy, not a little medicine fairy…..”\n\nThe crowd of soldiers fell into endless chaos, beating their chest and stomping their feet, with no strategy left to try.\n\nYu Fu bit into the apple and said with puffed cheeks, “However, if the person is about to die, there’s no harm in letting me practice my poison skills.”\n\nThrowing the apple aside, with a flash of her poison needle, curing poison with poison, she saved the Great General Marquis’s life. \n\nThe Great General Marquis woke up, and in order to thank her for saving his life, had her taken back to his manor. \n\nWho would’ve guess that the Great General Marquis had six sons with extraordinary appearances, completely different personalities, and exceptionally good marital art skills.  \n\nEspecially the heir who was the eldest, possessing a beautiful face, and a dignified bearing, making Yu Fu unable to walk. \n\n“This child is this marquis’s savior, in the future, she’ll be your younger sister.”\n\nYu Fu frantically shook her head, “No no no, I don’t want to be a younger sister!”\n\nDon’t joke, if she became their younger sister, how could she still admire the heir’s beautiful face as much as she liked then?\n\n————-\n\nMany years later, she don the imperial gown, the long dress dragging on the floor, standing in a high and unbearably cold place—–\n\nConferring him as the Top General.\n\nUnder the palace eaves after the rain, she cuddled in his embrace, yet he asked, “Why Top General?”\n\n“Eastern Ling honored the previous Han system, with Great General as the head of all military officials. The current dynasty instead honors the Spring-Autumn period’s ancient system, with Top General as the head of all military officials.”\n\n“In that case, this subject is also your Majesty’s husband, how should this one be addressed?”  \n\nShe suddenly smiled and rubbed against his arm. \n\n“Regardless of how others call you, you are forever my big brother….”>"
}