{
	"url": "https://www.novelupdates.com/series/divine-genius-healer-abandoned-woman-demonic-tyrant-in-love-with-a-mad-little-consort/",
	"title": "Divine Genius Healer, Abandoned Woman: Demonic Tyrant in Love with a Mad Little Consort - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2017/05/21197s.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Fantasy   Josei   Martial Arts   Romance   Supernatural   Xuanhuan   ",
	"tags": "Ancient China   Arranged Marriage   Assassins   Beautiful Female Lead   Black Belly   Broken Engagement   Calm Protagonist   Cold Love Interests   Cold Protagonist   Complex Family Relationships   Cruel Characters   Cultivation   Cunning Protagonist   Doctors   Female Protagonist   Genius Protagonist   Handsome Male Lead   Lucky Protagonist   Magical Space   Poisons   Protagonist Strong from the Start   Revenge   Ruthless Protagonist   Schemes And Conspiracies   Strong Love Interests   Strong to Stronger   Transmigration   Transported to Another World   Weak to Strong   ",
	"rating": "(3.7 / 5.0, 132 votes)",
	"author": "Shé Fā Yōu Yǎ   蛇发优雅   ",
	"year": "\n2016",
	"ranking": "#2000   #6315   #961   #11077   #1780   ",
	"reviewcount": "11 Reviews sorted by",
	"description": "Ye Qingli is the daughter of an Imperial Businessman’s first wife, wealthy and overbearing. But because of her mother’s early funeral, she suffered utter oppression and abuse under the hands of her stepmother. On the eve of her marriage, she died tragically in the hands of her stepsister and her own fiance!\n\nHe is an overbearing, tyrannical, cold-hearted, demonic king. Grim and ruthless, only restrained by his wife and son!\n\nOnce reborn, the weak daughter transfigured into a Divine Genius Healer. There was no intersection between the two people, yet they were bestowed a paper of marriage!\n\nSubdue and kill the Seven Wives?\n\nVery well. This daughter also wants to kill her evil, wicked stepmother and stepsisters! Do you still dare marry me?\n\nHowever, the Handsome Prince and the Divine Genius Doctor, how do you get them together? \n\nYe Qingli touched her chin: “So many people, which one do I choose?”\n\nA  furious royal highness: “Herald, continue dispatching orders. Whichever male creature dares get within three feet of the royal consort, kill him immediately!>"
}