{
	"url": "https://www.novelupdates.com/series/married-i-have-amnesia-dont-lie-to-me/",
	"title": "Married? I Have Amnesia, Don’t Lie to Me! - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/07/Married-I-Have-Amnesia-Dont-Lie-to-Me.jpg",
	"noveltype": "(CN)",
	"genre": "Drama   Psychological   Romance   Slice of Life   Yaoi   ",
	"tags": "Amnesia   Calm Protagonist   Clever Protagonist   Clumsy Love Interests   First-time Interc**rse   Love Interest Falls in Love First   Marriage   Multiple Personalities   Older Love Interests   Past Trauma   Unconditional Love   ",
	"rating": "(4.2 / 5.0, 46 votes)",
	"author": "愛哈哈的小刀   ",
	"year": "\n2021",
	"ranking": "#2000   #4733   #6127   #7723   #4858   ",
	"reviewcount": "6 Reviews sorted by",
	"description": "Shi Nan was surprised when he saw the big boss of the new company. Isn’t this his husband whom he married just a few days ago? But the big boss looked at him with an unfamiliar look: “Who are you? You want to rely on unspoken rules to get ahead, do you even know how much value you have? .”\r\n\r\nShi Nan:? ? ? ? ?\r\nWe hugged each other last night, so we don’t know each other today?\r\n\r\nShi Nan found out that Song Linsheng had a problem. He had no memories of the night at day, and no memories of the day at night.\r\n\r\nSong Linsheng in the daytime: Stay away from me.\r\nSong Linsheng at night: Come and give me a hug.\r\n\r\nOne day, Song Linsheng found his marriage certificate in a secret corner of his home, and the marriage partner on it turned out to be the eighteenth line actor who harassed him every day in the company.\r\n\r\nMarried? Don’t lie to him, he has amnesia.\r\nSong Linsheng asked Shi Nan about his marriage certificate.\r\n\r\nShi Nan glanced at him and said indifferently: “Oh, it’s me, why, do you want a divorce?”\r\nSong Linsheng hesitated, and asked Shi Nan, “Are you willing to have two husbands at the same time?”\r\nShi Nan: “…” You! I’m afraid you have a misunderstanding of yourself.\r\nSong Linsheng during the day: What did you both do at night?\r\nSong Linsheng at night: What did you two do during the day?\r\nShi Nan replied in unison: Do those things that made you wear a green hat.\r\n\r\nShi Nan was annoyed by the question, so he pulled Song Linsheng during daytime and Song Linsheng at night into a group and asked him to ask himself.>"
}