{
	"url": "https://www.novelupdates.com/series/trash-of-the-counts-family/",
	"title": "Trash of the Count’s Family - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/10/Trash-of-the-Counts-Family.jpg",
	"noveltype": "(KR)",
	"genre": "Action   Adventure   Comedy   Drama   Fantasy   Mystery   Seinen   ",
	"tags": "Absent Parents   Adapted to Manhwa   Adopted Children   Anti-Magic   Apocalypse   Appearance Different from Actual Age   Aristocracy   Artifacts   Assassins   Award-winning Work   Beast Companions   Bloodlines   Body Swap   Butlers   Character Growth   Child Abuse   Clever Protagonist   Complex Family Relationships   Conditional Power   Cruel Characters   Cunning Protagonist   Curses   Demi-Humans   Demons   Doting Parents   Dragon Slayers   Dragons   Dwarfs   Eidetic Memory   Elemental Magic   Elves   Empires   Enemies Become Allies   European Ambience   Evil Organizations   Family   Fanaticism   Flashbacks   Friendship   Genius Protagonist   Gods   Handsome Male Lead   Heroes   Hiding True Abilities   Immortals   Interdimensional Travel   Invisibility   Kingdoms   Knights   Loyal Subordinates   Male Protagonist   Merchants   Misunderstandings   Money Grubber   Monsters   Multiple Identities   Multiple POV   Multiple Realms   Multiple Reincarnated Individuals   Multiple Timelines   Multiple Transported Individuals   Mysterious Past   Nationalism   Necromancer   Nobles   Orphans   Outcasts   Parallel Worlds   Past Plays a Big Role   Past Trauma   Poisons   Politics   Post-apocalyptic   Previous Life Talent   Priests   Quirky Characters   Reincarnated in Another World   Reincarnation   Religions   Royalty   Saints   Schemes And Conspiracies   Secret Organizations   Secrets   Selfless Protagonist   Sentient Objects   Sentimental Protagonist   Shapeshifters   Siblings   S*aves   Special Abilities   Stoic Characters   Stubborn Protagonist   Sudden Strength Gain   Sword And Magic   Time Manipulation   Time Paradox   Torture   Tragic Past   Transformation Ability   Transmigration   Transplanted Memories   Transported to Another World   Unreliable Narrator   Vampires   Wealthy Characters   World Travel   ",
	"rating": "(4.5 / 5.0, 2762 votes)",
	"author": "Yu Ryeo Han   유려한   ",
	"year": "\n2017",
	"ranking": "#28   #26   #14   #35   #2   ",
	"reviewcount": "522 Reviews",
	"description": "When I opened my eyes, I was inside a novel.\n\n[The Birth of a Hero].\n\n[The Birth of a Hero] was a novel focused on the adventures of the main character, Choi Han, a high school boy who was transported to a different dimension from Earth, along with the birth of the numerous heroes of the continent.\n\nI became a part of that novel as the tr*sh of the Count’s family, the family that oversaw the territory where the first village that Choi Han visits is located.\n\nThe problem is that Choi Han becomes twisted after that village, and everyone in it, is destroyed by assassins.\n\nThe bigger problem is the fact that this s*upid tr*sh who I’ve become doesn’t know about what happened in the village and messes with Choi Han, only to get beaten to a pulp.\n\n“…This is going to be a problem.”\n\nI feel like something serious has happened to me.\n\nBut it was worth trying to make this my new life.>"
}