{
	"url": "https://www.novelupdates.com/series/rebirth-of-the-wolfish-silkpants-bottom/",
	"title": "Rebirth of the Wolfish Silkpants Bottom - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2018/02/download.jpg",
	"noveltype": "(CN)",
	"genre": "Drama   Mature   Romance   Yaoi   ",
	"tags": "Age Progression   Black Belly   Business Management   Carefree Protagonist   Cautious Protagonist   Child Protagonist   Childcare   Clever Protagonist   Cold Love Interests   Cute Protagonist   Devoted Love Interests   Doting Love Interests   Doting Older Siblings   Family Conflict   First-time Interc**rse   Handsome Male Lead   Heartwarming   Manipulative Characters   Modern Day   Naive Protagonist   Older Love Interests   Possessive Characters   Reincarnation   Revenge   R*pe   Schemes And Conspiracies   Second Chance   Shota   Siblings Not Related by Blood   Slow Romance   Strong Love Interests   Wealthy Characters   ",
	"rating": "(3.8 / 5.0, 902 votes)",
	"author": "Pào miàn xiāngcháng jūn   泡麵香腸   ",
	"year": "\n2017",
	"ranking": "#2240   #3238   #306   #187   #284   ",
	"reviewcount": "208 Reviews sorted by",
	"description": "[The gong (seme) and shou (uke) have no blood relation, are also not in the same household register, do not share a father nor a mother, this is a serious declaration.]\n~~~\n\nIn this life, Shu Ning was a joke, even to his death. Treated as a stepping stone by his biological mother, opening a path for his younger brother, only to realize all this when dying.\n\nShu Ning, who was thirsty for maternal love, was extremely hardworking, acting as a well-behaved child in front of his father, while fighting with his elder brother, although his IQ was not high, he still played dirty tricks to the utmost. Constantly being encouraged by his mother’s warm feelings, the more he obstructed his elder brother, the braver he got. When he met with a mishap, his mother took his younger brother and escaped to a faraway place, leaving Shu Ning alone to bear the crime and get thrown into jail. \n\nLove is more solid than gold, his lover decided to embrace another man.\n\nAttaching great importance to friendship, not only did they take the time to visit Shu Ning in jail and laugh at him, they even rubbed salt in the wound. \n\nHis most loved and respected mother did not even bother to show her face. \n\nHowever, when he closed his eyes, his elder brother came. Truth was, it was Shu Heng who had arranged for him to be able to live comfortably in prison.\n\nIf he hadn’t followed them and was a clever little brother, would it all have changed? In the blink of an eye, Shu Ning returned to the time where he was a junior high school student. \n\n\nTwo-faced, controlling elder brother gong X Clever and cute little wolf shou.\n\n\nElder brother thinks that younger brother is very cute, very adorable, very soft, how could he be this close to the ideal?\n\nThe younger brother is thinking, hahaha… that elder brother with facial nerve paralysis could blush?  What happened to your cold and handsome image? Becoming foolish with just one kiss? What happened to your mysophobia? I’m just sitting in your lap and your whole body stiffened up? ╮(╯▽╰)╭\n\nTo prevent his elder brother from thinking that Shu Ning was after the company, Shu Ning relied on memories from his previous life to earn a bit of money, becoming financially independent while being a silkpants, also slowly raising that soft and immature elder brother, Shu Ning felt that these days were just too comfortable. However… why is his elder brother becoming more and more strange? What is this sleeping together for warmth? What is this good morning and good night kiss? Do you really take me for a brat? Σ( ° △ °|||)\n\nNote: The ‘Silkpants’ part means mean a rich and hedonistic son.>"
}