{
	"url": "https://www.novelupdates.com/series/the-godsfall-chronicles/",
	"title": "The Godsfall Chronicles - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2017/01/1906906-1473328753000.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Fantasy   Martial Arts   Mature   Mystery   Sci-fi   Supernatural   Tragedy   ",
	"tags": "Abandoned Children   Aristocracy   Artifacts   Assassins   Beasts   Beautiful Female Lead   Cannibalism   Character Growth   Cruel Characters   Dark   Determined Protagonist   Genetic Modifications   Gods   Gore   Handsome Male Lead   Hiding True Identity   Human Experimentation   Lucky Protagonist   Male Protagonist   Mercenaries   Monsters   Mutated Creatures   Naive Protagonist   Post-apocalyptic   Revenge   Romantic Subplot   Schemes And Conspiracies   Special Abilities   Survival   Underestimated Protagonist   Unreliable Narrator   Weak to Strong   World Travel   ",
	"rating": "(4.0 / 5.0, 375 votes)",
	"author": "Half-Drunk Wanderer   Tipsy Wanderer   半醉游子   ",
	"year": "\nN/A",
	"ranking": "#6970   #2000   #521   #2412   #889   ",
	"reviewcount": "56 Reviews sorted by",
	"description": "The nuclear holocaust which caused the collapse of the Old Times on Earth should have wiped out all human life on the planet.  Yes, the gods set up their beautiful Elysiums to provide sanctuaries for their chosen, but by all rights everyone outside the elysian lands should’ve perished long ago.  Yet somehow, human life still managed to persist, even in the deadly, mutant-infested wastelands.\n\n           Cloudhawk was a young scavenger who dreamed of being as free as the hawks in the skies, yet seemed destined to live out his life scrounging for scraps in the wasteland ruins.  Fate, however, is ever-fickle.  A chance meeting with a ragtag group of mercenaries changed the trajectory of his life, bringing him into a world with mutants and metahumans, demonhunters and godslayers, and even gods and demons.  Cloudhawk would find his own place in a world that was far greater than he had imagined, find his own path between the zealous light of Sumeru and the whispering darkness of the Abyss… and one day, he would find that even gods may fall.>"
}