{
	"url": "https://www.novelupdates.com/series/love-you-till-death/",
	"title": "Love You Till Death - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/05/Screen-Shot-2020-05-09-at-2.49.44-PM.png",
	"noveltype": "(CN)",
	"genre": "Drama   Romance   Shounen Ai   Xianxia   Xuanhuan   ",
	"tags": "Absent Parents   Acting   Amnesia   Celebrities   Cohabitation   Cold Love Interests   Couple Growth   Cultivation   Demon Lord   Demonic Cultivation Technique   Demons   Devoted Love Interests   Disabilities   Enemies Become Lovers   Gods   Handsome Male Lead   Immortals   Poor to Rich   Power Couple   Secret Identity   Seme Protagonist   Showbiz   Transmigration   Transplanted Memories   Unreliable Narrator   Wealthy Characters   World Hopping   ",
	"rating": "(4.0 / 5.0, 85 votes)",
	"author": "静舟小妖   ",
	"year": "\n2020",
	"ranking": "#6970   #6219   #3836   #3926   #2987   ",
	"reviewcount": "21 Reviews sorted by",
	"description": "The demon is born!\n\nThe three realms are in chaos!\n\nA catastrophe for the common people!\n\nThe lords in heaven were jittery.\n\nBut as they waited here and there, the disaster didn’t come.\n\n100 years later, Ruan MingChi who vowed to devote himself to feeding the demon, finally returned.\n\nWhile holding the hands of a male, he brought him to the Hall of Marriage.  “This is my other half, the demon, JiHao.”\n\nLater, someone asked Ruan MingChi, “How were you able to do it?”\n\nRuan MingChi could only bitterly smile, “It’s better to ask, how did he do it?”\n\n“How?”\n\n“He…  He’s a natural at spoiling people, and I just…”\n\n~~~\n\nRuan Mingchi, the leader of the human race, pinched his fingers and calculated that the three realms would be in disorder. He decided to sacrifice himself to feed the devil for a hundred years and set up many magic arrays. The demon, Jihao, was deeply trapped in illusions due to the magic array.\n\nIn the illusion, JiHao invades Ruan MingChi's sea of knowledge. He created small worlds and actively brushed up goodwill with the immortal Ruan MingChi.\n\n[This immortal and I are relatives]\n\n[This immortal and I are friends]\n\n[This immortal and I are classmates]\n...\nAfter sharing tender feelings for 100 years, Ruan MingChi turned around and left.\n\nOutside of the illusions, Ruan Mingchi suddenly blushed. He was captured by JiHao's gentleness, and he willingly re-entered the world of illusion.​\n\nJiHao later held Ruan MingChi's hand and said, 'Love is always mutual. If you are merciless, how can I be tempted?'\n\nRuan Mingchi asked him, 'Do you still have murderous thoughts?'\n\nJiHao laughed, 'Dare not.'>"
}