{
	"url": "https://www.novelupdates.com/series/the-cave-king-will-live-a-paradise-life-becoming-the-strongest-with-the-mining-skill/",
	"title": "The Cave King Will Live a Paradise Life -Becoming the Strongest With the Mining Skill?- - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/05/81XkgWlwO0L.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Comedy   Fantasy   Harem   Mystery   Romance   Shounen   Slice of Life   ",
	"tags": "Accelerated Growth   Adapted to Manga   Aristocracy   Beast Companions   Beautiful Female Lead   Cheats   Complex Family Relationships   Dense Protagonist   Determined Protagonist   Dragons   Elemental Magic   Evolution   Family Conflict   Fantasy World   Futanari   Game Elements   Golems   Human-Nonhuman Relationship   Kingdom Building   Kingdoms   Magic   Male Protagonist   Merchants   Monster Girls   Monster Tamer   Monsters   Naive Protagonist   Nobles   Overpowered Protagonist   Pacifist Protagonist   Polygamy   R-15   Royalty   Sibling Rivalry   Siblings   Slow Romance   Special Abilities   Sudden Strength Gain   Sword And Magic   Underestimated Protagonist   Unique Weapon User   Weak to Strong   ",
	"rating": "(3.6 / 5.0, 252 votes)",
	"author": "Naehara Hajime   苗原一   ",
	"year": "\n2019",
	"ranking": "#443   #1676   #313   #879   #586   ",
	"reviewcount": "41 Reviews sorted by",
	"description": "Heal, the 17th prince of the Kingdom of Sanfaris was born with an unknown crest that he was unable to activate.\n\nBecause of this useless crest, he was relegated to being lord of a remote island by his father, the king.\n\nOf course, there were no people there, nor were there any trees or plants. It was an island with just a single cave.\n\nHowever, the moment that Heal picked up the pickaxe inside of the cave, the ‘Cave King’ crest was activated. Its effect was specializing in mining, allowing him to efficiently mine all kinds of ore.\n\nAmong the ore that could be mined on the island, there was even some ore that magic ability and ore that extended one's lifespan…\n\nHeal would become so engrossed in mining, that he would eventually create the strongest country.>"
}