{
	"url": "https://www.novelupdates.com/series/gluttonous-crown-princess/",
	"title": "Gluttonous Crown Princess - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/09/Gluttonous-Crown-Princess.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Drama   Fantasy   Historical   Romance   Slice of Life   ",
	"tags": "Ancient China   Beautiful Female Lead   Black Belly   Caring Protagonist   Cooking   Doting Love Interests   Female Protagonist   Handsome Male Lead   Hidden Abilities   Love Interest Falls in Love First   Male Yandere   Poisons   Righteous Protagonist   Royalty   Strong Love Interests   Transmigration   ",
	"rating": "(4.3 / 5.0, 40 votes)",
	"author": "小舟遥遥   ",
	"year": "\n2020",
	"ranking": "#1658   #537   #4991   #3103   #5009   ",
	"reviewcount": "10 Reviews sorted by",
	"description": "Tao Ti, a little taotie* cub, transmigrated and became the bride of the sickly crown prince who was meant to chase out his ill fortune, but ended up committing suicide by ingesting poison. \n\nMet by the disgusted gazes of everyone in the Eastern Palace, Tao Ti was a little flustered.\n\nJust then, the crown prince who was rumoured to soon die from illness comforted her, “Don’t be scared, I’ll give you a letter of annulment before I die, and return you your freedom.”\n\nTao Ti was stunned, “A-alright.”\n\nInwardly, she thought, “A gentle and beautiful man; I’m fine with this!!!”\n\nLater——\n\nWhen the crown prince was ridiculed, Tao Ti rolled up her sleeves to defend him.\n\nWhen the crown prince was sick with a high fever, Tao Ti boiled the medicine herself.\n\nWhen the crown prince’s appetite was poor, Tao Ti cooked, fried, steamed, and baked. \n\nEveryone in the Eastern Palace: Safeguard the best crown princess in the world!\n\n~\n\nThe prince of the outlying tribe was muscular and bold; he planned to abduct Taoti to the grasslands once the crown prince died.\n\nThe crown prince broke the prince’s leg, then, in the middle of the night, blocked Tao Ti.\n\nTao Ti’s voice trembled, “Your… Your Highness?”\n\nThe crown prince’s eyes were dark, and his smile was warm. “If I had known that you liked wild ones, I would’ve stopped pretending.”\n\n*T/N: Taotie are ancient Chinese mythological creatures with an insatiable appetite, commonly emblazoned on bronze vessels. It’s now used as a term to describe gluttonous people. Written as 饕餮, it’s pronounced ‘Tao Ti’ in Chinese, which happens to be a homonym of the FL’s name, 陶缇 (Tao Ti).>"
}