{
	"url": "https://www.novelupdates.com/series/the-flower-of-youth-blooms-when-he-smiles/",
	"title": "The Flower of Youth Blooms when He Smiles - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/11/The-Flower-of-Youth-Blooms-when-He-Smiles.png",
	"noveltype": "(CN)",
	"genre": "Romance   School Life   Slice of Life   ",
	"tags": "Calm Protagonist   Character Growth   College/University   Coming of Age   Female Protagonist   Handsome Male Lead   Introverted Protagonist   Late Romance   Popular Love Interests   Pragmatic Protagonist   Protagonist Falls in Love First   Quiet Characters   Secret Crush   Slow Romance   Unrequited Love   Writers   ",
	"rating": "(4.0 / 5.0, 11 votes)",
	"author": "Shu Yuan   舒远   ",
	"year": "\n2017",
	"ranking": "#2000   #2000   #10433   #10065   #10086   ",
	"reviewcount": "2 Reviews sorted by",
	"description": "It wasn’t the first time she had met him.\n\nHowever, at the time, in the corridor of the KTV, he smiled with charm as he hugged the girl in his arms.\n\nIt had left such a deep impression within her.\n\nWhat happened later on?\n\nLater–\n\nHer boyfriend, Lu Sibei, luxuriously invited his group of friends. He came late.\n\nSomeone yelled, “You have to drink for being late.”\n\n“Why didn’t you bring your girlfriend along?”\n\nThat person only smiled lightly, “We broke up.”\n\n“Oh, how many months was it this time?”\n\nThat person lifted his eyes, his voice flat, “That’s enough.”\n\nIn the private booth, the lights were dimly lit. Meng Shengnan drank her cola with her head down, but the drink in her tongue tasted both cold and bitter.\n\nAt the time she hadn’t realised yet that later on, she really couldn’t have anyone else but him.\n\n_\n\nDuring her youth, Meng Shengnan had fallen for someone. Yet, she knew that she would never be the type he liked, so she buried her unrequited love deep within her heart.\n\nMany years later, she met him again in her hometown.\n\nHe was no longer the unruly and carefree youth she remembered, instead, he would often pass through the old streets of Jiangcheng in a pair of flip-flops. The first time they met again, he stared at her, unshaven, his eyes full of untold stories.\n\nHer heart raced and he chased after her relentlessly. For her, he got his act together, started all from nothing, and wiped away his past humiliations. It was as if he had responded to the words she had written many years ago in the book she had gifted him: “In the days where the flower of youth blooms, I want to help him find his way after losing his path.”\n\n>"
}