{
	"url": "https://www.novelupdates.com/series/isekai-tensei-kimi-to-no-saikai-made-nagai-koto-nagai-koto/",
	"title": "Isekai Tensei – Kimi to no Saikai made Nagai koto Nagai koto - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2016/03/G874dq5.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Comedy   Drama   Fantasy   Harem   Mystery   Romance   Supernatural   Tragedy   ",
	"tags": "Adventurers   Age Progression   Age Regression   Appearance Different from Actual Age   Aristocracy   Character Growth   Childhood Friends   Childhood Love   Childish Protagonist   Clingy Lover   Cold Protagonist   Dark   Death of Loved Ones   Delinquents   Demi-Humans   Demons   Different Social Status   Doting Older Siblings   Dragons   Fantasy Creatures   Fantasy World   Farming   Fated Lovers   Kind Love Interests   Kingdoms   Lazy Protagonist   Love Interest Falls in Love First   Magic Beasts   Male Protagonist   Multiple Reincarnated Individuals   Nobles   Obsessive Love   Older Love Interests   Persistent Love Interests   Personality Changes   Polygamy   R-15   Reincarnated in Another World   Royalty   Slow Growth at Start   Strong Love Interests   Strong to Stronger   Sudden Strength Gain   Sword And Magic   Transported to Another World   Unique Weapon User   Unique Weapons   Wars   Weak to Strong   World Travel   Younger Love Interests   ",
	"rating": "(3.6 / 5.0, 202 votes)",
	"author": "Anikki Burazza   アニッキーブラッザー   ",
	"year": "\n2016",
	"ranking": "#1570   #2836   #1212   #1388   #1294   ",
	"reviewcount": "16 Reviews sorted by",
	"description": "I was a delinquent that died when an accident occurred on a school trip. When I realized it I was the growing son of a farmer in another world. In this world where demons and demi-humans were in the middle of a war, I didn’t have some ability that made me a hero nor did I have magical powers. I didn’t know anything useful.\r\n\r\nThen, why was I reincarnated?\r\n\r\nWait a second, when I reincarnated, was the girl who was my classmate that was riding on the same bus also reincarnated in this world? Alright, I’ve decided! I’ll reunite with that girl, and reach her with the feelings I couldn’t express in my previous life.>"
}