{
	"url": "https://www.novelupdates.com/series/luna/",
	"title": "Luna - Novel Updates",
	"image": "https://www.novelupdates.com/img/noimagefound.jpg",
	"noveltype": "(KR)",
	"genre": "Fantasy   Gender Bender   Romance   Shoujo   ",
	"tags": "Academy   Beautiful Female Lead   Clever Protagonist   Cross-dressing   European Ambience   Female Protagonist   Nobles   Poor Protagonist   Strong Love Interests   Wealthy Characters   ",
	"rating": "(3.9 / 5.0, 37 votes)",
	"author": "Ajuma   ",
	"year": "\nN/A",
	"ranking": "#2000   #2000   #9606   #11742   #6818   ",
	"reviewcount": "1 Review sorted by",
	"description": "Laneige is pretty and smart, but only thing that she is missing is wealth and last name. A commoner like her can't really get a good education even though she is smart. And people who are not nobles don't have last names to verify who they are. There is this one academy in the whole country called Royal Academy. They said it's for the education, but unless you are rich or already have large amount of knowledge, there is no way for a normal commoner to enter this school. Laneige studied her butt off to get out of poverty, and she was able to get into this school, BUT female student spots were filled. The school couldn't give special treatment to Laneige because then the nobles will uprise and complain to the school. Still the school couldn't let Laneige go because she had an outstanding grade, so their method was to disguise Laneige as a male and let her stay in the school.\n\nWhen you are a commoner, you can study your butt off to get into the school. But there is still a hierarchy in the school. When commoners enter the school, they are assigned to one child of a noble who is older than them. Those commoners are called Japry. They are to stay and follow the person to 'see' and 'learn' better and faster. But that's only an official excuse. Basically Japrys are their personal servants.\n\nLaneige becomes the Japry of the country's most powerful noble's second son. She was prepared to meet a spoiled brat, but he was little different than she thought....>"
}