{
	"url": "https://www.novelupdates.com/series/the-correct-strategy-to-approach-the-yandere-supporting-male-lead/",
	"title": "The Correct Strategy to Approach the Yandere Supporting Male Lead - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/01/The-Correct-Strategy-to-Approach-the-Yandere-Supporting-Male-Lead.jpg",
	"noveltype": "(CN)",
	"genre": "Drama   Fantasy   Romance   ",
	"tags": "Ancient China   Beautiful Female Lead   Blind Protagonist   Clingy Lover   Cunning Protagonist   Devoted Love Interests   Disabilities   Doting Love Interests   Female Protagonist   First Love   Handsome Male Lead   Male Yandere   Nobles   Obsessive Love   Possessive Characters   Psychopaths   Schemes And Conspiracies   Strong Love Interests   Transmigration   ",
	"rating": "(4.1 / 5.0, 46 votes)",
	"author": "欠金三两   ",
	"year": "\n2021",
	"ranking": "#1645   #1428   #5331   #2466   #5073   ",
	"reviewcount": "9 Reviews sorted by",
	"description": "Li Ruo Shui transmigrated to the book, the system wanted her to approach the gentle, caring, and spring-like smiling supporting male lead, Lu Zhi Yao.\r\n\r\nShe was ready to start acting when she was caught off guard by the gentle supporting male lead with a sword pointing at her.\r\n\r\nLi Ruo Shui: ?\r\n\r\nHe approached slowly, with a smile on his lips and an excited tone: How do you know my name?\r\n\r\nLooking at the blood on the corner of his robe, she felt that there was a need to redefine the meaning of gentleness.\r\n\r\nOn the first day of the strategy, Li Ruo Shui was thinking about how to survive.\r\n\r\nOn the second day of the strategy, she realized that he was actually a psycho, and continued to think about how to survive.\r\n\r\nOn the third day of the strategy, she found out that he was a psycho with a sensitive physical, and it seemed like it would not be difficult to survive. \r\n\r\n……\r\n\r\nNot knowing how many days had passed after she started her strategy, she was caught. At first she thought she had to rely on herself, but she saw him stepped through the blood and stood in front of her, and his trembling hands caressed her side face in excitement. \r\n\r\n\r\n\r\n\r\n'They were all dead, no one could ever hurt you anymore.'\r\n\r\n\r\n\r\n\r\nLu Zhi Yao’s mother fed on love all her life, insanely, he thought he was different, but then he realized he was wrong.\r\n\r\nOnce tainted with love, he could no longer endure the tastelessness of the past.\r\n\r\nHe could not stop his greed, so he had to bend and beg.\r\n\r\n“I love you, can you please love me a little more?”>"
}