{
	"url": "https://www.novelupdates.com/series/this-venerable-one-really-didnt-abandon-my-familiar/",
	"title": "This Venerable One Really Didn’t Abandon My Familiar - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/02/This-Venerable-One-Really-Didnt-Abandon-My-Familiar.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Drama   Mystery   Romance   Shounen Ai   Supernatural   Xuanhuan   Yaoi   ",
	"tags": "Appearance Changes   Cold Love Interests   Confident Protagonist   Cultivation   Devoted Love Interests   Hiding True Abilities   Hiding True Identity   Human-Nonhuman Relationship   Investigations   Mysterious Past   Past Trauma   Possessive Characters   Power Couple   Protagonist Strong from the Start   ",
	"rating": "(4.0 / 5.0, 44 votes)",
	"author": "Chi Ling   池翎   ",
	"year": "\n2021",
	"ranking": "#1060   #1259   #5671   #1103   #4587   ",
	"reviewcount": "3 Reviews sorted by",
	"description": "Feng Ci pacified the Four Seas, created the Six Sects, single-handedly rescued all life under Heaven, and was regarded as the Grandmaster of Salvation.\n\nLater on, he grew tedious and randomly found a cave to seal away all of his magic items and a small, skinny black snake that was unable to change form no matter what. Manipulating the boundaries of the realms with Dao, his spirit left to wander the great cosmos. \n\nThis abrupt journey lasted 3 thousand years. \n\n3 thousand years later, Feng Ci’s divine consciousness returned. Not only had his little black snake and the magic items disappear, even his physical body vanished without a trace.\n\nFeng Ci settled into the body of a youth who just lost his life. Forced to leave the mountains, coincidentally, the Immortal Alliance just happened to be accepting disciples.\n\nSitting above on a high cloud terrace, with black silk covering his eyes, the legendary coldblooded and merciless Leader of the Immortal Alliance, Pei QianYue, said coldly: Terrible innate constitution. You can go sweep the floors of the outer sect.\n\nFeng Ci: …… Who talks to their Master like this???\n\nAfter that day, a new disciple arrived in the outer sect.\n\nGood-looking in appearance, cultivation hard to describe in words, and exceptionally lazy. A salted fish who did nothing but eating, sleeping, and waiting for death all day.\n\nEveryone joined in the wager, betting how long it would take for the Leader to sweep him outside the door.\n\nUntil the Immortal Alliance turned traitor and the rebellion army marched straight up LinXian Terrace.\n\nFeng Ci casually broke off a branch from the cold plum tree. With a light wave, the sword light shook the Heavens.\n\nThen after that—\n\nIt’s said that the Leader knelt in front of the room of that outer disciple for three days and three nights, but still didn’t manage to enter the door.  >"
}