{
	"url": "https://www.novelupdates.com/series/keyboard-immortal/",
	"title": "Keyboard Immortal - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/12/Keyboard-Immortal.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Comedy   Harem   Martial Arts   Mature   Romance   Supernatural   Xianxia   ",
	"tags": "Academy   Adapted to Manhua   Arrogant Characters   Battle Competition   Beastkin   Beautiful Female Lead   Betrayal   Body Tempering   Carefree Protagonist   Character Growth   Cheats   Clever Protagonist   Conditional Power   Cultivation   Cunning Protagonist   Demons   Disabilities   Discrimination   Dragons   Elves   Empires   Enemies Become Lovers   Eunuch   First-time Interc**rse   F*llatio   Game Elements   Handsome Male Lead   Harem-seeking Protagonist   Hated Protagonist   Hiding True Abilities   Lack of Common Sense   Male Protagonist   Modern Knowledge   Mysterious Family Background   Mysterious Illness   Narcissistic Protagonist   Netori   Nobles   Older Love Interests   Playboys   Playful Protagonist   Politics   Polygamy   Pretend Lovers   Reincarnated in Another World   Ruthless Protagonist   Schemes And Conspiracies   Shameless Protagonist   Slow Growth at Start   Slow Romance   Spirit Advisor   Strong Love Interests   Student-Teacher Relationship   Transmigration   Weak to Strong   ",
	"rating": "(3.8 / 5.0, 364 votes)",
	"author": "Monk Of The Six Illusions   六如和尚   ",
	"year": "\n2020",
	"ranking": "#33   #46   #254   #47   #2073   ",
	"reviewcount": "89 Reviews sorted by",
	"description": "A lightning strike transmigrated Zu An into another world. In that world, he was known as the tr*sh of Brightmoon City, but for some reason, he was married to the gorgeous and highly talented daughter of the Chu clan? \n\nWhat? I’m a transmigrator but I don’t have any talent for cultivation? Why are there so many people out for my life? And most importantly of all, how in the world did I get on the bed of my sister-in-law on my wedding night?!\n\nIt was a nightmarish starting point for Zu An, but fortunately, as a famed keyboard warrior in his previous life, the world gave him a keyboard in this life too so that he could turn things around. Through his trolling and flaming, he shall stand atop the corpses of his burned enemies and rise to the top of the world!>"
}