{
	"url": "https://www.novelupdates.com/series/eldest-misss-style-isnt-right/",
	"title": "Eldest Miss’s Style Isn’t Right - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/03/Eldest-Misss-style-isnt-right.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Drama   Fantasy   Mature   Romance   Sci-fi   ",
	"tags": "Aliens   Artificial Intelligence   Beautiful Female Lead   Businessmen   Celebrities   Complex Family Relationships   Confident Protagonist   Crossover   Devoted Love Interests   Doting Love Interests   Family Business   Family Conflict   Fated Lovers   Female Protagonist   Genetic Modifications   Handsome Male Lead   Human Experimentation   Human-Nonhuman Relationship   Human Weapon   Humanoid Protagonist   Love at First Sight   Marriage   Modern Day   Mysterious Illness   Obsessive Love   Overpowered Protagonist   Possession   Power Couple   Resurrection   Secret Identity   Showbiz   Transmigration   Wealthy Characters   ",
	"rating": "(3.8 / 5.0, 76 votes)",
	"author": "慕清潋   ",
	"year": "\n2019",
	"ranking": "#561   #480   #1807   #790   #3485   ",
	"reviewcount": "11 Reviews sorted by",
	"description": "In the eyes of the public, the spoiled little crybaby daughter of the Gu family who was abandoned and discarded by her fiancé should be living a miserable life but they didn’t expect…\n\nA business tycoon: I’m honored to have dinner with Qing Yu~\n\nA top designer did cartwheels: Qing Yu is wearing the clothes I designed specifically for her!\n\nA technology bigwig: I got the signature of my idol Gu Qing Yu!\n\nEveryone: Is this Gu Qing Yu’s debut? So many bigwigs spoiling her like their own sister.\n\nThe bigwigs: We don’t dare treat her like our own sister, “Madam” is our aunt!\n\nAfter Gu Qing Yu dropped countless vests, people finally knew why the bigwigs called her “Aunt”.\n\nSo the question was, if Gu Qing Yu is “Madam”, then who is “Sir”?\n\nA certain person: Madam, going outside to attract bees and butterflies again, sleep by yourself tonight.\n\nGu Qing Yu: No! I’ll be right back!\n\nThe crowd: Huh? Madam, your style doesn’t seem normal.\n\nA certain person smug: What do you know? I am a unique delicacy to my wife~>"
}