{
	"url": "https://www.novelupdates.com/series/the-villain-is-outrageously-beautiful/",
	"title": "The Villain is Outrageously Beautiful - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/03/006BZsyPgy1fkldowrcsnj305k07sdhq.jpg",
	"noveltype": "(CN)",
	"genre": "Adult   Romance   Supernatural   Tragedy   Xianxia   Yaoi   ",
	"tags": "Complex Family Relationships   Conflicting Loyalties   Cruel Characters   Cultivation   Death   Death of Loved Ones   Depictions of Cruelty   Disabilities   Flashbacks   Friends Become Enemies   Friendship   Ghosts   Handsome Male Lead   Human-Nonhuman Relationship   Kidnappings   Love Triangles   Male Yandere   Manipulative Characters   Mind Control   Mysterious Past   Mystery Solving   Necromancer   Non-linear Storytelling   Past Plays a Big Role   Possessive Characters   Psychopaths   R*pe   Strong Love Interests   Suicides   Teamwork   Torture   Tragic Past   Transmigration   Transported to Another World   Unrequited Love   Writers   Younger Love Interests   ",
	"rating": "(4.1 / 5.0, 123 votes)",
	"author": "Qi Jing Nan Qu   Riding A Whale South   骑鲸南去   ",
	"year": "\n2017",
	"ranking": "#931   #2195   #2831   #3629   #1093   ",
	"reviewcount": "9 Reviews sorted by",
	"description": "Xu Xingzhi had penned in his original novella:\n\nOver the mountains and across the seas, there was a posse of villains. They were clever and cute, they were peculiar and bizarre, they were diligent and conscientious, and they were planning a jailbreak.\n\nAnd then, he transmigrated into this dramatic narrative.\n\nThe World commanded: Your presence has disrupted the balance of this world. You have to eliminate the villain boss who intends to break out of this cage and take over the world.\n\nXu Xingzhi replied: Sorry, I’m just a salted fish. \n\nThe World: Don’t worry, the villain is the shidi that you personally doted on throughout his childhood who hangs onto each and every one of your words.\n\nXu Xingzhi: . . . I never wrote such a character setting.\n\nBoss with a gentle face: Shixiong, do you prefer this golden chain or this silver one? Take your time to choose, I’ll listen to whatever you say.\n\nXu Xingzhi: . . . I really never wrote such a character setting.\n\nThis milieu was all as you desired.\n>"
}