{
	"url": "https://www.novelupdates.com/series/youve-got-mail-a-cautionary-tale/",
	"title": "You’ve Got Mail: A Cautionary Tale - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/03/Youve-Got-Mail-A-Cautionary-Tale.jpg",
	"noveltype": "(CN)",
	"genre": "Adult   Comedy   Drama   Historical   Mature   Mystery   Romance   Slice of Life   Smut   Yaoi   ",
	"tags": "Aggressive Characters   Ancient China   Arrogant Characters   Average-looking Protagonist   Court Official   Different Social Status   Doting Love Interests   First-time Interc**rse   Flashbacks   F*llatio   Generals   Honest Protagonist   Inferiority Complex   Kidnappings   Loneliness   Love Interest Falls in Love First   Low-key Protagonist   Manipulative Characters   M*sturbation   Multiple POV   Past Trauma   Persistent Love Interests   Poor Protagonist   Possessive Characters   Pragmatic Protagonist   Schemes And Conspiracies   S*x Friends   Slow Romance   Strong Love Interests   Toys   Younger Love Interests   ",
	"rating": "(4.5 / 5.0, 519 votes)",
	"author": "Hei Dan Bai   黑蛋白   ",
	"year": "\n2018",
	"ranking": "#1160   #6152   #902   #1978   #800   ",
	"reviewcount": "127 Reviews sorted by",
	"description": "The Peng Society for Gentlemen — a secret friend-making club for the homosexual men of the Great Xia Dynasty. Its services were designed to help its members along in their quest for their lifelong partners. Upon paying a monthly fee of fifty coins, members could get themselves listed in The Pengornisseur after providing a self-portrait, a mailing address, their age and hobbies, as well as a self-introduction. All members would receive a copy of the monthly publication, and they could communicate with one another in private using the information in The Pengornisseur.\n\nWu Xingzi, a bachelor about to turn forty, worked as the adviser to the magistrate in Qingcheng County.\n\nQingcheng County was a place with barely any resources. In other words, it was poor. In the list of counties of the Great Xia Dynasty, it had been ranked at the bottom for the past two hundred years.\n\nWu Xingzi felt that his life was hopeless: not only was he a homosexual, he was also a virgin. Even his retirement fund was lacking. Worse still, his looks were… forgettable.\n\nHe might as well die.\n\nHence, Wu Xingzi decided to commit suicide on his fortieth birthday. However, he was unwilling to remain a virgin to death! And so, gritting his teeth, he joined the Peng Society for Gentlemen and received The Pengornisseur. It was very painful; after all, fifty coins were the sum of his daily expenditure for ten days! He would only pay it once, and he was determined to succeed on his first try.>"
}