{
	"url": "https://www.novelupdates.com/series/my-daddy-hide-his-power/",
	"title": "My Daddy Hide His Power - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/08/My-Daddy-Hide-His-Power.jpeg",
	"noveltype": "(KR)",
	"genre": "Comedy   Fantasy   Romance   ",
	"tags": "Child Protagonist   Cute Protagonist   Doting Parents   Family   Fantasy World   Female Protagonist   Nobles   Reincarnation   Special Abilities   Sword And Magic   ",
	"rating": "(4.0 / 5.0, 23 votes)",
	"author": "고은채   ",
	"year": "\n2022",
	"ranking": "#684   #651   #7867   #1094   #7394   ",
	"reviewcount": "1 Review sorted by",
	"description": "Q. Describe how you felt when your trusted Dad wasn’t an extra.\n\nA. W, what… Give me back my role as ‘Passing Imperial Citizen 1’\n\nDuring the war 365 days a year!\n\nA crazy worldview where there is no day without worry! \n\nIt was a blessing to be born as an extra here.\n\n“Princess~ Wake up~♡”\n\n“Ah, my pretty daughter♡♡.”\n\nBesides, living a simple life in a mountain village with a nice and sweet dad (James Brown, 27, Extra) is the best! \n\n—and that’s what I thought. \n\n*****\n\n“Look! The person who just appeared is my father! A symbol of commoner men, brown hair and brown eyes!” \n\n“….”\n\n“He's just the Passing  Imperial Citizen 1 even if you look at it, and he’s a 27-year-old unmarried father living in a mountain village with a young daughter and working hard to make a living.”\n\nThe Knight Commander only looked at me indifferently.\n\n“—Excuse me, sir? Over there? Whoa!”\n\nAt that moment, The Knight Commander was startled and drew his sword.\n\nI looked back instinctively.\n\n‘…Daddy?’\n\nBlue energy was rising above my daddy’s wooden poker.\n\nI rubbed my eyes and watched it again.\n\n‘W, what’s that?’\n\nAt the next moment. \n\nDaddy’s brown hair and brown eyes, which were symbols of Extra 1— gradually changed.\n\n“Oh my.”\n\nAnyone can see, ‘I’m the main character!’ with his dazzling silver hair and sparkling blue eyes!\n\n‘E, excuse me? Isn’t he a 27-year-old unmarried father living in a mountain village with a young daughter—’\n\n—James? Is this real? \n\n“Give me my daughter, you bastard.”>"
}