{
	"url": "https://www.novelupdates.com/series/fox-demon-cultivation-manual/",
	"title": "Fox Demon Cultivation Manual - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/04/foxdemon.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Drama   Mystery   Shounen Ai   Supernatural   Xuanhuan   ",
	"tags": "Ancient China   Cultivation   Demon Lord   Demons   Devoted Love Interests   Doting Love Interests   Family Conflict   Fantasy World   First-time Interc**rse   Fox Spirits   Ghosts   Handsome Male Lead   Love Interest Falls in Love First   Past Plays a Big Role   Race Change   Shameless Protagonist   Slow Romance   Strong Love Interests   Time Paradox   Time Travel   Weak to Strong   ",
	"rating": "(4.3 / 5.0, 522 votes)",
	"author": "Feng Ge Qie Xing   风歌且行   ",
	"year": "\n2019",
	"ranking": "#6970   #6307   #1089   #7725   #570   ",
	"reviewcount": "129 Reviews sorted by",
	"description": "By some freak coincidence, Song Ci mistakenly consumed the blood of the Demon King, causing himself to become a demon too. A weak scholar…… forced to suffer in silence.\r\n\r\nWhat was even more tragic was that no matter where he went, demons would attack him from all directions braying for his blood, or they would squeeze his neck while interrogating him about his relationship with the Demon King.\r\n\r\nAs such, Song Ci became an anti-fan of the Demon King. Regardless of who praised the Demon King, he would be the first to stand out and refute them. \r\n\r\nSong Ci fled for his life as he searched for the gate leading to the Demon Realm. Along the way, he clung on to the thigh of an influential man, and went to great pains to persuade him to slay the Demon King together with him and restore peace to the human world.\r\n\r\nSong Ci, “Sooner or later, I will skin the Demon King, rip the tendons off him, and drink his blood!”\r\n\r\nRong Bai (smiling), “I admire the way you think.” \r\n\r\nWho knew that, after entering the demon realm — \r\n\r\nTens of thousands of monsters bowed their heads and kowtowed to this thigh beside him and shouted “Long live the Demon King!”\r\n\r\nSong Ci was stunned.\r\n\r\nRong Bai (smiling),  “What did you say you were going to do when you came to the Demon Realm?” \r\n\r\nSong Ci, “It, it’s all a misunderstanding……” \r\n\r\n>"
}