{
	"url": "https://www.novelupdates.com/series/unification-of-the-country-with-nobunaga-starting-from-honnoji/",
	"title": "Unification of the Country With Nobunaga Starting From Honnoji - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/03/Unification-of-the-Country-With-Nobunaga-Starting-From-Honnoji.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Harem   Historical   Martial Arts   Romance   Seinen   Supernatural   ",
	"tags": "Ancient Times   Male Protagonist   Polygamy   Time Travel   ",
	"rating": "(3.8 / 5.0, 8 votes)",
	"author": "Hitachinosuke Kankou   常陸之介寛浩   ",
	"year": "\n2018",
	"ranking": "#6970   #2000   #10391   #5746   #10464   ",
	"reviewcount": "1 Review sorted by",
	"description": "Makoto, who was raised by his father, a Kashima Shinto-ryu instructor, and mother, who comes from a family of Onmyoji, has chuunibyou (8th grade syndrome)?\n\nThere was a reason why his actions seemed chuuni.\n\nMakoto proceeded through an ancient temple’s underground passage to its idol during his school trip, and as he passed through the door…\n\nThe world that was beyond him was the Sengoku period!?\n\nIs this time traveling? What will happen to Makoto after he meets Nobunaga?\n\nCan Oda Nobunaga, who understood that the world was round, understand Makoto’s time travel?\n\nIsn’t Oda Nobunaga a super high-intellect boss? Are the Oda troops a black company? If you talk to Nobunaga, he’s surprisingly a nice person.\n\nThis is a story of a high school student from the Heisei era where Oda Nobunaga valued his delusional power, imagination, and wisdom to succeed in life.\n\nFried food, pork cutlet, curry rice. Heisei cuisine that fascinates Sengoku warlords and a dream harem life?\n\nAdvancing in the world with iron warships?\n\nMake Oda Nobunaga the supreme ruler of the world with his future knowledge?\n\nDevelop his birthplace, Ibaraki, as Japan’s second-biggest urban area?\n\nA new culture blooms from Makoto’s 2D bishoujo moe girl hobby?\n\nA history-altering fantasy beyond your belief!>"
}