{
	"url": "https://www.novelupdates.com/series/the-green-lotus-peasant-girl/",
	"title": "The Green Lotus Peasant Girl - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/11/O4r2PYDZynpRLxA.jpg",
	"noveltype": "(CN)",
	"genre": "Drama   Fantasy   Romance   Slice of Life   ",
	"tags": "Ancient China   Business Management   Childcare   Devoted Love Interests   Doting Love Interests   Family Business   Farming   Female Protagonist   Hard-Working Protagonist   Heartwarming   Love Interest Falls in Love First   Multiple Reincarnated Individuals   Power Couple   Pregnancy   Second Chance   Transmigration   ",
	"rating": "(4.0 / 5.0, 100 votes)",
	"author": "倾碧悠然   ",
	"year": "\n2019",
	"ranking": "#309   #519   #2072   #642   #2494   ",
	"reviewcount": "24 Reviews sorted by",
	"description": "In her previous life, Li Qinghe married into the Xu family with pomp and splendor but was treated coldly and ignored by everyone in the household she married into. She eventually died of an illness to make way for her husband’s white moonlight.\n\nHowever, she woke up again, this time with prior knowledge of herself being just a cannon fodder in a sweet romance novel. In the original novel, Qinghe had saved the male protagonist’s life and then asked him to marry her as repayment. She then made the lovers’ lifetime a hell because of her jealousy. Now that she had returned to the past and been given a second chance at life, Li Qinghe decided to change her way of living. She resolved to stay away from the male and female protagonists. It was still important to save his life for the story to continue, but that kindness would be exchanged for silver, and she would leave instead.\n\nBut unexpectedly, the original male protagonist was not reconciled to this and rushed to become entangled with her. She had a violent temper and rolled up her sleeves, intending to hit him. Another man beside her saw this and felt very distressed. Hurriedly taking her hand and squeezing it gently, he said, “Be good. If you’re not careful, your hand will hurt. You should stand aside and let me do such menial work.”\n\n…\n\nIn his last life, Zhou Chengkang had built and maintained a large tombstone in front of Li Qinghe’s grave for his entire life after her death. He regretted not expressing the feelings in his heart to her many times. He then died, still carrying that regret.\n\nWhen he opened his eyes again, he found that he was reborn and had returned to the time before she had gotten married to Xu Changjie. The beautiful lady was again alive and graceful, drawing at his heartstrings. He couldn’t help but want to take her into his arms.\n\nThis time, he won’t miss his chance again.\n\nDouble rebirth; a story of a husband and wife farming together and living with scums.>"
}