{
	"url": "https://www.novelupdates.com/series/48-hours-a-day/",
	"title": "48 Hours a Day - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/06/Hours-a-Day.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Fantasy   Mystery   Sci-fi   Supernatural   ",
	"tags": "Absent Parents   Adapted to Manhua   Aliens   Ancient Times   Archery   Artifacts   Calm Protagonist   Cheats   Clever Protagonist   Detectives   Fanfiction   Fast Learner   Game Elements   Gladiators   Goddesses   Gods   Guilds   Gunfighters   Handsome Male Lead   Hard-Working Protagonist   Interdimensional Travel   Male Protagonist   Mature Protagonist   Modern Day   Mysterious Past   Mythical Beasts   Mythology   Pirates   Romantic Subplot   Special Abilities   Survival Game   Time Manipulation   Transported to Another World   Unlimited Flow   Weak to Strong   ",
	"rating": "(4.0 / 5.0, 132 votes)",
	"author": "Little Bleary Zhao   小呆昭   ",
	"year": "\nN/A",
	"ranking": "#5262   #1084   #3776   #7987   #5717   ",
	"reviewcount": "47 Reviews sorted by",
	"description": "Growing up with eccentric materialist parents, who left him in the care of his grandfather for a job overseas, Zhang Heng had learned to adapt and be unfettered by the oddities and challenges in life. But he would soon learn the baffling truth about the world he thought he knew, when one day at midnight, time froze and he found himself in a world so quiet and still it was deafening. That night, he discovered that he had 24 hours more than everybody else and thus, marked the beginning of his adventures. The mysteries surrounding his newfound ability only deepened when a strange old man claimed to have given Zhang Heng that ‘gift of time’ and recruited the young man to participate in a cryptic ‘life-changing’ game on his behalf. Little did Zhang Heng know that accepting those terms meant embroiling himself in many versions of reality and exposing himself to the hidden secrets of the world—a decision he could never undo.>"
}