{
	"url": "https://www.novelupdates.com/series/second-marriage-of-a-wealthy-old-man/",
	"title": "Second Marriage of a Wealthy Old Man - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/04/9617ac2cgy1g2uweebalhj205k07sq4u.jpg",
	"noveltype": "(CN)",
	"genre": "Drama   Fantasy   Romance   Slice of Life   Yaoi   ",
	"tags": "Adultery   Businessmen   Calm Protagonist   Childcare   Clever Protagonist   Clingy Lover   Contracts   Doting Love Interests   Family   Family Conflict   Handsome Male Lead   Marriage   Mpreg   Older Love Interests   Past Plays a Big Role   Previous Life Talent   Proactive Protagonist   Protagonist Falls in Love First   Protagonist Strong from the Start   Reincarnation   Revenge   Second Chance   Smart Couple   Special Abilities   Strong Love Interests   Strong to Stronger   Tragic Past   Wealthy Characters   ",
	"rating": "(4.1 / 5.0, 336 votes)",
	"author": "Tangerine Boat   橘子舟   ",
	"year": "\n2019",
	"ranking": "#1837   #1626   #1018   #3250   #761   ",
	"reviewcount": "83 Reviews sorted by",
	"description": "Meng Yang had done a lot of s*upid and wrong things in his life. Jumping around like a clown, annoying and unpleasant. Only after his tragic death did he know that he was a cannon fodder written in a book who only existed to set off the protagonist shou.\n\nAlthough he certainly had done things to hate, the protagonist gong and the protagonist shou were not totally innocent. The protagonist gong betrayed him first, then the protagonist shou framed him. So when he was reborn, he decided…\n\nMarry the protagonist gong’s rich father and give the protagonist a few younger brothers to divide the property.\n\nHe wanted to be pregnant soon but thinking that the old man was getting older it would be more difficult. But he didn’t expect that the old man was not only strong, he was even more handsome than the protagonist gong. The steady momentum and charm of that mature man was so attractive that a certain person couldn’t close their legs…ahhhh, he accidentally told the truth. He just couldn’t hold his mouth.\n\nLuo Xiu and his ex-wife had been in a business marriage and were divorced for many years. He really did not expect that he would marry a boy so much younger than him, that he would become an extra son to raise.\n\nHe just didn’t expect this delicate and tender little guy to be so attractive, making him pamper him and spoil him and eventually take his heart.>"
}