{
	"url": "https://www.novelupdates.com/series/your-scandals-are-way-cuter-than-you/",
	"title": "Your Scandals Are Way Cuter Than You - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/04/Your-Scandals-Are-Way-Cuter-Than-You.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Romance   Shounen Ai   Yaoi   ",
	"tags": "Acting   Adapted to Drama CD   Bickering Couple   Black Belly   Carefree Protagonist   Celebrities   Childhood Friends   Cold Love Interests   Dense Protagonist   Doting Love Interests   Famous Protagonist   Game Elements   Handsome Male Lead   Hated Protagonist   Heartwarming   Hiding True Identity   Love Interest Falls in Love First   Mismatched Couple   Misunderstandings   Modern Day   Movies   Playful Protagonist   Popular Love Interests   Proactive Protagonist   Shameless Protagonist   Showbiz   Slow Romance   Wealthy Characters   ",
	"rating": "(4.6 / 5.0, 234 votes)",
	"author": "Mao Qiu Qiu   毛球球   ",
	"year": "\n2020",
	"ranking": "#2000   #2000   #2591   #1717   #2113   ",
	"reviewcount": "55 Reviews sorted by",
	"description": "Jiang Ying, a controversial second-generation celebrity. Loves nothing more than collecting dirt on other stars.\n\nQi Zhu, a controversial actor. His hobby? Counterattacking trolls, tabloids, and anti-fans.\n\nClassmates from elementary school to high school, they fit the mold of childhood sweethearts. And yet they were more like fire and ice: utterly incompatible.\n\nBack in high school, they fought while reviewing test answers. On set, they fought over their scripts. For better or worse, the two were in contact every single day. Their QQ streak has never been broken.\n\nBy chance, Qi Zhu discovered his own dirt in Jiang Ying’s possession.\n\nQi Zhu: ?\n\nJiang Ying: Don’t you know? Your scandals are way cuter than you.\n\nJiang Ying thought they would bicker for the rest of their lives.\n\nUntil, one day, he came across a new ship on Weibo: ZhuiFengZhuYing.\n\nAnd a supertopic to match: ZhuYingYaoHong.\n\nSoon after Jiang Ying was born, his parents held his  zhuazhou  ceremony. Among the items they set out before him, Jiang Ying crawled to the keyboard.\n\nEver since his youth, Jiang Ying had never lost an argument.\n\nIn a popular squabbling app that randomly matched users with differing opinions, prompting them to fight, Jiang Ying could handily defeat any opponent.\n\nAfter spending three years on the app ‘Fight!’, Jiang Ying reigned as king of the leaderboard.\n\nOut of the goodness of his heart, to benefit society, Jiang Ying took an apprentice who clearly didn’t know the first thing about dissing people. He worked hard to train up his little apprentice until the kid could diss and roast as fiercely as the king.\n\nIt was only later, when he was pushed down in bed and [redacted] by the typically cold and taciturn Qi Zhu, that Jiang Ying realized Qi Zhu had somehow learned every trick in his book.>"
}