{
	"url": "https://www.novelupdates.com/series/quick-transmigration-the-host-is-sweeter-than-sugar/",
	"title": "Quick Transmigration: The Host Is Sweeter Than Sugar - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/09/300-1.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Comedy   Josei   Romance   Supernatural   Xianxia   ",
	"tags": "Beautiful Female Lead   Clingy Lover   Cute Protagonist   Cute Story   Demon Lord   Dense Protagonist   Devoted Love Interests   Early Romance   Female Protagonist   Handsome Male Lead   Heartwarming   Heaven   Heavenly Tribulation   Interdimensional Travel   Love Interest Falls in Love First   Male Yandere   Multiple Realms   Naive Protagonist   Obsessive Love   Persistent Love Interests   Popular Love Interests   Possessive Characters   Post-apocalyptic   Reincarnation   Strong Love Interests   System Administrator   Transmigration   World Hopping   Yandere   Zombies   ",
	"rating": "(3.9 / 5.0, 50 votes)",
	"author": "沐沐超级乖   ",
	"year": "\n2020",
	"ranking": "#2000   #6371   #5409   #5149   #4101   ",
	"reviewcount": "10 Reviews sorted by",
	"description": "As the first refined sugar in the Three Realms, Su Tang was so sweet that anyone who saw her wanted to eat her. Among the people chasing her in the mountains and wilds, only the Immortal Xianzun Muli, who is as clear as a stream does not like sweets, and he won’t let others eat her! \n\nSu Tang happily followed Mu Li back to the palace, and even followed his reincarnation to the next worlds. But who can tell her what happened to the reincarnation of Mu Li, who is said to not love sugar in every possible way?\n\nIn his first life, the sickly beauty whispered to her in paranoia, “Su Tang, you are mine. You can’t escape from me.”\n\nIn his second life, the lonely boy rushed to her softly and acted like a baby, “Tang Tang, I’m very good. Please like me. Okay?”\n\nIn the nth life, the cruel demon chuckled softly at her, “Tangtang, I am very easy to be fed, but I don’t like sugar. Would you like to consider feeding me?”\n\nSu Tang hugged herself and shivered. She believed this ghost?! His reincarnations are liars! Con man!!!>"
}