{
	"url": "https://www.novelupdates.com/series/i-shocked-the-world-after-being-forced-to-farm/",
	"title": "I Shocked the World After Being Forced to Farm - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/09/egg-story.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Romance   School Life   Slice of Life   Yaoi   ",
	"tags": "Cold Love Interests   College/University   Farming   Level System   ",
	"rating": "(4.2 / 5.0, 36 votes)",
	"author": "Su Ci Li   苏词里   ",
	"year": "\n2020",
	"ranking": "#6970   #2000   #6568   #3697   #5103   ",
	"reviewcount": "5 Reviews sorted by",
	"description": "When Yu Ci woke up, he was perched on top of a 20 meter high branch with an unknown bird standing on his head. With a dull tone, the bird said, “Look downwards, this is the land I have conquered for you.” Unfortunately, the gifted land was barren. Then the strange bird gave him two options:\n\n1- Turn the wasteland into a farm\n\n2- Friendship gift's a pile of shit, so he’ll kick him down to become a pile of shit.\n\nYu Ci, trembling in fear, picked up the small hoe and started the story of forced farming. \n\nSince then, Yu Ci diligently tilled the land, until one day he stumbled upon a pearly white egg in the wasteland. A beautiful man hatched from the egg.\n\nWhen the man was happy, it would be a peaceful, sunny day with soft, gentle breezes.\n\nWhen the man was angry, there would be thunder rumbling and lightning flashes.\n\nWhen the man pursed his lips and was being uncommunicative, there would be an overcast.\n\nYu Ci: ??\n\nQi Huai noticed the youth who hatched him was always smiling at him, gently and patiently coaxing him, buying him clothes and sweets. As long as he requested something, there would be nothing that can’t be done. Afterwards, Qi Huai found out the truth. This person was cajoling him into a humanoid weather controller to make the farm crops grow better.\n\nQi Huai: Scum. \n\nOn this day, the sun was blazing hot and all the plants on the farm were drooping their heads. Yu Ci was extremely distressed at the sight, pulled on Qi Huai’s hand and asked, “Could you please cry for a moment? This place needs a good rain. The more tears, the better.”\n\nThe other party had a faint smile as he pressed against Yu Ci, “I can cry, but I can also make you cry. It won’t matter how loud you’re being.”\n\nYu Ci: …..>"
}