{
	"url": "https://www.novelupdates.com/series/three-lives-three-worlds-the-pillow-book/",
	"title": "Three Lives Three Worlds, The Pillow Book - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2017/01/s27081205.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Drama   Fantasy   Josei   Mature   Romance   Supernatural   Xianxia   ",
	"tags": "Adapted to Drama   Adapted to Drama CD   Appearance Different from Actual Age   Beautiful Female Lead   Cultivation   Demons   Devoted Love Interests   Fairies   Female Protagonist   Goddesses   Gods   Handsome Male Lead   Immortals   Magic   Misunderstandings   Multiple Realms   Mythology   Power Couple   Reincarnation   Slow Romance   Strong Love Interests   Stubborn Protagonist   ",
	"rating": "(4.1 / 5.0, 127 votes)",
	"author": "Tang Qi Gong Zi   唐七公子   ",
	"year": "\n2012",
	"ranking": "#2000   #2000   #4482   #13810   #3804   ",
	"reviewcount": "21 Reviews sorted by",
	"description": "Book 1:\n\nThe start of another one of Tang Qi Gong Zi’s tale of a past life and present life.\n\nIf persistentness in the end will still be in vain, who would use up this life to entirety, only to watch over an untouchable love?\n\nIf a persistant attraction of more than two thousand years, is to be put down right now, to be cut off, would there be tears to be poured?\n\nEven if honored with the status of a God, Dong Hua would still perish like features.\n\nEven as the female monarch of Qing Qiu, Feng Jiu would still fade away in time.\n\nAlthough what is unknown, is that when wind and clouds are gone, when he is still walking through never ending years and ages, and occasionally brushing past her, this once legacy making God, would he still be able to remember, from his former days, that little red fox with a patch of snowy white fur on her forehead that had once rested between his sleeves.\n\nThat commanding Queen of Qing Qiu of ancient times from the deity clan, whether she can still remember he plucked a strand of Fuling flowers for her in the bygone era.\n\nBook 2:\n\nTwo thousand years of obsessions, but in exchange for many missed opportunities in love.\n\nIf ultimately we have no chance to be together, so why let us meet each other in this life, a glance a million years?\n\nIn the middle of a foggy dream, one walks through whose shadow, destroys whose yearning, and buries whose current life and past life?\n\n“Emperor (Di) and concubine (Ji) who are floating ups and downs in the dream land, what do you really want?”\n\n“All I seek in this lifetime, is merely that he can see my shadow in his eyes.”\n\nThere is a saying that the feeling is deep but the fate is shallow. She is the one with deep feeling but her fate with Dong Hua is shallow.\n\nThere is a word called unfortunate. She is unfortunate so she met him. He is also unfortunate so he missed her.\n\n“He is very good. Just that he and I have no fate to be together.”\n\n“So what if the Mandate of Heaven says we are destinated to be together or not destinated to be together?  As the King, I have never fear the Mandate of Heaven and also do not need any handout from the Mandate of Heaven.”\n\nHow does the Mandate of Heaven determine our predestined relationship? One person’s doubt, everyone get caught in a vortex.>"
}