{
	"url": "https://www.novelupdates.com/series/omnipotent-sage/",
	"title": "Omnipotent Sage - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2018/01/600.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Martial Arts   Xianxia   ",
	"tags": "Appearance Different from Actual Age   Aristocracy   Arranged Marriage   Arrogant Characters   Artifact Crafting   Artifacts   Beast Companions   Beasts   Blacksmith   Bloodlines   Body Tempering   Buddhism   Clever Protagonist   Confident Protagonist   Cultivation   Cunning Protagonist   Demons   Determined Protagonist   Eye Powers   Fast Cultivation   Hard-Working Protagonist   Heavenly Tribulation   Hiding True Abilities   Hiding True Identity   Immortals   Loyal Subordinates   Lucky Protagonist   Magic Formations   Magical Space   Male Protagonist   Mature Protagonist   Modern Knowledge   Multiple POV   Multiple Realms   Past Plays a Big Role   Personality Changes   Politics   Pragmatic Protagonist   Pregnancy   Romantic Subplot   Royalty   Ruthless Protagonist   Schemes And Conspiracies   Secretive Protagonist   Spatial Manipulation   Spirit Advisor   Time Manipulation   Time Skip   Transmigration   Underestimated Protagonist   Weak to Strong   ",
	"rating": "(2.9 / 5.0, 107 votes)",
	"author": "Snake Swallows Whale   蛇吞鲸   ",
	"year": "\n2010",
	"ranking": "#2000   #2000   #1596   #10478   #4621   ",
	"reviewcount": "18 Reviews sorted by",
	"description": "Invincible fists, unrivaled hammers!\n\nJunior Leopard, who traveled through time and space, takes what he earns and does only what he needs to do, never undertaking too much responsibility nor being so chivalrous as to do every good deed. His so-called ambitions from his past life to change the world were cast aside.\n\nHowever, when a forbidden bloodline awakens in his body and his eternal eyes begin to shine once again, he discovers that his iron fists give him the power to force others to follow the truth and to reforge justice!\n\nThis is a cultivation legend about a modern man that was thrust into an amazing martial arts world.>"
}