{
	"url": "https://www.novelupdates.com/series/i-became-a-magical-cheat-loli-witch-my-different-world-life-with-my-reincarnation-privilege-creation-magic-and-the-seed-of-magic/",
	"title": "I Became a Magical Cheat Loli Witch ~My Different World Life With My Reincarnation Privilege [Creation Magic] and the [Seed of Magic]~ - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/12/81hPKfgxH4L.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Comedy   Fantasy   Shoujo Ai   Slice of Life   Supernatural   ",
	"tags": "Adapted to Manga   Adopted Children   Adventurers   Androids   Angels   Appearance Different from Actual Age   Calm Protagonist   Caring Protagonist   Childcare   Crafting   Demons   Dragons   Dwarfs   Elemental Magic   Elves   Female Protagonist   Game Elements   Goddesses   Golems   Immortals   Level System   Loli   Magic   Magic Beasts   Magic Formations   Maids   Master-Servant Relationship   Monsters   Overpowered Protagonist   Reincarnated in Another World   Reincarnation   Skill Creation   Special Abilities   Strong to Stronger   Sword And Magic   Time Skip   Weak to Strong   Witches   ",
	"rating": "(4.4 / 5.0, 116 votes)",
	"author": "Aloha Zachou   アロハ座長   ",
	"year": "\n2019",
	"ranking": "#2510   #2265   #1595   #1447   #1901   ",
	"reviewcount": "12 Reviews sorted by",
	"description": "A goddess of another world who called herself Goddess Liliel gave her a unique skill [Creation Magic], and the nameless protagonist reincarnated into another world.\n\nAlthough she had knowledge of her previous life Japan, she couldn’t remember the specifics—-the girl who decided to call herself Chise, invented the [Seed of Magic] in order to increase her mana, and continued creating them with her increased mana.\n\nThe girl who obtained massive amounts of mana stopped aging, and eventually obtained perpetual youth.\n\nThe forever young loli cheat creation witch Chise brought her companion Tet, her golem daughter who can’t grow old, to become an adventurer, and traveled around various places in a different world with the safe land as a base that she personally created.>"
}