{
	"url": "https://www.novelupdates.com/series/historys-strongest-senior-brother/",
	"title": "History’s Strongest Senior Brother - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2017/04/hssb.jpeg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Fantasy   Martial Arts   Xuanhuan   ",
	"tags": "Adapted to Manhua   Artifact Crafting   Artifacts   Beautiful Female Lead   Body Tempering   Buddhism   Calm Protagonist   Clever Protagonist   Cultivation   Cunning Protagonist   Dao Comprehension   Demons   Famous Protagonist   Handsome Male Lead   Immortals   Loyal Subordinates   Lucky Protagonist   Magic Formations   Male Protagonist   Multiple Realms   Multiple Reincarnated Individuals   Proactive Protagonist   Reincarnated in Another World   Reincarnation   Romantic Subplot   Schemes And Conspiracies   Special Abilities   Strong to Stronger   Sword Wielder   Time Skip   Transmigration   Unique Weapons   Unreliable Narrator   Wars   World Travel   ",
	"rating": "(4.2 / 5.0, 939 votes)",
	"author": "August Eagle   Ba Yue Fei Ying   八月飞鹰   ",
	"year": "\n2016",
	"ranking": "#224   #113   #56   #449   #98   ",
	"reviewcount": "134 Reviews sorted by",
	"description": "It was Yan Zhaoge’s first time transmigrated into another world. He landed in a martial warrior civilization that was at the peak of prosperity. He ended up in the Divine Palace’s library, which collected and preserved the classics of the entire world from all fields of knowledge. However, a world-class calamity struck soon after, and even the Divine Palace was destroyed.\n\nYan Zhaoge’s soul once again transmigrated into another world. The twist was he arrived in the same world, except countless years have passed.\n\nWith his brain full of rare books and classics from the era of peak prosperity, Yan Zhaoge’s second transmigration to the present era was like a gamer who was used to playing hell mode suddenly finding himself playing the game on easy mode.\n\nThat was just way too awesome.\n\nBut before that, he would need to fix a problem.\n\n“I’m not the main character? In fact, I’m actually the main character’s love rival and the antagonistic Mr. Perfect senior brother? This script is wrong!”>"
}