{
	"url": "https://www.novelupdates.com/series/after-becoming-the-tyrant/",
	"title": "After Becoming The Tyrant - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/01/After-Becoming-The-Tyrant.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Fantasy   Romance   Shounen Ai   Supernatural   ",
	"tags": "Alchemy   Alternate World   Ancient Times   Angels   Antihero Protagonist   Aristocracy   Betrayal   Calm Protagonist   Death of Loved Ones   Demons   Devoted Love Interests   European Ambience   Gods   Heaven   Hell   Industrialization   Kingdom Building   Kingdoms   Knights   Nobles   Past Plays a Big Role   Pirates   Politics   Pragmatic Protagonist   Priests   Royalty   Schemes And Conspiracies   Scientists   Slow Romance   Transmigration   Transported to Another World   Wars   Witches   ",
	"rating": "(4.5 / 5.0, 77 votes)",
	"author": "吾九殿   ",
	"year": "\n2019",
	"ranking": "#5262   #4690   #4494   #5243   #3513   ",
	"reviewcount": "15 Reviews sorted by",
	"description": "[His iron cavalry kicked up wild gales, and his fleet of ships wove an unbreakable net. \n\nHis power shook the four seas, he was the ruler of the world]\n\nZhu Chi, who didn’t want to die, made a deal with the devil in exchange for the chance to survive in another world. The new body was young, full of vitality, and full of life.\n\nZhu Chi finally escaped from the smell of the hospital ward’s antiseptic wipes, and he smiled with joy.\n\nSoon, after accepting the new identity, the smile on Zhu Chi’s face gradually disappeared.\n\nHe, wearing a royal robe and a crown, ruled over thirty-six states and was the only Emperor in the Western Continent.\n\nHe, aggressively levied exorbitant taxes, arbitrarily conquering neighboring lands, using gold to build a carriage, scorning the divine power and humiliating the church.\n\n——He was a tyrant.　　\n\nThe devil was indeed the devil, treacherous, cunning, and sinister.\n\nNow, Zhu Chi, who had recovered his health, had to face all of the hatred and animosity:\n\n1, the nobility deprived of their titles\n\n2, the cardinals who were deliberately suppressed\n\n3, the leaders of the chamber of commerce whose wealth and property were seized\n\n4, the……\n\nAs well as: face an assassination seven days later.\n\nIf still according to the script, he would be exiled in four months, and then hanged in front of the Mohn Tower.\n\nZhu Chi: Splendid.\n\nHe rolled up his sleeves leisurely and smiled: What about the tyrant? If I want to, this tyrant can also rule the earth.\n\n[I want the Rose King’s flag to fly across the mainland, I want the glory that will be like a sun that will never set, I want wherever the golden carriage passes to receive allegiances from all the people.\n\nBecause I am——\n\nBorn to be King]>"
}