{
	"url": "https://www.novelupdates.com/series/godfather-of-champions/",
	"title": "Godfather Of Champions - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2018/06/Godfather-Of-Champions.jpg",
	"noveltype": "(CN)",
	"genre": "Drama   Historical   Slice of Life   Sports   Tragedy   ",
	"tags": "Adopted Children   Celebrities   Charismatic Protagonist   Devoted Love Interests   Famous Protagonist   Male Protagonist   Management   Marriage   Modern Day   Romantic Subplot   Sharp-tongued Characters   Transmigration   Younger Love Interests   ",
	"rating": "(4.0 / 5.0, 100 votes)",
	"author": "Lin Hai Ting Tao   林海听涛   ",
	"year": "\n2007",
	"ranking": "#1380   #2000   #3413   #8667   #7286   ",
	"reviewcount": "14 Reviews sorted by",
	"description": "This is a story about the pursuit of victory.\n\n- 'I subscribe only to the theory of victory. I only pursue victory. As long as I am able to obtain victory, I don't care if it's total football or counterattack. What is the ultimate goal of professional soccer? In my opinion, it is victory, and the pinnacle of victory is to become the champions. I am a manager. If I don't wish to lose my job or be forgotten by the people, there's only one path for me to take, and that is to lead the team in obtaining victories, in obtaining championship titles!'\n\nThe main character was not well-liked by people.\n\n- '...We conducted a survey which had been deemed by Manager Tony Twain as extremely meaningless. In a random street survey conducted, ninety-three percent of those surveyed chose the option 'I hate Tony Twain', while only seven percent chose the option 'This person is rather decent, I like him'. It is worth noting that nobody chose the option 'Who is Tony Twain? I don't know him'. Mark, do you know why Manager Twain felt that our survey was very meaningless?' Parker, a reporter from  laughed loudly and said when he was being interviewed by BBC.\n\nBut there were also people who were madly in love with him.\n\n- '...Became the spokesperson of world-wide famous clothing brands, shot advertisements, frequented the fashion industry's award ceremonies, endorsed electronic games, has a supermodel girlfriend. His earnings from advertisements exceed his club salary by seventeen times, owns a special column in various print medias, publishing his autobiography (in progress), and is even said that he is planning to shoot an inspirational film based off his own person experiences! Who can tell me which part of his life experiences is worthy of being called 'inspirational'? Hold on....Are you all thinking that I'm referring to David Beckham? You're sorely mistaken! I'm talking about Manager Tony Twain....'\n\nHe was very knowledgeable about Chinese soccer.\n\n- '...I've heard about it, that Bora gifted four books to his manager Mr. Zhu before your country's national team's warm up match. After which, the team lost 1:3 to a nameless American team from Major League Soccer. The new excuse that Mr. Zhu gave for losing the match, was that Bora gifted 'books' ('books' and 'lose' are homophones in the Chinese language). Here, I recommend that you guys find out what that one specific book is. Which book? Of course the one that caused you all to score a goal. After that, tell me the title of the book. Before every match, I will gift ten copies of that same book to you. In that case, won't you all be able to get a triumphant 10:0 win over your opponents every time?' An excerpt taken from Tony Twain's special column in a certain famous Chinese sports newspaper.>"
}