{
	"url": "https://www.novelupdates.com/series/emperors-domination/",
	"title": "Emperor’s Domination - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2016/09/liqiye.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Drama   Harem   Martial Arts   Mystery   Xuanhuan   ",
	"tags": "Adapted to Manhua   Alchemy   Appearance Different from Actual Age   Arrogant Characters   Artifacts   Average-looking Protagonist   Beast Companions   Beautiful Female Lead   Bloodlines   Body Tempering   Buddhism   Calm Protagonist   Carefree Protagonist   Charismatic Protagonist   Cultivation   Cunning Protagonist   Dao Comprehension   Death   Death of Loved Ones   Demons   Determined Protagonist   Eidetic Memory   Empires   Godly Powers   Gore   Heavenly Tribulation   Hiding True Identity   Immortals   Long Separations   Lost Civilizations   Loyal Subordinates   Lucky Protagonist   Maids   Male Protagonist   Mature Protagonist   Mind Control   Monsters   Multiple Realms   Overpowered Protagonist   Past Plays a Big Role   Phoenixes   Pill Concocting   Playful Protagonist   Polygamy   Previous Life Talent   Protagonist Strong from the Start   Quirky Characters   R*pe Victim Becomes Lover   Ruthless Protagonist   Saints   Schemes And Conspiracies   Sect Development   Sentient Objects   Shameless Protagonist   Spatial Manipulation   Strength-based Social Hierarchy   Strong to Stronger   Student-Teacher Relationship   Teachers   Time Skip   Time Travel   Underestimated Protagonist   Unique Cultivation Technique   Unique Weapons   Wars   World Travel   World Tree   ",
	"rating": "(3.9 / 5.0, 2044 votes)",
	"author": "Yan Bi Xiao Sheng   厌笔萧生   ",
	"year": "\n2014",
	"ranking": "#17   #20   #1   #23   #34   ",
	"reviewcount": "326 Reviews sorted by",
	"description": "A boy that was imprisoned for millions of years has regained a mortal body.\n\nHe became a disciple of the declining Cleansing Incense Ancient Sect where its patriarch used to be his disciple. Now he will bring this sect back to its former glory.\n\nThis is his journey to reach the apex and take revenge on those who had imprisoned him.\n\nThis is his story of meeting old friends and making new companions.\n\nThis is his path of traversing the Nine Worlds and becoming the next ruler of the Heavens.\n\nSeveral millennia have passed and the golden age of experts has passed. A master whose disciples once were the most exalted Immortals among the 9 worlds had all left him. With his mortal body, mortal physique and mortal life wheel… he shall sweep the 9 worlds and take what is rightfully his.>"
}