{
	"url": "https://www.novelupdates.com/series/rebirth-into-an-interstellar-marriage/",
	"title": "Rebirth into an Interstellar Marriage - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2018/08/rebirthinto.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Romance   Slice of Life   Yaoi   ",
	"tags": "Acting   Arranged Marriage   Artificial Intelligence   Black Belly   Businessmen   Calm Protagonist   Contracts   Debts   Devoted Love Interests   Family   First Love   Futuristic Setting   Handsome Male Lead   Heartwarming   Love at First Sight   Love Interest Falls in Love First   Marriage   Movies   Mpreg   Orphans   Possessive Characters   Previous Life Talent   Protagonist Strong from the Start   Showbiz   Time Travel   Transmigration   Wealthy Characters   ",
	"rating": "(4.2 / 5.0, 78 votes)",
	"author": "Mo Chen Huan   莫晨欢   ",
	"year": "\n2016",
	"ranking": "#4617   #6367   #3339   #6111   #2244   ",
	"reviewcount": "18 Reviews sorted by",
	"description": "After just recently attaining the trophy for emperor of the silver screen, Chu Yan dies in a traffic accident and is rebirthed into a period millennium years later.\n\nFloating cars occupy the skies, and everyone owns virtual glasses. Culture explosion! Entertainment explosion!\n\nYet, in such a glorious and brilliant entertainment world, Chu Yan was astonished to discover that——all these people didn’t know how to act!!!\n\nSimulation of moods through artificial intelligence? Special effects production replacing acting skills?\n\nBecoming an actor simply by just understanding AI script? The era is progressing, but acting skills have retrogressed.\n\nReporter: Chu Yan, what is your opinion regarding the scandal this time about you already being married?\n\nChu Yan: …Please inform me, exactly who is my spouse?!\n\nRebirth of the emperor of the silver screen into a third-tier star: shooting movies, becoming popular, winning awards, and ascending to the peak, and setting off a surging tide to the apex of the entertainment circle!\n\nAs for who his partner was——\n\nHe Baishen: Hello, my surname is Yi, you may call me Yi Ming (Anonymous).>"
}