{
	"url": "https://www.novelupdates.com/series/genius-princes-national-revitalization-from-state-deficit-right-let-us-sell-the-country/",
	"title": "Genius Prince’s National Revitalization from State Deficit ~ Right, Let Us Sell the Country - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/04/Genius-Prince’s-National-Revitalization-from-State-Deficit-Right-let-us-sell-the-country.jpg",
	"noveltype": "(JP)",
	"genre": "Adventure   Comedy   Fantasy   Romance   Shounen   ",
	"tags": "Adapted to Anime   Adapted to Manga   Aristocracy   Beautiful Female Lead   Bodyguards   Cautious Protagonist   Charismatic Protagonist   Childhood Friends   Clever Protagonist   Cunning Protagonist   Dense Protagonist   Devoted Love Interests   Different Social Status   Domestic Affairs   Eidetic Memory   Empires   European Ambience   Friendship   Genius Protagonist   Handsome Male Lead   Kingdom Building   Lazy Protagonist   Loyal Subordinates   Male Protagonist   Master-Servant Relationship   Misunderstandings   Multiple POV   Nobles   Politics   Protagonist Strong from the Start   Royalty   Ruthless Protagonist   Schemes And Conspiracies   Secret Identity   Shameless Protagonist   Strategic Battles   Strong Love Interests   Time Skip   Wars   Younger Sisters   ",
	"rating": "(4.2 / 5.0, 235 votes)",
	"author": "Toba Tooru   鳥羽 徹   ",
	"year": "\n2018",
	"ranking": "#4617   #3717   #878   #431   #560   ",
	"reviewcount": "26 Reviews sorted by",
	"description": "The state administration had been checkmated, it was hopeless!\n\n“As expected of your Highness, for you to aim for such goal!”\n\n“I will follow you wherever you are!”\n\n“Your Highness! Your Highness! Your Highness!”\n\n“(How did it all end up like this?!)”\n\nThe young prince Wayne, he revitalized the weak state by the power of pen and military arts. (Oh and misunderstanding!)\n\nHe was a man who excelled at management and the military arts, but had a secret wish.\n\n(Ah, I wish to sell this country as fast as possible and retire!)\n\nIndeed, his true nature was that of a traitor who wanted to sell his country.\n\nHowever, when he tried to sell the country to another great power, he ended up profiting! And he even moderately won against a larger nation in a war!\n\nHis fame ended up rising, his retainers ended up loyal to him.\n\nHis wish of retirement went further away…\n\nThis is a story about a genius prince who revitalized a nation full of hilarity!>"
}