{
	"url": "https://www.novelupdates.com/series/citadel-for-all-the-only-unit-angel-at-the-start-of-the-game/",
	"title": "Citadel for All: The Only Unit Angel at the Start of the Game - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/09/Citadel-for-All-The-Only-Unit-Angel-at-the-Start-of-the-Game.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Fantasy   Harem   Mystery   Romance   Sci-fi   Supernatural   ",
	"tags": "Angels   Boss-Subordinate Relationship   Evil Gods   Fantasy World   Game Ranking System   God Protagonist   Goddesses   Gods   Kingdom Building   Loyal Subordinates   Male Protagonist   Monsters   Polygamy   Survival   Transported to Another World   Weak to Strong   ",
	"rating": "(2.9 / 5.0, 39 votes)",
	"author": "洪荒大狐仙儿   ",
	"year": "\n2021",
	"ranking": "#290   #760   #3403   #624   #7760   ",
	"reviewcount": "9 Reviews",
	"description": "Billions of humans have descended on the Boundless Continent to become the Lord of the Citadel and participate in a fair and equitable race for supremacy.\n\nAt the beginning of the landing, each Citadel Lord would randomly receive an Initial Barrack.\n\nThe first thing to do was to recruit soldiers, plunder resources, build a dynasty and compete for supremacy over all races!\n\nLin Yi was surprised to find out.\n\nThe one he received at random was the unique Military Barrack - the [Angel Reincarnation Pool]!\n\nAngels could be bred!\n\n'Haha, mine is an Advanced Troop Type building that can summon Forest Elves!'\n\n'Mine is a Top Tier Troop Building, capable of summoning Dark Dragons with ultimate potential to reach the Holy Rank!!!'\n\n'I can summon Golden Behemoths ......'\n\nLooking at these self-bragging messages, Lin Yi couldn't help but fall into contemplation.\n\nHis angels, holy beings, unique soldiers!\n\nThe weakest of the twin-winged Angel, in its full form, was also of demigod level.\n\nThe most powerful of all, the eighteen-winged Archangel, was even a terrifying existence of the Lord God level!\n\nAs soon as the Angel Legion comes out, who can compete with them?\n\nBelieve in the Lord, and you shall have eternal life!>"
}