{
	"url": "https://www.novelupdates.com/series/after-the-full-level-boss-is-reborn/",
	"title": "After the Full-Level Boss is Reborn - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/04/After-the-FullLevel-Boss-is-Reborn.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Drama   Romance   Xianxia   Yuri   ",
	"tags": "Antihero Protagonist   Beautiful Female Lead   Cold Protagonist   Cultivation   Demons   Female Protagonist   Master-Disciple Relationship   Multiple Personalities   Protagonist Strong from the Start   Reincarnation   Revenge   Ruthless Protagonist   Strong Love Interests   Tragic Past   Transmigration   Unconditional Love   ",
	"rating": "(4.0 / 5.0, 24 votes)",
	"author": "You Kun   游鲲   ",
	"year": "\n2019",
	"ranking": "#6970   #6203   #6491   #5567   #7704   ",
	"reviewcount": "6 Reviews sorted by",
	"description": "As the second cannon fodder in a fairy tale, Pei Yu was disappointed, used, pushed down to the Ten Thousand Demons Cave, and reduced to a mortal and a ghost.\n\nIn the end, she finally demonized, returned from the Yellow Springs, and got revenge on all those who wronged her.\n\nAfter coming back to life, Pei Yu just wanted to be a villain quietly, and by the way, protect her own disused master who laughed harmlessly.\n\n…Well, wait! Master, how did you become the strongest sword cultivator? Aren’t you a waste?\n\nHuai Bai wore a book of fairy tales. The book is not a serious book, the male lead and the female lead are awesome, only the second female is the Virgin Mary.\n\nAnd she became the second female’s master, and at the beginning of the story she died with nothing left.\n\nPointing to the fact that there are still hundreds of years from the beginning of the plot, she decided to practice hard first to become a thigh, and by the way, help the little apprentice to correct the problems of others.\n\nHey? Why is this little apprentice different from the book?\n\nPei, Ruthless, Yu: Master is a waste, I must protect her!\n\nHuai, Strongest Sword Cultivator, Bai: The apprentice is a Virgin Mary, I must educate her well!\n\nCrowd, eating melons: Two full-level bosses team up to abuse vegetables, who can survive this?\n\nPei Yu originally thought that after a new life, the worst would be the end at the Thousand Demons Cave.\n\nBut she never thought that there would be someone who opened her hands to her after she was covered with scars after the calamity.\n\nShe smiled and said, “Hey, I’ll spoil you.”>"
}