{
	"url": "https://www.novelupdates.com/series/her-majestys-swarm/",
	"title": "Her Majesty’s Swarm - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/02/Her-Majestys-Swarm.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Drama   Fantasy   Horror   Mystery   Psychological   Seinen   Tragedy   ",
	"tags": "Adapted to Manga   Angels   Antihero Protagonist   Aristocracy   Army   Army Building   Calm Protagonist   Death of Loved Ones   Depictions of Cruelty   Discrimination   Dragon Riders   Dragons   Elves   Female Protagonist   Game Elements   Insects   Kingdom Building   Kingdoms   Knights   Leadership   Loyal Subordinates   Mind Control   Politics   Protagonist Strong from the Start   Revenge   Ruthless Protagonist   Strategic Battles   Strategist   Survival Game   Wars   ",
	"rating": "(3.6 / 5.0, 55 votes)",
	"author": "616th Special Information Battalion   第６１６特別情報大隊   ",
	"year": "\n2017",
	"ranking": "#2000   #863   #5147   #3868   #4966   ",
	"reviewcount": "13 Reviews sorted by",
	"description": "Our protagonist is a college student who enjoys playing as the evil-aligned faction Arachnea in her favorite real-time strategy game. One day, she finds herself in a world similar to the one in the game; additionally, her body is now that of a fourteen-year-old girl. \n\nWhile things are a bit different from how they were in the game, one element has remained the same: she is the leader of the Arachnea. The insects under her control, collectively known as the Swarm, praise her and implore her to lead them to victory. In order to survive, she raises her Swarm and forms friendly relations with the elves of the neighboring forest. \n\nBut after a s*aver traveling through the forest murders one of her Swarm and the nearby kingdom’s knights burn down the elven village and massacre its people, she prepares to launch her counterattacks in the name of revenge. However, revenge is merely a pretense for attacking the countries of this world. Her command is masterful and severe, as one who has played the game in real life…>"
}