{
	"url": "https://www.novelupdates.com/series/yuusha-dakedo-maou-kara-sekai-wo-hanbun-moratte-uragiru-koto-ni-shita/",
	"title": "Yuusha Dakedo, Maou Kara Sekai Wo Hanbun Moratte Uragiru Koto ni Shita - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2018/05/Yuusha-Dakedo-Maou-Kara-Sekai-Wo-Hanbun-Moratte-Uragiru-Koto-ni-Shita.jpg",
	"noveltype": "(JP)",
	"genre": "Adventure   Comedy   Ecchi   Fantasy   Mature   Romance   ",
	"tags": "Beastkin   Betrayal   Couple Growth   Demon Lord   Demons   Depictions of Cruelty   Doting Love Interests   Drugs   Elemental Magic   Elves   Enemies Become Lovers   Fantasy Creatures   Hated Protagonist   Healers   Heroes   Kingdoms   Loli   Love at First Sight   Love Interest Falls in Love First   Magic   Male Protagonist   Marriage   Mismatched Couple   Naive Protagonist   Persistent Love Interests   Power Couple   Power Struggle   R-15   Revenge   Royalty   Schemes And Conspiracies   Strong Love Interests   Sword And Magic   Sword Wielder   Unrequited Love   Wars   ",
	"rating": "(3.9 / 5.0, 89 votes)",
	"author": "Yagami Kagami   八神鏡   ",
	"year": "\n2017",
	"ranking": "#2000   #2000   #3429   #3235   #2571   ",
	"reviewcount": "9 Reviews sorted by",
	"description": "As a hero, I have been doing my best up until now. Even with little reward, unreliable comrades, citizens that only keep complaining and a princess that only treats me like a tool, I still do my best without a word of complaint.\n\nI finally gave up after being rejected by the girl I like, being betrayed by my comrades and not receiving any recognition despite my best efforts.\n\n[I will give you half of this world. Hence, join forces with me!]\nHowever, the demon king received me with both arms and this made me delighted. I felt she is more charming that anyone in this world after receiving her recognition.\n\nThus… even though I’m the hero, I decided to betray after receiving half of the world — This is a story of the hero that is always trying his best being showered with love by a small demon king girl.>"
}