{
	"url": "https://www.novelupdates.com/series/cry-even-better-if-you-beg/",
	"title": "Cry, Even Better if you Beg - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/03/Cry-Even-Better-if-you-Beg.jpg",
	"noveltype": "(KR)",
	"genre": "Adult   Drama   Fantasy   Psychological   Romance   Tragedy   ",
	"tags": "Adopted Protagonist   Age Progression   Arranged Marriage   Arrogant Characters   Beautiful Female Lead   Bickering Couple   Caring Protagonist   Character Growth   Charismatic Protagonist   Clingy Lover   Cold Love Interests   Confinement   Cruel Characters   Dark   Different Social Status   Emotionally Weak Protagonist   European Ambience   First Love   Forced into a Relationship   Glasses-wearing Protagonist   Handsome Male Lead   Jealousy   Love at First Sight   Lovers Reunited   Male Yandere   Master-Servant Relationship   Misunderstandings   Naive Protagonist   Nobles   Obsessive Love   Possessive Characters   Pregnancy   Sadistic Characters   Secret Relationship   Seduction   Slow Romance   Stoic Characters   Tragic Past   Unrequited Love   Wars   Wealthy Characters   ",
	"rating": "(3.7 / 5.0, 152 votes)",
	"author": "Solche   솔체   ",
	"year": "\n2019",
	"ranking": "#1750   #1703   #2825   #4922   #2996   ",
	"reviewcount": "35 Reviews",
	"description": "The Herhardt household’s masterpiece.\n\nThe young owner of a heaven-like place called Arvis.\n\nThe beautiful bird slaughterer.\n\nMatthias von Herhardt.\n\nHis perfect life- completely swallowed, crushed, and shaken-\n\nby his lovely bird.\n\nLeyla Lewellin.\n\n–\n\nCut, locked, and tamed her wings.\n\nIn order to keep Leyla Lewellin in custody, Matthias did not hesitate in his actions.\n\nBecause he did not hesitate, he did not regret.\n\nBecause he did not regret, he did not reflect.\n\nBecause he did not reflect, he did not apologize.\n\nWhen his beautiful bird, Leyla Lewellin, opened her cage and flew away, Matthias decided. \n\n“If I am to lose her forever and can’t get her back, I’d rather kill her.”>"
}