{
	"url": "https://www.novelupdates.com/series/corporate-save-is-saved-by-a-beautiful-onee-san/",
	"title": "Corporate S*ave Is Saved by a Beautiful Onee-san - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/06/Corporate-Save-Is-Saved-by-a-Beautiful-Oneesan.jpg",
	"noveltype": "(JP)",
	"genre": "Comedy   Romance   Slice of Life   ",
	"tags": "Beautiful Female Lead   Cohabitation   Male Protagonist   Older Love Interests   ",
	"rating": "(4.4 / 5.0, 20 votes)",
	"author": "Sakurai Haruki   櫻井 春輝   ",
	"year": "\n2019",
	"ranking": "#6970   #2000   #7488   #5687   #7871   ",
	"reviewcount": "4 Reviews sorted by",
	"description": "Yanagi Daiki, who worked for a black company, got off the train just before the last train and caught and saved a beautiful woman who had fallen down the stairs. Just a few minutes later, he reunited with the beautiful woman in front of her high-class condominium with her bag spilled. He helps her pick up the contents of her bag, but when he stands up, he gets dizzy and collapses, partly due to his daily hard work.\r\n\r\nWhen he woke up, he found himself in a room in a luxury apartment building where a beautiful woman -Kisaragi Reika, the older, yet youthful and more beautiful president of a company, lived. While he was borrowing the shower and listening to the story of what happened last night, it was lunchtime and as he was feeding the beautiful woman, she said.\r\n\r\n[Delicious! How did you cook something like this with the scarce ingredients in this house!]\r\n\r\n[Even if I’m like this, I’m the son of a Western-style restaurant owner.]\r\n\r\nThe company man and the beautiful young president grow closer as the day progresses.\r\n\r\n[Eh? It’s hard to change jobs because you can’t save money? –If that’s the case, why don’t you live here? You can save on rent, right?]\r\n\r\n[You should quit that company as soon as possible. You don’t have to worry about your living expenses while you’re here–right?]\r\n\r\n[Well, you don’t have to work yet, do you? Take some more time off for a while, okay?]\r\n\r\n[No, it’s been a month since I quit.]\r\n\r\n[Only, just a month! I think you should take another six months, maybe a year off!]\r\n\r\n[That’s a long time!]\r\n\r\nThe battle between Daiki, who wants to work normally, and Reika, who wants him to stay home (and cook for her), begins–?\r\n\r\nThis is such a romantic comedy for adults.>"
}