{
	"url": "https://www.novelupdates.com/series/yin-xiaomei-the-bad-girl/",
	"title": "Yin Xiaomei The Bad girl - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2018/08/RP78ul3pMW7khlTgqibSP_T6Xu5ep6sYwGHWO1hZJQfHIODSFYxOSdNAFfajXUF_Dte3JMZlpW8a8wYU3BA95nmlKa90JFnWX9h6cm4cs2pu8IA8r0XX8oeTbQjjys62l2rxnju807zKMYx-RXSBpww411-h358-nc.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Drama   Mature   Romance   ",
	"tags": "Adopted Protagonist   Beautiful Female Lead   Black Belly   Celebrities   Famous Protagonist   Female Protagonist   Modern Day   Showbiz   Siblings Not Related by Blood   Time Skip   ",
	"rating": "(3.8 / 5.0, 58 votes)",
	"author": "Gui Dou   鬼斗   ",
	"year": "\nN/A",
	"ranking": "#2000   #6305   #5189   #9698   #6089   ",
	"reviewcount": "7 Reviews sorted by",
	"description": "My name is Yin Xiaomei and they all say that I am a bad woman. But I don’t think so.\n\nWhat? You want me to start from my childhood? Okay!\n\nI don’t think its such a bad idea to shoot a nude photo of my brother, right? After all, I’m helping my female compatriots. You don’t know how much a single photo can sell… If you’re going to ask for the amount… it's a secret!\n\nWhat? You said that my mother and father divorced? Please, it’s my handsome old man who’s been going outside. You can see how much father and son are alike! Although my parents rarely come home, but when they do, they are more active in bed than anyone else! Mom is young and beautiful, and the money she has is infinite! Tsk tsk.. let me wipe my saliva and continue.\n\nIt’s been so many years, but I still wonder how my brother discovered that I was the one who took his pants away? Well, he still had to stay in the school bathhouse until midnight either way!\n\nThere is also Zhang’s little brother who took a nap. Who knew that when he was in a very deep sleep, his full face got painted yet he doesn’t even realise it! Good! She is very good!\n\nHowever, the current Yin Xiaomei isn’t the same as before. She is now out of style, has a bad taste, and is black bellied!\n\nIn short, she is not suitable to be a wife, so they should not threaten her to marry someone knowing what she has done.\n\n“Bad woman Yin Xiaomei, you think you can escape?!”\n\n“Eh? Brother, please don’t pull my hind legs.”\n\nYin Zhefei coldly said,  “Do you think you are a dog? You can divide your front legs and hind legs?!”>"
}