{
	"url": "https://www.novelupdates.com/series/banished-ranger/",
	"title": "Banished Ranger - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/02/Banished-Ranger.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Ecchi   Fantasy   Romance   Shounen   ",
	"tags": "Beautiful Female Lead   Dungeons   Male Protagonist   Weak Protagonist   ",
	"rating": "(3.6 / 5.0, 41 votes)",
	"author": "ANEKO Yusagi   ",
	"year": "\n2020",
	"ranking": "#2000   #2000   #6242   #7726   #6932   ",
	"reviewcount": "No Reviews",
	"description": "“Let me be clear here! We don't need a luggage carrier ranger who can't contribute to the fight at all… Leave contributing to the fight, you’re just luggage yourself so please leave, and of course, leave all your equipment and money behind!”\r\nRielle, a ranger and the founding member of the party was asked to leave by his friends with no prior notice of his removal.\r\n\r\nWhen he became an adventurer, Rielle’s first skill was the worst of even the shitty skills : Playing Dead.\r\n\r\nRielle himself was fully aware that he had been left behind by everyone’s strength, so he worked hard to make them proud and learned countless non-combat skills like lock picking, locating traps, studying about the monsters, and equipment repair and maintenance.\r\n\r\nIn spite of this, he was ruthlessly sentenced deep in the labyrinth, and if he was left behind out here only certain death remained for him.\r\n\r\nThe Hero was furious “You selfish bastards! Then I’ll go with Rielle! I’m leaving you guys here!”\r\n\r\n“Wha… What are you saying? What would this party be without you? We need people stronger and more capable than him. Okay! I’ll put Rielle’s banishment on hold!”\r\n\r\n“It’s too late now! I can’t be with you guys who can’t even take good care of your friends anymore!”\r\n\r\nRielle went out of the labyrinth with the Hero Lunas.\r\n\r\nRielle vowed to follow her for the rest of his life. At that moment the hero began to speak “I have a reason to not let you go” The reason why it has to be Rielle had been revealed, His secret and the true power of the the shitty skill “Playing Dead”.\r\n\r\nThe Hero Lunas told Rielle that if he's with her, they can go anywhere and so, Rielle turned over a new leaf and went to adventure.\r\n\r\nThis is the story of the most irreplaceable person who supported the hero to eventually bring peace to the world.>"
}