{
	"url": "https://www.novelupdates.com/series/pampered-darling-99-yuan-sweet-wife/",
	"title": "Pampered Darling: 99 Yuan Sweet Wife - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/09/Pampered-Darling-Yuan-Sweet-Wife_1664559689.jpg",
	"noveltype": "(CN)",
	"genre": "Drama   Romance   Slice of Life   ",
	"tags": "Arranged Marriage   Beautiful Female Lead   Black Belly   Broken Engagement   Business Management   Female Protagonist   Modern Day   Revenge   ",
	"rating": "(3.0 / 5.0, 4 votes)",
	"author": "云绯颜   ",
	"year": "\n2020",
	"ranking": "#2182   #1677   #13482   #9697   #13362   ",
	"reviewcount": "No Reviews",
	"description": "Su Qingqing was being watched by a pervert.\n\nYes, that man with a model figure and an immortal appearance that was all about women’s aesthetic points, however he was ruthless and refused to recognize her. He also successfully fooled her into a marriage with only ninety-nine yuan!\n\nIt should’ve been that each takes what they need, it’s mutual benefit. Typically, everything should revolve around interests.\n\nBut only watching her make a fool of herself,  secretly letting her go, mocking her for being ugly without make-up!\n\nEven worse, he squatted at her bedside one night.\n\nHis handsome face was full of indignation. \n\nWhat do you mean by warding off evil spirits? \n\nWhat contraception??\n\nThe man laughed wantonly, and there was no trace of cold air around him. \n\n“Darling, I missed you all night last night.”\n\n“Shut up! What are you trying to do?”\n\nThe man hooked his lips, trapping the person under his body with an overwhelming advantage. His posture was very provocative.\n\n“What do you want to do…”\n\nEh? Is it not enough to pay you back? Do I have to sleep with you??\n\nSu Qingqing’s heart trembled.\n\n“Go away, you pervert! Let go of me! If you have the ability, let go. Let…let’s fight!”\n\n“Fight? Then we can fight in bed.”\n\n“…”\n\n“Who shouts stop first is the loser, how about it?”\n\nHe didn’t even give Su Qingqing the chance to regret, as the man kept her lips shut.\n\nWuwu, this husband, she can’t stand it, can she give him away?>"
}