{
	"url": "https://www.novelupdates.com/series/i-came-back-but-the-world-is-still-a-fantasy/",
	"title": "I Came Back but the World is Still a Fantasy!? - Novel Updates",
	"image": "https://www.novelupdates.com/img/noimagefound.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Comedy   Fantasy   Harem   Romance   School Life   Sci-fi   Seinen   Tragedy   ",
	"tags": "Academy   Bullying   Clever Protagonist   Complex Family Relationships   Demons   Dense Protagonist   Elemental Magic   Emotionally Weak Protagonist   Evil Gods   Family   Family Conflict   Godly Powers   Hated Protagonist   Hiding True Abilities   Magic   Magic Beasts   Male Protagonist   Monsters   Multiple POV   Mysterious Past   Non-linear Storytelling   Onmyouji   Overpowered Protagonist   R-15   Returning from Another World   Ruthless Protagonist   Sealed Power   Secret Identity   Siblings   Terrorists   Time Skip   Underestimated Protagonist   World Travel   ",
	"rating": "(3.9 / 5.0, 335 votes)",
	"author": "Tsukimi Cocoa   月見ココア   ",
	"year": "\n2013\r\n",
	"ranking": "#670   #1236   #287   #606   #574   ",
	"reviewcount": "38 Reviews sorted by",
	"description": "When a boy coincidentally fell into a dimension hole, what awaited him was a world of sword and magic.\n\nTwo years of tragedies, wars, and schemes, passed until he was finally able to return to Earth.\n\nBut when he came back, the world was no longer the same.\n\nA new world with advanced technology, Garesto, was now trading with Earth, leading to a complete overhaul of Earth’s technology.\n\nIn the long years that have passed and the great changes that have occurred, his family was not left untouched.\n\nHis parents were now divorced. His siblings were now strangers. And all his friends were now gone.\n\nHe who possessed otherworldly power and knowledge hid himself for various reasons. But though he was able to somehow pull the wool over the world’s eyes, there were still those who noticed him.\n\nThis is a tale that came to be because of a boy who came back home.\n\n———————————————————\n\nFrequently Asked Questions\n\n1. In what order should I read this?\n\nRead it from the oldest release until the newest one. This story is NOT written in CHRONOLOGICAL ORDER, and is meant to be read according to the RELEASE ORDER.\n\n2. What do the numbers AA-BB mean in the titles?\n\nThey mean Time Axis-Act.\n\nE.g., 03-01 happens after all the 02-BB, but before 03-02.\n\n02-02 means that there’s a 02-01 chapter.\n\nThis also means that 05-00 happens in the far later.\n\nNOTE: The first six releases are PROLOGUES, main chapters start from the seventh release onwards.>"
}