{
	"url": "https://www.novelupdates.com/series/branches-on-both-hands/",
	"title": "Branches On Both Hands - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/07/branches-both-hands.jpg",
	"noveltype": "(KR)",
	"genre": "Adult   Drama   Fantasy   Harem   Josei   Romance   Slice of Life   Smut   ",
	"tags": "Abusive Characters   Aggressive Characters   Beautiful Female Lead   Caring Protagonist   Charismatic Protagonist   Charming Protagonist   C*nnilingus   Depictions of Cruelty   Doting Love Interests   Early Romance   Engagement   European Ambience   Family Conflict   Female Protagonist   First-time Interc**rse   F*llatio   Handsome Male Lead   H*ndjob   Jealousy   Maids   Marriage   Master-Servant Relationship   Nobles   Past Plays a Big Role   Past Trauma   Personality Changes   Popular Love Interests   Possession   Possessive Characters   R-18   Reverse Harem   Royalty   Sadistic Characters   S*xual Abuse   Sharp-tongued Characters   Tragic Past   Twisted Personality   Weak to Strong   Wealthy Characters   ",
	"rating": "(3.4 / 5.0, 36 votes)",
	"author": "Solttam   솔땀   ",
	"year": "\n2020",
	"ranking": "#2000   #2000   #9443   #9324   #5751   ",
	"reviewcount": "No Reviews",
	"description": "“Do you like me as I am? Beaten and bruised?”\n\n“You’re beautiful even when bruised. Call it a preference or a taste.”\n\nElysia was a lady of a noble family. Her future seemed bright, but when she married the handsome Dominic, her life turned upside down. Since then, she had lived a life of domestic abuse for the past eight years. And then she met Enoch. His way of speaking surprised her. Enoch grabbed her wrist before she could come to her senses. His low voice rang in her hears, her shoulders shrinking unconsciously, her breathing shaking and fuzzy.\n\n“I don’t know what I’d do if I end up embracing you. Will you allow me to seduce you? It would very much please me.”\n\n***\n\n“I’d like to make a deal.”\n\n“The trade is equivalent to an exchange.”\n\nKillian tilted his head to the side. Soon, he let out a soft chuckle and sat on the sofa, saying softly, “Then take out what you have. I don’t know what it is, but is should be attractive enough. I don’t like cheap deals.”\n\nElysia raised her body, ignoring the pain. She took off her clothes that smelt like medicine. Standing before him with a limp, Killian raised his dark eyebrows. Muttering softly, she said, “I know I look like this now, but if you wait a little longer…”\n\n“Do I look that frightening to you that I would not hold a battered woman? You're beautiful, you know. Cherish yourself more. It is what you deserve. It is what you are owed.'>"
}