{
	"url": "https://www.novelupdates.com/series/monster-inn-rectification-report/",
	"title": "Monster Inn Rectification Report - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/08/monster-inn-photo.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Supernatural   Yaoi   ",
	"tags": "Absent Parents   Celebrities   Demons   Handsome Male Lead   Human-Nonhuman Relationship   Management   Mob Protagonist   Modern Day   Transmigration   Tsundere   ",
	"rating": "(4.4 / 5.0, 49 votes)",
	"author": "Li Siwei   李思危   ",
	"year": "\n2019",
	"ranking": "#2384   #2184   #4989   #6963   #4024   ",
	"reviewcount": "12 Reviews sorted by",
	"description": "Before going to bed, Xie Fei read a rich novel. In the novel, the family took home a son and made a living. The parents were so crazy about the adopted son who had the blood of a koi, they ended up looking at their own son with disgust and disdain. In the end, the real son was smashed into a vegetative state by a falling object. \n\nWhen Xie Fei woke up, he found himself lying on a hospital bed as that cannon fodder son. He thought that he wouldn’t survive past three chapters but he ended up accidentally inheriting an unconventional inn for monsters–\n\nSeahorse Tyrant: I heard that I’m pregnant with 1,800 cubs?\n\nJellyfish Gambler: After getting old, I’m no longer afraid of getting my hands chopped!\n\nGroundhog Singer: Ah! I can’t help but scream!\n\nSince then, Xie Fei was forced to devote himself in restructuring, rectifying,  and managing the inn. Additionally, he became involved in emotional counseling and resolving disputes. \n\nLater on, the inn made the headlines! One room was occupied by a gold medal producer. Another room was occupied by the city’s richest man. The big sister of society also lived in one of the inn’s rooms. In Room 004, a popular idol has boss Xie trapped on the sofa and boldly said, “Kiss me again if you dare!”\n\nXie Fei: *kisses again*\n\nPopular Idol: “….kisses, kiss me ten more times!”\n\nThis is the story of a cannon fodder-now-protagonist facing Buddha. It’s also a fantasy story filled with monsters and sweet sugar!>"
}