{
	"url": "https://www.novelupdates.com/series/second-marriage-with-the-alliance-marshal/",
	"title": "Second Marriage with the Alliance Marshal - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/04/Second-Marriage-with-the-Alliance-Marshal.jpg",
	"noveltype": "(CN)",
	"genre": "Romance   Sci-fi   Shounen Ai   Yaoi   ",
	"tags": "Arranged Marriage   Dense Protagonist   Doting Love Interests   Forced Living Arrangements   Futuristic Setting   Genius Protagonist   Kidnappings   Love Interest Falls in Love First   Military   Older Love Interests   Omegaverse   Pets   ",
	"rating": "(3.7 / 5.0, 55 votes)",
	"author": "弥语   ",
	"year": "\n2021",
	"ranking": "#432   #388   #4007   #671   #3943   ",
	"reviewcount": "5 Reviews sorted by",
	"description": "Xu Xinghe, a genius omega from the Department of Computer Science at Capital University, was matched by the AI mastermind to Mu Qingyun, a major general of the Alliance, the year after his graduation.\n\nA year later, just after the marriage protection period, Major General Mu unilaterally announced their divorce.\n\nXu Xinghe learned the news of his divorce from a colleague. He hung up the phone call from Mu Qingyun during work hours with a cold look, and after work was completed, he sent a text message to his ex-husband: “Send the divorce agreement and I will sign it.”\n\nOvernight, media coverage of his divorce was overwhelming. But no one thought that only a few days later, Xu Xinghe’s name would be on the list of mastermind matched marriages again—\n\nThis time, he was matched to the Alliance Marshal, Ling Changfeng, known as the “Black God of War”.\n\nThis time Xu Xinghe prepared a divorce agreement in advance.\n\nOn the first night of marrying into the Marshal’s Mansion, he put the divorce agreement with his signature in front of Marshal Ling. “When you want to divorce, just sign it.”\n\nThe divorce agreement was burned by Marshal Ling in less than three months.\n\nAnd those who were waiting to see Xu Xinghe being divorced for the second time, waited and waited, only to hear news of the marshal spoiling his little spouse.\n\n———-\n\nLing Changfeng never received a marriage notice from the AI mastermind for decades, and thought that he would never get married in his life.\n\n“What’s so good about getting married? A waste of time,” said the marshal.\n\nLater, he met an omega who was many years younger than him and resembled a little hedgehog. Beneath the other party’s cold appearance, he discovered the messily sweet pheromones.\n\n“It’s nice to get married.” The marshal thought to himself.>"
}