{
	"url": "https://www.novelupdates.com/series/miracle-pill-maker-bullies-the-boss/",
	"title": "Miracle Pill Maker Bullies the Boss - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/11/当满级大佬翻车以后.jpeg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Comedy   Drama   Fantasy   Romance   School Life   Shoujo   ",
	"tags": "Beautiful Female Lead   Business Management   Calm Protagonist   College/University   Complex Family Relationships   Doctors   Doting Love Interests   Doting Older Siblings   Doting Parents   Family Conflict   Fast Learner   Female Protagonist   Genius Protagonist   Hackers   Handsome Male Lead   Hard-Working Protagonist   Hidden Abilities   Hiding True Abilities   Hiding True Identity   Love Interest Falls in Love First   Low-key Protagonist   Medical Knowledge   Misunderstandings   Modern Day   Money Grubber   Pharmacist   Pill Concocting   Poor to Rich   Protagonist Strong from the Start   Shameless Protagonist   Slow Romance   Transmigration   ",
	"rating": "(3.6 / 5.0, 36 votes)",
	"author": "Nalanxian   纳兰闲   ",
	"year": "\n2020",
	"ranking": "#5262   #4834   #5927   #7990   #6592   ",
	"reviewcount": "16 Reviews sorted by",
	"description": "The aristocratic Lu family has produced a joke, a beautiful one, but a joke nonetheless. The daughter they have been rearing all this while turns out to be an imposter! With the real heiress returning to take her rightful place, everyone is eager to know the outcome of the imposter...\r\n\r\nWill she be able to survive in poverty after living a life of riches?\r\n\r\nHaving just transmigrated, Huo Yao imagines that this experience will be pretty interesting. However, imagination and reality are always so different!\r\n\r\nDad: 'Daughter! Take this black card. It has no limit! Use it freely.'\r\n\r\nMom: 'My dear Yao Yao! If you don't like this jewelry, I'll get them to change it immediately.'\r\n\r\nHuo Yao: '…'\r\n\r\nWeren't they supposed to be poor and ordinary? What is with this hidden lavish behavior?\r\n\r\nHer eldest brother, an investment company's CEO: 'Sis, inherit my company!'\r\n\r\nHer second brother, a top lawyer: 'Whoever dares slander my sis will face the full brunt of the law!'\r\n\r\nThe third brother, an international genius doctor: 'Bullying my sister? Should I display the prowess of my scalpel?'\r\n\r\nMysterious fourth brother: 'My sis is the cutest!'\r\n\r\nHuo Yao: '…'\r\n\r\nWhat happened to being a good-for-nothing person who lives off her parents?\r\n\r\nA top aristocrat secretly changes into his cheap clothes and drives his crappy old car to her. 'Baby, my heart is yours. Why don't we get married to test if I'm telling the truth or not?'\r\n\r\nEveryone who knows about it, doesn't dare say it out loud.\r\n\r\nAll they can do is curse inwardly: 'Bah! Keep acting! No one believes it!'>"
}