{
	"url": "https://www.novelupdates.com/series/im-pregnant-with-the-child-of-the-traitor-general-in-my-past-life/",
	"title": "I’m Pregnant With The Child Of The Traitor General In My Past Life - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/09/Im-Pregnant-With-The-Child-Of-The-Traitor-General-In-My-Past-Life.jpeg",
	"noveltype": "(CN)",
	"genre": "Drama   Fantasy   Historical   Romance   Yaoi   ",
	"tags": "Ancient China   Confinement   Couple Growth   Enemies Become Lovers   Futanari   Generals   Hated Protagonist   Inferiority Complex   Kingdoms   Love Interest Falls in Love First   Male Yandere   Military   Misunderstandings   Mpreg   Multiple Reincarnated Individuals   Possessive Characters   Reincarnation   Royalty   R*pe   Second Chance   Strong Love Interests   Suicides   Time Skip   Tragic Past   Underestimated Protagonist   Weak Protagonist   Yandere   Younger Love Interests   ",
	"rating": "(4.0 / 5.0, 80 votes)",
	"author": "止宁   ",
	"year": "\n2020",
	"ranking": "#1678   #1325   #3879   #1979   #2848   ",
	"reviewcount": "15 Reviews sorted by",
	"description": "The prince raised in the Cold Palace was once pushed to the supreme position by his beloved and became a puppet emperor. Only before his death did he realize that in his short life he was just a pawn for other’s power and desires. When the city was about to fall, he who was imprisoned for many years cut his beautiful face that had been his curse for half of his life and ended his tragic life with white silk.\n\nOnce he returned to his youth, he looked at the orphan traitorous general who was trampled and humiliated by the spoilt royal children in the secluded courtyard. He remembered the murderous hero who broke through the city gate in blood and gore in his previous life.\n\nLi Yuanmin sighed and quietly took the bruised child back to the palace to take care of him, hoping to eliminate some hostility from him and minimize the people suffering.\n\n***\n\nYears later, the great general who calmed down the frontier, returned to the court. The first thing he did was not to return to his residence, but to go straight to the inner palace. He personally helped His Majesty take off his shoes and socks and helped clean his feet.\n\n“This minister has worked hard for His Majesty’s country and missed out on one’s lifelong happiness,” the tall and mighty general’s eyes were hot, “So now Your Majesty should bestow his subject a marriage with His Majesty.”>"
}