{
	"url": "https://www.novelupdates.com/series/scattered-immortal/",
	"title": "Scattered Immortal - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2017/12/Scattering-Immortal.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Fantasy   Harem   Martial Arts   Xianxia   ",
	"tags": "Arrogant Characters   Artifacts   Beast Companions   Beautiful Female Lead   Body Tempering   Calm Protagonist   Carefree Protagonist   Clever Protagonist   Confident Protagonist   Cultivation   Dao Companion   Dao Comprehension   Early Romance   Famous Protagonist   Fast Cultivation   Handsome Male Lead   Heavenly Tribulation   Hiding True Abilities   Hiding True Identity   Immortals   Kuudere   Lazy Protagonist   Magic Formations   Male Protagonist   Marriage   Mature Protagonist   Misunderstandings   Monsters   Multiple Realms   Overpowered Protagonist   Past Plays a Big Role   Personality Changes   Polygamy   Protagonist Strong from the Start   R*pe Victim Becomes Lover   Reverse R*pe   Romantic Subplot   R*pe   Ruthless Protagonist   Shameless Protagonist   Sharp-tongued Characters   Strength-based Social Hierarchy   Strong Love Interests   Tsundere   Underestimated Protagonist   Unique Cultivation Technique   ",
	"rating": "(4.0 / 5.0, 69 votes)",
	"author": "Nine Snort   九哼   ",
	"year": "\n2015",
	"ranking": "#2000   #2000   #5623   #8803   #6351   ",
	"reviewcount": "4 Reviews sorted by",
	"description": "As a Rogue Immortal, Tang Qing felt that the pressure on him was very big because you will never know when the next Heavenly Tribulation will descend upon you. \n\nAlso, you will never know just how many Heavenly Tribulations you would have to overcome to finally come to the end of the Heavenly Tribulation. \n\nJust right after overcoming the Ninth Layer Heavenly Tribulation, Tang Qing’s body got extremely damaged by the perverted Heavenly Tribulation. \n\nAfter climbing out of the ruins and being met with an unfathomable encounter, he became the dao companion of a bunch of heavenly women……>"
}