{
	"url": "https://www.novelupdates.com/series/my-abducted-tsundere-husband/",
	"title": "My Abducted Tsundere Husband - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/02/tsunderehusabnd1a.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Romance   Shoujo   ",
	"tags": "Ancient Times   Bodyguards   Brotherhood   Clever Protagonist   Cold Love Interests   Cross-dressing   Female Protagonist   Loyal Subordinates   Male Yandere   Misunderstandings   Smart Couple   Tsundere   ",
	"rating": "(3.8 / 5.0, 12 votes)",
	"author": "Shi Er Yue   十二玥   ",
	"year": "\n2017",
	"ranking": "#2000   #2000   #10193   #12558   #10350   ",
	"reviewcount": "4 Reviews sorted by",
	"description": "She was the leader of a gang of bandits, and legend had it that she was bloodthirsty, vicious and unscrupulous. \n\nHe was the richest of Daliang and the most handsome man in the country. He loved money and beauties and was a charming dandy who had many concubines. \n\nThey were never supposed to cross paths but in a twist of fate, a robbery brought the two together in marriage. Would love bloom between them? Well, before their love got the chance to bud, his aunts, stepmothers, cousins, distant cousins, and his concubines who were doted on or not all wanted to step on her, the lawfully wedded wife! What they didn’t know was that under her weak cat-like facade, hid a ferocious tiger. She could kill without batting an eyelid, and ruthlessness was in her blood. However, the tigers and cats shared one nature. After catching their food, they would toy with the preys before devouring them. When they finally had enough fun, they would strike with their claws and end the game!\n\nIn their first encounter, she hid in the crowds to peep at her future husband. The man donned a snow white fur cloak. His inky hair long and silky. He stepped down slowly from the carriage, and his gorgeousness outshined the sun and the moon. All the ladies began to scream in excitement. \n\nIn their second encounter, she was drinking with her gang. With one foot on the table, she grabbed her subordinate by the collar, hollering fiercely. “Drink up, if not I’ll kill you!”. He stood at the door and froze, thinking that he had entered the wrong place.\n\nThe third time, it was their wedding night. She was in red, beautiful and enchanting. He too was in red, handsome and bewitching. “My lady, it’s getting late. Let us go to bed!”\n\nOutside the window, her subordinates were discussing intensely.\n“Let Chief bed him, it will be easier for us to strike in the future!”\n“No, she can’t! If she beds him and our plans don;t work out, her efforts would be in vain!”\n“Let Chief do it, if not it will arouse suspicion!”\n“No, it can’t happen! What if they have a child? How is Chief going to run away then?”\n\nWhile the heated dispute continued, and suddenly something landed among the red-faced debaters. The man donned in red stood in the center of them, his shoulders half exposed. His skin was fair as snow and his face alluring as the moonlight. Her subordinates gulped and suggested.\n'How about, let me bed him?'>"
}