{
	"url": "https://www.novelupdates.com/series/please-continue-protecting-me/",
	"title": "Please Continue Protecting Me - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/11/338275s.jpg",
	"noveltype": "(CN)",
	"genre": "Josei   Romance   Slice of Life   Tragedy   ",
	"tags": "Beautiful Female Lead   Bodyguards   Clingy Lover   Death of Loved Ones   Disabilities   Doting Love Interests   Doting Parents   Female Protagonist   First Love   Handsome Male Lead   Kidnappings   Love at First Sight   Love Interest Falls in Love First   Modern Day   Tragic Past   ",
	"rating": "(3.6 / 5.0, 74 votes)",
	"author": "An Zhi Ruo Mian   As Peaceful As Slumber   安之若眠   ",
	"year": "\n2019",
	"ranking": "#2000   #3244   #4466   #5506   #4110   ",
	"reviewcount": "16 Reviews sorted by",
	"description": "A few years ago, the rumored delicate and fragile wheelchair bound beauty of the Rong Family was kidnapped by someone.\r\n\r\nWhile everyone panicked and burned their heads looking for her, only one man was able to find her.\r\n\r\nRong Mo carefully asked the tall and gloomy man before her. “Will…..you continue to protect me?”\r\n\r\nThe man took one glance at her immobile legs and pale tender face and answered. ”No”\r\n\r\n“Then why did you rescue me?”\r\n\r\nShe waited for a long time before she heard him say lightly. “It was along the way.”\r\n\r\nA few years ago, Rong Mo thought this man’s blood must be cold. It was only many years later that he really did become the true sense of the word ‘bodyguard’, and she finally ‘‘experienced’ the warmth and hot blood that his body always had.\r\n\r\nAfterwards, Rong Mo sat on her wheelchair in the school garden and looked at the man pretending to be a school worker at a far distance. She reached her hand out to him and said. “Hey. Come over here and lift me up. I need to get to class.”\r\n\r\nNie Feizhan: “....”\r\n\r\n“Aren’t you my bodyguard?”\r\n\r\n‘I’m only a school worker.” Nie Feizhan reminded her. ”I’m just here to do menial labor.”\r\n\r\n“Then menial labor school worker, come here and carry me.”\r\n\r\nAfterwards-\r\n\r\n“Hey, the bodyguard over there, come here and carry me. I want to go to sleep.”\r\n\r\nNie Feizhan took big steps over. “Are you sure you want me to carry you into the bedroom?”\r\n\r\nRong Mo retreated slightly. “Didn’t you dislike carrying me?”\r\n\r\nNie Feizhan paused and bent down to sweep her off her chair. He said through almost gnashed teeth. “I can’t bear to pick you up everyday and put you in my pocket and you still think that’s not enough like?”\r\n\r\nThe previous Nie Feizhan: I don’t want to tease her.\r\n\r\nI don’t have any interest in cute girls.\r\n\r\nI don’t want to protect her, not one bit.\r\n\r\nI also won’t fall madly in love with her in the future.\r\n\r\nThe future Nie Feizhan: Only I can carry her from her chair. \r\n\r\nWhomever dares to touch her will be gambling his life away with me.\r\n\r\nThis is the story of a weak and frail gorgeous heiress vs her manly and protective bodyguard. \r\n>"
}