{
	"url": "https://www.novelupdates.com/series/jun-ye-cant-help-but-tease-his-wife/",
	"title": "Jun Ye Can’t Help But Tease His Wife - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2018/07/military-master.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Drama   Fantasy   Gender Bender   Josei   Mature   Romance   Sci-fi   Supernatural   ",
	"tags": "Beautiful Female Lead   Complex Family Relationships   Cross-dressing   Doting Love Interests   Doting Older Siblings   Family Conflict   Female Protagonist   Generals   Handsome Male Lead   Hard-Working Protagonist   Marriage   Military   Modern Day   Sickly Characters   Strong Love Interests   Weak to Strong   ",
	"rating": "(3.9 / 5.0, 77 votes)",
	"author": "Āotú mán   凹凸蛮   ",
	"year": "\n2017",
	"ranking": "#6970   #6236   #2957   #3978   #3080   ",
	"reviewcount": "11 Reviews sorted by",
	"description": "Rumor has it that the empire’s first general, Shen Chengfeng, has a quirk that does not allow anyone to touch his body!\n\nBut on a certain day, not only did he touch people, but also slept with a certain person!\n\n…\n\nFor countless generations, it is rumored that the empire’s well-known Xiao family only had sons who became generals. But the fact is, they actually have a daughter named Xiao Jing!\n\nHowever, she must dress as a man to become a young soldier.\n\n…\n\nAnybody who will have a contact with Shen Chengfeng’s skin will die. This is the secret of the Shen family that cannot be disclosed.\n\nXiao Jing, however, was careless and touched the general’s body everywhere!\n\n…\n\nThe Shen family is well aware of the fact that Shen Chengfeng’s both hands are like strong sulfuric acid. Once touched, even the bones will not be saved.\n\nXiao Jing, however, was not paying attention and touched him all over!\n\n…\n\nThe Shen family understood that the body of the imperial general is special and cannot have a wife and children in this life.\n\nHowever, one day, the general suddenly announced that he is going to marry a certain soldier!\n\nIn other words…\n\nXiao Jing didn’t have a choice but to disguise herself as a man to become a soldier. Unexpected events led her to have physical encounters with the empire’s most distinguished general, Shen Chengfeng. However, unknown to the public, this military master has a mysterious secret – anything that he touches would all turn to ash! Surprisingly, Xiao Jing was an exception!\n\nHow will our hardworking Xiao Jing keep her little secret hidden when Shen Chengfeng is constantly keeping an eye on her? And how will our formidable general react when a certain soldier is not affected by his supernatural ability?>"
}