{
	"url": "https://www.novelupdates.com/series/top-notch-masquerading-as-cannon-fodder-female-companion/",
	"title": "Top-notch Masquerading as Cannon Fodder Female Companion - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/06/Topnotch-Masquerading-as-Cannon-Fodder-Female-Companion.jpg",
	"noveltype": "(CN)",
	"genre": "Fantasy   Josei   Romance   ",
	"tags": "Academy   Age Progression   Beautiful Female Lead   Business Management   Calm Protagonist   Child Protagonist   Childhood Friends   Comedic Undertone   Cunning Protagonist   Doting Love Interests   Doting Older Siblings   Doting Parents   Handsome Male Lead   Reincarnation   Slow Romance   Wealthy Characters   ",
	"rating": "(3.3 / 5.0, 15 votes)",
	"author": "Dawnesque   恍若晨曦   ",
	"year": "\n2020",
	"ranking": "#2000   #2000   #8805   #11314   #10067   ",
	"reviewcount": "6 Reviews sorted by",
	"description": "The little snow fairy Tan Mo was about to complete her transformation into a human when she was picked away and reincarnated as the Tan family’s beloved daughter. Only then did she realize that she had become the tragic cannon fodder who died a miserable death after serving as her green tea cousin’s stepping stone for marrying We Keli, and whose life she had once seen before in her master’s mortal world mirror. \n\nHer parents seemingly aged overnight, and her three older brothers all suffered ignominy after their attempts to seek revenge for her. Yet with her here in this life, nobody should even think about harming her family! Tan Mo: Wanna play green tea with me? I’ll give you a taste of master level green tea art today!\n\nReporter: Young Master Wei, what do you admire the most about your wife? \n\nWei Zhiqian: She’s kind, cute, pure-hearted, and unpretentious. \n\nReporter: Director Tan, your new work has been praised as a masterpiece. How did you create such an amazing script? \n\nOlder brother Tan: There’s nothing of the sort. Truthfully, I didn’t write the script. It’s just that the true author is too low key to reveal her true identity. \n\nReporter: Lord Tan, your new song has come out and immediately became the number one hit single on the charts. The lyrics are ingenious. \n\nSecond brother Tan: You flatter me. The person who came up with the lyrics is someone very important to me. Without her, the song wouldn’t have been successful. Yet she’s too low key to reveal her identity. \n\nReporter: Artist Tan, your painting was sold at a ten-figure price as soon as it hit the market. Where did the inspiration come from? \n\nThird brother Tan: It’s all thanks to her. \n\nReporter: ...... \n\nOldest brother Tan, second brother Tan, third brother Tan: Our younger sister had always helped us without asking for anything in return. \n\nWei Zhiqian: Without my protection, she would be ruthlessly bullied by those pretentious and innocent-looking Machiavellians.\n\nEveryone: Pfft! Who is the one bullying who!>"
}