{
	"url": "https://www.novelupdates.com/series/the-first-class-medical-princess/",
	"title": "The First-Class Medical Princess - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/07/n2.jpg",
	"noveltype": "(CN)",
	"genre": "Drama   Fantasy   Historical   Josei   Romance   ",
	"tags": "Ancient China   Beautiful Female Lead   Calm Protagonist   Clever Protagonist   Complex Family Relationships   Devoted Love Interests   Familial Love   Female Protagonist   Handsome Male Lead   Military   Power Couple   Royalty   Schemes And Conspiracies   Transmigration   ",
	"rating": "(4.0 / 5.0, 16 votes)",
	"author": "西青先生   ",
	"year": "\n2016",
	"ranking": "#2000   #2000   #10598   #10478   #10334   ",
	"reviewcount": "No Reviews",
	"description": "This is the ongoing history of a generation of military doctors, and the birth of a generation of military masters.\n\nThis is the history of a princess’s glory and the history of the growth of a female middle child.\n\nThere were rumors that His Highness King Jing, the great War God, commanded the military with extraordinary skill, but His Highness King Jing’s royal consort was a divine warrior.\n\nThere were also rumors that the new generation’s Great War God was wrapped around her finger, when the Princess says west, he does not dare go east, and when she says east, he does not dare go west. Even if the Princess says that the sun is square, earth is heaven and heaven is earth, His Highness King Jing will cut out the four corners of the sun and convert heaven and earth. It was really a disgrace to men.\n\nBut His Highness Jing said, “A bunch of nonsense, this is the King respecting the Princess!”\n\nSo the world was aghast, and even enemy soldiers knew that King Jing could be messed with, but Princess Jing could not!\n\nSu Yun Chu was born again, and only wanted to have a quiet and unrestrained life in Jiang Nan, but she didn’t want to return to the capital for no reason…\n\nUnprovoked persecution in the inner courtyard, treacherous schemes at every turn in the imperial palace, resolving the internal and external problems of the country, happiness of a lifetime frequently wished to be destroyed by others…\n\nAnd so….\n\nA senior military doctor is reborn into the first daughter of a marquis, a special elite soul colliding into a brilliant princess.>"
}