{
	"url": "https://www.novelupdates.com/series/the-lord-is-addicted-in-infrastructure/",
	"title": "The Lord is Addicted in Infrastructure - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/02/The-Lord-is-Addicted-in-Infrastructure.jpg",
	"noveltype": "(CN)",
	"genre": "Adventure   Fantasy   Romance   Shounen Ai   Slice of Life   ",
	"tags": "Age Regression   Army   Beasts   Business Management   Calm Protagonist   Charismatic Protagonist   Charming Protagonist   Child Protagonist   Clever Protagonist   Cunning Protagonist   Cute Protagonist   Doting Love Interests   Empires   European Ambience   Famous Protagonist   Fantasy World   Handsome Male Lead   Hard-Working Protagonist   Industrialization   Kingdom Building   Kingdoms   Love Interest Falls in Love First   Loyal Subordinates   Management   Medieval   Modern Knowledge   Nobles   Older Love Interests   Pets   Poor to Rich   Royalty   Schemes And Conspiracies   Shy Characters   Slow Romance   System Administrator   Time Skip   Transmigration   Wealthy Characters   ",
	"rating": "(4.4 / 5.0, 128 votes)",
	"author": "弓青瀚   ",
	"year": "\n2020",
	"ranking": "#553   #3238   #1841   #4214   #2390   ",
	"reviewcount": "35 Reviews sorted by",
	"description": "Xia Zuoyi transmigrated and became a beautiful and delicate little lord in an unrealistic western fantasy medieval novel. Gender is male, loves male, and the role is a cannon fodder. Under the shining halo of the Mary Sue heroine, in order to promote the development of the plot, he’s constantly mentally disabled, and was eventually convicted and hanged to death. \n\nAfter passing through, Xia Zuoyi touched the white and tender neck and thought, ‘I don’t want to be gay, I’m going to do infrastructure. It is better to do infrastructure than to fall in love! Please let me be beautiful alone! Thank you! \n\nPope/Duke/Leader: Did we agree? \n\nHere, the upper class is distinct from the lower class, and the hierarchy is strict. Here, food is in short supply, medicine is backward, and city-state disputes continue. The prosperity of the nobility and the depression of the common people flourish together. Here is the romantic capital, but also the wild world. \n\nThere are rumors in the Western Continent that the Pope has the favor of God, the Duke has more power than the king, and the leader of the chamber of commerce takes over the wealth of the empire. However, Xia Zuoyi, in the name of Lord Rose, promoted the civilization and economic development of the whole western continent, unified city-states, and created a powerful industrial empire. He is the glory and the most vivid rose of the empire. Rumor has it that the Pope, the Duke, and the leader all bowed under his pants, but Lord Rose is dismissive. \n\nXia Zuoyi: The rumors misunderstood me. Q_Q>"
}