{
	"url": "https://www.novelupdates.com/series/overgeared/",
	"title": "Overgeared - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2017/10/og.jpg",
	"noveltype": "(KR)",
	"genre": "Action   Adventure   Comedy   Fantasy   Harem   ",
	"tags": "Adapted to Manhwa   Appearance Changes   Army   Artifact Crafting   Artificial Intelligence   Assassins   Average-looking Protagonist   Beautiful Female Lead   Blacksmith   Character Growth   Crafting   Demons   Dense Protagonist   Discrimination   Dragons   Dungeons   Dwarfs   Elemental Magic   Elves   Empires   Evil Gods   Famous Protagonist   Farming   First-time Interc**rse   Futuristic Setting   Game Ranking System   God Protagonist   Goddesses   Godly Powers   Gods   Grinding   Guilds   Hard-Working Protagonist   Immortals   Inheritance   Kingdom Building   Kingdoms   Knights   Lack of Common Sense   Legends   Level System   Loyal Subordinates   Lucky Protagonist   Magic   Male Protagonist   Marriage   Master-Disciple Relationship   Master-Servant Relationship   Misunderstandings   MMORPG   Modern Day   Money Grubber   Multiple POV   Mythical Beasts   Nationalism   Nobles   Orcs   Overpowered Protagonist   Pets   Polygamy   Poor Protagonist   Poor to Rich   Pregnancy   Racism   Romantic Subplot   Schemes And Conspiracies   Seven Deadly Sins   Shameless Protagonist   Shapeshifters   Skill Assimilation   Skill Books   Skill Creation   Souls   Sword And Magic   Sword Wielder   Time Skip   Underestimated Protagonist   Unlucky Protagonist   Virtual Reality   Weak to Strong   Younger Sisters   ",
	"rating": "(3.8 / 5.0, 1643 votes)",
	"author": "Park Saenal   ",
	"year": "\n2014",
	"ranking": "#13   #16   #8   #15   #25   ",
	"reviewcount": "370 Reviews sorted by",
	"description": "As Shin Youngwoo had an unfortunate life and is now stuck carrying bricks on construction sites. He even had to do labor in the most popular VR game, Satisfy!\n\nHowever, luck would soon enter his hopeless life. His character, ‘Grid’, would discover the Northern End Cave for a quest, and in that place, he would find ‘Pagma’s Rare Book’ and will become a legend…>"
}