{
	"url": "https://www.novelupdates.com/series/perfect-virtuous-girlfriends-ntr-production/",
	"title": "Perfect & Virtuous Girlfriend’s NTR Production - Novel Updates",
	"image": "https://www.novelupdates.com/img/noimagefound.jpg",
	"noveltype": "(JP)",
	"genre": "Adult   Ecchi   Mature   ",
	"tags": "Depictions of Cruelty   Male Protagonist   Modern Day   Netorare   Netorase   ",
	"rating": "(2.2 / 5.0, 51 votes)",
	"author": "Tofu Field X   Tōfu Hata X   豆腐畑X   ",
	"year": "\n2018",
	"ranking": "#2000   #2000   #7923   #11073   #9346   ",
	"reviewcount": "1 Review sorted by",
	"description": "My name is Minamori Shunta.\n\nMy body was small, I was not good at exercising, all I could do was study and she was still better than me at that.\n\nThe other party is Akane Toe.\n\nBlack hair like long silk thread, dignified looks like dolls.\n\nFully slender high stature, plump fruit full of fruit that can be seen even on uniform uniform of fabric.\n\nWaist narrowed in upper body tightened, thigh with clench, supple and long legs.\n\nApproximately perfect proportions, appearance is meant to refer to her.\n\nIt is not only appearance that such Akane is perfect.\n\nIn the mock exam, the first place in the country is commonplace, in the land section the national tournament first place.\n\nParents are one of Japan’s leading businessmen, local educators with schools, a millionaire with many real estate.\n\nPersonality is not separated from anyone, it is a good interview.\n\nCompleteness means exactly that of her.\n\nSomehow, I confessed to her that she fell in love at first sight, I decided to start dating with her.\n\nNow living together with her parents in the property of her parents,\n\nI am studying from domestic affairs, even my sexual life.\n\nBut I had sexual preferences that I could not tell her.\n\nNTR likes taste.\n\n“I will satisfy the shunta’s being snatched”\n\nThe day she liked NTR like me like that to Akane, she told me so.\n\nSeven days after that, I got her a piece of video data.\n\n※ There is only an er**ic scene, it will be a work like a scene collection rather than a novel.>"
}