{
	"url": "https://www.novelupdates.com/series/criminal-investigation-files/",
	"title": "Criminal Investigation Files - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/08/20200418121854.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adult   Comedy   Drama   Mystery   Psychological   Romance   Yaoi   ",
	"tags": "Crime   Criminals   Cruel Characters   Doting Love Interests   Handsome Male Lead   Love Interest Falls in Love First   Modern Day   Murders   Pets   Power Couple   Slow Romance   Smart Couple   Strong Love Interests   Thriller   Wealthy Characters   ",
	"rating": "(4.5 / 5.0, 31 votes)",
	"author": "清韵小尸   ",
	"year": "\n2019",
	"ranking": "#4617   #2000   #8057   #8531   #5412   ",
	"reviewcount": "3 Reviews sorted by",
	"description": "Every murder has its own reasons behind it.\r\n\r\nWith the help of criminal investigation, we can restore the killer’s appearance, predict their psychology and unravel the truth.\r\n\r\nCaptain Song Wen of the Criminal Investigation Department has repeatedly solved strange cases using his masterful ability to simulate criminal portraits down to the last detail. With the arrival of the blooming season, the South City Bureau welcomed a new trainee police officer, Lu Siyu, a taciturn officer who is always able to uncover the truth. And behind him there are also hidden secrets….\r\n\r\nSong Wen: Where did this rich second-generation newcomer come from?? No, no need! It hasn’t been seven days. I want to return the goods. There’s no reason.*\r\n\r\nA week later — The report written by Lu Siyu is good. The food cooked by Lu Siyu is also good. Ah Lu Siyu, you can also solve the cases so quickly (^o^)\r\n\r\nSix months later — Wife, whatever you say is right ヽ(^o^)丿\r\n\r\nEven Song Wen couldn’t escape the law of true fragrance*.\r\n\r\nPowerful Wolf Dog Chief Gong × Beautiful Yet Cruel, Cold-blooded Pervert\r\n\r\nThe new book “Criminal Investigation Notes” is here for collection.\r\n\r\nThe process of solving cases becomes refreshing and sweet when emotions come into the picture\r\n\r\n*Taobao, which allows customers to return any product within 7 days. No reasons asked! (七天无理由退换)\r\n\r\n*The popular Internet term zhēn xiāng or “true fragrance” is mainly used to ridicule the contradictory behavior of a person who is dead against doing something, but later on falls in love with the same thing and turns back to slap their own face.>"
}