{
	"url": "https://www.novelupdates.com/series/after-running-away-with-a-cub-i-became-everyones-favourite/",
	"title": "After Running Away With a Cub, I Became Everyone’s Favourite - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/01/After-running-away-with-a-cub-I-became-everyones-favourite.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Romance   Shounen Ai   Slice of Life   ",
	"tags": "Acting   Black Belly   Calm Protagonist   Character Growth   Dense Protagonist   Handsome Male Lead   Love Interest Falls in Love First   Misunderstandings   Mob Protagonist   Modern Day   Mpreg   Shameless Protagonist   Slow Romance   Transmigration   Wealthy Characters   ",
	"rating": "(2.9 / 5.0, 157 votes)",
	"author": "招财的猞猁   ",
	"year": "\n2021",
	"ranking": "#1183   #3115   #2754   #316   #3404   ",
	"reviewcount": "38 Reviews sorted by",
	"description": "Xia Qingshu transmigrated into a book. He was now the beautiful, arrogant, but slow-witted cannon fodder that always antagonised the protagonist shou. Finally, after a retaliation, he met a very miserable ending.\n\nXia Qingshu, who found himself already in the villain's luxury suite: 'Wuu, how can I be so miserable?'\n\nSo, he decided to run away.\n\n～\n\nChen Zhiyu is a wealthy boss, the richest man in the world.\n\nHe was abstinent and conservative. Handsome in appearance, clean, and always at the top of the cantaloupe rich list.\n\nBecause the family business has always been handed down to a single heir for the past nine generations, Chen’s parents are always pushing for marriage and birth.\n\nChen Zhiyu: No marriage. After death, all the inheritance will be donated to the country!\n\nThe distant relatives looked forward to the extinction of the Chen family like vultures. They are waiting for the opportunity to adopt their grandsons into the Chen family to inherit hundreds of billions of yuan in inheritance.\n\nOne day, Mother Chen found Xia Qingshu, who was close to Chen Zhiyu, by the maternity unit leaning against the wall with morning sickness.\n\nThe Chen family boiled over. Mother Chen rushed to Xia Qingshu: 'I'll give you 100 million...'\n\nXia Qingshu quickly opened the payment code: 'Auntie, I'll buy a plane ticket right away, and make sure to stay away from your son.'\n\nMother Chen: 'Marry my son, I'll give you five billion, and also let the child be born!'\n\nMother Chen went wild, and gifts piled up on a mountain to welcome the new life.\n\nXia Qingshu: ? !\n\nXia Qingshu: 'Auntie, I also can’t let go of the little life in my stomach... I don’t want the five billion, only the child. As for your son, I don't want. '\n\n~\n\n'Secretary, Is Xia Qingshu still spying on my whereabouts every day? '\n\n'President. Xia Qingshu has never appeared again.'\n\n'Then is he not suffering?'\n\n'...Xia Qingshu has become a top-notch streamer. Not only is he a popular anchor, he is also an upcoming movie star/top streamer, and the second richest person in the world. '\n\n'??'\n\n'President, Xia Qingshu is on a blind date. He will never pester you again! '\n\n'....'\n\n'Secretary, you are seeing things, right?'\n\n\n>"
}