{
	"url": "https://www.novelupdates.com/series/great-day-to-be-alive-the-daughter-spoiled-by-the-president-wants-me-to-marry-her-3ldk-cohabitation-life-with-a-perfect-beautiful-girl/",
	"title": "Great Day to Be Alive! The Daughter Spoiled by the President Wants Me to Marry Her ~ 3LDK Cohabitation Life With a Perfect Beautiful Girl (WN) - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/01/Great-Day-to-Be-Alive-The-Daughter-Spoiled-by-the-President-Wants-Me-to-Marry-Her-LDK-Cohabitation-Life-With-a-Perfect-Beautiful-Girl.jpg",
	"noveltype": "(JP)",
	"genre": "Comedy   Romance   School Life   Shounen   ",
	"tags": "Beautiful Female Lead   Cohabitation   Male Protagonist   Modern Day   Wealthy Characters   ",
	"rating": "(3.9 / 5.0, 44 votes)",
	"author": "Kishimoto Kazuha   岸本 和葉   ",
	"year": "\n2021",
	"ranking": "#1326   #1148   #4527   #1465   #5608   ",
	"reviewcount": "1 Review sorted by",
	"description": "Haruyuki Inamori, a high school student who lost his parents in an accident, has been living alone with most of his parents' inheritance to escape his money-grubbing relatives. Having to earn all the money except for school fees on his own, Haruyuki spends his time outside of school working part-time. However, while working late at night to cover up his age, he accidentally helps a girl in his class who is being tangled up with a drunk, and is fired from his job. Haruyuki is at his wits' end after losing his lucrative job, but the girl he rescued, Tojo Fuyuki, offers him an unbelievable deal.\r\n\r\n'If you marry me, I promise to support you for the rest of your life.'\r\n\r\nHaruyuki is skeptical about this too-good-to-be-true offer from the only daughter of the Tojo Group, a large corporation, but he agrees to it on the light condition that he will first try it out. From that day on, he started his sweet life with the daughter of the president. The day begins with breakfast prepared by her, and then the two of them go to school together. Whenever they have free time, they watch a movie together or play a popular game. On holidays, they enjoy dates in the city and sleep well in the same bed at night. This is a sweet love comedy between a struggling high school student and the daughter of the president, who is the envy of everyone. The story is currently being posted in advance on Kakuyomu.>"
}