{
	"url": "https://www.novelupdates.com/series/the-princess-and-the-film-empress/",
	"title": "The Princess and the Film Empress - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/09/20200816155935.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Romance   Shoujo   ",
	"tags": "Acting   Celebrities   Female Protagonist   Friendship   Modern Day   Multiple Protagonists   Royalty   Transmigration   ",
	"rating": "(3.7 / 5.0, 20 votes)",
	"author": "Mò Lǐ   莫里_   ",
	"year": "\n2020",
	"ranking": "#2000   #6382   #10184   #6620   #9201   ",
	"reviewcount": "1 Review sorted by",
	"description": "Her Highness, the Princess Royal Hua Zhao of the Hua Dynasty, was savage, willful, and domineering, receiving the disgust of the people.\r\n\r\nBut it was this savage and willful princess who bewitched the enemy troops with her red-clothed dance, when the Huns went south to destroy the country and massacre everyone in the city, finally snatching the opportunity for tens of thousands of people in the capital to flee.\r\n\r\nFinally, Princess Hua Zhao committed suicide before the iron heel of the Hun general.\r\n\r\n......\r\n\r\nWhen she opened her eyes again, it was already 1,000 years later.\r\n\r\nHua Zhao was still wearing her red dancing clothes, mindlessly wandering around the 5th Ring Road.\r\n\r\nHua Zhao learnt from those around her and hailed a taxi.\r\n\r\nDriver: Miss, where are you going?\r\nHua Zhao: Why haven’t you taken bengong to see Father Emperor yet?\r\nDriver: Tch~ ok~!!\r\n20 minutes later, the driver threw Hua Zhao at the doors of the History Museum.\r\nHua Zhao: ???\r\n\r\n***\r\n\r\nThe historical drama “Princess Hua Zhao” was successfully completed, the audience ratings of the finale breaking 2 stars on two broadcast networks and 3 stars on one! It deserved to be called a phenomenal drama!\r\n\r\nThe actress who played the female lead, Princess Hua Zhao, was the circle’s most famous little flower, Cheng Xingfei.\r\n\r\nShe was humble, low-key, and peaceful; the model of a conscientious worker.\r\n\r\nBut then a pot fell down from the sky — gossip reporters broke the news that Cheng Xingfei had gotten too far into her role and had a mental disorder. In the middle of the night, wearing a red costume, she ran to the doors of the History Museum to mourn!\r\n\r\nCheng Xingfei: ???>"
}