{
	"url": "https://www.novelupdates.com/series/solo-leveling/",
	"title": "Solo Leveling - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/01/Solo-Leveling.jpg",
	"noveltype": "(KR)",
	"genre": "Action   Adventure   Drama   Fantasy   Mystery   Shounen   Supernatural   ",
	"tags": "Accelerated Growth   Adapted to Anime   Adapted to Manhwa   Adventurers   Appearance Changes   Army Building   Beautiful Female Lead   Calm Protagonist   Caring Protagonist   Cheats   Determined Protagonist   Dungeons   Famous Protagonist   Game Elements   Gate to Another World   Grinding   Guilds   Handsome Male Lead   Hard-Working Protagonist   Hiding True Abilities   Hunters   Kuudere   Late Romance   Level System   Loner Protagonist   Loyal Subordinates   Male Protagonist   Misunderstandings   Modern Day   Multiple POV   Nationalism   Near-Death Experience   Necromancer   Overpowered Protagonist   Personality Changes   Romantic Subplot   Time Travel   Weak to Strong   ",
	"rating": "(3.9 / 5.0, 1429 votes)",
	"author": "Chugong   Jang Sung-Lak   추공   ",
	"year": "\n2016",
	"ranking": "#946   #924   #309   #1   #42   ",
	"reviewcount": "233 Reviews sorted by",
	"description": "10 years ago, after “the Gate” that connected the real world with the monster world opened, some of the ordinary, everyday people received the power to hunt monsters within the Gate. They are known as “Hunters”.\n\nHowever, not all Hunters are powerful. My name is Sung Jin-Woo, an E-rank Hunter. I’m someone who has to risk his life in the lowliest of catacombs, the “World’s Weakest”.\n\nHaving no skills whatsoever to display, I barely earned the required money by fighting in low-leveled catacombs… at least until I found a hidden catacomb with the hardest difficulty within the D-rank catacombs!\n\nIn the end, as I was accepting death, I suddenly received a strange power, a quest log that only I could see, a secret to leveling up that only I know about! If I trained in accordance with my quests and hunted monsters, my level would rise.\n\nChanging from the weakest Hunter to the strongest S-rank Hunter!>"
}