{
	"url": "https://www.novelupdates.com/series/why-is-it-possible-for-this-type-of-a-to-also-have-an-o/",
	"title": "Why Is It Possible For This Type Of A To Also Have An O? - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/02/Why-Is-It-Possible-For-This-Type-Of-A-To-Also-Have-An-O.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Drama   Fantasy   Psychological   Romance   Slice of Life   Tragedy   Yaoi   ",
	"tags": "Abusive Characters   Adapted to Manhua   Alternate World   Calm Protagonist   College/University   Couple Growth   Different Social Status   Doctors   Mature Protagonist   Multiple Protagonists   Older Love Interests   Omegaverse   Past Plays a Big Role   Past Trauma   Power Couple   Rebellion   R*pe   Selfless Protagonist   Seme Protagonist   S*xual Abuse   Transmigration   ",
	"rating": "(4.1 / 5.0, 71 votes)",
	"author": "图南鲸   ",
	"year": "\n2021",
	"ranking": "#1518   #1284   #5693   #1523   #5146   ",
	"reviewcount": "9 Reviews sorted by",
	"description": "After 18 hours of operation, a certain handsome doctor died on the operating table, only to wake up and discover that he had transmigrated into an alpha’s body.\n\nA pitiful omega sat next to his bed. When the omega noticed him waking up, his small face immediately turned pale!\n\nJiang Yunshu: I used to treat you badly?\n\nBai Tang trembled and didn’t dare to talk.\n\nJiang Yunshu: ….\n\nJiang Yunshu: It won’t happen again.\n\nJiang Yunshu found that Bai Tang’s body was covered with wounds, and his left arm was fractured.\n\nJiang Yunshu: I used to hit you?\n\nBai Tang turned pale and whimpered: No…\n\nJiang Yunshu: ….\n\nJiang Yunshu: It won’t happen again.\n\nJiang Yunshu found that Bai Tang didn’t even attempt to dine at the table at home since the original owner would not allow it.\n\nThe original owner forbade him to eat meat because it would taste. He couldn’t sleep in bed because the original owner didn’t like him. Jiang Yunshu also found out that something was amiss with Bai Tang. His gland was utterly f*cked up.\n\nJiang Yunshu, who hardly cursed: f*ck.\n\nLater, Jiang Yunshu also learned that every time the original owner domestically abused Bai Tang, he would say the same sentence, “It won’t happen again”, but the next time he’d only hit harder.\n\nJiang Yunshu: Bastard!!!\n\nBut luckily, Jiang Yunshu is a patient man, and as a doctor, he’d be able to gradually nurse this beautiful but broken omega back. He even went so far as to spend his entire life proving to Bai Tang what he meant when he said, “It won’t happen again.”>"
}