{
	"url": "https://www.novelupdates.com/series/i-refuse-to-be-a-supporting-character/",
	"title": "I Refuse to be a Supporting Character - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2018/09/006eynQAly1fqpbttll97j30b40fkq4l.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Drama   Josei   Romance   Slice of Life   ",
	"tags": "Beautiful Female Lead   Betrayal   Clever Protagonist   Cousins   Cute Protagonist   Female Protagonist   Handsome Male Lead   Love Interest Falls in Love First   Mob Protagonist   Modern Day   Multiple Transported Individuals   Obsessive Love   Past Plays a Big Role   Popular Love Interests   Possessive Characters   R*pe   Second Chance   Transmigration   Transplanted Memories   Transported to Another World   Wealthy Characters   ",
	"rating": "(3.7 / 5.0, 470 votes)",
	"author": "Jiang Li Yuan   姜离远   ",
	"year": "\nN/A",
	"ranking": "#1201   #3695   #450   #503   #501   ",
	"reviewcount": "122 Reviews sorted by",
	"description": "Gu Jin, your average day-to-day worker, crossed into a novel as the supporting character and best friend and cousin of the female protagonist, Cheng Xin, who was frequently surrounded by men of status and quality. The two cousins believed they'd enjoy this friendship for a lifetime. \n\nBut soon, Gu Jin discovered that the body she had crossed into had memories of future events beyond the novel's plot, including finding out that her marriage would end in utter failure. Her husband, the second male lead named Shao Chong, would neglect their marriage because of his infatuation for Cheng Xin. On the day that, Gu. Jin was kidnapped and beaten to death, her good husband stayed by her cousin's side and accompanied her to the hospital. \n\nWhen Gu Jin transmigrated into this novel world and learned of the truth, she refused to waste this new life as a supporting role for her cousin the way the previous soul had done. She refused to live her life as a spectator in someone else's love story. No. She would be the protagonist of her own romance in this new life.>"
}