{
	"url": "https://www.novelupdates.com/series/why-do-all-the-male-protagonists-look-at-me-like-that/",
	"title": "Why Do All the Male Protagonists Look at Me Like That - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/01/Why-Do-All-the-Male-Leaders-Look-at-Me-Like-That.jpeg",
	"noveltype": "(CN)",
	"genre": "Harem   Romance   Shounen Ai   Slice of Life   Yaoi   ",
	"tags": "Calm Protagonist   Caring Protagonist   Celebrities   Character Growth   Charismatic Protagonist   Charming Protagonist   Clingy Lover   Devoted Love Interests   Doting Love Interests   Easy Going Life   First Love   Glasses-wearing Love Interests   Handsome Male Lead   Heartwarming   Helpful Protagonist   Kind Love Interests   Love Interest Falls in Love First   Love Rivals   Love Triangles   Older Love Interests   Persistent Love Interests   Popular Love Interests   Showbiz   Strong Love Interests   Transmigration   Wealthy Characters   ",
	"rating": "(3.9 / 5.0, 78 votes)",
	"author": "Gong Zi Yu Ge   公子于歌   ",
	"year": "\n2021",
	"ranking": "#2053   #1479   #3559   #2008   #3892   ",
	"reviewcount": "14 Reviews sorted by",
	"description": "Zhai Xingchen has transmigrated into a novel about a rich and powerful love variety show. Almost all of the 8 guests have a combination of beauty and wealth, which can be called the pinnacle of a love variety show.\n\nFor example, guest No. 1 is notorious and cold. Everyone has to avoid him. He has only been interested in financial data in his life, but he has an extremely handsome face. A casual smile can make people blush and walk. He is the master of the Future Business Empire, and he can swipe his bank card at will.\n\nGuest No. 2, a straight boss with evil charm, height 191, male dog waist, shark muscle, the son of luck who will be famous in the world. Now he is still starting his own business, but he will suddenly become rich in a year, and become the owner of a listed company at a young age.\n\nGuest No. 3, a gentleman who is aloof and abstinent, his shirt is always buttoned to the top. Although extremely clean, he actually has a twisted and fiery heart. And he is a well-known domestic e-sports ace.\n\nThe other guests are all rich second-generation, such as the enthusiastic and gorgeous queen Bottom, the restrained and temperamental high-level intellectual Bottom, the mature and dignified Bottom and so on.\n\nBut Zhai Xinchen is the nobody in this romance novel. He does the most work and gets the fewest shots. He has never received a Touched Message from beginning to end. He is a complete nerd. Ah, this persona suits him so well!\n\nZhai Xingchen is determined to be the little match, to burn himself and illuminate other guests.\n\nWhen someone was hurt by the indifference of guest No. 1, he comforted: “It’s only because of his unfortunate childhood that he was so dark. Don’t you want to be his only light?”\n\nWhen everyone thought that guest No. 2 was too greasy and domineering, he explained: “Don’t you think he is full of the spirit of a king? He will definitely achieve something in the future, I am optimistic about him!”\n\nAs for the guest No. 3: “He looks so cold and abstinent, don’t you want to tear his shirt off?”\n\nThanks to his efforts, the show really exploded.\n\nGuest No. 1: “He is my only light.”\n\nGuest No. 2: “Only he understands me best.”\n\nGuest No. 3: “What I thought in my heart, even if I say it, it will be banned from broadcasting.”\n\nFour five six seven guests: “I love him.”\n\nZhai Xingchen: “…Ah?”\n\nWhen the show first aired, netizens said, “I don’t think the guests seem to be in love.”\n\nLater: “Every episode is a jealous Shura field, so exciting!”\n\n“This is too damn sweet! My little face is flushed.”>"
}