{
	"url": "https://www.novelupdates.com/series/world-teacher-other-world-style-education-agent/",
	"title": "World Teacher – Other World Style Education & Agent (WN) - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2017/11/World-Teacher-Isekaishiki-Kyouiku-Agent-6.jpeg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Comedy   Drama   Fantasy   Harem   Martial Arts   Romance   School Life   Shounen   Supernatural   ",
	"tags": "Academy   Adapted to Manga   Age Progression   Assassins   Beast Companions   Beastkin   Calm Protagonist   Clever Protagonist   Cooking   Death   Death of Loved Ones   Demi-Humans   Discrimination   Dungeons   Dwarfs   Early Romance   Elemental Magic   Elves   Fantasy World   First-time Interc**rse   Genius Protagonist   Human-Nonhuman Relationship   Love Interest Falls in Love First   Male Protagonist   Marriage   Master-Disciple Relationship   Monsters   Multiple POV   Overpowered Protagonist   Polygamy   Pregnancy   R-15   Reincarnated in Another World   Royalty   Ruthless Protagonist   Student-Teacher Relationship   Sword And Magic   Teachers   Time Skip   Underestimated Protagonist   Weak to Strong   World Travel   ",
	"rating": "(3.9 / 5.0, 829 votes)",
	"author": "Neko Kouichi   ",
	"year": "\n2014",
	"ranking": "#3567   #2579   #125   #3450   #43   ",
	"reviewcount": "65 Reviews sorted by",
	"description": "A man who was once called the world’s strongest agent ended up becoming a teacher after his retirement, to train a new generation of agents. After many years of training his disciples, he was killed at the age of 60 by a secret organization’s ruse and was reincarnated in another world with his memories intact. Though he was surprised by the existence of magic and the strange species in that world, he quickly adapted to his condition as a newborn and took advantage of it. He acquired special magic and gained a massive amount of strength thanks to his rigorous discipline, in order to reach his goal: Resume his career as a teacher which he left halfway through in his previous life.\r\n\r\nThis is the story of a man, who, based on the memories and the experiences of his previous life, became a teacher who travels through the world with his students.>"
}