{
	"url": "https://www.novelupdates.com/series/confinement-king/",
	"title": "Confinement King (WN) - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/08/Confinement-King.jpg",
	"noveltype": "(JP)",
	"genre": "Adult   Drama   Ecchi   Harem   Psychological   Romance   School Life   Seinen   Supernatural   ",
	"tags": "An*l   Adapted to Manga   Adultery   Angels   Average-looking Protagonist   Brainwashing   Bullying   Celebrities   Cheats   Clingy Lover   C*nnilingus   Cohabitation   Cold Protagonist   Confinement   Cowardly Protagonist   Crime   Cruel Characters   Death   Demons   Depictions of Cruelty   Detectives   Devoted Love Interests   Emotionally Weak Protagonist   Enemies Become Lovers   Evil Protagonist   First Love   First-time Interc**rse   F*llatio   Hated Protagonist   H*ndjob   Inferiority Complex   Jealousy   Kidnappings   Level System   Magic   Maids   Male Protagonist   Manipulative Characters   Masochistic Characters   Master-Servant Relationship   Mind Break   Mind Control   Models   Modern Day   Modern Knowledge   Multiple POV   Murders   Netori   Nudity   Organized Crime   Or*y   Outdoor Interc**rse   Perverted Protagonist   Police   Polygamy   Popular Love Interests   R-18   R*pe Victim Becomes Lover   Revenge   R*pe   Sadistic Characters   S*x S*aves   S*xual Abuse   S*aves   Stockholm Syndrome   Succubus   Threesome   Tragic Past   Twisted Personality   Wealthy Characters   Yandere   ",
	"rating": "(4.2 / 5.0, 263 votes)",
	"author": "マサイ   ",
	"year": "\n2020",
	"ranking": "#287   #115   #555   #505   #1033   ",
	"reviewcount": "29 Reviews sorted by",
	"description": "A girl who calls herself a demon appeared before a timid student named Fumio Kijima. The girl claims to be a campaign girl from the demon world and she gives him the ability to 'summon a room' from nothing but thin air.\n\nAt first he doesn't abuse his power and uses it as a convenient ability in his every day life. But one day he is bullied by his classmates under a false pretext and is made to suffer. In the past he would have wallowed in misery and cried himself to sleep, but now he had a power to call upon.\n\n'I will make them regret it!'\n\nUsing his powers to summon his 'room', he begins his era of confinement and brainwashing to achieve his goals.>"
}