{
	"url": "https://www.novelupdates.com/series/absolute-choice/",
	"title": "Absolute Choice - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2017/06/Absolute-Choice.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Comedy   Drama   Fantasy   Martial Arts   Mystery   Xuanhuan   ",
	"tags": "Aggressive Characters   Aliens   Amnesia   Arrogant Characters   Average-looking Protagonist   Beautiful Female Lead   Bloodlines   Body Tempering   Calm Protagonist   Character Growth   Charismatic Protagonist   Chuunibyou   Cold Love Interests   Cold Protagonist   Cultivation   Demons   Dense Protagonist   Devoted Love Interests   Fast Cultivation   Firearms   Game Elements   Genius Protagonist   Gods   Human-Nonhuman Relationship   Loli   Love Interest Falls in Love First   Lucky Protagonist   Male Protagonist   Manipulative Characters   Misunderstandings   Modern Day   Multiple Realms   Mysterious Family Background   Mysterious Past   Naive Protagonist   Older Love Interests   Parody   Past Plays a Big Role   Perverted Protagonist   Psychic Powers   Race Change   Romantic Subplot   Schemes And Conspiracies   Sentient Objects   Seven Deadly Sins   Shameless Protagonist   Special Abilities   Stoic Characters   Strong Love Interests   Sudden Strength Gain   Sword And Magic   Time Loop   Transformation Ability   Transmigration   Transported to Another World   Tsundere   Unconditional Love   Weak to Strong   ",
	"rating": "(3.7 / 5.0, 951 votes)",
	"author": "Pear Lands In The Autumn Spring   梨落秋溪   ",
	"year": "\n2016",
	"ranking": "#5262   #2000   #59   #2267   #455   ",
	"reviewcount": "83 Reviews sorted by",
	"description": "A world filled with heroes with superpowers. A world attacked by calamity fiends. A modern world filled with wonders and dangers.\n\nShi Xiaobai, a child from normal Earth, walked into such a world, proclaiming to be its king. But at the first signs of danger, he is forced to make a choice, one which he cannot refuse for time would repeat, making him face the choice again.\n\nHe is not humble nor is he modest, but neither is he delusional. Yet, the Absolute Choice seems to make fun of him. Will the joke be on him or will he laugh at his opponents? There will be many watching his escapades, and there will be some joining him in his adventures.\n\nTo see through the world and to grasp its truth, that is the destiny of the King.\n>"
}