{
	"url": "https://www.novelupdates.com/series/level-1-strongest-sage-cursed-to-be-able-to-use-only-the-lowest-level-of-magic-but-because-of-the-gods-miscalculation-i-got-infinite-magic-and-became-the-strongest/",
	"title": "Level 1 Strongest Sage ~ Cursed to Be Able to Use Only the Lowest Level of Magic, but Because of the God’s Miscalculation I Got Infinite Magic and Became the Strongest ~ - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/07/Level-1-Strongest-Sage.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Comedy   Fantasy   Harem   Romance   School Life   ",
	"tags": "Academy   Adapted to Manga   Beastkin   Beautiful Female Lead   Contracts   Curses   Demons   Dense Protagonist   Depictions of Cruelty   Discrimination   Dragons   Early Romance   Elemental Magic   Elves   Evil Gods   Gods   Handsome Male Lead   Magic   Magic Formations   Magical Technology   Male Protagonist   Marriage   Master-Servant Relationship   Misunderstandings   Multiple POV   Multiple Reincarnated Individuals   Multiple Transported Individuals   Naive Protagonist   Overpowered Protagonist   Polygamy   Pregnancy   Reincarnation   Righteous Protagonist   Royalty   Spirits   Strong Love Interests   Strong to Stronger   Sword And Magic   Transmigration   Tsundere   Weak to Strong   ",
	"rating": "(3.6 / 5.0, 114 votes)",
	"author": "Kizuka Maya   木塚 麻弥   ",
	"year": "\n2018",
	"ranking": "#1851   #1872   #660   #1079   #1819   ",
	"reviewcount": "15 Reviews sorted by",
	"description": "One day, Saijō Haruto was forced by the Evil God of another world into reincarnation, and his soul was cursed.\n\nHe was reborn into a world of swords and magic.\n\nIn this world, one can become stronger by raising the level of their combat occupations.\n\nUnfortunately, Halt cannot raise his level because of the curse.\n\nHalt felt hopeless.\n\nHowever, because of the Evil God’s miscalculation, Halt obtained an inexhaustible supply of magical power.\n\nThis is the tale of how a Sage—cursed to have a “Locked” Status—managed to reach the pinnacle of strength by the effect of the curse.>"
}