{
	"url": "https://www.novelupdates.com/series/flying-gulls-never-land/",
	"title": "Flying Gulls Never Land - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/10/飞鸥不下2.jpg",
	"noveltype": "(CN)",
	"genre": "Drama   Mature   Psychological   Romance   Yaoi   ",
	"tags": "Absent Parents   Adapted to Drama CD   Adapted to Manhua   Adopted Children   Brother Complex   Childhood Love   Cold Love Interests   Cruel Characters   Death of Loved Ones   Depictions of Cruelty   Determined Protagonist   Devoted Love Interests   Enemies Become Lovers   F*llatio   Gore   Handsome Male Lead   Lawyers   Lovers Reunited   Male Yandere   Modern Day   Mysterious Past   Non-linear Storytelling   Obsessive Love   Past Plays a Big Role   Past Trauma   Possessive Characters   Prison   Proactive Protagonist   Psychopaths   R*pe Victim Becomes Lover   R*pe   Schemes And Conspiracies   S*xual Abuse   Siblings Not Related by Blood   Stalkers   Stoic Characters   Strong Love Interests   Twisted Personality   Unreliable Narrator   Unrequited Love   Yandere   ",
	"rating": "(4.3 / 5.0, 170 votes)",
	"author": "Hui Nan Que   回南雀   ",
	"year": "\n2019",
	"ranking": "#504   #355   #3335   #5349   #2696   ",
	"reviewcount": "31 Reviews sorted by",
	"description": "“I went to prison for ten years for him, and not once did he come to see me.”\n\nWhile he was explaining the questions to me, I always admired the view of his side profile, seeing how the sunlight would hit his fluttering eyelashes, casting faint shadows just beneath his irises.\n\nEvery time I was entranced by his good looks, I would marvel at whether his biological parents were fools, because how could a normal person abandon such a handsome and healthy boy.\n\nFrom then on, I believed the deep affection I couldn’t push aside for him was just the attachment I felt for an older brother, a dependency born from the lack of a father figure in my life.\n\nUntil the appearance of Qi Yang.\n\n“The only difference between me and Sheng Min Ou’s harasser, is probably the fact that I call Sheng Min Ou ‘Older brother’”>"
}