{
	"url": "https://www.novelupdates.com/series/the-time-mages-strong-new-game-%ef%bd%9ei-returned-to-the-past-to-rewrite-it-as-the-worlds-strongest/",
	"title": "The Time Mage’s Strong New Game ～I Returned to the Past To Rewrite It as the World’s Strongest - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/05/The-time-mages-strong-new-game-I-returned-to-the-past-to-rewrite-it-as-the-worlds-strongest.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Fantasy   Harem   Martial Arts   Romance   Supernatural   ",
	"tags": "Adopted Protagonist   Adventurers   Childhood Friends   Demon Lord   Demons   Elemental Magic   Heroes   Love Interest Falls in Love First   Magic   Male Protagonist   Monsters   Overpowered Protagonist   Protagonist Strong from the Start   R-15   Second Chance   Spatial Manipulation   Special Abilities   Strong Love Interests   Strong to Stronger   Sword And Magic   Sword Wielder   Time Manipulation   Time Travel   Younger Love Interests   ",
	"rating": "(3.2 / 5.0, 34 votes)",
	"author": "Sakaki Mochimaru   坂木持丸   ",
	"year": "\n2021",
	"ranking": "#327   #415   #4002   #398   #6795   ",
	"reviewcount": "1 Review sorted by",
	"description": "The only time mage in the world, Chrom Chronogate.\r\nHe was abandoned by his family and scorned for having zero talent for magic, but after a hundred years of hard work, he rose to the top.\r\nHowever, by the time he became strong, he had lost everything he wished to protect. His one and only life was spent entirely on the pursuit of power.\r\nBut then, Chrom made a decision.\r\nHe would use time magic, and rewrite his life.\r\nAnd thus, he went back to a time in his life when he was known as a failure, with his powers intact. All to defeat the enemies he was unable to beat, and save the people he once lost.\r\nThe fated deaths of his childhood friends, the attacks of powerful monsters, enemy conspiracies... He would have to settle everything from the shadows using his knowledge of the future.\r\nWhile being lauded by the townspeople as a mysterious hero, Chrom enjoyed his opportunity to live his life again, with the people he saved.\r\n>"
}