{
	"url": "https://www.novelupdates.com/series/reborn-in-konoha-as-the-anbu-torturer/",
	"title": "Reborn in Konoha as the Anbu Torturer - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/11/Reborn-in-Konoha-as-the-Anbu-Torturer.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Fantasy   ",
	"tags": "Anti-social Protagonist   Antihero Protagonist   Bloodlines   Cautious Protagonist   Cheats   Clever Protagonist   Cold Protagonist   Determined Protagonist   Eye Powers   Fanfiction   Hidden Abilities   Hiding True Abilities   Low-key Protagonist   Male Protagonist   Manipulative Characters   Misunderstandings   Mob Protagonist   Modern Knowledge   Multiple POV   Overpowered Protagonist   Power Struggle   Protagonist Strong from the Start   Ruthless Protagonist   Schemes And Conspiracies   Secret Identity   Secretive Protagonist   Skill Assimilation   Strategist   Strong to Stronger   Sudden Strength Gain   System Administrator   Torture   Transformation Ability   Transmigration   Underestimated Protagonist   ",
	"rating": "(3.4 / 5.0, 41 votes)",
	"author": "Shi Tianfeng   释天风   ",
	"year": "\n2020",
	"ranking": "#4265   #3587   #4290   #4924   #8876   ",
	"reviewcount": "4 Reviews sorted by",
	"description": "“Introduce yourself!”\n\nThe smile on Aoba’s face slowly converged, and he became extremely serious, which made his face in the shadow of the backlight even more terrifying.\n\n“My name is Yamanaka Aoba, fourteen years old and live in the Anbu dormitory. I work in the Konohagakure Intelligence Division and live an ordinary quiet life every day…”\n\nAoba transmigrated to the world of Naruto, became an ordinary Yamanaka clan member. Due to his frail body, the clan arranged for him to become Anbu in the Konohagakure Intelligence Division and conduct mind-reading interrogation work.\n\nWhen he didn’t know how to pass the level, he awakened the Mind Reading System. Not only could he read memory, but he could also get rewards!\n\nAoba learned from the memories of those who need to be interrogated that the ninja world was far more dangerous than he imagined, so he decided to grow wretchedly in the Konohagakure Intelligence Division and would never waver before becoming invincible ninja world.\n\nTen years later, the Kyuubi Rampage broke out.\n\nSeeing that Kyuubi’s claws were about to smash the Konohagakure Intelligence Division, Aoba had no choice but to make a move.\n\n“Kyuubi, you are too strong. You should still be sealed!”>"
}