{
	"url": "https://www.novelupdates.com/series/after-the-little-crybaby-enters-the-nightmare-cycle/",
	"title": "After the Little Crybaby Enters the Nightmare Cycle - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/06/After-the-Little-Crybaby-Enters-the-Nightmare-Cycle.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Horror   Mystery   Shounen Ai   Supernatural   ",
	"tags": "Amnesia   Blind Protagonist   Calm Protagonist   Cross-dressing   Devoted Love Interests   Disabilities   Doting Love Interests   Ghosts   Honest Protagonist   Multiple Realms   Mysterious Past   Mystery Solving   Past Plays a Big Role   Possession   Power Couple   Protagonist Strong from the Start   Survival Game   System Administrator   Time Loop   Transmigration   Unlimited Flow   ",
	"rating": "(4.5 / 5.0, 101 votes)",
	"author": "菊长大人   ",
	"year": "\n2020",
	"ranking": "#284   #160   #2675   #457   #2497   ",
	"reviewcount": "17 Reviews sorted by",
	"description": "Chi Nan was the young man in one of the Top 10 forbidden paintings, the Crying Boy. It was said that he would bring disaster, so his memories were sealed and his soul was locked in the painting.\n\nOne day, Chi Nan entered the body of a blind young master who died accidentally. The young master was the owner of this forbidden painting. However, Chi Nan had stayed in the painting for a long time. He lost the happiness and sadness of human beings. The only emotion he could show on his face was: tears.\n\nChi Nan made three wishes to the gods: regain his vision, stop crying and get his memories back.\n\nThus, he was invited into the world of terror, the Nightmare Cycle. Break the nightmares to gain points and grant his wishes.\n\nOrdinary players: Ahhh, it is terrible! I want to wake up!\n\nMeanwhile, Chi Nan moved through the nightmares, grabbing small skeletons at the crane machine in the amusement park at midnight, building ice sculptures with corpses in a snowy country’s mass grave and dancing with a fierce ghost in a life-threatening waltz until dawn.\n\nThe dreams were really good. There were endless games, ghosts who tried to amuse him and a mysterious boss who sent him good medicine every day.\n\nChi Nan cried happily but when he cried, the ghosts of the world trembled.\n\n***\n\nThe owner of the body was called You Yu and he suspected that he didn’t die accidentally. In order to understand the truth behind his death and be reborn in his body, he sold his soul to the world called the ‘Nightmare Cycle.’ He became the dream maker behind the scenes, conscientiously creating dreams of terror.\n\nHe didn’t expect that he would meet his body in the infinite nightmare he created with his own hands. The user of the body was a bigshot who loved to shed tears. This person was diligent in going through the instances to earn points and restore vision for him.\n\nThus, You Yu secretly added the sweetest honey to medicine and sent it to Chi Nan at midnight every day. So why did the little crybaby cry again after drinking it?>"
}