{
	"url": "https://www.novelupdates.com/series/the-principle-of-a-philosopher-by-eternal-fool-asley/",
	"title": "The Principle of a Philosopher by Eternal Fool “Asley” - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2017/07/13ee1749c310bef151727f31192477c0.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Comedy   Fantasy   Martial Arts   School Life   Shounen   Slice of Life   Supernatural   ",
	"tags": "Academy   Adapted to Manga   Alchemy   Ancient Times   Appearance Different from Actual Age   Artifacts   Beast Companions   Demon Lord   Dense Protagonist   Elves   Familiars   Fantasy World   Game Elements   Glasses-wearing Protagonist   Harsh Training   Immortals   Lack of Common Sense   Magic   Magic Beasts   Magical Technology   Male Protagonist   Management   Pets   Protagonist Strong from the Start   R-15   Sword And Magic   Time Skip   Time Travel   ",
	"rating": "(4.1 / 5.0, 165 votes)",
	"author": "Hifumi   壱弐参   ",
	"year": "\n2015",
	"ranking": "#763   #1480   #800   #1023   #931   ",
	"reviewcount": "15 Reviews",
	"description": "The 5,000 years-old boy has resurfaced!\n\nIn the distant past, young and foolish Asley flunked out of the prestigious Magic University… by failing an early exam that had a 100% passing rate until then. Shortly afterwards, he accidentally created the immortality-granting “Drop of Eternity,” and upon consuming it, obtained an eternally lasting body. \n\nHe devoted himself to researching magic for almost 5,000 years… after which he traveled in search of the world’s most mysterious Dungeon. Along the way, he happened to save a family, and then their town, from a monster attack. Before he knew it, he was hailed by the locals as a savior with ancient arcane arts and knowledge…\n\nWhile helping to rebuild the town, an opportunity came up for Asley to enter the Magic University once again, so he did. One thing led to another, and his initially normal journey got bigger and bigger — studying, adventuring, monster hunting, money-making, hellish training, uncovering conspiracies, saving the world, the whole nine yards!\n\nThus began the adventure through the mundane and the insane of “Eternal Fool” Asley, his Familiar wolf-dog Pochi, and all their friends and enemies along the way!>"
}