{
	"url": "https://www.novelupdates.com/series/obey-me/",
	"title": "Obey Me - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/08/Obey-Me.jpg",
	"noveltype": "(KR)",
	"genre": "Adult   Fantasy   Mature   Psychological   Smut   Tragedy   ",
	"tags": "Adapted to Manhwa   Aristocracy   Beautiful Female Lead   Broken Engagement   Calm Protagonist   Character Growth   Charismatic Protagonist   Clingy Lover   Confinement   Cruel Characters   Dark   Death of Loved Ones   Depression   Empires   European Ambience   Female Protagonist   First-time Interc**rse   Godly Powers   Handsome Male Lead   Hard-Working Protagonist   Hated Protagonist   Immortals   Inheritance   Magic   Male Yandere   Mind Break   Near-Death Experience   Nobles   Older Love Interests   Outdoor Interc**rse   Parent Complex   Politics   Possessive Characters   Power Couple   Power Struggle   Psychopaths   Royalty   Sadistic Characters   Saving the World   Second Chance   Selfless Protagonist   Smart Couple   Stockholm Syndrome   Suicides   Sword And Magic   Thriller   Time Skip   Trap   Wealthy Characters   ",
	"rating": "(4.0 / 5.0, 132 votes)",
	"author": "Gyeonwoo   견우   ",
	"year": "\n2020",
	"ranking": "#770   #1494   #2961   #2214   #2134   ",
	"reviewcount": "24 Reviews sorted by",
	"description": "At that time, she was dumped by the crown prince and was free to go on her own journey.\n\n[Hello.]\n\nShe had woken that thing, no, him up.\n\n[I am Nathaniel.]\n\nHe said.\n\n[People here call me ‘The End’.]\n\nA beautiful man, like the king of winter, smiled in boredom and with arrogance.\n\n* * *\n\n“Let me out.”\n\nNathaniel stretched out his hand, but Kyrie rejected it. However, the white hands with prominent bones slowly and softly touched her ears and cheeks.\n\n[You’d better not think about it. If you don’t want to be tied up.]\n\nInstead of answering, she bit Nathaniel’s fingers.\n\nHe lowered his head slowly and put his head against her forehead.\n\nThe blue eyes in front of her seemed more ecstatic as Kyrie’s purple eyes shook with anxiety.\n\n[Take off your clothes on your own.]\n\nNathaniel looked down at his ruined sleeve and smiled fiercely.\n\n[I know how to put a leash on you if you do something stupid again.]>"
}