{
	"url": "https://www.novelupdates.com/series/infinite-bloodcore/",
	"title": "Infinite Bloodcore - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/04/unlimitedbloostone1c.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Fantasy   Mature   Xuanhuan   ",
	"tags": "Alchemy   Amnesia   Artifacts   Beasts   Beautiful Female Lead   Betrayal   Bloodlines   Calm Protagonist   Cannibalism   Caring Protagonist   Cautious Protagonist   Character Growth   Charismatic Protagonist   Clever Protagonist   Couple Growth   Cultivation   Dark   Demi-Humans   Depictions of Cruelty   Determined Protagonist   Discrimination   Dragons   Elemental Magic   Empires   Engagement   European Ambience   Fantasy Creatures   Fantasy World   Fast Learner   Flashbacks   Friendship   Gods   Handsome Male Lead   Hard-Working Protagonist   Helpful Protagonist   Hidden Abilities   Hiding True Abilities   Identity Crisis   Knights   Leadership   Loyal Subordinates   Magic Beasts   Magic Formations   Male Protagonist   Manipulative Characters   Misunderstandings   Monsters   Mysterious Past   Near-Death Experience   Necromancer   Nobles   Past Plays a Big Role   Philosophical   Pirates   Pragmatic Protagonist   Priests   Proactive Protagonist   Religions   Resurrection   Romantic Subplot   Sadistic Characters   Schemes And Conspiracies   Secretive Protagonist   Secrets   Souls   Special Abilities   Strategist   Strength-based Social Hierarchy   Stubborn Protagonist   Survival   Sword And Magic   Transformation Ability   Weak to Strong   ",
	"rating": "(4.3 / 5.0, 197 votes)",
	"author": "Gu Zhen Ren   蛊真人   ",
	"year": "\n2020",
	"ranking": "#2731   #2000   #2975   #6262   #3953   ",
	"reviewcount": "27 Reviews",
	"description": "There was no light in the dark of night, only war drums sounded and war cries shouted. A young man listened carefully, it was his heart beating and blood flowing. \n\nWhat lies hidden in the darkness ahead? Is it a man, a god, or…a monster? \n\nNo path could be the best, for infinite are the journeys possible underfoot!>"
}