{
	"url": "https://www.novelupdates.com/series/the-reincarnated-heavy-knight-who-was-exiled-after-a-supposed-big-miss-is-unparalleled-with-his-game-knowledge/",
	"title": "The Reincarnated Heavy Knight Who Was Exiled After A Supposed Big Miss Is Unparalleled With His Game Knowledge - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/05/The-Reincarnated-Heavy-Knight-Who-Was-Exiled-After-A-Supposed-Big-Miss-Is-Unparalleled-With-His-Game-Knowledge.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Fantasy   Romance   Shounen   ",
	"tags": "Abandoned Children   Adapted to Manga   Adventurers   Alchemy   Arrogant Characters   Artifacts   Blacksmith   Calm Protagonist   Clever Protagonist   Determined Protagonist   Dungeons   Fallen Nobility   Fantasy World   Game Elements   Guilds   Hot-blooded Protagonist   Level System   Love Interest Falls in Love First   Lucky Protagonist   Male Protagonist   Mystery Solving   Naive Protagonist   Nobles   Poor to Rich   Previous Life Talent   Reincarnated in a Game World   Romantic Subplot   Skill Books   Strategic Battles   Strong Love Interests   Strong to Stronger   Sword Wielder   Underestimated Protagonist   Weak to Strong   ",
	"rating": "(3.9 / 5.0, 141 votes)",
	"author": "Nekoko   猫子   ",
	"year": "\n2021",
	"ranking": "#1046   #727   #769   #639   #1631   ",
	"reviewcount": "20 Reviews",
	"description": "“You good-for-nothing bastard.. You are the son of a Sword Saint, yet you dare pull such a defective Class!?”\n\nDuring the〈Divine Blessing Ceremony〉of the 15-year-old Elma who came from a lineage of Sword Saints, he had manifested a commonly deemed defective class known as the Heavy Knight. He had been deprived of his position as the next head of the Edvan Household and was then exiled. The Heavy Knight class had an unbalanced status and useless skills, to top it off, it was even said to be a class cowardly and indolent people have.\n\nBut, Elma knew better—that this world was the world of the game he had used to play before—and that the Heavy Knight class was the strongest class to exist. Elma made full use of the knowledge he had in his previous life and began his efficient walkthrough of the world he was reincarnated into.>"
}