{
	"url": "https://www.novelupdates.com/series/my-wayward-ex-wife/",
	"title": "My Wayward Ex-Wife - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2017/10/fuqi-186x300.jpg",
	"noveltype": "(CN)",
	"genre": "Historical   Romance   Shoujo   Supernatural   ",
	"tags": "Ancient China   Beautiful Female Lead   Childcare   Clever Protagonist   Cold Love Interests   Demons   Female Protagonist   Handsome Male Lead   Sealed Power   ",
	"rating": "(3.7 / 5.0, 80 votes)",
	"author": "莫颜   ",
	"year": "\n2017",
	"ranking": "#2000   #2000   #3570   #6513   #3476   ",
	"reviewcount": "12 Reviews sorted by",
	"description": "Mu Huanqing despised two people in her life. – The first was the Emperor, who had terrible matchmaking skills; the second was the Duke of Zhen Yuan, who was forced into a marriage with her due to the imperial edict. He did not like her and had contempt for her family, the Mu family, for using this marriage to climb up the social ladder. Because of Mu Huanqing, he couldn’t marry his sweetheart and  could only make her a lowly concubine.\n\nShe also didn’t  care for him as she was originally living a free and leisurely lifestyle. Who knew that one imperial edict would end her happy days, causing her to be forcefully married to the cold, arrogant, and unmanageable Fu Yanlin?\n\nNot long after their marriage, he made her move into a manor in the country side, letting her live on her own. However, she didn’t care for it and instead even gave birth to an obedient and outstanding daughter. But one day, the husband who abandoned her suddenly appeared at the countryside manor, destroying her peaceful days. He was still  cold and arrogant, but a reserved air of authority was added to him as time passed. She didn’t know what type of plan he had concocted If he came to bully her treasured daughter, she would definitely break all ties with him!\n\nThe little daughter widened her innocent eyes, looking at the demon that no one else could see. “I’m scared!”\n\nThe demon gently pinched the little girl’s beautiful face: “Don’t be scared. The person your dad wants to bully isn’t you, but your mom.”>"
}