{
	"url": "https://www.novelupdates.com/series/the-monster-of-the-northernmost-territory%ef%bd%9ewealth-and-military-strength-of-a-country-that-begins-in-debt-trap%ef%bd%9e/",
	"title": "The Monster of the Northernmost Territory～Wealth and Military Strength of A Country that Begins in Debt Trap～ - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/04/The-Monster-of-the-Northernmost-TerritoryWealth-and-Military-Strength-of-A-Country-that-Begins-in-Debt-Trap.jpeg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Fantasy   Shounen   ",
	"tags": "Aristocracy   Death of Loved Ones   Depictions of Cruelty   Engagement   European Ambience   Fantasy World   Knights   Male Protagonist   Marriage   R-15   Younger Sisters   ",
	"rating": "(4.2 / 5.0, 5 votes)",
	"author": "なんじゃもんじゃ   ",
	"year": "\n2021",
	"ranking": "#3802   #2000   #12740   #9150   #12616   ",
	"reviewcount": "No Reviews",
	"description": "After his father’s death in war, Rodney inherited the knight household and rose to be the ruler of the desolate Dedel territory on the northernmost frontier.\n\nNevertheless, the knight household was in enormous debt. With only enough to cover the interests, the debts were accumulating like a snowball.\n\nAt the moment he opened the book his father had left him, Rodney was engulfed by a light. When he came to, he found himself recalling memories of his previous life, but they were from another world. Although he could not recollect his name or information about his parents and siblings from his previous life, he was able to acquire knowledge of the advanced civilization.\n\nStruggling with debt, Rodney established an industry and entered the Labyrinth to obtain a special power called Root Power.\n\nFortunately, his maternal grandfather was a merchant, and with his help, he was able to sell his specialties. He managed to pay off the debt, raise the wages of his soldiers, which had been low, and reinforce his army by acquiring equipment for them in order to achieve wealth and military strength of his own. Eventually, people began to be aware of this, and he emerged to be known as the “Monster of the Northernmost Territory”.>"
}