{
	"url": "https://www.novelupdates.com/series/refusing-love-as-a-queen/",
	"title": "Refusing Love As A Queen - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/11/RLAAQ.jpg",
	"noveltype": "(CN)",
	"genre": "Drama   Josei   Romance   ",
	"tags": "Aristocracy   Beautiful Female Lead   Charismatic Protagonist   Clever Protagonist   European Ambience   Female Protagonist   Kingdom Building   Love Interest Falls in Love First   Love Triangles   Nobles   Politics   Reincarnation   Romantic Subplot   Royalty   Second Chance   Tragic Past   Villainess Noble Girls   ",
	"rating": "(4.0 / 5.0, 24 votes)",
	"author": "吾九殿   ",
	"year": "\n2020",
	"ranking": "#2000   #4675   #8819   #9501   #7162   ",
	"reviewcount": "3 Reviews sorted by",
	"description": "Fate cut through my throat like a knife and judged my death to be without a resting place.\r\n\r\n—That was how Adele would describe her past life.\r\n\r\nAs a queen, she ruled the Rolan Empire well, but in the end, she ended up under the guillotine.\r\n\r\nThe moment she was reborn, she learned—\r\n\r\nAfter her death, Roland was torn apart by the struggle for the throne and the glory of the Empire was destroyed. All that was left of her in the history books was the phrase: 'She was a worthy ruler, but a pity it was that she could not resist her fate.'\r\n\r\nBack to the night of the mutiny, the queen sneered at her 'fate'.\r\n\r\nLater—\r\n\r\nThose who betrayed her bowed beneath her throne as if they were possessed.\r\n\r\nOnce a knight who disdained pledging loyalty to her, now one who wished only to fight and die for her sake.\r\n\r\nA hypocritical nobleman personally scoured the lands himself to present her precious jewels.\r\n\r\nThe heresy-hating bishop bows down to her and renounces his faith.\r\n\r\n..\r\n\r\nTo fight for her sake, to write her letters of sweet nothings, and to never forget her even in their deaths.\r\n\r\nA debauched queen on the surface, but with a heart cold as steel on the throne, 'Heh.'\r\n\r\n*\r\n\r\n'You will not find another woman like her. Maddeningly beautiful and filled with ambition, an amorous queen, yet one so cruel.'\r\n\r\n—This is how the imperial history books summed up the life of Adele the Great when they described her.\r\n>"
}