{
	"url": "https://www.novelupdates.com/series/the-actor-and-his-three-and-half-years-old-sister/",
	"title": "The Actor and His Three and Half Years Old Sister - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/10/The-Actor-and-His-Three-and-Half-Years-Old-Sister.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Drama   School Life   Shoujo   Slice of Life   ",
	"tags": "Acting   Appearance Different from Actual Age   Celebrities   Character Growth   Charming Protagonist   Child Protagonist   Childcare   Childhood Friends   Confident Protagonist   Cute Story   Doting Parents   Family Conflict   Female Protagonist   Genius Protagonist   Handsome Male Lead   Modern Day   Modern Knowledge   Romantic Subplot   Showbiz   Siblings   ",
	"rating": "(4.3 / 5.0, 33 votes)",
	"author": "Jiang Yue Nian Nian   江月年年   ",
	"year": "\n2020",
	"ranking": "#2000   #6153   #7099   #7040   #7864   ",
	"reviewcount": "7 Reviews sorted by",
	"description": "The little prodigy Chu Xiao Xiao grew up in a lot of love since childhood but did not know she had an older brother until she was three years old, until one day the whole family watched the Spring Festival Gala. \n\nChu Xiao Xiao: This star can’t sing or dance, how can he still be on the Spring Festival Gala? \n\nFather Chu pointed to the fool in red on TV and introduced: Xiao Xiao, this is your brother. \n\nChu Xiaoxiao:??? \n\nChu Xiaoxiao: My brother made such a big fool of himself at the Spring Festival Gala, how can I hold my head up in front of the kids in the future! \n\n ※ \n\nThe big star Chu Xiao Yi has tens of millions of fans, very popular, but did not know that he suddenly had a sister until one day he finished his work during the Spring Festival Gala. \n\nFather Chu sent a text message: come home when you have time, your sister misses you. \n\nChu Xiaoyi:???? \n\nChu Xiao Yi: I’m busy with work, and haven’t entered the house more than three times. My parents actually gave birth to a second child!? \n\n ※ \n\nIn Chu Xiao Xiao’s opinion, even if Chu Xiao Yi is the idol admired by millions of young girls, he is just an obnoxious brother. In Chu Xiao Yi’s opinion, even if Chu Xiao Xiao is an amazing and intelligent prodigy, she is just an annoying sister.\n\nChu Xiao Xiao, Chu Xiao Yi: In this family, either he (she) dies, or she (he) dies.>"
}