{
	"url": "https://www.novelupdates.com/series/you-are-the-daughter-of-my-first-love/",
	"title": "You Are the Daughter of My First Love - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/10/You-Are-the-Daughter-of-My-First-Love_1635228055.jpg",
	"noveltype": "(JP)",
	"genre": "Comedy   Drama   Romance   Slice of Life   ",
	"tags": "Apartment Life   Beautiful Female Lead   Business Management   Childhood Friends   Childhood Love   Complex Family Relationships   Cosplay   Death of Loved Ones   Dreams   Family Business   Family Conflict   First Love   Hard-Working Protagonist   Living Alone   Loneliness   Love Interest Falls in Love First   Male Protagonist   Management   Part-Time Job   Past Plays a Big Role   Persistent Love Interests   Second Chance   Younger Love Interests   ",
	"rating": "(3.7 / 5.0, 51 votes)",
	"author": "Kimura Kaito   機村械人   ",
	"year": "\n2021",
	"ranking": "#2000   #4208   #5580   #11077   #6662   ",
	"reviewcount": "3 Reviews",
	"description": "The high school girl he rescued closely resembled his first love.\n\nA workaholic who is still reeling from his sorrowful first love and a high school girl who looks like the splitting image of that very person.\n\nThere is no forgiveness. There is no stopping it. His “second” first love starts――.\n\n“I would like to repay you…… if you don’t mind.”\n\nOne night, while living a contented life as a working adult, Ichigo rescues Luna, a high school girl, from a drunkard. This girl looked like two peas in a pod with his first love, Sakura.\n\n“Do you know my mother?”\n\nHe is made aware that Luna is Sakura’s daughter with the news that she has passed away. And then…\n\n“Kugiyama-san, you were the person I’ve always admired in my heart, ──the person of my dreams.”\n\nLuna confesses that she has always had a pang of longing for Ichigo from the memories Sakura had told her about.\n\n“Could you please have me as your lover?”\n\n“Your stories are always so interesting, Ichi.”\n\nIchigo is unable to forgive Luna, as she reminds him so much of the Sakura of those bygone days. He can’t stop it. He fell into first love for the second time.>"
}