{
	"url": "https://www.novelupdates.com/series/the-venerable-monster-tamer/",
	"title": "The Venerable Monster Tamer - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/04/venmonstertamer1.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Fantasy   Harem   Romance   Supernatural   Xuanhuan   ",
	"tags": "Ancient Times   Appearance Changes   Calm Protagonist   Cultivation   Cunning Protagonist   Dao Comprehension   Famous Protagonist   Fast Learner   Hard-Working Protagonist   Heavenly Tribulation   Inheritance   Magic Beasts   Male Protagonist   Manipulative Characters   Monster Tamer   Past Plays a Big Role   Previous Life Talent   Schemes And Conspiracies   Second Chance   Strength-based Social Hierarchy   Time Travel   Weak to Strong   ",
	"rating": "(4.0 / 5.0, 34 votes)",
	"author": "Gu Zhen Ren   蛊真人   ",
	"year": "\n2012",
	"ranking": "#2000   #2000   #7648   #8227   #9091   ",
	"reviewcount": "4 Reviews sorted by",
	"description": "In this magical world, people brought holding bags, raising monster beasts, controlling monster weapons, nurturing monster plants, and taking pride in climbing to the ultimate rank of monster tamers.\n\nRed Owl, Black Crane, Ink Unicorn, Bloody Night Bat, Heavenly Fox, Green Pheasant, Phoenix… countless monsters spread across heaven and earth, lived in mountains and rivers, waiting for you to conquer.\n\nDrunk Snow Blade, Sunflower Needle, Compliant Staff… countless monster weapons were waiting for you to control.\n\nThunder Vine, Ginseng Fruit, Peach Tree… countless monster plants were waiting for you to nurture.\n\nChu Yun was an Explorer. He has discovered a secret, but died an unwilling death. Opening his eyes again, he found that he was returned to 23 years ago.\n\nIt all started again, and he was determined to make up for all his regrets, chase his dreams, and embark on a different path of becoming mighty.\n\nThe lovely Heavenly Fox loli, the beautiful Lamia woman, the pure Lotus Fairy, the innocent Rabbit Demon girl, the sexy Scorpion sister… one by one was added to the harem.\n\nThe Star Sea Dragon Palace, the Abyss of the Sea’s Eye, the Tomb of Ghost King… many Legendary Places were hidden, waiting to be excavated.\n\nThe world’s trend was constantly changing, many heroes appeared… he would witness them one by one, then overcome them one by one!>"
}