{
	"url": "https://www.novelupdates.com/series/a-white-lotus-host-who-does-not-want-to-be-a-white-moonlight-is-not-a-good-host/",
	"title": "A White Lotus Host Who Does Not Want To Be a White Moonlight is Not a Good Host - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/05/notagoodhost1.jpg",
	"noveltype": "(CN)",
	"genre": "Adventure   Comedy   Drama   Fantasy   Romance   Sci-fi   Shounen Ai   Supernatural   Xuanhuan   ",
	"tags": "Ancient China   Black Belly   Caring Protagonist   Cultivation   Cute Protagonist   Dense Protagonist   Dragons   Episodic   Flashbacks   Futuristic Setting   Ghosts   Love Interest Falls in Love First   Misunderstandings   Pill Concocting   Royalty   Seme Protagonist   Strong Love Interests   Sword Wielder   System Administrator   Timid Protagonist   Transmigration   Unrequited Love   Vampires   World Hopping   Zombies   ",
	"rating": "(3.8 / 5.0, 175 votes)",
	"author": "慕韶七   ",
	"year": "\n2018",
	"ranking": "#2384   #3770   #2105   #1841   #2054   ",
	"reviewcount": "38 Reviews sorted by",
	"description": "Bai Lianhua looks just like his namesake, a white lotus.\n\nSo it’s probably inevitable that a system came for him.\n\nSystem: come, my dear host Bai Lianhua, please live up to your name, and with your white lotus aura that is dazzlingly divine, save those antagonists who have led tragic lives and who are to stand against the world in the future.\n\nBai Lianhua: …Wait, it isn’t my fault my name is like that.\n\nBefore, Bai Lianhua thought this would have been the most excruciating thing to happen to his life, until all his missions were completed, and he’s happy and excited to go home. His system which had always been acting cute wipes his face handsomely, and then gives him a mystifying smile, “in fact, my real name is Return System of White Moonlight.”\n\n＃Apparently, white lotus and white moonlight are great as a combo＃\n\nSo, this was actually an all-in-one service featuring white lotus + white moonlight? The missions he thought he had completed were just the preludes to his missions to follow?\n\nAnd so, after having acted as a white lotus waving brilliantly in the wind, Bai Lianhua will have to return to his previous worlds, as that white moonlight that never went away in each of the antagonists’ minds, and resave the world from their clutches.\n\nBai Lianhua: Wait! System, come back! Explain to me why all my missions failed after I left, and why all those guys who I had painstakingly dragged back into the righteous path still went awry!\n\nMr. Antagonist: Hm? What’s the problem? I’m really happy with this——Now I finally have the power to take this white lotus from the pond, and nurture it well within a vase [takes a fresh white●lotus in his hand, playing with it gently]\n\nBai Lianhua: …! [Like the small white lotus, shaking pitifully in the wind]_(:з」∠)_\n\nIf the system lied to you, don’t despair, don’t cry, please stay as quiet as a flower, and be a stretch of pure white moonlight.>"
}