{
	"url": "https://www.novelupdates.com/series/south-wind-knows-my-mood/",
	"title": "South Wind Knows My Mood - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/01/South-Wind-Knows-My-Mood.jpg",
	"noveltype": "(CN)",
	"genre": "Drama   Romance   ",
	"tags": "Adapted to Drama   Disabilities   Female Protagonist   Modern Day   Sickly Characters   Tragic Past   ",
	"rating": "(3.4 / 5.0, 14 votes)",
	"author": "Qi Wei   七微   ",
	"year": "\n2019",
	"ranking": "#2000   #2000   #10105   #12295   #10254   ",
	"reviewcount": "2 Reviews sorted by",
	"description": "The south wind knew my mood and dreamed of Xi Zhou. \n\nI met a man who was like a breeze and bright moon. I didn’t think about anything. I just wanted to love him.\n\nI only wish to be with you, from light to dusk, until our hair is grey.\n\nIn the 18th summer, Gu Ruanruan spent her summer holiday in Muyun county. After swimming, she had saved someone from a car accident. That man is Fu Xizhou, who woke up three days later without any memories. The kind-hearted Ruanruan decided to take care of him. And after one month, she developed feelings for him. But before she could confess, that man had disappeared. \n\nFour years later, she reunited with him in the airport. Over the years, her feelings were still the same, much like aging, they grew even more intensely. After he recovers his memories, he is still him to her, although he was different from the introverted and gentleman in her memory. Yet, she was still obsessed with her love and heartbroken.\n\nShe chased him for half a year, and finally, he proposed to her. She thinks she finally touched his heart. But, he disappeared on their wedding day, making her fall into a dark abyss. When she came closer to him, she found that his world was way more and more complicated than she had imagined.\n\nWhen we were just nineteen, we fell in love, I did everything for him. And naively think, if we give all of our heart, we will get the same back. But life is not that simple like that. Not all feelings will receive equal reward.>"
}