{
	"url": "https://www.novelupdates.com/series/if-you-are-not-red-you-must-inherit-the-family/",
	"title": "If You Are Not Red, You Must Inherit the Family - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/06/20190528120232.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Romance   Yaoi   ",
	"tags": "Acting   Celebrities   Complex Family Relationships   Cute Protagonist   Family Business   Handsome Male Lead   Second Chance   Showbiz   Siblings Not Related by Blood   Singers   Wealthy Characters   ",
	"rating": "(3.8 / 5.0, 44 votes)",
	"author": "Chángshēng Jūn   长生君   ",
	"year": "\n2018",
	"ranking": "#2000   #2000   #6654   #7357   #4937   ",
	"reviewcount": "7 Reviews sorted by",
	"description": "The reborn Chi Feiran swiftly ran to the entertainment world to protect his life. After working one time with Rong Jin, a famous actor, the shipping between them erupted.\n\n“You guys, look at Ranran! He’d never smiled so sweetly as he sang before!” \n\nChi Feiran was dumbstruck, his last mini album was a compilation of sad depressed love songs! It’s all broken-hearted songs with being dumped, being cheated on, being a spare tire, is he supposed to smile when he’s being kept as a spare?! Does that make any sense?!\n\nRong Jin: “...…”\nSo he actually likes me……  \n\nIt’s the first time actor Rong had a gay scandal since he debuted many years ago. The shipping between them became very hyped up. Every day, Chi Feiran saw himself... If not being paid for, he’s being cared for. So many scandals that it’ll need to be put in cargo when shipped out.  \n\nUntil the day when the big internet users exposed who his biological and step-father were……  \n\nThe silence is the most terrifying. \n\nNetizen A lamented, “If he couldn’t make it big he has to go home and succeed the business as a president, so pitiful…”\nNetizen B sobbed, “What’s more pitiful is... He might have to inherit two businesses at once.”\n\nPampered rich young master Shou X Film Emperor Gong who’s outwardly a noble flower but inwardly a narcissistic internet addict with a tendency to over-fantasise. Easy read! Good-feeling plots! Sweet story!>"
}