{
	"url": "https://www.novelupdates.com/series/hen-na-ryu-to-moto-yuusha-party-zatsuyougakari-shintairiku-de-nonbiri-slow-life/",
	"title": "Hen na Ryu to Moto Yuusha Party Zatsuyougakari, Shintairiku de Nonbiri Slow Life - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/03/Hen-na-Ryu-to-Moto-Yuusha-Party-Zatsuyougakari-Shintairiku-de-Nonbiri-Slow-Life.jpg",
	"noveltype": "(JP)",
	"genre": "Adventure   Fantasy   Slice of Life   ",
	"tags": "Beast Companions   Beastkin   Beasts   Calm Protagonist   Demi-Humans   Demon Lord   Demons   Dragons   Fantasy World   Gods   Guilds   Leadership   Magic   Magic Beasts   Magical Space   Magical Technology   Male Protagonist   Mythical Beasts   Pets   ",
	"rating": "(3.7 / 5.0, 32 votes)",
	"author": "Ezo Gingitsune   えぞぎんぎつね   ",
	"year": "\n2020",
	"ranking": "#1691   #2210   #4834   #3855   #6101   ",
	"reviewcount": "2 Reviews sorted by",
	"description": "\r\nThe Demon King was defeated. The world was at peace. And so Adventurers were losing their jobs.\r\nAnd though Theodore was the backbone of the Hero’s party, and worked as a choreman who would take any jobs, he was not immune to this change.\r\n\r\n“I have enough money, so maybe I’ll just live a slow life in the countryside.”\r\n\r\nTheodore thought. But then his old friend the guild master said,\r\n‘Could you join the investigation in the new continent?’ It was a request.\r\n\r\nIf people needed his help, then joining would not be a bad thing.\r\nAnd so Theodore decided to go to the new continent.\r\n\r\n“Kyao?”\r\nOn the way to the new continent, Theodore tamed a large, and strangely shaped young dragon.\r\nAnd with this dragon, he heads to the new continent.\r\n\r\nWith his ‘Appraisal’ skill he is able to see the quality of the soil in an instant, the ‘Crafting’ skill allows him to create a mansion all at once, and the ‘Taming’ skill can even tame a dragon.\r\nWith these cheat-level skills, Theodore’s comfortable slow life on the frontiers begins!\r\n>"
}