{
	"url": "https://www.novelupdates.com/series/princess-consort-is-no-pushover/",
	"title": "Princess Consort Is No Pushover - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/06/This-Prince-Consort-Is-No-Pushover.jpg",
	"noveltype": "(CN)",
	"genre": "Romance   Sci-fi   Shoujo   ",
	"tags": "Ancient China   Beautiful Female Lead   Character Growth   Cold Love Interests   Enemies Become Lovers   Female Protagonist   Handsome Male Lead   Love Rivals   Medical Knowledge   Misunderstandings   Revenge   R*pe   Slow Romance   Transmigration   Weak to Strong   ",
	"rating": "(3.7 / 5.0, 29 votes)",
	"author": "故苏小七   ",
	"year": "\n2019",
	"ranking": "#2000   #3198   #6752   #2537   #9773   ",
	"reviewcount": "5 Reviews sorted by",
	"description": "Yun Ruoyue (30), a general surgeon from the 21st century who died from a car accident and her soul transmigrated back to 1800 years ago in ancient China. Her soul occupied another body with a new entity as Princess Consort Li. \n\nShe is beautiful, kind-hearted and with inborn courageous. She fights for what she believes in and never afraid to stand up for injustice. \n\nThis novel follows the turbulent growth of her in adjusting in her new life and how she fight back including her prince husband, Chu Xuanchen, to take back her rightful place. \n\nChu Xuanchen (23), a prince from the Great Chu dynasty, he is handsome and intelligent, arrogant and domineering, and his biggest weakness that he’s a man of word, just like a typical military man. \n\nHe was forced by the Emperor to marry Yun Rouyue as his princess consort, the daughter of the enemy who killed his parents. In the end, he did marry her even though he didn’t love her. After the marriage, he treated her badly and even marries another woman of his love in order to degrade and humiliate Yun Rouyue. \n\nAt first, he thought that he would be happy after married the woman of his love, Nangong Rou, but he was wrong. Later on, and slowly, he realised the person in his heart was actually Yun Rouyue and has no love feeling to Nangong Rou other than just gratitude because she saved his life two years ago.\n\nApparently, he was too late as Yun Rouyue didn’t love him and wanted a divorce, and the story goes on with how he will woo her back and they stay happily ever after. >"
}