{
	"url": "https://www.novelupdates.com/series/after-participating-in-intern-parents-variety-show-with-movie-empress-mother/",
	"title": "After Participating in Intern Parents Variety Show with Movie Empress Mother - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/04/After-Participating-in-Intern-Parents-Variety-Show-with-Movie-Empress-Mother.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Drama   Slice of Life   ",
	"tags": "Celebrities   Child Protagonist   Childcare   Cute Children   Female Protagonist   Modern Day   Showbiz   ",
	"rating": "(4.1 / 5.0, 15 votes)",
	"author": "Su Shi   溯时   ",
	"year": "\n2022",
	"ranking": "#2000   #2000   #9144   #9698   #10208   ",
	"reviewcount": "5 Reviews sorted by",
	"description": "An An was an abandoned baby who grew up in an orphanage. When she was four years old, she was invited to a variety show called “Intern Parents” as a guest.\n\nThe live broadcast room was full of people every day. It turned out that the actress has zero life skill, had been seeing a psychiatrist, her marriage with her husband was not happy, and she was not a winner in life at all…\n\nEveryone was worried that this messy family will cause harm to the heart of the poor and young girl again.\n\nHowever, An An didn’t know because she was so busy. In her new home, she learned to cook with her mother, taught her father to coax her, and every day she woke up wondering which little princess dress to wear and playing with dolls or stuffed bears… She has never experienced this kind of life before and she was very happy!\n\nAt the end of the 20-day recording time, An An’s eyes were red and she was reluctant to leave. Just when everyone thought that the big star’s career was over, the actress submitted the formalities to the orphanage and officially adopted the child.\n\nThe little dumpling was stunned.\n\nLater, her parents learned that their biological daughter was still alive… Everything that happened back then was a deliberate conspiracy.\n\nAn An, who was suddenly picked up with excitement: even more stunned.\n\n……\n\nLosing her daughter four years ago was the biggest pain in Mo Sui’s heart. Even in her dreams, she never expected that her daughter would come back to her side.\n\nThis time, no matter what, she and her husband would protect An An well.>"
}