{
	"url": "https://www.novelupdates.com/series/side-character-transmigrations-the-final-boss-is-no-joke/",
	"title": "Side Character Transmigrations: The Final Boss is No Joke - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2018/06/Side-Character-Transmigrations-The-Final-Boss-is-No-Joke.png",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Comedy   Fantasy   Martial Arts   Mature   Mystery   Romance   Sci-fi   Supernatural   ",
	"tags": "Acting   Appearance Changes   Arrogant Characters   Artificial Intelligence   Artists   Beautiful Female Lead   Bloodlines   Broken Engagement   Celebrities   Cheats   Chuunibyou   Clever Protagonist   Cross-dressing   Cultivation   Cunning Protagonist   Demons   Devoted Love Interests   Doting Love Interests   Episodic   Famous Protagonist   Female Protagonist   Gods   Hackers   Handsome Male Lead   Hated Protagonist   Hiding True Identity   Immortals   Love Interest Falls in Love First   Magical Space   Male Yandere   Marriage   Mob Protagonist   Models   Modern Day   Modern Knowledge   Multiple Personalities   Multiple Realms   Mysterious Past   Outer Space   Overpowered Protagonist   Possessive Characters   Power Couple   Proactive Protagonist   Protagonist Strong from the Start   Reverse R*pe   Ruthless Protagonist   Schemes And Conspiracies   Selfish Protagonist   Shameless Protagonist   Showbiz   Slow Romance   System Administrator   Time Skip   Transmigration   Tsundere   Unconditional Love   Virtual Reality   World Hopping   Zombies   ",
	"rating": "(4.4 / 5.0, 1102 votes)",
	"author": "Mo Ling   墨泠   ",
	"year": "\n2016",
	"ranking": "#616   #2041   #100   #995   #175   ",
	"reviewcount": "135 Reviews sorted by",
	"description": "System: Host, what is that thing in the sky?\n\nShi Sheng: An intergalactic spaceship.\n\nSystem: …This is a cultivation world, where did an intergalactic spaceship come from?!\n\n—\n\nSystem: Host, what are you holding in your hand?\n\nShi Sheng: Xuanyuan Sword.\n\nSystem: This is an advanced scientific world, where did an ancient divine sword come from?! Wait a moment… Host what are you doing?!\n\nShi Sheng: Breaking apart the main couple.\n\n#MyHostIsTooPowerfulAndLikesToBreakShips.\n\nNote : ‘shipping’ is the term people use when they want two people to be a couple.>"
}