{
	"url": "https://www.novelupdates.com/series/im-not-doing-this-with-a-friend/",
	"title": "I’m Not Doing This With A Friend - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/02/Im-Not-Doing-This-With-A-Friend.jpg",
	"noveltype": "(KR)",
	"genre": "Comedy   Drama   Fantasy   Romance   ",
	"tags": "Academy   Aristocracy   Beautiful Female Lead   Bickering Couple   Calm Protagonist   Charming Protagonist   Clingy Lover   Clubs   Clumsy Love Interests   Cute Story   Devoted Love Interests   Different Social Status   Enemies Become Lovers   European Ambience   Female Protagonist   Friendship   Handsome Male Lead   Heartwarming   Love at First Sight   Love Interest Falls in Love First   Multiple POV   Nobles   Persistent Love Interests   Playful Protagonist   Possessive Characters   Power Couple   Quirky Characters   Shameless Protagonist   Shy Characters   Strong Love Interests   Sword And Magic   Tomboyish Female Lead   Tsundere   ",
	"rating": "(3.9 / 5.0, 103 votes)",
	"author": "Jahwa   쟈화   ",
	"year": "\n2021",
	"ranking": "#3710   #4739   #3279   #6882   #2436   ",
	"reviewcount": "7 Reviews sorted by",
	"description": "She enticed the successor to the Duke of Lisianthus.\n\nHe sneakily grabbed my hand. \n\nI sighed and twisted my hand out of his grip. “We can’t do this as friends.”\n\n“Are you ashamed of holding my hand even once, Leen?”\n\nNo matter how much I think about what Carsion said, with his face showing ‘I barely held one hand’, it doesn’t seem that way.\n\n“I can do more with you, Leen.”\n\nThose words seemed to ring in my head, but the blue pupils were headed in a different direction - you can’t even look me in the eye. I mean, it’s not convincing to say those kind of words with such a shy face, you punk.\n\n* * * * *\n\nThe Duchess took something out from the purse in her arms.\n\n“Do you need money? Then take this money and break up with Carsion; take it without hard feelings.”\n\nI stared silently into the thick pockets that the Duchess gave. Then I tapped my chin and gave her a serious look. “We’re not dating, we’re friends. Do you want me to cut off my friendship with Carsion from today?”\n\nWill the Duchess get up from her seat, trembling and slap my face? Or are you going to spray water on me?\n\n“Pass!”\n\n“Ye-yes?” My face slowly blushed with embarrassment. What’s with her unexpected reaction.>"
}