{
	"url": "https://www.novelupdates.com/series/coiling-dragon/",
	"title": "Coiling Dragon - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2016/03/s4437529.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Fantasy   Martial Arts   Seinen   Xuanhuan   ",
	"tags": "Academy   Adapted to Anime   Adapted to Manhua   Alchemy   Angels   Artifacts   Beast Companions   Beautiful Female Lead   Betrayal   Bloodlines   Body Tempering   Calm Protagonist   Cautious Protagonist   Character Growth   Clan Building   Cold Protagonist   Cultivation   Dao Comprehension   Death of Loved Ones   Devoted Love Interests   Dragons   Elemental Magic   Evil Religions   Fast Cultivation   Genius Protagonist   Godly Powers   Gods   Hard-Working Protagonist   Late Romance   Legends   Lucky Protagonist   Magic   Male Protagonist   Marriage   Monsters   Multiple Realms   Mysterious Past   Mythical Beasts   Politics   Pregnancy   Protagonist with Multiple Bodies   Revenge   Sculptors   Souls   Spirit Advisor   Sword Wielder   Time Skip   Transformation Ability   Wars   Weak to Strong   World Travel   ",
	"rating": "(4.5 / 5.0, 1846 votes)",
	"author": "I Eat Tomatoes   Wo Chi Xi Hong Shi   我吃西红柿   ",
	"year": "\n2008\r\n",
	"ranking": "#5262   #4824   #868   #13810   #111   ",
	"reviewcount": "174 Reviews sorted by",
	"description": "Empires rise and fall on the Yulan Continent. Saints, immortal beings of unimaginable power, battle using spells and swords, leaving swathes of destruction in their wake. Magical beasts rule the mountains, where the brave – or the foolish – go to test their strength. Even the mighty can fall, feasted on by those stronger. The strong live like royalty; the weak strive to survive another day.\n\nThis is the world which Linley is born into. Raised in the small town of Wushan, Linley is a scion of the Baruch clan, the clan of the once-legendary Dragonblood Warriors. Their fame once shook the world, but the clan is now so decrepit that even the heirlooms of the clan have been sold off. Tasked with reclaiming the lost glory of his clan, Linley will go through countless trials and tribulations, making powerful friends but also deadly enemies.\n\nCome witness a new legend in the making. The legend of Linley Baruch!>"
}