{
	"url": "https://www.novelupdates.com/series/dont-pretend-to-be-poor-with-me/",
	"title": "Don’t Pretend to be Poor with Me - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/02/Dont-Pretend-to-be-Poor-with-Me.jpeg",
	"noveltype": "(CN)",
	"genre": "Romance   School Life   Shounen Ai   ",
	"tags": "Abandoned Children   Absent Parents   Abusive Characters   Bickering Couple   Bullying   Cold Protagonist   Doting Love Interests   Heartwarming   Love at First Sight   Love Interest Falls in Love First   Misunderstandings   Past Trauma   Power Couple   Protagonist Strong from the Start   Shameless Protagonist   Smart Couple   Strong Love Interests   Tsundere   Wealthy Characters   ",
	"rating": "(4.1 / 5.0, 46 votes)",
	"author": "Lin Qinian   林七年   ",
	"year": "\n2021",
	"ranking": "#1969   #1656   #5280   #6107   #4698   ",
	"reviewcount": "11 Reviews sorted by",
	"description": "The first day Song Yan transferred to his new school, he met his new roommate being blocked by gangsters in an alley asking to pay up a debt.\r\n\r\nThe stick in the new roommate’s hands fell, and the little gangster fled in defeat, but didn’t forget to yell in anger while running:\r\n\r\n“Look at your little white face, if you find a wealthy woman and get rich, how can you still be afraid to pay up!”\r\n\r\nThe new roommate looked on in approval, and seemed to have realized the light: “Makes sense.”\r\n\r\nSong Yan: “......” What kind of nonsense.\r\n\r\nSo to block his new roommate from going astray, Song Yan began the road to ruin of targeted poverty alleviation for pure and beautiful male high school students.\r\n\r\nNo money to buy dinner, so he treated him. No money for book expenses, so he sponsored it. No money for a scarf, so he took advantage of the buy one get one promotion from the store in front of the school to send him a scarf.\r\n\r\nThe eldest young master Song who already had his expenses cut off by his family had no choice but to learn to be thrifty and hardworking.\r\n\r\nLater, his dad brought him to attend a dinner banquet: “Come, Xiao Yan, let me introduce you to grandpa Xia’s grandson, Xia Zhiye.”\r\n\r\nSong Yan looked at the boy in front of him wearing a custom-made suit, with the worn out scarf that he dredged out from the buy one get one promotion in front of the school wrapped around his neck, and expressionlessly raised up a knife.\r\n\r\nThat night, in some male high school’s dorm room came the yell of domestic violence: “Fuck off, don’t pretend to be poor with me!”\r\n\r\nHowever the target of the domestic violence patiently coaxed him: “I didn’t pretend to be poor, I’m really poor. But later on I’ll be very rich, and I’ll even give it to my boyfriend to manage, so how about you consider it again?”>"
}