{
	"url": "https://www.novelupdates.com/series/mr-melancholy-wants-to-live-a-peaceful-life/",
	"title": "Mr. Melancholy Wants to Live a Peaceful Life - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/08/melancholy.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Comedy   Fantasy   Romance   Shounen Ai   Supernatural   ",
	"tags": "Ability Steal   Adapted to Manhua   Assassins   Black Belly   Calm Protagonist   Caring Protagonist   Cautious Protagonist   Clever Protagonist   Devoted Love Interests   Doting Love Interests   Enemies Become Allies   First Love   Handsome Male Lead   Hidden Abilities   Hiding True Abilities   Love at First Sight   Loyal Subordinates   Manipulative Characters   Manly Gay Couple   Marriage   Misunderstandings   Modern Day   Multiple POV   Overpowered Protagonist   Possessive Characters   Power Couple   Protagonist Strong from the Start   Saving the World   Sealed Power   Secret Identity   Secrets   Seme Protagonist   Smart Couple   Special Abilities   Strategist   Strong Love Interests   Transmigration   Unconditional Love   Wealthy Characters   Younger Love Interests   ",
	"rating": "(4.6 / 5.0, 494 votes)",
	"author": "Cyan Wings   Qing Se Yu Yi   青色羽翼   ",
	"year": "\n2020",
	"ranking": "#2182   #4750   #1353   #297   #690   ",
	"reviewcount": "106 Reviews sorted by",
	"description": "Yu Hua loses his job, and the weight of the household falls on the shoulders of his partner, You Zhengping. \n\nHis husband is a temporary employee at the subdistrict office, with a monthly salary of only 2500; this troubles Yu Hua exceedingly.\n\n\n\nYou Zhengping is secretly engaged in the work of protecting the world from Destroyers, with a rather liberal subsidy. \n\nYou Zhengping spends all day fretting: how can he tell Yu Hua that he has a few million in private savings without giving anything away? \n\n\n\nRight up until the day that You Zhengping receives a notice that a power great enough to destroy the world has appeared in his home. \n\nWorried that something will happen to Yu Hua, an ordinary person, You Zhengping hurries home with his team. Once through the door, he sees a peaceful home, Yu Hua wearing an apron, a lifted frying pan in his hand, and a fish, golden on both sides and its aroma wafting around, frying in the pan. \n\nSeeing You Zhengping, Yu Hua puts the frying pan on the switched-off electric stove and wipes his hands on his apron. “I wanted to save on the electricity bill.” \n\nYou Zhengping: …\n\nThe entire world’s most awesome Destroyer is his husband. >"
}