{
	"url": "https://www.novelupdates.com/series/after-becoming-the-alpha-protagonist-i-snatched-the-cannon-fodder-omega/",
	"title": "After Becoming the Alpha Protagonist, I Snatched the Cannon Fodder Omega - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/03/After-Becoming-the-Alpha-Protagonist-I-Snatched-the-Cannon-Fodder-Omega.jpg",
	"noveltype": "(CN)",
	"genre": "Mecha   Romance   School Life   Sci-fi   Yaoi   ",
	"tags": "Arranged Marriage   Child Abuse   Clever Protagonist   Cold Love Interests   Cooking   Doting Love Interests   Futuristic Setting   Omegaverse   Protagonist Falls in Love First   Protagonist Strong from the Start   Seme Protagonist   Shameless Protagonist   Transmigration   Wealthy Characters   ",
	"rating": "(3.8 / 5.0, 72 votes)",
	"author": "草莓坨坨   ",
	"year": "\n2020",
	"ranking": "#655   #623   #3365   #721   #4033   ",
	"reviewcount": "17 Reviews sorted by",
	"description": "The thick-skinned Qiu Zhenyang just transmigrated, and became the crazy, cool alpha protagonist gong in an interstellar ABO campus story.\n\nHe silently looked at the young man glaring at him with misty eyes. This young man was the cannon fodder omega the original owner had recently broken the marriage contract with, and the overflowing pheromones from his body indicated he was about to enter estrus.\n\nDo or not do?\n\nThis is a question worth thinking about…\n\nTransmigrating into the young master of the Federation’s Chief Legion, the First Consortium, and a Pharmacy Family, Qiu Zhenyang has whatever he wants. Whoever is not pleasing to the eye, he can deal with.\n\nOn his first day in the Interstellar Academy, facing the confession of the omega school flower: Sorry, you aren’t my type.\n\nInadvertently, hero saves beauty. Facing the protagonist shou in the original text: Go away, I don’t drink green tea.\n\nBesieged at home, facing the pursuit of the coquettish childhood sweetheart: Why are you wearing such showy clothes?\n\nQiu Zhenyang’s pheromone tastes like sunshine, and his personality is like a little sun. But only when facing Ling Mu, the cannon fodder covered in thorns, did heart soften again and again. His affection grew stronger, and he loved him uncontrollably.\n\nAfter the marriage contract with the Qiu family’s young master was called off, Ling Mu’s difficult life became even worse.\n\nBut, just over a month later, he had an affair with the young master, and was even temporarily marked!\n\nThat bastard!\n\nQiu Zhenyang, who temporarily marked him: “I will be responsible for you!”\n\nLing Mu: “Shut up, go away!”\n\nQiu Zhenyang, who officially introduced Ling Mu to his friends: “This is my wife!”\n\nLing Mu: “What wife, go away!”\n\nQiu Zhenyang, who had just rejected the protagonist’s confession: “Oh, are you jealous?”\n\nLing Mu: “F*ck, go away!”\n\nQiu Zhenyang: “Are you serious? Then… Xiao Mumu, let’s do something harmonious?”\n\nLing Mu: “…”\n\nAfter a few seconds, Qiu Zhenyang: “Ow! Wife, your fists are so powerful!”\n\nMy pheromone is sunshine, your pheromone is sunflower, we are born to fit together.>"
}