{
	"url": "https://www.novelupdates.com/series/dont-cry/",
	"title": "Don’t Cry - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/10/dont-cry-2.jpg",
	"noveltype": "(CN)",
	"genre": "Drama   Romance   ",
	"tags": "Absent Parents   Adapted to Manhua   Amnesia   Beautiful Female Lead   Blind Protagonist   Cute Protagonist   Cute Story   Devoted Love Interests   Disabilities   Doting Love Interests   Family Conflict   Female Protagonist   First Love   Handsome Male Lead   Living Alone   Modern Day   Naive Protagonist   Older Love Interests   Popular Love Interests   Sharp-tongued Characters   Tragic Past   ",
	"rating": "(4.5 / 5.0, 72 votes)",
	"author": "Qū Xiǎo Qū   Small Song Cricket   曲小蛐   ",
	"year": "\n2020",
	"ranking": "#624   #470   #4587   #7727   #3510   ",
	"reviewcount": "9 Reviews sorted by",
	"description": "The Tang family had two daughters.\n\nOutsiders have only heard that the eldest daughter, Tang Luoqian, was beautiful and would be engaged to Luo Zhan, the young master of the Luo family, in the future and everyone envied her.\n\nFew people knew that the Tang family has a youngest daughter who was blind, named Tang Ran.\n\nTang Ran’s sixteenth birthday present was a robot.\n\nOn the day the robot arrived, the whole family was in the front hall with her sister Tang Luoqian, preparing to welcome Luo Zhan, who was visiting for the first time. Tang Ran was alone in the side house, fumbling to see her robot.\n\nStanding in the chaotic darkness, Luo Zhan spoke after a long time.\n\n“Good evening, Master.”\n\nWith a good family background, a calamity-bringing face, and a top mind, Luo Zhan was the dream lover of countless girls in the AI field, but no one could stand next to him.\n\nThere was only one reason: Luo Zhan liked beautiful eyes.\n\nLater on, Luo Zhan made a bet with his older brother to imitate a robot for the little blind girl from the Tang family.\n\n—He never thought that he would fall for the little blind girl.\n\nAnd then it spread that Luo Zhan had been beaten with the family rod by the old man of the Luo family in order to reject his engagement to Tang Luoqian, without uttering a single word.\n\nEveryone was guessing who it was for.\n\nA week later, for the first time, the Tang family threw a birthday banquet for Tang Ran, whose eyes had recovered. After the banquet, the little girl drank too much and hugged the stone pillar in the banquet hall, whispering that she wanted to see Luo Zhan.\n\nThe bystanders mocked when they heard, “The young master of the Luo family doesn’t even consider Tang Luoqian. She’s just a half-blind girl who thinks she can see him just because she wants to?”\n\nBefore finishing his sentence, Luo Zhan ran in from outside in a wretched state.\n\nThe young master of the Luo family, who was usually in high spirits, panicked and fell to his knees, at a loss to kiss the girl’s trembling eyes…\n\n“Don’t cry.”\n\n“Will you marry me, Ranran?”>"
}