{
	"url": "https://www.novelupdates.com/series/the-hero-is-crazy-about-me/",
	"title": "The Hero is Crazy About Me! - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/05/The-Hero-is-Crazy-About-Me.jpg",
	"noveltype": "(KR)",
	"genre": "Adult   Fantasy   Mature   Romance   Smut   ",
	"tags": "Arranged Marriage   Beautiful Female Lead   Contracts   Curses   European Ambience   Female Protagonist   First-time Interc**rse   Handsome Male Lead   Love Interest Falls in Love First   Magic   Male Yandere   Marriage of Convenience   Misunderstandings   Nobles   R-18   Reincarnated in Another World   Spirit Users   Time Travel   Villainess Noble Girls   Werebeasts   ",
	"rating": "(3.6 / 5.0, 20 votes)",
	"author": "금귀   ",
	"year": "\nN/A",
	"ranking": "#1888   #2356   #6340   #1050   #6219   ",
	"reviewcount": "2 Reviews sorted by",
	"description": "“From the moment I took a breath and opened my eyes, I wondered where I was. But then, I was clear on what world I was in after hearing a familiar name.\r\n\r\nI was reborn as the villainess, Frisia Atreille, from a novel I read before I died, called “I’ll Leave it to You.”\r\n\r\nTo escape from my fate in the original work, I initiated my contract marriage with him three years ago.\r\nA month before our contract marriage breaks off, Aslei is cursed.\r\n\r\n“I can endure it. If it becomes unmanageable, I’ll call the magician……!”\r\n“It’s alright.”\r\n\r\nAfter sleeping with him, I feel dejected and melancholy and avoid him. But eventually, Aslei boldly approaches me and makes a startling admission:\r\n\r\n“Frisia. It is my fault and due to my insensibility that I did not confess before we slept together last night.”\r\n\r\nDo you really like me? Isn’t that impossible?\r\nAfter his confession, my heart pounds for no reason, but I can’t believe him because I know the original story.\r\n\r\n‘If Aslei gets better and I remain as the Duchess…….’\r\n\r\nCan I do that?\r\n\r\nI fear some horrifying conspiracy will unfold, and I will be discarded.>"
}