{
	"url": "https://www.novelupdates.com/series/ive-became-able-to-do-anything-with-my-growth-cheat-but-i-cant-seem-to-get-out-of-being-jobless/",
	"title": "I’ve Became Able to Do Anything with My Growth Cheat, but I Can’t Seem to Get out of Being Jobless - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2016/07/nojob-1.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Comedy   Ecchi   Fantasy   Harem   Romance   Seinen   ",
	"tags": "Accelerated Growth   Adapted to Manga   Animal Characteristics   Automatons   Beastkin   Brother Complex   Cheats   Demi-Humans   Demon Lord   Demons   Dragons   Dungeons   Fantasy World   First-time Interc**rse   Game Elements   Goddesses   Hidden Abilities   Hikikomori   Homunculus   Human-Nonhuman Relationship   Jobless Class   Level System   Lucky Protagonist   Magical Space   Male Protagonist   Master-Servant Relationship   Misunderstandings   Monsters   Multiple Reincarnated Individuals   Nobles   Overpowered Protagonist   Polygamy   R-15   S*ave Harem   S*aves   Special Abilities   Spirits   Sword And Magic   Transported to Another World   Weak to Strong   Yandere   Younger Sisters   ",
	"rating": "(3.8 / 5.0, 818 votes)",
	"author": "Yousuke Tokino   時野洋輔   ",
	"year": "\n2015",
	"ranking": "#1563   #226   #52   #197   #29   ",
	"reviewcount": "62 Reviews sorted by",
	"description": "I, Ichinosuke, failed to get a job for 100 consecutive times. Furthermore, my record is still being updated as unemployed.\n\nOn my way to a job interview, I was involved in an accident with a truck and tragically passed away.\n\nAnd then, a Goddess bestowed upon me the ability to grow at a speed 400 times faster than normal, before sending me to a game-like otherworld.\n\nHowever, knowing that I would not become stronger even if I continued growing while jobless, I aimed to get a job, but I found out that it was my terrible fate to remain jobless.\n\nAs my Growth Cheat and Jobless Cheat existed side-by-side in this otherworld, an adventure record, no doubt certified by the job-placement agency as a harmful book, begins here.>"
}