{
	"url": "https://www.novelupdates.com/series/i-cant-live-if-it-gets-out-that-im-actually-just-a-shady-high-school-boy-who-is-a-handsome-prince-like-waiter-at-a-cafe-popular-with-high-school-girls-i-dont-want-to-stand-out-too-much-so-i/",
	"title": "I Can’t Live if It Gets Out That I’m Actually Just a Shady High School Boy Who Is a Handsome, Prince-like Waiter at a Café Popular With High School Girls – I Don’t Want To Stand Out Too Much, so I Refuse To Be a Handsome High School Boy - Novel Updates",
	"image": "https://www.novelupdates.com/img/noimagefound.jpg",
	"noveltype": "(JP)",
	"genre": "Comedy   Romance   School Life   Slice of Life   ",
	"tags": "Beautiful Female Lead   Charming Protagonist   Hiding True Identity   Male Protagonist   Older Love Interests   ",
	"rating": "(4.0 / 5.0, 3 votes)",
	"author": "Astlia   ",
	"year": "\n2022",
	"ranking": "#2000   #1322   #13177   #8229   #12918   ",
	"reviewcount": "No Reviews",
	"description": "First-year high school student Hiiragi Makoto is just a shady high school boy who can be found anywhere at school. After school, he has a secret face as ‘Alma’, aka the handsome prince-like clerk at the coffee shop.\n\nHiiragi Makoto thought that his identity would never be discovered. This is because the coffee shop where Hiiragi Makoto works is located somewhat far from his home, and students from the same school rarely come to the coffee shop. Besides, he rarely speaks at school, so he would not be recognised by his voice.\n\nHowever, Hiiragi Makoto had a purpose for working part-time. For some reason, Hiiragi Makoto had a bad relationship with his family and had always wanted to live on his own. After a year of working part-time, he was finally allowed to live on his own with the help of his grandmother, but at the same time he had to transfer to a new school, which was the nearest high school to the coffee shop.\n\nA familiar customer here, a familiar customer there. And a girl that I met the other day when she was alone in the park and brought her to the shop, turned out to be the most beautiful girl in this school.\n\nOh no. If they find out that ‘Alma’ is just me, a shady high school boy, I won’t be able to live socially, let alone in school anymore!\n\n*This story is fictional.>"
}