{
	"url": "https://www.novelupdates.com/series/is-it-tough-being-a-friend/",
	"title": "Is it Tough Being a Friend? - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/04/isittoughv1a.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Comedy   Ecchi   Fantasy   Harem   School Life   Supernatural   ",
	"tags": "Absent Parents   Acting   Adapted to Manga   Average-looking Protagonist   Clingy Lover   Contracts   Cross-dressing   Demons   Determined Protagonist   Devoted Love Interests   Different Social Status   Doting Love Interests   Evil Gods   Evil Organizations   Friendship   Hard-Working Protagonist   Hidden Abilities   Hiding True Abilities   Identity Crisis   Love Interest Falls in Love First   Male Protagonist   Misunderstandings   Mob Protagonist   Modern Day   Monsters   Multiple Identities   Multiple POV   Mysterious Family Background   Mysterious Past   Obsessive Love   Older Love Interests   Overpowered Protagonist   Persistent Love Interests   Possession   Possessive Characters   Protagonist Strong from the Start   Secret Identity   Secret Organizations   Secretive Protagonist   Secrets   Tomboyish Female Lead   Underestimated Protagonist   ",
	"rating": "(3.7 / 5.0, 328 votes)",
	"author": "Yasushi Date   ",
	"year": "\n2016",
	"ranking": "#6970   #6145   #671   #2336   #910   ",
	"reviewcount": "38 Reviews sorted by",
	"description": "I’ve encountered my ideal protagonist!\r\n\r\nIt’s my friend, Hinomori Ryuuga. We’ve become the closest of friends after entering high school.\r\n\r\nMy first impression of Ryuuga was “This is the kind of protagonist you’d see in something like an anime.” Then, that thought soon changed into conviction.\r\n\r\nFirst of all, this guy almost never talks about his past. Also, he frequently slips out of class. As soon as he comes back, he gets extremely tired, blood comes out from his lips, the sleeves and cuffs of his uniform get torn, and so forth.\r\n\r\nFurthermore, there’s always beauties that are surrounding Ryuuga. The one who’s like an idol within the school, Yukimiya Shiori. The cool expert of the sword, Aogasaki Rei. The mysterious transfer student, Elmira McCartney. It’s very tiring for me when these people appear in front of Ryuuga. I have to frantically make a fuss by saying things like “H, hey Ryuga! How did you get acquainted with Yukimiya!”, “W, why did the beautiful swordswoman Aogasaki come to the classroom to specifically meet Ryuga?!”, or “E, E, Elmira! What is it that you see in Ryuga!”\r\n\r\n…So why am I doing this? That’s because I, Kobayashi Ichirou, am a pro at being a friend.\r\n\r\nMy life’s calling is to support Hinomori Ryuuga, the protagonist amongst protagonists, as a close friend character.\r\n\r\n―Let the curtains open for the rom-com presented by co-starring best friend, Kobayashi Ichirou!>"
}