{
	"url": "https://www.novelupdates.com/series/living-as-the-villainess-queen/",
	"title": "Living As the Villainess Queen - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/08/89158493.jpg",
	"noveltype": "(KR)",
	"genre": "Adult   Drama   Fantasy   Romance   Smut   ",
	"tags": "Aristocracy   Arranged Marriage   Beast Companions   Beautiful Female Lead   Betrayal   Calm Protagonist   Character Growth   Charming Protagonist   Contracts   Couple Growth   Cruel Characters   Cute Children   Determined Protagonist   Devoted Love Interests   Divorce   Dragons   Enemies Become Lovers   Fantasy Creatures   Fantasy World   Fast Learner   Fated Lovers   Female Protagonist   First Love   First-time Interc**rse   Handsome Male Lead   Hidden Abilities   Hiding True Identity   Jealousy   Kingdoms   Love Interest Falls in Love First   Lovers Reunited   Magic Beasts   Male Yandere   Marriage   Marriage of Convenience   Misunderstandings   Monster Tamer   Monsters   Multiple POV   Nobles   Obsessive Love   Outdoor Interc**rse   Parallel Worlds   Personality Changes   Possession   Possessive Characters   Power Couple   Pragmatic Protagonist   Pregnancy   Pretend Lovers   R-18   Reincarnated in Another World   Royalty   Second Chance   Shameless Protagonist   Special Abilities   Strong Love Interests   Time Skip   Tragic Past   Transmigration   Villainess Noble Girls   Weak to Strong   ",
	"rating": "(4.5 / 5.0, 578 votes)",
	"author": "Covering The Sky   하늘가리기   ",
	"year": "\n2019",
	"ranking": "#164   #1577   #443   #428   #126   ",
	"reviewcount": "90 Reviews sorted by",
	"description": "‘I want to travel to a place unknown to the many…’\r\n\r\nIt was a passing wish to the weary and tired Eugene and she’d not think it’d ever come to pass… but it did.\r\n\r\nShe opened her eyes and found she was sent to a novel-like world she wrote in passing and became Jin Anika, the scorned queen notorious for her ruthlessness and undeserving of her status.\r\n\r\nQueen Jin only sought and desired to see the destruction of this world — the villainess who met her untimely and miserable end at the hands of her husband, Kasser, the reigning king of the Fourth Kingdom.\r\n\r\nWhile struggling to survive in the unknown world, King Kasser visited Eugene and demanded that a contract be fulfilled and come to fruition.\r\n\r\n“Three years ago, we made a deal.”\r\n\r\nIt turns out the Queen was under a contractual marriage with King Kasser. The ultimate price? To bear him a child.\r\n\r\n“A… a child?”\r\n\r\n“Yes, my successor.”>"
}