{
	"url": "https://www.novelupdates.com/series/shuras-wrath/",
	"title": "Shura’s Wrath - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2015/07/shurawrath.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Drama   Fantasy   Harem   Mature   Romance   Sci-fi   Seinen   Tragedy   ",
	"tags": "Aliens   Assassins   Beast Companions   Beautiful Female Lead   Betrayal   Corruption   Death of Loved Ones   Determined Protagonist   Drugs   Dwarfs   Early Romance   Elves   F*llatio   Futuristic Setting   Game Ranking System   Goddesses   Gods   Guilds   Handsome Male Lead   Hiding True Identity   Hot-blooded Protagonist   Human Experimentation   Level System   Loli   Loyal Subordinates   Lucky Protagonist   Male Protagonist   Mind Control   MMORPG   Monsters   Mysterious Past   Nationalism   Overpowered Protagonist   Past Plays a Big Role   Perverted Protagonist   Pets   Polygamy   Protagonist Strong from the Start   Psychic Powers   Racism   R*pe Victim Becomes Lover   R*pe   Ruthless Protagonist   Sealed Power   Siblings Not Related by Blood   Special Abilities   Spirit Advisor   Strong to Stronger   Sword And Magic   Terminal Illness   Threesome   Tragic Past   Unreliable Narrator   Virtual Reality   ",
	"rating": "(3.8 / 5.0, 1186 votes)",
	"author": "Mars Gravity   火星引力   ",
	"year": "\n2014",
	"ranking": "#2917   #6168   #68   #569   #238   ",
	"reviewcount": "142 Reviews sorted by",
	"description": "The mysterious boy Ling Chen is saved by a little girl as he lay on the street dying. Years later, he strikes a deal to save this savior-turned sister and enters the virtual world. In a future Earth where advanced warfare has forced nations to settle issues virtually or else suffer the consequences, Ling Chen bursts into the scene and goes from unknown to legend. Yet all is not as it seems, for Ling Chen has a dark past, and there is a greater mystery at hand behind this virtual world.\n\nTo save his terminally ill little sister, Ling Chen enters the newly released virtual game world and joins a small gaming studio comprising entirely of women. From now on walking upon his path towards the pinnacle. An ancient, evil item almost forgotten by history, the “Lunar Scourge” helps forge his unsurpassable legend, and causes him to unknowingly step upon a path that is destined to be punished by the heavens, the way of the Shura.>"
}