{
	"url": "https://www.novelupdates.com/series/broken-bonds/",
	"title": "Broken Bonds - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/12/1607512562364.jpg",
	"noveltype": "(CN)",
	"genre": "Drama   Martial Arts   Mature   Romance   Smut   Xuanhuan   Yaoi   ",
	"tags": "Adultery   Affair   Ancient China   Boss-Subordinate Relationship   Cheats   Childcare   Drugs   Handsome Male Lead   Kidnappings   Misunderstandings   Mpreg   Power Struggle   Pregnancy   Protagonist Falls in Love First   R*pe Victim Becomes Lover   R*pe   Secrets   Sickly Characters   Wars   ",
	"rating": "(3.0 / 5.0, 122 votes)",
	"author": "Shi Shi   十世   ",
	"year": "\n2006",
	"ranking": "#1288   #4812   #3201   #3281   #4498   ",
	"reviewcount": "31 Reviews sorted by",
	"description": "Beitang Ao, Master of the Four Heavenly Sect’s Northern Sect, Ming Dynasty nobleman and inheritor of the title “King of Beitang” (Ruler of Beitang). He was elegant and cool as snow; but within his body, a peerless martial skill was contained.\r\n\r\nYan Feili, General of the Northern Sect, in his need to seek vengeance on behalf of a benefactor, met Beitang Ao and after being subdued, pledged his allegiance to the Northern Sect.\r\n\r\nFor eight years, Yan Feili held feelings for Beitang Ao. In the beginning, it was no more than a God-like reverence but gradually, it became a greed fueled admiration.\r\n\r\nFollowing the incident in the Demon Forest, Yan Feili soon discovered he was pregnant. It turned out that Yan Feili was, to his surprise, a descendant of the “Moye” tribe. He kept his pregnancy hidden until the child could be born, but soon afterwards, was sent off by Beitang Ao, beginning the dispute between the two.\r\n\r\nWhen all is said and done, how will these “entangled emotions” be “resolved”?\r\n\r\nEntangled emotion: or deep seated emotions (literal translation: Complex), is a call back to the “情结” in novel’s name.\r\n\r\nresolved: another call back to the title as the word “了断” can also mean to break/end.>"
}