{
	"url": "https://www.novelupdates.com/series/mob-sore-mo-waki-mob-no-hazu-nan-desu-kedo/",
	"title": "Mob… Sore mo Waki Mob no Hazu Nan Desu Kedo!? - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2017/10/510S3suHCML.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Comedy   Fantasy   Harem   Shounen Ai   Slice of Life   Yaoi   ",
	"tags": "Cheats   Dense Protagonist   Familiars   Master-Servant Relationship   Mob Protagonist   Politics   Reincarnated in Another World   Shota   S*ave Harem   Younger Love Interests   ",
	"rating": "(3.8 / 5.0, 208 votes)",
	"author": "Bannbu   ",
	"year": "\n2016",
	"ranking": "#2000   #2000   #1727   #1840   #1494   ",
	"reviewcount": "20 Reviews sorted by",
	"description": "Afflicted with an illness at 25, my life should have ended when I was 26 years old. However, when I came to, I had become a 6 year old boy. Not only did I have my past memories, I also retained the memories of my current body that I shouldn’t have. Recognizing the six years of memories, I recalled immediately.  \n\nThe world I had awakened in was a world I’d read about in a shoujo manga in my previous life. It seems I’m on a parallel world trip ….. No, I have reincarnated. \n\nAt the same time as I recognized this world from the shoujo manga, I remembered my status. \n\nIn the story, I was the subordinate of a stalking horse who fell in love with the heroine. To compete for the hand of the heroine, by the stalking horse’s orders, I got involved by implementing various interferences to all the other love interests like the prince and sons of dukes which resulted in the death penalty. The stalking horse didn’t even bother to protect his subordinate and covered up his own crimes. \n\nI can’t remember if my final moment was captured or not in a panel. Even when I read it, I just skimmed through it. I was a nameless mob and, in addition to that, a supporting mob. \n\nIn the shoujo manga, that was my status in this world. Since I have reincarnated, I would prefer if I didn’t appear in the manga at all. \n\nThe six year old me has yet to encounter the stalking horse in that world. Like I’ll follow the story and die! Using the knowledge from my previous life, I’ve made a decision to keep on living. \n\nThis is a common tale of the protagonist who strives to keep on living by avoiding the encounter with the main and mob characters, and to avoid being involved with them in order to evade the scenario.>"
}