{
	"url": "https://www.novelupdates.com/series/the-british-girl-wants-to-say-suki-not-i-love-you/",
	"title": "The British Girl Wants To Say “Suki”, Not “I Love You” (WN) - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/08/The-British-Girl-wants-to-say-SUKI-not-I-Love-You.jpg",
	"noveltype": "(JP)",
	"genre": "Comedy   Romance   School Life   ",
	"tags": "Beautiful Female Lead   Male Protagonist   Modern Day   ",
	"rating": "(3.8 / 5.0, 26 votes)",
	"author": "Kaedehara Kouta   楓原こうた   ",
	"year": "\n2020",
	"ranking": "#2000   #6316   #8935   #7726   #8900   ",
	"reviewcount": "1 Review sorted by",
	"description": "The protagonist, Kisaragi Manaka, had fallen in love for the first time in his life when he was in his second-year of middle school.\r\n\r\nClear skin, black hair and eyes, a lovely face, and a kind and cheerful personality.\r\n\r\nHe fell in love with such a girl, Kannazuki Sayaka.\r\n\r\nThey didn’t have any particular connections with each other, nor were they in the same class.\r\n\r\nHowever, when she talked to Manaka in one of their joint lessons, he fell in love with her in an instant.\r\n\r\nYes, it was the so-called “love at first sight”.\r\n\r\nFrom then on, Manaka worked very hard.\r\n\r\nWhen he heard that Kannazuki thought people who could study well are cool, he studied like mad. When he heard that she thought athletic guys are cool, he went to a gym.\r\n\r\nHe did all of those for the sake of going out with her.\r\n\r\nHowever, Manaka had suddenly heard devastating news. It was when he was in the third-year of middle school, that he heard Kannazuki was going out with a guy from another school.\r\n\r\nAt that moment, Manaka’s first love had ended.\r\n\r\nNonetheless, when Manaka became a first-year highschool student, he still couldn’t throw that first love away.\r\n\r\n“I already know that she’s already dating someone, but I… still love her.”\r\n\r\nHe was certain that venturing out and finding a new love would be for the best.\r\n\r\nHowever, he still couldn’t give up his feelings.\r\n\r\nThen, a certain incident resulted in him having to rescue the class’ top beauty, Hiiragi Stella.\r\n\r\nShe had long blonde hair and a refined demeanor. A half-british girl who is always surrounded by people in the class, otherwise known as the popular “Saint.”\r\n\r\nThe incident resulted in Hiiragi approaching Manaka, however the latter, having not yet forgotten his first love, dismissed it as something trivial.\r\n\r\nAt first, both of them were in an awkward relationship, but as they spent more time together, teaching each other how to cook, and helping each other clean, they eventually grew closer to each other. However, his first love caused many problems and their relationship was at her mercy.>"
}