{
	"url": "https://www.novelupdates.com/series/acting-school/",
	"title": "Acting School - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/09/Acting-School.jpg",
	"noveltype": "(CN)",
	"genre": "Drama   Romance   Slice of Life   Yaoi   ",
	"tags": "Acting   Black Belly   Celebrities   Co-Workers   Cute Protagonist   First-time Interc**rse   Handsome Male Lead   Modern Day   Movies   Naive Protagonist   Obsessive Love   Overpowered Protagonist   Past Trauma   Reincarnation   Second Chance   Showbiz   Shy Characters   Slow Romance   Time Travel   Tsundere   Wealthy Characters   ",
	"rating": "(4.2 / 5.0, 42 votes)",
	"author": "Shui Mang   睡芒   ",
	"year": "\n2020",
	"ranking": "#1820   #1493   #4864   #7988   #3838   ",
	"reviewcount": "12 Reviews sorted by",
	"description": "Washed-up small star Zhuang Qin returned to the year he first debuted. That year, he was in his prime and because of his outstanding face unexpectedly became the most popular Star.\nHis scenery was unlimited.\n\nYet he rembered that that year, he refused a poor film crew that was shooting a same sex film\n\nThat movie became the springboard for the male god Li Mu to become a film emperor. afterwards it was exposed that  Li Mu came from a wealthy family and the family was not happy about him mixing in the entertainment circle. \nThey were only waiting for his casual playing to fail and return home to inherit the family business.\n\n\nAt the time, Zhuang Qin was fortunate to see him on the red carpet and even as the center of attention, he had the confidence to not create hype with anyone and had no messy scandals.\n\nHe always kept his hands clean and also loved to put on a cold iceberg face and could be called a clear stream in the circle —\n\nIn his previous life, he watched the film and the role that he rejected was not outstanding at all and due to script changes, the second male lead faded into background and even the ambiguous scenes had been deleted completely.\n\nBut it didn’t matter. The opportunity to act in a film with the future film emperor, or even to hold those great thighs was very rare. Zhuang Qin made the decision, this film, he must take it!\n\nUntil he joined the crew and opened the original script that hadn’t been change.\n\nKiss scene, kiss scene, kiss scene, bed scene, kiss scene…\n\nI’m gonna die QAQ>"
}