{
	"url": "https://www.novelupdates.com/series/a-slave-of-rubelfast/",
	"title": "A S*ave Of Rubelfast - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/12/A-Save-Of-Rubelfast.jpg",
	"noveltype": "(KR)",
	"genre": "Fantasy   Romance   ",
	"tags": "Aristocracy   Different Social Status   Empires   European Ambience   Female Protagonist   Handsome Male Lead   Nobles   Royalty   Second Chance   S*ave Protagonist   S*aves   ",
	"rating": "(4.1 / 5.0, 13 votes)",
	"author": "레몬개구리   ",
	"year": "\n2021",
	"ranking": "#2000   #2000   #10180   #12116   #10462   ",
	"reviewcount": "No Reviews",
	"description": "It was unbelievable, but Ellier had died once and came back to life.\n\nAdditionally, she, though it may seem far-fetched, was the Empress of this huge Empire, Pardinas.\n\nThe problem lay in that she woke up in the body of a certain s*ave girl, returning to 17 years in the past before she, the Empress, died. \n\n“This toxic b*tch! Today’s events have made it clear that there isn’t any difference between you and a beast.”\n\nThe enraged s*ave trader placed Ellier in the middle of Rubelfast Square on display as a spectacle.\n\nThe surroundings were exceptionally clean and the people were particularly busy today. \n\n‘Ah… So today was the day the s*ave market opened…!’\n\nThe s*ave market was held once every fortnight, and was possibly a day where s*ave traders have been waiting for. It was also the day that she has been anxiously awaiting, as it was a golden opportunity to screw with the s*ave traders and escape from this agonizing place.\n\n\n∘₊✧──────✧₊∘\n\n \n\n“You’ve woken up.”\n\n \n\nThe door swung open suddenly, and a tall and handsome young man of a stalwart build entered.\n\n \n\nIt was a very natural attitude for someone who entered without knowing that Ellier had woken up.\n\n \n\n‘Oh my God, how the hell did this happen?’\n\n \n\nTo her surprise, it was a familiar face.\n\n \n\nPlatinum blond hair that evoked sighs of wonder, amber eyes that were beautiful enough to be an ornament, smooth and firm skin that was tanned by the sun, as well as a big and sturdy frame that left no doubts that he was a knight…\n\n \n\nThat’s it. Even if she died and came back to life, she would never forget that appearance.\n\n \n\n‘Isn’t that Slarkan Ventiark!’\n\n \n\nHe was the strongest political adversary in Ellier’s previous life.>"
}