{
	"url": "https://www.novelupdates.com/series/the-scum-gong-begs-me-to-get-back-together-but-i-just-want-to-get-rich/",
	"title": "The Scum Gong Begs Me to Get Back Together, but I Just Want to Get Rich - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/06/The-Scum-Gong-Begs-Me-to-Get-Back-Together-but-I-Just-Want-to-Get-Rich.png",
	"noveltype": "(CN)",
	"genre": "Drama   Romance   Tragedy   Yaoi   ",
	"tags": "Abusive Characters   Betrayal   Business Management   Businessmen   Dead Protagonist   Determined Protagonist   Hard-Working Protagonist   Misunderstandings   Modern Day   Multiple Reincarnated Individuals   Poor Protagonist   Poor to Rich   Power Couple   Reincarnation   Second Chance   Straight Seme   Terminal Illness   Wealthy Characters   ",
	"rating": "(3.9 / 5.0, 106 votes)",
	"author": "Su HuaiHuang   苏怀荒   ",
	"year": "\n2020",
	"ranking": "#3710   #3533   #3979   #6109   #3923   ",
	"reviewcount": "19 Reviews sorted by",
	"description": "When Jiang Xiao was nineteen, he accidentally dug a dirty and penniless Lin ChengYu out of the tr*sh and fell in love with him at first sight. He accompanied Lin ChengYu through hard times, and gave him warmth for the next fifteen years until he finally became successful.\n\nBy rights, he should have been the white moonlight of Lin ChengYu’s heart. It turns out that he was just a supporting role. Successful people can be callous. When Jiang Xiao fell ill and died in a hospital bed, Lin ChengYu never came to see him even once.\n\nJiang Xiao after rebirth: F**k this love.\n\nHe learned that in this world, aside from the knowledge in his head and the money in his pocket, everything else is unreliable. Now all Jiang Xiao wants is to study hard, earn money seriously, and become a common, ordinary rich man, academic tyrant, and local tycoon.\n\nLin ChengYu: QAQ, baby look at me! I’m rich, too. I’ll give you all my money and my life!\n\nJiang Xiao (slowly backing away): Thanks, but I don’t seem to know you.\n\n#Now that I have money, my pursuers are lined up from here to France, who the hell are you?#\n\n【Lin ChengYu, president of YongJiang Group, is well-known in the industry as a single, rich, and handsome man. The outside world thought that he was a cold, sexually indifferent orphan. Only a few people knew that he was  just doing his best to hang on until a certain person turns his head.\n\nThat person used to spoil him but he didn’t know how to cherish his love. Then he suddenly left, and never returned.>"
}