{
	"url": "https://www.novelupdates.com/series/bokusatsu-majo-no-yuri-musou%ef%bd%9eimouto-ga-sukisugite-geemu-ni-nagurikonda-onee-chan-no-noukin-boukendan%ef%bd%9e/",
	"title": "Bokusatsu Majo No Yuri Musou～Imouto Ga Sukisugite Geemu Ni Nagurikonda Onee-chan No Noukin Boukendan～ - Novel Updates",
	"image": "https://www.novelupdates.com/img/noimagefound.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Fantasy   Yuri   ",
	"tags": "Beautiful Female Lead   Chat Rooms   Fantasy World   Friendship   Gamers   Hikikomori   Lack of Common Sense   Level System   Loli   Magic   MMORPG   Modern Day   Overpowered Protagonist   R-15   Sister Complex   Tsundere   Virtual Reality   Younger Sisters   ",
	"rating": "(3.9 / 5.0, 39 votes)",
	"author": "Jajamaru   ジャジャ丸   ",
	"year": "\n2020",
	"ranking": "#2000   #2000   #7699   #3249   #7073   ",
	"reviewcount": "No Reviews",
	"description": "Suzumiya Suzune is a high school girl who loves her younger sister so much it’s unbearable. Despite this, she spends her days being treated coldly by her precious little sister, Shizuku.\n\nOne day, her close friends tells her that Shizuku has recently been obsessed with a VRMMORPG called “Fantasy Frontier Online”. With her mind completely set on playing together with her younger sister, Suzune dives into the game world.\n\nShe spends an entire night making an avatar that would appeal to her little sister’s preferences, a little girl with beautiful silver hair. For the sake of creating conversation with her little sister, she also chooses the same class as her, a magician. Preparations were complete!\n\nOr so she thought, but because she was a beginner, she made a mistake and misallocated her stats. Suzune’s character was now maxed towards ATK and turned into a joke build, the “Battlemage.”\n\nCompletely ignorant of this situation, Shizuku gives her a condition, “If you get stronger, I’ll play together with you,” to which Suzune quickly accepts.\n\n“Wait for me Shizuku, Oneechan will definitely get stronger!”\n\nA little girl who’s a magician, yet her magic power was weak. Instead, she relied on physical attacks. Was it possible for her to really be able to convey her overflowing feelings to her little sister!?\n\nLater, she would be referred to as the “Bludgeoning Witch”, “Incarnation of a Real Life Cheat”, and “Bloodstained Little Girl.” Suzune’s slapstick game life starts now!!>"
}