{
	"url": "https://www.novelupdates.com/series/its-okay-except-for-love/",
	"title": "It’s Okay, Except for Love - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/10/Its-Okay-Except-for-Love.jpg",
	"noveltype": "(KR)",
	"genre": "Adult   Drama   Fantasy   Mature   Romance   School Life   Smut   ",
	"tags": "Academy   Artists   Beautiful Female Lead   Books   Bullying   Caring Protagonist   C*nnilingus   College/University   Cute Protagonist   Female Protagonist   First-time Interc**rse   Glasses-wearing Protagonist   Handsome Male Lead   Leadership   Magic   Mismatched Couple   Multiple POV   Nobles   Polite Protagonist   Quiet Characters   R-18   Smart Couple   Younger Love Interests   ",
	"rating": "(4.5 / 5.0, 2 votes)",
	"author": "Yuusung   ",
	"year": "\n2020",
	"ranking": "#2000   #1957   #13648   #12435   #13203   ",
	"reviewcount": "No Reviews",
	"description": "There were two geniuses at Chez Chambre Academy.\nDelilah Erika, loved by everyone, and Eric Briar loved by no one.\n\nOne day, Eric unintentionally rejects Delilah’s request to sit beside him.\nAfter that, the contempt and ostracism toward Eric only intensified, and Delilah secretly visits Eric’s room at night…\n\nAfter their secret meeting, Delilah routinely visits Eric’s room.\nAnd as the secret meetings go on, the more they fall for one another.\n\nHowever, the two are well aware that a relationship can never be achieved, so they decide to share everything, except for “love” only.\nExcept for “love” only.\n\n“You’ll regret it, noona.”\n“I won’t.”\nActually, she might regret it, but she won’t regret everything that’s happened with Eric.\n“…Except for love.”\n“…Yes, except for love.”\nConfirming till the end, Eric’s voice sounded not only a little cruel but kind as long as someone did not covet his heart.\nEric’s hand gently took her chin and tilted her face upward. Delilah tightly screwed her eyes shut, and their lips met in a natural sequence.\nBut she was glad. She could keep seeing him.\nDelilah closed her eyes again. The kiss grew deeper and deeper. As the night deepened, so did their touches, and when Delilah let out a cry, Eric swallowed her sobbing moan with his lips.\n\n《It's Okay, Except for Love》>"
}