{
	"url": "https://www.novelupdates.com/series/the-disabled-tyrants-pet-palm-fish-transmigration/",
	"title": "The Disabled Tyrant’s Pet Palm Fish [Transmigration] - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/06/The-Disabled-Tyrants-Pet-Palm-Fish-Transmigration.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Fantasy   Historical   Romance   Shounen Ai   ",
	"tags": "Ancient China   Caring Protagonist   Childcare   Cold Love Interests   Comedic Undertone   Complex Family Relationships   Cute Children   Cute Protagonist   Disabilities   Doting Love Interests   Handsome Male Lead   Helpful Protagonist   Hiding True Identity   Human-Nonhuman Relationship   Level System   Love Interest Falls in Love First   Magical Space   Misunderstandings   Mpreg   Mute Character   Naive Protagonist   Non-humanoid Protagonist   Pets   Possessive Characters   Proactive Protagonist   Royalty   Schemes And Conspiracies   Shapeshifters   Slow Romance   Strong Love Interests   System Administrator   Transmigration   Transported to Another World   Wealthy Characters   ",
	"rating": "(4.6 / 5.0, 752 votes)",
	"author": "Fat Snow Mountain Fox   Xuěshān féi hú   雪山肥狐   ",
	"year": "\n2020",
	"ranking": "#337   #580   #552   #2089   #389   ",
	"reviewcount": "173 Reviews sorted by",
	"description": "One day, Li Yu transmigrated into a fish. Furthermore, this fish even had a master. This master was the sinister and terrifying, mute tyrant from a novel. The system gave Li Yu a task. If he wanted to change back into a human, he had to obtain the tyrant’s heart. \n\nLi Yu full of tears: System, please wake up. I’m only a fish. He can’t even speak. How can we interact?\n\nSystem: Stop jabbering. To take down the tyrant, you must attack his heart.\n\nLi Yu: Can I ask, does the tyrant have a heart–\n\nLi Yu did his best to blow bubbles at the tyrant, but ended up being captured by the tyrant and raised carefully in a huge, ginormous…… fish tank. The life of a fish was filled with all sorts of blessings.\n\nEveryday, Mu Tianchi watched the little carp swim around happily, pondering when this fish would finally transform into a human.\n\nThe little carp didn’t know. It’s not that the tyrant had no heart, it’s just that he already gave it away to the little carp that accidentally saved his life.>"
}