{
	"url": "https://www.novelupdates.com/series/please-leave-the-sickly-villainess-alone/",
	"title": "Please Leave The Sickly Villainess Alone - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/11/Please-Leave-The-Sickly-Villainess-Alone.jpg",
	"noveltype": "(KR)",
	"genre": "Comedy   Drama   Fantasy   Romance   ",
	"tags": "Ancient Times   Aristocracy   Beautiful Female Lead   Character Growth   Charismatic Protagonist   Early Romance   European Ambience   Female Protagonist   Handsome Male Lead   Obsessive Love   Orphans   Persistent Love Interests   Reincarnation   Royalty   Sickly Characters   Strong Love Interests   Time Skip   ",
	"rating": "(4.2 / 5.0, 38 votes)",
	"author": "별림서   ",
	"year": "\n2021",
	"ranking": "#2240   #2388   #6820   #2303   #4978   ",
	"reviewcount": "3 Reviews sorted by",
	"description": "I became the villain who grew up in the same orphanage as the male lead. The villain who harassed and tormented the male lead, causing a rift between him and the heroine.\r\n\r\nAs I became conscious of my new body, I understood my fate was to be a crippled and mentally sick lady with an incurable condition.\r\n\r\nNonetheless, I was familiar with the novel's plot, so I decided to leave that minefield.\r\n\r\n'I made a decision. I can't go on living like this.'\r\n\r\n'Why? Are you going to flee? Noonim, take me with you.'\r\n\r\nHis angelic face calling me 'noona' even though we didn't have an ounce of blood mixed, was too foreboding.\r\n\r\nIt didn't matter, though. I was determined to live my life to the fullest!\r\n\r\nHowever…\r\n\r\n'Did you hate me enough to run away to another country with that weak body of yours?'\r\n\r\n'Huh?'\r\n\r\nThe male lead smiled sweetly as he picked up a handkerchief soaked in blood that I had thrown randomly.\r\n\r\n'You said you'd be by my side for the rest of your life. You have to keep your promise... If not, I'll go crazy, noonim.'\r\n\r\nI think the male lead darkened after I ran away…?>"
}