{
	"url": "https://www.novelupdates.com/series/overlord/",
	"title": "Overlord (LN) - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2017/11/overlord_ln.jpeg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Drama   Fantasy   Mature   Psychological   Sci-fi   Seinen   ",
	"tags": "Adapted to Anime   Adapted to Drama CD   Adapted to Game   Adapted to Manga   Adapted to Movie   Antihero Protagonist   Aristocracy   Assassins   Award-winning Work   Beastkin   Boss-Subordinate Relationship   Calm Protagonist   Cautious Protagonist   Child Abuse   Cruel Characters   Cunning Protagonist   Demi-Humans   Demons   Depictions of Cruelty   Dragons   Dungeons   Dwarfs   Elves   Evil Protagonist   Game Elements   Gore   Guilds   Humanoid Protagonist   Kingdom Building   Kingdoms   Knights   Leadership   Loyal Subordinates   Lucky Protagonist   Magic   Maids   Male Protagonist   Manipulative Characters   Misunderstandings   Monster Girls   Monster Tamer   Monsters   Multiple POV   Murders   Necromancer   Overpowered Protagonist   Personality Changes   Politics   Protagonist Strong from the Start   R-15   Royalty   Ruthless Protagonist   Secret Identity   Strategist   Succubus   Sword And Magic   Torture   Transported to Another World   Vampires   Wizards   Yandere   ",
	"rating": "(4.5 / 5.0, 1534 votes)",
	"author": "Maruyama Kugane   ",
	"year": "\n2010\r\n",
	"ranking": "#193   #305   #464   #205   #36   ",
	"reviewcount": "123 Reviews sorted by",
	"description": "In 21st century, world entered a new stage of VR games…and “YGGDRASIL” is considered top of all MMORPG…but, After announcing that all its servers will be off, the internet game ‘Yggdrasil’ shut down…or so was supposed to happen, but for some reason, the player character did not log out some time after the server was closed. NPCs start to become sentient. A normal youth who loves gaming in the real world seemed to have been transported into an alternate world along with his guild, becoming the strongest mage with the appearance of a skeleton, Momonga. He leads his guild “Ainz Ooal Gown” towards an unprecedented legendary fantasy adventure!>"
}