{
	"url": "https://www.novelupdates.com/series/still-wait-for-me/",
	"title": "Still, Wait For Me - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2017/07/stillwait.jpg",
	"noveltype": "(CN)",
	"genre": "Adventure   Drama   Harem   Romance   School Life   Seinen   Slice of Life   ",
	"tags": "Business Management   Calm Protagonist   Caring Protagonist   Charismatic Protagonist   College/University   Cunning Protagonist   Devoted Love Interests   Emotionally Weak Protagonist   Famous Protagonist   Handsome Male Lead   Harem-seeking Protagonist   Loli   Male Protagonist   Mature Protagonist   Modern Day   Past Plays a Big Role   Poor to Rich   Second Chance   Secret Identity   Shameless Protagonist   Younger Love Interests   ",
	"rating": "(3.8 / 5.0, 281 votes)",
	"author": "Xiang Tingsheng   项庭生   ",
	"year": "\n2015",
	"ranking": "#6970   #6307   #651   #7990   #1791   ",
	"reviewcount": "40 Reviews sorted by",
	"description": "Inexplicably reborn in the year 2003, having failed terribly in his previous life, the prevailing concern with Xu Tingsheng, that stands above all else, is none other than her. But alas, he is just months away from entering university, while she is but in her first year of junior high… Regarding this, all he can do is wait silently…for now.\r\n\r\nIn the meantime, other matters remain. There were quite a few things that went…rather badly, back then. Given the chance to change things, how would it not be the best decision to give that roulette wheel another spin with the odds stacked a better way, to attempt to change those dismal fates? And in some matters, does the alternative even truly exist? Hence flaps the butterfly’s wings…\r\n\r\nIn Xu Tingsheng’s new ‘second chance’ life, the power of foreknowledge coupled with intelligence pre-empts excellence, and that, coupled with personal charisma and character, begets women. Here he strives for success, while always keeping foremost in his mind that for which he exists, that which his achievements are ultimately meant to protect and cherish. And amidst all this, the season of youth does bloom for the young, deep, complicated romance and spontaneous, hot-blooded fighting never failing to inspire.\r\n\r\nPhilosophical and deep amidst the great, original tale of modernity it tells, this is a thought-provoking story of life, on life, on living.>"
}