{
	"url": "https://www.novelupdates.com/series/i-am-the-nanny-of-the-villain/",
	"title": "I Am the Nanny of the Villain - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/01/I-am-the-Nanny-of-the-Villain.jpeg",
	"noveltype": "(KR)",
	"genre": "Drama   Fantasy   Romance   Slice of Life   ",
	"tags": "Aristocracy   Beautiful Female Lead   Calm Protagonist   Carefree Protagonist   Caring Protagonist   Charming Protagonist   Childcare   Cold Love Interests   Comedic Undertone   Confident Protagonist   Curses   Cute Children   Doting Parents   European Ambience   Famous Protagonist   Female Protagonist   Handsome Male Lead   Love Interest Falls in Love First   Magic   Maids   Misunderstandings   Multiple Identities   Multiple POV   Multiple Realms   Nobles   Obsessive Love   Overpowered Protagonist   Power Struggle   Protagonist Strong from the Start   Quirky Characters   Royalty   Schemes And Conspiracies   Selfless Protagonist   Strategist   Transmigration   Unrequited Love   ",
	"rating": "(3.9 / 5.0, 107 votes)",
	"author": "Seorae Lee   이서래   ",
	"year": "\n2021",
	"ranking": "#601   #246   #1994   #581   #1642   ",
	"reviewcount": "10 Reviews sorted by",
	"description": "She became the nanny of Claude, the blackened male protagonist who would destroy the world. If this continues, she will be killed by the cursed power possessed by the  blackened male protagonist. So, she decided to pour out her love for the  blackened male protagonist to prevent the blackening.\n\nShe also raised the child’s self-esteem, and made the Duke act like a proper father, as fatherly love was essential for the male protagonist’s self-esteem.\n\nShe thought the child was gradually recovering his bright face, and the Duke was now learning how to gradually give love to the child.\n\nBut she doesn’t know if it’s because she worked too hard….?\n\n“It has always been a problem. You have hundreds of reasons to abandon me, but I don’t have a single one.”\n\n“Nanny will always be by my side, right? That’s why you can’t go. Never, never.”\n\nTwo men started obsessing over me.>"
}