{
	"url": "https://www.novelupdates.com/series/the-game-character-i-raised-is-the-boss-of-the-end-of-the-world/",
	"title": "The Game Character I Raised is the Boss of the End of the World - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/04/The-Game-Character-I-Raised-is-the-Boss-of-the-End-of-the-World.jpg",
	"noveltype": "(CN)",
	"genre": "Adventure   Comedy   Fantasy   Romance   Supernatural   ",
	"tags": "Alternate World   Apocalypse   Farming   Female Protagonist   Game Elements   Game Ranking System   Godly Powers   Kingdom Building   Love Interest Falls in Love First   Spatial Manipulation   Special Abilities   Strong Love Interests   Survival Game   Transmigration   Weak to Strong   Zombies   ",
	"rating": "(4.2 / 5.0, 39 votes)",
	"author": "果核之王   ",
	"year": "\n2020",
	"ranking": "#4265   #4085   #5919   #6511   #7351   ",
	"reviewcount": "7 Reviews sorted by",
	"description": "“Welcome to Apocalypse Cub Raising Game” \n\nShen Cheng downloaded a game called “The Last Survivor.”\n\nThe protagonist is a pitiful little villain with broken hands and feet, dying alone amid a pile of corpses. Shen Cheng really couldn’t stand it anymore. “Isn’t it six yuans! Who hasn’t spent game money before?” Then one six yuan, two six yuan, and lots and lots of six yuans!\n\nWhile Shen Cheng was cursing and scolding herself that she will never spend money on game coins anymore, the villain gradually ascended to the peak of the Apocalypse.\n\nWhen she woke up one day, she actually appeared next to the villain’s bed?\n\nForceful dog game, game coins harms me! \n\nSpatial ability user Li Weilan crawled out from a heap of dead bodies. He felt like he was being watched by a pervert. This person forcibly changed his clothes, went in and out of his space at will, and stared at him while he sleeps.\n\nHowever, it was also this person who gave him the most advanced scientific and technological weapons in the last days, created the safest paradise for him, and gave him something he longed for the most… a home.>"
}