{
	"url": "https://www.novelupdates.com/series/the-beast-attached-to-lily-fragrance/",
	"title": "The Beast Attached to Lily Fragrance - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/03/Lily.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adult   Adventure   Fantasy   Josei   Romance   Smut   ",
	"tags": "Ancient China   Beautiful Female Lead   Calm Protagonist   Carefree Protagonist   Character Growth   Charming Protagonist   Clingy Lover   C*nnilingus   Cold Love Interests   Cute Story   Devoted Love Interests   Female Protagonist   First Love   First-time Interc**rse   F*llatio   Handsome Male Lead   Heartwarming   Kidnappings   Love Interest Falls in Love First   Persistent Love Interests   Playful Protagonist   Popular Love Interests   Possessive Characters   Power Struggle   Protagonist Strong from the Start   Revenge   Seduction   Short Story   Strong Love Interests   Unconditional Love   ",
	"rating": "(4.0 / 5.0, 99 votes)",
	"author": "Yuan Yuan   元媛   ",
	"year": "\n2008",
	"ranking": "#4265   #2000   #4684   #2126   #3915   ",
	"reviewcount": "13 Reviews sorted by",
	"description": "Huh … Why is she so unlucky?\n\nShe just happened to bump into him naked and he had been chasing her for five years! \n\nCome on, her eyes were all fixed on his evil beauty’s face at all time and there’s no other part where she was looking at, that she shouldn’t be! \n\nAfter years of chasing, she was finally “blocked” by him and brought back to the famous killer building in Jianghu by this murderous man. \n\nBut this man doesn’t understand what was going on. His eyes were glued to her all day long and seemed to be the only one in his eyes. Letting her heart crisp and numb so she never thought of running away again… \n\nUntil his emotions broke out, but he was holding back the desire of her body and avoided her.\n\nShe knew that it will be alright if she could just let him endure one night just like he used to, but she was so distressed that she couldn’t let him suffer alone…>"
}