{
	"url": "https://www.novelupdates.com/series/poison-doctor-demon-consort/",
	"title": "Poison Doctor Demon Consort - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/08/27667s.jpg",
	"noveltype": "(CN)",
	"genre": "Gender Bender   Romance   ",
	"tags": "Beautiful Female Lead   Black Belly   Comedic Undertone   Cross-dressing   Doctors   Female Protagonist   Handsome Male Lead   Imperial Harem   Nobles   Poisons   Royalty   Transmigration   ",
	"rating": "(3.8 / 5.0, 20 votes)",
	"author": "Hong Shui   红水   ",
	"year": "\nN/A",
	"ranking": "#2000   #2000   #6562   #9319   #6906   ",
	"reviewcount": "No Reviews",
	"description": "A certain Xiao wang* embraced her who was in men’s clothing, rolled over onto the ground, not neglecting to kiss her with burning kisses.\r\n\r\nShe who was going to war on behalf of her brother yelled out, “Wangye*, I am a man! A man! Do you see clearly?”\r\n\r\nWangye acted as if nothing happened, accurately captured two fragrant, soft and sweet lips, one kiss after another: “This wang am recently sexually inclined towards males!” A certain female’s tiny waist was being crushed as she tearfully pled, “Wangye, please spread the rain and dew!”\r\n\r\nA certain Xiao wang: “There are many potential lovers to choose from, but this wang only wants one.”\r\n\r\nShe, Linghu Shui Yue, a military doctor from the modern era, has reincarnated into a stupid sixteen year old girl?\r\n\r\nShe stupid? Then she’ll stupidly hit Qi* wang! Fortune favors fools! How about changing a husband to play with? What is Qi wang? She heard that You* wang was the world’s most beautiful man! Sleep, of course one must sleep the world’s number one beautiful man! Marry, of course she must marry the man all the women in the world want to marry!\r\n\r\nBut, isn’t this man too black-bellied? There was no need for her to even think about it for the man voluntarily presented himself at her door and used all sorts of wiles and methods to marry her as consort! There’s a conspiracy! Then come! And see how she sees through the subterfuge and completely demolishes it.>"
}