{
	"url": "https://www.novelupdates.com/series/she-became-the-devils-stepmother-whos-about-to-be-killed/",
	"title": "She Became The Devil’s Stepmother Who’s About To Be Killed - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/08/She-Became-The-Devils-Stepmother-Whos-About-To-Be-Killed.jpg",
	"noveltype": "(KR)",
	"genre": "Fantasy   Romance   ",
	"tags": "Beautiful Female Lead   Childcare   Cute Children   Demon Lord   European Ambience   Familial Love   Family   Female Protagonist   Handsome Male Lead   Magic   Nobles   Obsessive Love   Protagonist Strong from the Start   Royalty   Transmigration   Villainess Noble Girls   ",
	"rating": "(3.9 / 5.0, 38 votes)",
	"author": "퐁푸딩   ",
	"year": "\n2021",
	"ranking": "#1527   #2945   #4812   #2183   #4071   ",
	"reviewcount": "4 Reviews sorted by",
	"description": "“I’ll kill you! Do you want to die?”\n\nI possessed the body of an extra character, the stepmother who was torn to pieces at the hands of her devilish stepson on the first page of the novel. Because she was a witch’s illegitimate child, Sinclair was abused both by her half-siblings and her father, the Marquis. She was handed over in a political marriage to Grand Duke Gerald Vonzeyer. \n\nAnd then, she was given a task: Capture the heart of the Grand Duke and murder his nephew, the young prince, before he turns into a demon!\n\n‘I should escape the death flag at all costs to avoid ending up like Sinclair in the original.’\n\n“Son, how old are you?”\n\n“Five years old!”\n\nSurvival period: five years.\n\nI needed to lift the curse; raise him to be healthy and kind; protect my favorite character, the Crown Prince; prevent the destruction of the Empire, and save my own life.\n\n“Son, would you like your stepmother to cook something sweet for you?”\n\n“Son, do you want to raise a pet with me?”\n\n“Son, shall we join a study club?”\n\nThe “Character Development of the Young Prince” Project has begun!\n\n“I argued with Kerman Gemo.”\n\n“That’s ridiculous. I’m going to make a 19-karat gold library and studio right now. Just for the two of you.”\n\n“Huh, why?”\n\n“You’re mine.”\n\nSo…\n\nThe Grand Duke, the demon world’s conqueror, who claimed this was his first marriage and even first romance, was becoming obsessed.\n\nWould I be able to endure the Grand Duke’s possessiveness?>"
}