{
	"url": "https://www.novelupdates.com/series/delicate-best-friend-of-the-female-lead/",
	"title": "Delicate Best Friend of the Female Lead - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/10/Delicate-best-friend-of-the-Female-lead.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Drama   Josei   Romance   Supernatural   ",
	"tags": "Abandoned Children   Artists   Beautiful Female Lead   Brainwashing   Business Management   Businessmen   Celebrities   Character Growth   Charming Protagonist   Cheats   Chefs   Childcare   Cooking   Couple Growth   Cute Story   Divorce   Familial Love   Family   Family Business   Female Protagonist   Handsome Male Lead   Marriage of Convenience   Multiple Reincarnated Individuals   Multiple Transported Individuals   Poor to Rich   Rivalry   Second Chance   Sudden Wealth   Transmigration   Transported to Another World   Wealthy Characters   ",
	"rating": "(3.6 / 5.0, 155 votes)",
	"author": "富十二   ",
	"year": "\nN/A",
	"ranking": "#3802   #3197   #1539   #3800   #3002   ",
	"reviewcount": "66 Reviews sorted by",
	"description": "As soon as she opened her eyes, the sickly An Xia found out that she had actually entered a dog-blood novel with wrong moral views! Reborn as the female lead’s best friend, the short-lived ex-wife of the overlord male lead, and the gold digger mother!\r\n\r\nThe attributes were really unlucky, short-lived, and cannon fodder! In the book, the original owner was forced to have a miscarriage and injured her body. In the end, she was pissed alive by the touching love between the heroine and her rebellious son.\r\n\r\nAn Xia lowered her head and looked at her pregnant lower abdomen…\r\n\r\nSickly An Xia cried bitterly!\r\n\r\nSickly An Xia: Oh! Finally, I have a healthy body! Heyaaa! \\(^o^)/~ Eh, eh, eh? The transmigration also came with a golden finger to keep the body healthy?\r\n\r\nWait wait wait! Σ(⊙▽⊙”\r\n\r\nIt seems that something is not quite right with this golden finger! Why was there bruise on her skin just after blowing on it? Why was it so fragile! (⌯˃̶᷄ ﹏ ˂̶᷄⌯)ﾟ>"
}