{
	"url": "https://www.novelupdates.com/series/i-reincarnated-as-an-ugly-woman/",
	"title": "I Reincarnated As an Ugly Woman - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/09/I-Reincarnated-As-an-Ugly-Woman.jpg",
	"noveltype": "(KR)",
	"genre": "Fantasy   Josei   Romance   Smut   Tragedy   ",
	"tags": "Abusive Characters   Confinement   Cruel Characters   Dark   Depictions of Cruelty   Female Protagonist   Male Yandere   Poor Protagonist   Pregnancy   R-18   R*pe Victim Becomes Lover   Reincarnation   R*pe   Sadistic Characters   Second Chance   Stockholm Syndrome   Twisted Personality   Ugly Protagonist   Ugly to Beautiful   ",
	"rating": "(3.3 / 5.0, 31 votes)",
	"author": "철부지마니아   ",
	"year": "\n2021",
	"ranking": "#5262   #6348   #9054   #7727   #7257   ",
	"reviewcount": "1 Review sorted by",
	"description": "Tears welled up in her eyes and she could not see ahead. They put  her head in a trap made of rope, and the rope tightened around her neck. \n\nThis face caught the eyes of the emperor. If she didn’t have this face, she wouldn’t have become the emperor’s concubine. This face was a curse. \n\n‘God, if I were to be born again, I would like to live a long and ordinary life.’\n\n“Ugh…no!”\n\nEmily stood up quickly and looked at her hands, her tattered clothes were the first thing she saw. She stroked her slender neck with her hand. \n\n“Am I alive? Where’s the rope mark on my neck?”\n\nIt was an old room in the crumbling shack where she had lived with her parents. In her room, Emily began to look around for her favorite item. It was the wall mirror that her parents had given her for her fifteenth birthday. \n\nEmily quickly ran to the mirror. She couldn’t help but look at the mirror with disbelief. \n\n“No way!”\n\nThere was a strange woman standing in front of the mirror. She was short, thin, and had tousled black hair. She had a square-shaped face with small eyes. Her skin was dark with many freckles and moles. Her eyes were small and purple, and she looked like she was a sick person.\n\n“…Who is this woman?”\n\nThis was her room. But who was the woman reflected in the mirror?>"
}