{
	"url": "https://www.novelupdates.com/series/transmigrated-as-the-villains-cat/",
	"title": "Transmigrated as the Villain’s Cat - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/03/Transmigrated-as-the-Villains-Cat.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Fantasy   Romance   Shounen Ai   ",
	"tags": "Animal Characteristics   Complex Family Relationships   Cute Protagonist   Doting Love Interests   Heartwarming   Multiple POV   Naive Protagonist   Pets   Power Couple   Second Chance   Slow Romance   Strong Love Interests   Tragic Past   Transformation Ability   Transmigration   Wealthy Characters   ",
	"rating": "(4.5 / 5.0, 81 votes)",
	"author": "Xishan Fish   西山鱼   ",
	"year": "\n2019",
	"ranking": "#136   #511   #3188   #213   #3843   ",
	"reviewcount": "14 Reviews sorted by",
	"description": "The Great God of Book Transmigration: “Transmigrate over, and you can sit on a mountain of gold and silver, and become an existence only surpassed by one person in the entire world.”\n\nNot a bad deal! Su Zening happily agreed to transmigrate!\n\nAs a result——\n\nSu Zening successfully transmigrated into the big world-shaking villain of the book, Fu Xiao…’s most important treasured… cat.\n\nCat Su Zening got to eat the top Italian blue lobster airlifted in that morning. Laying in the comfortable arms of a maid, he flipped himself over and sneered in his heart: “Why would I ever have believed that devious old man!”\n\nAfter many trials and hardships, Su Zening was finally able to transform into a human. But thanks to a freak accident, he now became Fu Xiao’s newest lackey.\n\nEvery day, he had no choice but to transform back and forth, switching between useless flunkey and the Fu family’s tiny overlord.\n\nAs a result, in the company:\n\nAll the other subordinates looked at the newbie Su Zening: “If you mess up our business, the big boss will make you into a concrete pillar and send you sinking to the bottom of the sea.”\n\nSu Zening: !!!\n\nThe big villain coldly looked over this clueless new lackey: “Useless tr*sh, if you can’t handle the next task properly, then never show your face in front of me ever again.”\n\nSu Zening sobbed: “I, I, I won’t mess up ever again. I don’t want to be turned into a concrete pillar!”\n\nBig villain: …..\n\nAfter rebuking this lackey, the big villain went home.\n\nAs soon as he opened the door, the cat, Su Zening fell from the sky and used his cold and noble butt to sit on the big villain’s face. He expressionlessly stomped on this face with his paws: That’s what you get for being mean to me, that’s what you get for scolding me!\n\nThe big villain was gentle and helpless: “O great one, lighten your stomps, don’t hurt your paws.”>"
}