{
	"url": "https://www.novelupdates.com/series/he-woke-up-and-became-the-actors-cat/",
	"title": "He Woke Up And Became The Actor’s Cat - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/08/HWUATAC.jpg",
	"noveltype": "N/A",
	"genre": "Comedy   Drama   Mystery   Romance   Supernatural   Yaoi   ",
	"tags": "Acting   Adopted Children   Adopted Protagonist   Animal Characteristics   Celebrities   Character Growth   Clingy Lover   Couple Growth   Cute Protagonist   Family   Handsome Male Lead   Language Barrier   Misunderstandings   Modern Day   Near-Death Experience   Non-humanoid Protagonist   Orphans   Pets   Polite Protagonist   Power Couple   Showbiz   Shy Characters   Straight Uke   Strong Love Interests   Transformation Ability   Unconditional Love   Unreliable Narrator   Wealthy Characters   ",
	"rating": "(4.3 / 5.0, 74 votes)",
	"author": "祝辞酒   ",
	"year": "\nN/A",
	"ranking": "#920   #2645   #2702   #1545   #2466   ",
	"reviewcount": "16 Reviews sorted by",
	"description": "Xu Jian, an actor, died before he became popular. Just when he was abandoned by the company and frustrated, he woke up as a cat.\n\nAs Xu Jian cat face was confused, he was carefully carried back to his room by Qin Chen, the film emperor who was rumored to be grumpy and difficult to get along with.\n\nQin Chen, who was disliked by all the hairy animals, saw a stray cat in the community and was surprised to find that the cat was not afraid of him!\n\nQin Chen loved this cat so much that he had to hold it high with a kiss when he went to other places to film.\n\nJust when Xu Jian felt that it was good to be a cat forever, one day he suddenly recovered, and woke up in Qin Chen’s bed.\n\nFour eyes met, two faces were confused, the scene was very embarrassing.\n\nQin Chen’s face was expressionless, and his heart roared: Where was his cat!!\n\nFacing Qin Chen’s eyes and habits, Xu Jian opened his mouth: “Meow ~”\n\nQin Chen: ! ! !\n\n# My cat’s a man! #\n\n#Thought you were furry, but you’re still naked! #\n\nExtremely lacking in love actor × Famous Film Emperor>"
}