{
	"url": "https://www.novelupdates.com/series/i-want-to-be-alone-beautifully/",
	"title": "I Want to be Alone, Beautifully - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/04/I-Want-to-be-Alone-Beautifully.jpg",
	"noveltype": "(CN)",
	"genre": "Drama   Mature   Romance   Sci-fi   Yuri   ",
	"tags": "Apathetic Protagonist   Beautiful Female Lead   Character Growth   Childhood Love   Cold Protagonist   Devoted Love Interests   Female Protagonist   Multiple Identities   Obsessive Love   Omegaverse   Resurrection   Revenge   R*pe   Tragic Past   Transmigration   Wealthy Characters   World Hopping   Yandere   ",
	"rating": "(4.2 / 5.0, 47 votes)",
	"author": "Qishang Festival   柒殇祭   ",
	"year": "\n2020",
	"ranking": "#2000   #1162   #5282   #6416   #5940   ",
	"reviewcount": "8 Reviews sorted by",
	"description": "Xu Jiao, the terrifying stepmother-like author of dog-blood plots, has made countless pits in her life, and finally suffered retribution for the deaths of the protagonist in her books.\n\nSystem: “Since the content of your article does not conform to the core socialist values, please cooperate with the system to make corrections.”\n\nXu Jiao: “I am going to change it! I am going to change it! You don’t have to throw me into the book?”\n\nScene one.\n\nSystem: “The heroine in front was bullied by a neighbor at the corner. Please help in time so that she can feel the care and love of socialism.”\n\nXu Jiao: “I know this question. As long as I show up in front of her to scare away the gangsters, I will become her best friend from then on.”\n\nSoon after, the system: “Successfully saves the heroine, gains +1 for favorability and +1 for blackening.”\n\nXu Jiao: “…? Blackening?”\n\nScene two.\n\nSystem: “The heroine in front is harassed by a domineering boss, please help in time.”\n\nXu Jiao: “I will do this too! As long as I help her get out of the clutches, drive away the villains, and then tell her what true love is…”\n\nSystem: “Successfully saved the heroine, get favorability +50, blackening value +50, open the black lotus route——”\n\nSystem: “Sorry to inform you that the final rectification failed.”\n\nXu Jiao shivered as she watched the approaching female host with a blackened aura, “Don’t tell me… I, I, I have to run first!”>"
}