{
	"url": "https://www.novelupdates.com/series/dont-chase-me-its-fruitless/",
	"title": "Don’t Chase me, It’s Fruitless - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/08/Dont-Chase-me-Its-Fruitless.jpg",
	"noveltype": "(CN)",
	"genre": "Romance   Shoujo Ai   Yuri   ",
	"tags": "Beautiful Female Lead   Contracts   Doting Love Interests   Doting Parents   Narcissistic Protagonist   Past Plays a Big Role   Poor to Rich   Revenge   Showbiz   Singers   Wealthy Characters   ",
	"rating": "(3.9 / 5.0, 18 votes)",
	"author": "热到昏厥   ",
	"year": "\n2020",
	"ranking": "#2000   #2000   #9629   #7040   #10697   ",
	"reviewcount": "3 Reviews sorted by",
	"description": "Tao Youqing has liked Zhou Yirou and been her secret lover for several years.\r\n\r\nBut she knew that Zhou Yirou didn't love her, and she was just used as a double so she can look at as a vase.\r\n\r\nBut Tao Youqing thought that if she spent more time with Zhou Yirou she would get her love and let her put down her white moonlight to look at herself. But after a long time, she realized that Zhou Yirou would not love her. And instead Tao Youqing was tired of her enthusiasm for her and couldn't love her anymore.\r\n\r\nFinally, she decided to let go and never like Zhou Yirou again.\r\n——If you don’t love, then don’t love, the next one will be better!\r\n\r\nBut what she didn't expect was that when she let go of her, Zhou Yirou fell in love with her instead, and wanted to 'reunite' with her.\r\n\r\nBroken mirror reunion?\r\n\r\nTao Youqing refused: 'No, the broken mirror said it doesn't want to rebound.'\r\n\r\nDoesn't believe she doesn't like her anymore?\r\n\r\nTao Youqing simply pulled out a shield: 'Sorry, I already have someone I like.'\r\n\r\n'Her name is Yuan Churui.'\r\n\r\nYuan Churui, a well-known entrepreneur, is not only President Yuan of Yueyong Entertainment, but also the little director of Yuan Group. Her net worth and value are dauntingly high.\r\n\r\nTao Youqing thoughts at the time: the sky is high and the emperor is far away, Yuan Churui wouldn't find out.\r\n\r\nAs a result, Yuan Churui knew about it and gave her a paper love contract.\r\n\r\nYuan Churui smiled slightly: 'Sign it, didn't you say you like me?'\r\n\r\nTao Youqing: '...'\r\n\r\nShe never thought that things would develop like this!>"
}