{
	"url": "https://www.novelupdates.com/series/the-prince-wants-to-leave-his-concubine/",
	"title": "The Prince Wants to Leave His Concubine - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/11/itsnotme2.jpg",
	"noveltype": "(CN)",
	"genre": "Drama   Fantasy   Josei   Romance   Tragedy   ",
	"tags": "Ancient China   Betrayal   Buddhism   Cruel Characters   Female Protagonist   Gods   Handsome Male Lead   Multiple Timelines   Protagonist Falls in Love First   Time Travel   ",
	"rating": "(3.9 / 5.0, 22 votes)",
	"author": "Mo Wu Bi Ge   墨舞碧歌   ",
	"year": "\n2012",
	"ranking": "#6970   #2000   #8536   #11739   #8587   ",
	"reviewcount": "4 Reviews sorted by",
	"description": "It started from a mystical dynasty that had been lost in the history of the past. From there, their life began to interlace, but at the same time, they died. In the 21st century, Hai Lan, one of the members in the archaeological team, was saved by her ex-boyfriend, Qin Ge, when she was in danger while excavating an ancient tomb. Because of that, Qin Ge died.\n\nIn Qin Ge's mourning hall, Hai Lan learned that he had been with her for three years as she was similar to the woman he loved the most.\n\nShe was heartbroken when she came to know of the truth. At that moment, she encountered a mysterious woman named Lin Lang. She told her that if Qin Ge was to be reborn, she would have to break the butterfly effect. In other words, she needed to prevent the construction of the ancient tomb. Without it, everything would go back to normal.\n\nLin Lang had a hidden token, one that was said to have been owned by Fei Tian, the ancestor of ten thousand Buddhas. With the token, Hai Lan would be able to travel to the age of the ancient tomb and change the past.\n\nShe contemplated it endlessly and finally decided to travel back in time and change history, rewriting a love that would stay etched in Shangguan Jinghong's (Qin Ge) mind.\n\nThe myths and legends from thousands of years ago, the great secrets that have been lost and forgotten for several generations, who has the ability to uncover them all?>"
}