{
	"url": "https://www.novelupdates.com/series/glory/",
	"title": "Glory - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/03/glory1b.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Comedy   Romance   Shounen Ai   Sports   ",
	"tags": "Clubs   Confident Protagonist   Devoted Love Interests   Doting Love Interests   e-Sports   Family Conflict   Friendship   Gamers   Handsome Male Lead   Heartwarming   Love Interest Falls in Love First   Modern Day   Power Couple   Protagonist Strong from the Start   Secret Identity   Shameless Protagonist   Strong Love Interests   Teamwork   ",
	"rating": "(4.6 / 5.0, 270 votes)",
	"author": "Long Qi   龙柒   ",
	"year": "\n2020",
	"ranking": "#3567   #3186   #740   #3196   #786   ",
	"reviewcount": "52 Reviews sorted by",
	"description": "This novel is also known as [I was caught and brought back after using and tossing aside the Great Demon King of e-sports…]\n\nWei Xiao––the former rookie king of the league, now an accompanying player and tr*sh talk king, had a stupefied look on his face!\n\nSomeone bought 10,000 games with him!\n\n200 yuan a game, for a neat and tidy total of two million yuan!\n\nWei Xiao: “Boss, you didn’t miscount the zeroes, right?”\n\n“No.”\n\n“You want me to accompany you to play 10,000 games?”\n\n“Mm.”\n\nWei Xiao was amazed. But just when he thought he’d encountered a generous fool and was having a good time deceiving and playing with them, he discovered the other party’s identity.\n\nThis person actually turned out to be his previous captain, the one whose hands were tired from accepting too many championship trophies, the one who made everyone feel fear when they heard his name, the Great Demon King of the league, Lu Feng!\n\nWei Xiao: “I’m sorry for disturbing you, goodbye!”\n\nLu Feng picked up the little bastard who wanted to run, “Have you played around enough? Come back for training if you’ve played enough!”\n\nLater on, Wei Xiao became famous in a single game. The host interviewed him, “How would you evaluate God Lu?”\n\nWei Xiao: “God Lu? Great technique, strong physical strength, and the most heaven-defying thing is his endurance!”\n\nHost: “???”\n\nHow come the answer seemed to be a little strange?!>"
}