{
	"url": "https://www.novelupdates.com/series/i-was-caught-up-in-a-hero-summoning-but-that-world-is-at-peace-ln/",
	"title": "I Was Caught up in a Hero Summoning, but That World Is at Peace (LN) - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/06/I-Was-Caught-up-in-a-Hero-Summoning-but-That-World-Is-at-Peace-LN.jpg",
	"noveltype": "(JP)",
	"genre": "Comedy   Fantasy   Harem   Romance   Shounen   Slice of Life   ",
	"tags": "Adapted to Manga   Beautiful Female Lead   Caring Protagonist   Demons   Dense Protagonist   God-human Relationship   Goddesses   Heartwarming   Kind Love Interests   Male Protagonist   Polygamy   Strong Love Interests   Transported to Another World   Weak to Strong   Yandere   ",
	"rating": "(4.0 / 5.0, 71 votes)",
	"author": "Toudai   灯台   ",
	"year": "\n2017",
	"ranking": "#723   #1236   #3220   #1939   #5281   ",
	"reviewcount": "3 Reviews sorted by",
	"description": "Suddenly appearing in a different world, it looks like I got caught up in a Hero Summoning. And of course, I’m not the Hero, but it’s another guy……and while being very cautious and scared of the cliche-like development, I was thrown into the maelstrom of war……or not.\r\n\r\nThe Demon Lord? It was defeated a thousand years ago. Hero? He’s just the main actor in a festival. Nobles? They’re kindly taking care of us. The Demon Race? They have good relationships with Humans. Wars? It’s already 800 years since the last one. Monsters? The Guild and Order of Knight are taking care of them. Return to Earth? It is eventually No-Risk.\r\n\r\nWhat I’m planning after being caught up into this? I’m gonna enjoy the life in a different world as much as I want to, go on a cultural exchange and sightseeing, and after experiencing the festival that is only held once every ten years……I shall go home safely.\r\n\r\nThe other world was――at Peace.\r\n\r\nA kind world where the three races, the Spirit World’s Magical Races, the Celestial World’s Divine Races, the Human World’s Human Races, they are kind neighbors to each other, with everyone living a peaceful and fulfilling life.\r\n\r\nBut although I wished to peacefully spend a year before my return, for some reason, the heavyweights of this world keeps gathering around me, and……>"
}