{
	"url": "https://www.novelupdates.com/series/kaifuku-jutsushi-no-yarinaoshi-sokushi-mahou-to-skill-copy-no-choetsu-heal/",
	"title": "Kaifuku Jutsushi no Yarinaoshi ~ Sokushi Mahou to Skill Copy no Choetsu Heal - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/06/DtGIVVJX4AEKk6S.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Ecchi   Fantasy   Harem   Mature   Psychological   Romance   Seinen   Tragedy   ",
	"tags": "An*l   Ability Steal   Abusive Characters   Adapted to Anime   Adapted to Drama CD   Adapted to Manga   Adventurers   Aggressive Characters   Alchemy   Antihero Protagonist   Arrogant Characters   Artifacts   Beastkin   Betrayal   Brainwashing   Cautious Protagonist   C*nnilingus   Confident Protagonist   Cross-dressing   Cruel Characters   Cunning Protagonist   Cute Protagonist   Dark   Death of Loved Ones   Demi-Humans   Demon Lord   Demons   Depictions of Cruelty   Discrimination   Disfigurement   Distrustful Protagonist   Drugs   Enemies Become Lovers   Enlightenment   Eye Powers   Fantasy World   First Love   First-time Interc**rse   F*llatio   Game Elements   Harem-seeking Protagonist   Hated Protagonist   Healers   Heroes   Hidden Abilities   Hiding True Abilities   Hiding True Identity   Human-Nonhuman Relationship   Hypnotism   Kingdoms   Knights   Level System   Loli   Loyal Subordinates   Magic Beasts   Male Protagonist   Master-Servant Relationship   M*sturbation   Mind Break   Mind Control   Near-Death Experience   Nobles   Past Plays a Big Role   Past Trauma   Perverted Protagonist   Philosophical   Polygamy   Possessive Characters   Proactive Protagonist   Psychic Powers   Psychopaths   R-18   R*pe Victim Becomes Lover   Revenge   Reverse R*pe   Royalty   R*pe   Ruthless Protagonist   Second Chance   Selfish Protagonist   S*x S*aves   S*ave Harem   S*aves   Special Abilities   Stockholm Syndrome   Strategic Battles   Strong Love Interests   Threesome   Time Manipulation   Time Travel   Torture   Toys   Tragic Past   Transformation Ability   Transplanted Memories   Trap   Twisted Personality   Underestimated Protagonist   Unreliable Narrator   Wars   Weak to Strong   Yandere   Younger Love Interests   ",
	"rating": "(3.3 / 5.0, 472 votes)",
	"author": "Tsukiyo Rui   月夜　涙（るい）   ",
	"year": "\n2016",
	"ranking": "#5262   #4792   #413   #3130   #123   ",
	"reviewcount": "55 Reviews sorted by",
	"description": "–Using healing magic on the world itself, I’ll start over.\r\n\r\n‘Healing magicians cannot fight alone.’ Keare, who was bound by this common knowledge, was exploited again and again by others.\r\n\r\nBut one day, he noticed what lay beyond healing magic, and was convinced that a healing magician was the strongest class. However, by the time he realized that potential, he was deprived of everything. Thus, he used healing magic on the world itself to go back four years, deciding to redo everything.\r\n\r\nThis is a heroic tale of one healing magician who became the strongest by using knowledge from his past life and healing magic.>"
}