{
	"url": "https://www.novelupdates.com/series/i-help-the-richest-man-spend-money-to-prevent-disasters/",
	"title": "I Help the Richest Man Spend Money to Prevent Disasters - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/12/10393s.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Fantasy   Romance   ",
	"tags": "Beautiful Female Lead   Celebrities   Family   Famous Parents   Female Protagonist   Handsome Male Lead   Love Interest Falls in Love First   Lucky Protagonist   Marriage   Modern Day   Multiple Transported Individuals   Past Plays a Big Role   Showbiz   Slow Romance   Transmigration   Wealthy Characters   ",
	"rating": "(4.0 / 5.0, 317 votes)",
	"author": "Bìxià Bù Shàng Cháo   陛下不上朝   ",
	"year": "\n2019",
	"ranking": "#186   #290   #295   #245   #852   ",
	"reviewcount": "89 Reviews",
	"description": "Ye Zhi not only inherited the run-down house, but also the engagement with a man. The man who met his true love disliked his fiancée in all ways and asked for divorce.\n\nIn order to express their guilt, the man’s family decided to make up for it with Ye Zhi. But she did not want their ‘compensation’ and simply left without turning her back.\n\nThe next second, Ye Zhi was picked up by a Rolls Royce.\n\nGu Ren, the son of the richest man, had a tough life and couldn’t live past 30 years old. Only Ye Zhi, who was born on the cloudy day of the lunar year, was the most suitable match that could make him survive.\n\nYe Zhi and Gu Ren got married. Gu Ren gave her a bank card. All she has to do is—\n\nSpend money for him! Squander his fortune!\n\nYe Zhi bought a Lamborghini for Gu Ren, but he had an accident as soon as he drove the car.\n\nAs soon as she bought some Hermes platinum bags for herself, Gu Ren signed a more than one billion worth contract.\n\nIt turned out that the money could only be spent on herself.  The more she spent, the more prosperous she became.\n\nSince then her life has changed completely. She became a rich woman who owns luxury items, limited edition bags and a villa overlooking the Forbidden City.\n\nThe man thought that Ye Zhi, who he had broken up with, must have suffered a lot. Until one day, he saw his former fiancée walking in the street, followed by a striking Lamborghini.\n\nWait! Who is the man next to her?\n\nThis man is a super-rich man—Hundreds of times richer than his own family!>"
}