{
	"url": "https://www.novelupdates.com/series/all-stars-are-my-gourmet-fans/",
	"title": "All Stars are My Gourmet Fans - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/11/All-Stars-are-My-Gourmet-Fans_1637057607.jpg",
	"noveltype": "(CN)",
	"genre": "Fantasy   Mecha   Romance   Sci-fi   ",
	"tags": "Aliens   Alternate World   Army   Celebrities   Cooking   Devoted Love Interests   Fast Learner   Female Protagonist   Futuristic Setting   Generals   Handsome Male Lead   Hard-Working Protagonist   Healers   Marriage   Military   Older Love Interests   Poor to Rich   Popular Love Interests   Protagonist Falls in Love First   Secret Relationship   Strong Love Interests   Technological Gap   Transmigration   ",
	"rating": "(4.0 / 5.0, 23 votes)",
	"author": "向微醺   ",
	"year": "\n2021-09-19",
	"ranking": "#6970   #2000   #7972   #4491   #8357   ",
	"reviewcount": "3 Reviews",
	"description": "\r\nJiang Qiuqiu, a food blogger in the 21st century, has traveled to the interstellar era.\r\n\r\nTo make ends meet, a food anchor named Jiang Jiaoyu in the Federal Food Live Zone was born, attracting countless local tycoons and hundreds of millions of Federal fans!\r\n#Shock! The fan rankings of a certain anchor in the food live category is simply a Federal press conference!#\r\n\r\nThe first fan on the list is Admiral Mosi, the Blade of the Empire!\r\n\r\nThe second on the list is His Excellency Jones, the Chief of the Cabinet!\r\n\r\nFrom the third to the twenty fans' list, there are 18 conscripts from the Federation!\r\n\r\nEveryone: ! ! ! ? ? ?\r\n\r\n-----\r\n\r\nJiang Qiuqiu originally only wanted to cook and make ends meet, but she unexpectedly became famous, enlisted in the army, saved a legion, and picked up a husband.\r\n\r\nOne day, a short video became famous on the federal network. In the video, the hottest Internet celebrity surnamed Jiang tweeted a video where a tall, handsome and imposing Admiral, who destroyed the hands of the Zerg queen, holding a kitchen knife to cut carrots! And the tweet said: I finally found a man who can cook for me.\r\n\r\nCountless people are screaming for this beautiful love!>"
}