{
	"url": "https://www.novelupdates.com/series/when-two-alphas-meet-ones-an-omega/",
	"title": "When Two Alphas Meet, One’s an Omega - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/07/2alphasmeet.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Romance   School Life   Slice of Life   Yaoi   ",
	"tags": "Adapted to Drama CD   Bickering Couple   Childhood Friends   Handsome Male Lead   Love Interest Falls in Love First   Modern Day   Omegaverse   Slow Romance   Smart Couple   Tsundere   ",
	"rating": "(4.1 / 5.0, 75 votes)",
	"author": "Li Dongren   厉冬忍   ",
	"year": "\n2019",
	"ranking": "#599   #603   #2839   #870   #1766   ",
	"reviewcount": "22 Reviews sorted by",
	"description": "When Jian Songyi was born, gene testing showed there was a 100% chance he would present as a first-rate alpha. Thus, he conscientiously spent over ten years to mature into a second-generation rich kid that could get anything he wanted. He was the boss of the school. He was the most handsome boy in the school. He was also the top student of the school.\n\nUntil his sworn enemy, who lived next door when he was a child, transferred into his school. He didn’t just steal his spot as the most handsome boy, he even stole his spot as the top student.\n\nMost importantly, he had even f*cking presented as a first-rate alpha before him.\n\nTowards this, Jian Songyi said, one mountain can’t house two alphas! If he didn’t hurry up and shoo this son of a bit*h Bo Huai away, then he wasn’t an alpha!\n\nWell, Heaven had eyes. The next night, right in front of Bo Huai, he presented as an omega.\n\n–\n\nJian Songyi resolved to become an omega with strength of character. Even if he went in heat, even if he forgot to bring his inhibitors, even if he were to die right then where he stood, he would never let Bo Huai mark him!\n\nBo Huai could only coax him in a low voice. “Let me take a bite. In the final exam, I’ll give you first place in the grade.”\n\nJian Songyi couldn’t take the seduction of his silky soft breath and gave in.\n\nThe day exam grades came out, Jian Songyi looked at the honor roll that said “First Place: Bo Huai” and puffed up in anger. “Bo Huai, you freaking liar! You beat me by a point again!”\n\nBo Huai smiled lightly. “What’s wrong? I’ll give you first place, me.”\n\n---\nA/N in the tags: (I know I should read ***'Bai' but I'm shameless)\n\n*** ML's name can be read as Bai Huai (standard pinyin) or Bo Huai (author intention) >"
}