{
	"url": "https://www.novelupdates.com/series/quick-transmigration-system-male-god-come-here/",
	"title": "Quick Transmigration System: Male God, Come Here - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2018/08/t5_20980484.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Comedy   Drama   Mystery   Romance   Tragedy   Xianxia   ",
	"tags": "Abusive Characters   Acting   Ancient Times   Arranged Marriage   Beautiful Female Lead   Betrayal   Black Belly   Calm Protagonist   Charming Protagonist   Clever Protagonist   Cold Love Interests   Confident Protagonist   Cultivation   Determined Protagonist   Devoted Love Interests   Episodic   Female Protagonist   Game Elements   Interdimensional Travel   Love Interest Falls in Love First   Male Yandere   Modern Day   Multiple Realms   Narcissistic Protagonist   Otaku   Possessive Characters   Revenge   R*pe   Shameless Protagonist   Sharp-tongued Characters   Showbiz   Sickly Characters   System Administrator   Transmigration   Tsundere   Wealthy Characters   World Hopping   Zombies   ",
	"rating": "(4.4 / 5.0, 382 votes)",
	"author": "Pineapple Cake   凤梨糕   ",
	"year": "\nN/A",
	"ranking": "#1837   #882   #239   #1152   #618   ",
	"reviewcount": "108 Reviews sorted by",
	"description": "After signing the share transfer of the Bai company, Bai Weiwei who had a congenital heart disease got betrayed by her adopted sister she always loved along with her trusted bodyguard.\n\nShocked, betrayed, and worried for her father made her unwilling to die, and her resentment actually let her bind with a quick transmigration system. Completing the task means that she will be able to increase the number of days she can live, and she will be able to get revenge on her white lotus sister and the unconscionable bastard bodyguard.\n\nCEO, Emperor, General… Supreme Immortal? All of them will turn to a love-sick waste who bowed before her skirt.\n\nJust… why is this unlucky star of a wooden fiancee trying so hard to chase her? Stop sucking my life force already! Our marriage is only for business! I want to break the engagement!\n\nYe Yuxuan: “I will never let go of you.”\n\nBai Weiwei: '..............'>"
}