{
	"url": "https://www.novelupdates.com/series/thousand-autumns/",
	"title": "Thousand Autumns - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/01/21847026327091_546.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Drama   Historical   Martial Arts   Mature   Shounen Ai   Wuxia   ",
	"tags": "Abusive Characters   Adapted to Anime   Adapted to Drama CD   Amnesia   Ancient China   Aristocracy   Arrogant Characters   Betrayal   Bickering Couple   Blind Protagonist   Calm Protagonist   Caring Protagonist   Character Growth   Charming Protagonist   Clever Protagonist   Comedic Undertone   Confident Protagonist   Cruel Characters   Cultivation   Daoism   Determined Protagonist   Famous Protagonist   Handsome Male Lead   Hard-Working Protagonist   Hiding True Identity   Love Interest Falls in Love First   Manipulative Characters   Mature Protagonist   Multiple Personalities   Older Love Interests   Polite Protagonist   Politics   Power Couple   Protagonist Strong from the Start   Righteous Protagonist   Sadistic Characters   Sickly Characters   Slow Romance   Smart Couple   Strength-based Social Hierarchy   Strong Love Interests   Sword Wielder   Underestimated Protagonist   Weak to Strong   World Travel   ",
	"rating": "(4.6 / 5.0, 679 votes)",
	"author": "Meng Xi Shi   梦溪石   ",
	"year": "\n2015",
	"ranking": "#574   #807   #884   #532   #133   ",
	"reviewcount": "143 Reviews sorted by",
	"description": "Yan Wushi had walked a path full of blood and corpses.\n\nHe did not believe in the good nature of humanity. Even more so, he did not believe that there could be someone with great kindness and sense of justice, who would be so considerate of others without asking anything in return.\n\nOne day, Shen Qiao, who was the sect leader of Mount Xuandu, the number one Daoist sect under the heavens, was challenged to a duel but somehow fell off the cliff.\n\nYan Wushi happened to pass by down there.\n\nSeeing Shen Qiao who was seriously injured to the point of dying, he suddenly came up with a perfect idea…\n\nAfter thousands of autumns, who could stay eternal?>"
}