{
	"url": "https://www.novelupdates.com/series/shujinkou-janai/",
	"title": "Shujinkou Janai! - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/02/Shujinkou-Janai.jpeg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Comedy   Fantasy   Seinen   Tragedy   ",
	"tags": "Adapted to Manga   Brother Complex   Cunning Protagonist   Demon Lord   Demons   Elves   Friendship   Game Elements   Goddesses   Guilds   Harsh Training   Heroes   Level System   Loyal Subordinates   Magic   Magical Space   Male Protagonist   Mature Protagonist   Monsters   Overprotective Siblings   Proactive Protagonist   Protagonist Strong from the Start   Reincarnated in a Game World   Reincarnated in Another World   Skill Creation   Strong to Stronger   Survival   Transported into a Game World   ",
	"rating": "(3.5 / 5.0, 37 votes)",
	"author": "Usber   ウスバー   ",
	"year": "\n2020",
	"ranking": "#217   #270   #5331   #397   #7112   ",
	"reviewcount": "3 Reviews",
	"description": "He was hit by a car when he tried to save a girl and was reborn as Lex, the most powerful character in the early stages of the RPG world! He starts off at a staggering level of 50! He’s an all-rounder well equipped with skills from all areas and he’s even good-looking! This was an absolute big win!\r\nOr so one might think… but Lex was actually just a minor character in the early stages, like those early SR cards in online games or the old paladin with the silver spear in SRPGs. Even if you’re very strong at the start, you’d soon become completely useless! \r\n\r\nAs I battled with the monsters and went through events I was bound to experience while enduring the poor growth rate, disappointing unique skills, and the status of being a jack of all trades but master of none, I made up my mind—\r\n\r\n「I’ll just dump all the troublesome things onto the game’s hero who should be out there somewhere and retire in a quiet place!」\r\n\r\nThis is the story of an ordinary person looking for a 'hero' who somehow ends up becoming the hero who saves the world!>"
}