{
	"url": "https://www.novelupdates.com/series/a-villainess-needs-to-have-the-ability-of-a-villainess/",
	"title": "A Villainess Needs to Have the Ability of a Villainess - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/04/A-Villainess-Needs-to-Have-the-Ability-of-a-Villainess.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Drama   Romance   Slice of Life   ",
	"tags": "Acting   Beautiful Female Lead   Celebrities   Character Growth   Cold Love Interests   Couple Growth   Cute Story   Female Protagonist   Handsome Male Lead   Hard-Working Protagonist   Late Romance   Modern Day   Slow Growth at Start   Slow Romance   Strong Love Interests   Stubborn Protagonist   Unlucky Protagonist   ",
	"rating": "(3.7 / 5.0, 76 votes)",
	"author": "苏钱钱   ",
	"year": "\n2021",
	"ranking": "#1575   #1449   #3280   #2201   #3982   ",
	"reviewcount": "12 Reviews sorted by",
	"description": "On the day Wen Yu found out her celebrity boyfriend had cheated on her, her family was also in danger of going bankrupt. That scummy ex of hers didn’t even feel any guilt. First, he cheated, then he mocked Wen Yu, declaring that he was no longer the poor man he had used to be. And thus, her status fell from a phoenix to a pheasant.\n\nWen Yu couldn’t take this insult.\n\nAfter her break-up, she was accidentally hit by a car.\n\nWhen she woke up, in front of her stood a man feared by everyone in the entertainment industry: Jiang Yuhe. He was the capital magnate who could essentially control the fate of all celebrities.\n\nHe asked her nonchalantly, “How do you want to be compensated?”\n\nSeeing this as the golden finger sent by God, bold ideas suddenly sprang into Wen Yu’s head.\n\n–\n\nWen Yu had claimed to have forgotten everything, firmly calling Jiang Yuhe “Older Brother”. And thus, the doctor diagnosed her with psychogenic amnesia, so her memories were distorted. Helpless, Jiang Yuhe was forced to temporarily take care of this “Little Sister”.\n\n“Brother, are you coming home for dinner tonight?”\n\n“Sorry Brother, a sister just called you. She seems to have misunderstood.”\n\n“Brother, if you are well, then today will be a good day.”\n\nPretending to be an innocent little green tea*, Wen Yu was sweet, plain, and gentle and had a peaceful and beautiful temperament in front of other people. Behind that facade was a woman who would strike scummy men with a knife heavy-handedly.\n\nOn the day she humiliated her scummy ex and forced him to leave the entertainment industry, Wen Yu felt vindicated. Overly excited for a moment, she mistakenly texted her “brother” instead of her scummy ex.\n\nThe man squinted as he read the words on the screen out loud. “‘I tolerated and endured humiliation for three months’?”\n\nHe sneered, adjusting his position. “Well, aren’t you quite capable?”\n\n“…”\n\nEventually, Wen Yu would finally learn on the true meaning of tolerating and enduring humiliation T_T\n\n* ‘Green Tea’ is Chinese slang to describe a girl pretending to be innocent and pure.>"
}