{
	"url": "https://www.novelupdates.com/series/the-ten-promises-with-my-master/",
	"title": "The Ten Promises with My Master - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/06/mmexport1561088206382.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Comedy   Romance   Smut   Yaoi   ",
	"tags": "Character Growth   Clan Building   Criminals   Cruel Characters   Determined Protagonist   Handsome Male Lead   Power Struggle   Prison   Reincarnation   Strength-based Social Hierarchy   Weak to Strong   ",
	"rating": "(3.7 / 5.0, 13 votes)",
	"author": "青浼   ",
	"year": "\n2013",
	"ranking": "#2000   #2000   #10203   #11313   #8867   ",
	"reviewcount": "1 Review sorted by",
	"description": "[Light]\nThis is the inspirational, heart-warming story of a youth that was reborn as a puppy and his perverted owner. \n\n[Shadow]\nThis is the inspirational, growth story of the pup who returned as the youth to start a war against the perverted owner but failed, thus he trained as a weakling to the 2nd prison’s in charge and claimed another war with the perverted owner. \n\n[The Ten Promises between Ruan Da Ye and the Perverted Owner]\n1. Just the thought of needing to spend ten long years with you makes me extremely regretful.\n\n2. To enhance our understanding with each other, please give the both of us enough time, I’ll do my best to prove how much I don’t want to wake up early to go jogging with you.\n\n3. Shut up and leave me alone, alright?\n\n4. Don’t quarrel, don’t beat or scold me, because I’ve grown teeth to bite you.\n\n5. There’s got to be a reason when I don’t listen to you, so before beating me, please think, for specific circumstances, refer to the previous rule.\n\n6. Nobody can bully you, except for me.\n\n7. You have your friends and family matters in the prison, trust me, I’m busy too.\n\n8. Even when I turn old, you can’t abandon me, be with me till I grow old and die.\n\n9. I’ll never forget the memories with you even with the passing of time.\n\n10. When the time comes for me to leave, please don’t be by my side, I won’t be able to leave peacefully, being a Master as stupid as you, would you be able to take care of yourself with me gone?>"
}