{
	"url": "https://www.novelupdates.com/series/its-over-the-major-general-is-bent/",
	"title": "It’s Over! The Major General is Bent! - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/05/Its-Over-The-Major-General-is-Bent.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Comedy   Drama   Psychological   Romance   Sci-fi   Supernatural   Tragedy   Yaoi   ",
	"tags": "Appearance Different from Actual Age   Character Growth   Cold Love Interests   Cosmic Wars   Cryostasis   Cute Protagonist   Dense Protagonist   Depictions of Cruelty   Determined Protagonist   Devoted Love Interests   Fated Lovers   Futuristic Setting   Handsome Male Lead   Human Experimentation   Love Interest Falls in Love First   Nobles   Obsessive Love   Outer Space   Power Couple   Sealed Power   Slow Growth at Start   Special Abilities   Straight Uke   Strong Love Interests   Weak to Strong   ",
	"rating": "(4.1 / 5.0, 53 votes)",
	"author": "Tian Luo Shui   天洛水   ",
	"year": "\nN/A",
	"ranking": "#3923   #4088   #4580   #10478   #3483   ",
	"reviewcount": "12 Reviews sorted by",
	"description": "When the youth found himself transmigrated into the interstellar world of the future, he was a bit dumbfounded. En, as dumbfounded as a primitive person crossing over into modern society. He has now become a primitive person.\n\nFortunately, this super thick golden thigh, cold, interstellar lord major general with fair skin, handsome looks, and long legs could easily lift you up to the sky and fly.\n\nBut what if this golden thigh wants to throw you to his territory planet to muddle along while waiting for death like a dandy, and you even have to carry out the task of going forth to multiply, reproducing like a pig?\n\n“No need… I like men.”\n\nThis absolutely pure straight lad has surely dug a pit, and he spent his whole lifetime burying it.\n\nEn, this is actually a dog-blood ‘overbearing interstellar marshal (promoted from major general) fell in love with me’ drama.\n\nAlso known as, 《The whole universe thinks that it was me, a straight guy who was bent, that bent their esteemed male god》.\n\nThe subordinates on the battleship who were forced to be stuffed with dog food every day at work by the Lord Major General watched at the side and sneered:\n\n“You still want to run after flirting with Lord Major General? He he.”>"
}