{
	"url": "https://www.novelupdates.com/series/transmigrating-into-the-villains-sickly-childhood-friend/",
	"title": "Transmigrating into the Villain’s Sickly Childhood Friend - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/10/Transmigrating-into-the-Villains-Sickly-Childhood-Friend.jpeg",
	"noveltype": "(CN)",
	"genre": "Action   Martial Arts   Mystery   Romance   Yaoi   ",
	"tags": "Adopted Children   Adventurers   Arms Dealers   Award-winning Work   Business Management   Businessmen   Calm Protagonist   Charismatic Protagonist   Clever Protagonist   Clingy Lover   Crime   Criminals   Cruel Characters   Cunning Protagonist   Doting Love Interests   Drugs   Enemies Become Allies   Friendship   Gambling   Gangs   Gunfighters   Handsome Male Lead   Hard-Working Protagonist   Kidnappings   Love Interest Falls in Love First   Movies   Murders   Near-Death Experience   Organized Crime   Police   Poor to Rich   Possessive Characters   Power Couple   Previous Life Talent   Revenge   Schemes And Conspiracies   Showbiz   Sickly Characters   Slow Romance   Smart Couple   Strategist   Strong Love Interests   Transmigration   Wars   Weak Protagonist   Wealthy Characters   Writers   Younger Brothers   ",
	"rating": "(3.9 / 5.0, 54 votes)",
	"author": "逆水舟   ",
	"year": "\n2020",
	"ranking": "#1653   #1606   #4706   #1700   #3329   ",
	"reviewcount": "9 Reviews sorted by",
	"description": "Qiao Wen was accidentally transmigrated into a 1970s Hong Kong style novel and became cannon fodder with the same name who died young.\n\nThe cannon fodder was the villain’s childhood friend in the novel. Due to a lack of funds, he died of a serious illness. His death was also the catalyst for the villain’s descent into madness, leading him down a bloody path of unscrupulous deeds for money, which eventually resulted in his tragic death from a stray bullet.\n\nQiao Wen, who had just awoken from a coma in a hospital bed, gazed at the dashing villain who was about to cut people with a knife in order to raise enough money to treat the original owner.\n\n—— I believe this individual can still be saved.\n\nWhile trying to make a fortune and get out of the slums, Qiao Wen stopped the villain from going dark.\n\nIt was necessary to establish a factory and engage in commercial activity.\n\nInvesting in stocks and real estate speculation are not to be overlooked.\n\nIt was also necessary to make movies and earn money in the entertainment industry.\n\nIn the meantime, fight evil forces in order to bring justice to the world.\n\n——I am a legend, not a cannon fodder.\n\nJust as everything seemed to be going smoothly, Qiao Wen noticed that the villain’s eyes were becoming increasingly strange, as if they had gone to the darkside.\n\nHe comforted the other person by patting them on the shoulder and saying, ”We’ll be good brothers, for a lifetime.”\n\n'En, good brothers under one quilt,' said someone with a grin on his face.>"
}