{
	"url": "https://www.novelupdates.com/series/spending-the-villains-money-to-extend-my-life/",
	"title": "Spending the Villain’s Money to Extend My Life - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/11/HEML.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Fantasy   Romance   ",
	"tags": "Arranged Marriage   Artists   Beautiful Female Lead   Business Management   Carefree Protagonist   Cheats   Cohabitation   Cold Love Interests   Cute Protagonist   Doting Love Interests   Female Protagonist   Handsome Male Lead   Heartwarming   Love Interest Falls in Love First   Misunderstandings   Modern Day   Money Grubber   Pregnancy   Previous Life Talent   System Administrator   Transmigration   Tsundere   Villainess Noble Girls   Wealthy Characters   ",
	"rating": "(4.1 / 5.0, 359 votes)",
	"author": "Salted Lobster   盐焗大龙虾   ",
	"year": "\n2019",
	"ranking": "#793   #1604   #148   #76   #506   ",
	"reviewcount": "91 Reviews sorted by",
	"description": "Gu Shishi, a master of traditional Chinese painting, transmigrated into the role of  a cannon fodder in a cliché novel.\n\nThe cannon fodder female supporting character was switched at birth. She had barely spent a few days with her biological parents before she was tossed into the wolf’s den by those same parents. Her parents, having no heart to send their fake daughter with a heart disease to live a hard life, forced the real daughter into becoming the replacement. Gu Shishi was sent away to marry the big villain – the rumored evil, cruel, and wife-cursing first young master of the Huo’s.\n\nOn the very first day that she had transmigrated, she had to face her fated tragic death….\n\nLuckily, she had also inadvertently discovered the path to altering her fate!\n\n— The more gifts she received from the big villain, the longer she could live and the more cheats she would gain!\n\nSystem:\n\n(Wealthy Housewife System, Initiated!)\n\n(Remaining Life: 8 minutes and 56 seconds)\n\n(Recharge to extend your life.)\n\n(Method of Recharging: Receive Money or Valuables from Wealthy Husband.)\n\n(Received DIOR Bobbin Net Smock x 1, recharge value: $15,000!)\n\n(Received FENDI Black Hooded Sweater x 1, recharge value: $10,160!)\n\n(Received Givenchy Single Strap Mini Floral Print Pleated Skirt x 1, recharge value $180,695!)\n\n(Recharge Successful!)\n\n(Note: 24 hours additional life for every $1,000.)>"
}