{
	"url": "https://www.novelupdates.com/series/im-actually-a-cultivation-bigshot/",
	"title": "I’m Actually a Cultivation Bigshot - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/01/Im-Actually-a-Cultivation-Bigshot.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Harem   Slice of Life   Xianxia   ",
	"tags": "Adapted to Manhua   Beast Companions   Beautiful Female Lead   Card Games   Caring Protagonist   Cooking   Cultivation   Dao Comprehension   Demons   Dragons   Easy Going Life   First-time Interc**rse   Fox Spirits   God Protagonist   Human-Nonhuman Relationship   Immortals   Kingdoms   Lack of Common Sense   Love Interest Falls in Love First   Magic Beasts   Male Protagonist   Misunderstandings   Monsters   Multiple POV   Mythical Beasts   Overpowered Protagonist   Phoenixes   Polygamy   Protagonist Strong from the Start   Sentient Objects   Transmigration   ",
	"rating": "(3.6 / 5.0, 106 votes)",
	"author": "Kinoshita Nakui   Rugao Under The Bridge   木下雉水   ",
	"year": "\n2020",
	"ranking": "#1380   #2851   #3992   #13807   #5482   ",
	"reviewcount": "34 Reviews sorted by",
	"description": "The Immortal Dao is ethereal, and Immortals are hard to find.\r\n\r\nLi Nianfan had descended into the cultivation world as a mortal. After learning that he has no hope in cultivation, he only wants to live a peaceful life.\r\n\r\nHowever…\r\n\r\nThe dog he adopts becomes a demon king of a generation when it sees his poems and paintings. It manages to suppress an entire world.\r\n\r\nThe tree he plants behind his house becomes a World Tree after listening to his zither music, forming a bridge between heaven and earth.\r\n\r\nHe meets a passerby who is enlightened by him and becomes an immortal sage who leads an entire generation.\r\n\r\nWhen he looks back—\r\n\r\nIt turns out that the scholar who had been pestering him for his calligraphy and paintings despite having crappy chess skills, is a chess saint from the Immortal Realm. The beautiful woman who comes to listen to his music every night is the number one saintess of the Immortal Realm…>"
}