{
	"url": "https://www.novelupdates.com/series/picked-up-a-small-cannon-fodder/",
	"title": "Picked Up A Small Cannon Fodder - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/08/Picked-Up-A-Small-Cannon-Fodder.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Fantasy   Romance   Shounen Ai   ",
	"tags": "Age Regression   Brotherhood   Businessmen   Charming Protagonist   Child Protagonist   Childcare   Childhood Friends   Childish Protagonist   Couple Growth   Cute Children   Cute Protagonist   Doting Older Siblings   Doting Parents   e-Sports   Friendship   Handsome Male Lead   Lack of Common Sense   Lucky Protagonist   Modern Day   Older Love Interests   Playful Protagonist   Shameless Protagonist   Slow Romance   Transmigration   Wealthy Characters   ",
	"rating": "(3.5 / 5.0, 44 votes)",
	"author": "Miāo Jí Jí   喵吉吉   ",
	"year": "\n2021",
	"ranking": "#3133   #4865   #5623   #5958   #5404   ",
	"reviewcount": "4 Reviews sorted by",
	"description": "Li Ji Yue transmigrated in a book and became a three-year-old little cannon fodder.\n\nThe other cannon fodders are messing up while the little cannon fodder is just eating, drinking and sleeping all day. His legs crossed waiting for tomorrow’s little milk.\n\nLater, the little cannon fodder and the supporting character met.\n\nJiang Fang looked at the little one who suddenly ran out and bumped into him.\n\nThis little one shamelessly filed a complaint first, “You knocked this baby down, you need to give two pieces of cake to make him stand up.”\n\nThe three-year-old baby in the small theater continues to believe that his IQ is no different from his brother in junior high school and in order to prove this, Li Jiyue secretly followed after his brother while he was going to school, planning to pass the entrance exam.\n\nThe on-duty student with the red armband on his shoulder grabbed him and sent him to the baby nursery school next door.\n\nLi Jiyue, who was forcibly sent to the kindergarten, thumped his helpless little short legs, “Let this baby go! You… caught the wrong person.”>"
}