{
	"url": "https://www.novelupdates.com/series/ascendance-of-a-bookworm/",
	"title": "Ascendance of a Bookworm - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2015/12/Ascendance-of-a-Bookworm.jpg",
	"noveltype": "(JP)",
	"genre": "Adventure   Comedy   Drama   Fantasy   Shoujo   Slice of Life   Supernatural   ",
	"tags": "Abandoned Children   Academy   Adapted to Anime   Adapted to Drama CD   Adapted to Manga   Adopted Children   Adopted Protagonist   Age Progression   Artists   Award-winning Work   Battle Competition   Books   Bookworm   Business Management   Character Growth   Child Protagonist   Childhood Friends   Clever Protagonist   Coma   Contracts   Cooking   Crafting   Dense Protagonist   Determined Protagonist   Different Social Status   Domestic Affairs   Doting Parents   Economics   European Ambience   Familial Love   Family   Family Conflict   Fantasy Creatures   Female Protagonist   Genius Protagonist   Goddesses   Gods   Kingdom Building   Knights   Late Romance   Library   Magic   Magic Beasts   Magical Technology   Merchants   Modern Knowledge   Money Grubber   Multiple POV   Music   Mysterious Illness   Nobles   Poor Protagonist   Poor to Rich   Pregnancy   Priestesses   Priests   Quirky Characters   Reincarnated in Another World   Religions   Restaurant   Romantic Subplot   Royalty   Saints   Schemes And Conspiracies   Secret Identity   Secrets   Siblings   Siblings Not Related by Blood   Sickly Characters   Singers   Slow Growth at Start   Slow Romance   Special Abilities   Sword And Magic   Technological Gap   Time Skip   Transmigration   Transplanted Memories   Unreliable Narrator   Villainess Noble Girls   Weak Protagonist   Weak to Strong   Wealthy Characters   ",
	"rating": "(4.2 / 5.0, 720 votes)",
	"author": "Kazuki Miya   美夜香月   ",
	"year": "\n2013",
	"ranking": "#2210   #2385   #274   #1891   #118   ",
	"reviewcount": "155 Reviews sorted by",
	"description": "A bookworm who had finally found a job as a librarian at a university was sadly killed shortly after graduating from college.\n\nShe was reborn as Myne, the daughter of a soldier in a world where the literacy rate is low and books were scarce. No matter how much she wanted to read, there were no books around. What is a bookworm to do without any books? Make them, of course.\n\nHer goal is to become a librarian! So that she may once again live surrounded by books, she must start by making them herself.>"
}