{
	"url": "https://www.novelupdates.com/series/my-loves-first-love-is-back/",
	"title": "My Love’s First Love is Back - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/03/My-Loves-First-Love-is-Back.jpg",
	"noveltype": "(KR)",
	"genre": "Drama   Fantasy   Romance   ",
	"tags": "Beautiful Female Lead   European Ambience   Fated Lovers   Female Protagonist   First Love   Handsome Male Lead   Late Romance   Long Separations   Misunderstandings   Protagonist Falls in Love First   Saints   Second Chance   ",
	"rating": "(4.0 / 5.0, 21 votes)",
	"author": "체리봉봉   ",
	"year": "\n2020",
	"ranking": "#4265   #4834   #8956   #4880   #7939   ",
	"reviewcount": "2 Reviews sorted by",
	"description": "He stood by his almost dead lover and longed for her like a broken man. \n\nShe was someone under the pretext of being his ‘friend’.\n\nThe moment Elsia thought she had finally opened up Ian’s heart…….\n\n‘She’ came back.\n\nIt was painful to see the back of a man who was willing to let go of a friend’s hand just to run toward his old lover.\n\n“Ian, I have loved you for a long time. I’ve never thought of you as a friend, ever since the beginning. It’s been like that all year round.”\n\nSince they will never see each other again, Elsia was able to run away after throwing her painful confession for the first and last time.\n\nBy the way….\n\nHe said that he had struggled to find Elsia, who had given up on her long unrequited love and ran away from him.\n\n“Elsie…….”\n\n“Stop! Don’t call my name!”\n\nShe screamed out loud enough to surprise even herself and immediately felt that distant feeling of emptiness.\n\nThe moment she heard Ian’s voice, which she had been desperately trying to forget, she realized that she had not yet given up on her tormenting unrequited love.\n\nTo her, he was her first love, her last love, and the only one who had her eternal love engraved on her chest like a brand.\n\nIan said to Elsia, who was trying to reject him with all her might.\n\n“It must have been our destiny since you came to Eusley Castle to wake me up. The rest of my time will be spent by looking at you wherever you are. Right here, Ian Cypris swears to Elsia Bennett.”\n\nThen, Elsia’s heart began pounding again.>"
}