{
	"url": "https://www.novelupdates.com/series/the-incompetent-prince-who-has-been-banished-wants-to-hide-his-abilities-the-strongest-sage-who-reincarnated-twice-he-wanted-to-enjoy-this-life-so-took-it-easy-and-was-banished-from-the-royal-famil/",
	"title": "The Incompetent Prince Who Has Been Banished Wants To Hide His Abilities~ The Strongest Sage Who Reincarnated Twice, He Wanted To Enjoy This Life, so Took It Easy and Was Banished From the Royal Family. It’s Too Late To Be Told Come Back Now Cause the People of the Territory Have Noticed His Abilities, and Won’t Let Him Return to His Family Home - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/01/The-Incompetent-Prince_1642486506.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Comedy   Fantasy   Harem   Shounen   ",
	"tags": "Assassins   Butlers   Complex Family Relationships   Demon Lord   Demons   Discrimination   Enemies Become Allies   Family Conflict   Fantasy World   Heroes   Kingdom Building   Kingdoms   Knights   Loli   Loyal Subordinates   Magic   Maids   Male Protagonist   Misunderstandings   Overpowered Protagonist   Protagonist Strong from the Start   Quirky Characters   Reincarnated in Another World   Reincarnation   Royalty   Selfish Protagonist   Sibling Rivalry   Sword And Magic   Underestimated Protagonist   ",
	"rating": "(2.9 / 5.0, 66 votes)",
	"author": "Ibarakino   茨木野   ",
	"year": "\n2021",
	"ranking": "#1453   #4731   #4044   #3122   #5676   ",
	"reviewcount": "8 Reviews sorted by",
	"description": "The main character, Noah, is a reincarnated person. He was active as a sword saint in a previous life, and as a sage in another. But he’s been forced to work hard all his life, and he’s sick of being a hero!\n\nOne day, Noah dies and wakes up to find that he has been reborn as a prince. He had a high level of magical talent and the swordsmanship of a sword saint, but he didn’t want to get busy again, so Noah pretended to be incompetent with all his might.\n\nThen, on his 15th birthday. A skill appraisal revealed that he was incompetent (actually, he was just hiding it with his concealment skill). Noah was scorned and banished. With what seemed like a gesture of warmth, his father gave him a remote territory.\n\n“Now I’ll enjoy my second life!” Noah was enthusiastic, but he didn’t know.\n\nActually, the territory was in the devil’s forest, which is said to be uninhabitable. But his past life was more advanced compared to this one, and the level of human beings in this world was lower. Noah’s ability is revealed when he helps a girl who was attacked by a monster in the forest.\n\n“Amazing!!! Noah-sama defeated a dragon with a single blow!”\n\n“How did this happen? Ahhhhh!”\n\nOn the other hand, the royal family also noticed Noah’s ability and came to take him back, but it was too late. At that time, Noah was already being praised by the people as the lord of the Demon Forest.>"
}