{
	"url": "https://www.novelupdates.com/series/di-daughters-rebirth-sheng-shi-wang-fei/",
	"title": "Di Daughter’s Rebirth: Sheng Shi Wang Fei - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2018/03/SSWF-1.jpg",
	"noveltype": "(CN)",
	"genre": "Drama   Fantasy   Romance   ",
	"tags": "Ancient China   Arranged Marriage   Beautiful Female Lead   Betrayal   Complex Family Relationships   Familial Love   Female Protagonist   Handsome Male Lead   Love Interest Falls in Love First   Older Love Interests   Possessive Characters   Pregnancy   Reincarnation   Revenge   Royalty   Schemes And Conspiracies   Second Chance   ",
	"rating": "(4.0 / 5.0, 110 votes)",
	"author": "Dú Bù Yún Xiāo   Unrivaled In The Sky   独步云霄   ",
	"year": "\n2014",
	"ranking": "#1969   #2586   #1675   #3025   #1678   ",
	"reviewcount": "23 Reviews sorted by",
	"description": "On her wedding day, she was humiliated; her status as the legitimate wife was instantly changed into that of a concubine.\n\n“Who*e! Marrying you is my life’s shame!” These were the hurtful words that came from her childhood sweetheart, now husband.\n\n….\n\nJiejie, jiejie, thank you for your sacrifice. Jiejie, if you’re kind then go. Meimei will replace you and take good care of your husband, to help you enjoy the blessings that you are unable to enjoy!” these words spat out by her smiling cousin made her whole body feel cold.\n\n….\n\n“You are shameless! There is no need to say anything! From now on, our Shen family will not have you as our daughter! Someone! Throw out this shameless woman!” These were her relatives?\n\n…\n\nBecoming the target of criticisms, and being submerged in a small lake, she realized that all of this was the result of another person’s scheme – but it was already too late!\n\n…\n\nInstead of dying, she went back to the past, back to where both feelings were still alive and were loving towards each other; back to when she was not yet an orphan but the doted on Di daughter of the Shen family. \n\nNo matter what, in this life, she would never allow anyone to hurt the people she loved. And those people who harmed her in the previous life, she would make them pay the price!>"
}