{
	"url": "https://www.novelupdates.com/series/today-the-foolish-scum-gong-screwed-me-over-again/",
	"title": "Today, the Foolish Scum Gong Screwed Me Over Again - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/06/Today-the-Idiot-Scum-Gong-Screwed-Me-Over-Again.png",
	"noveltype": "(CN)",
	"genre": "Comedy   Drama   Mystery   Psychological   Romance   Shounen Ai   ",
	"tags": "Acting   Adapted to Drama CD   Adapted to Manhua   Adultery   Artificial Intelligence   Betrayal   Bickering Couple   Character Growth   Cheats   Child Abuse   Childhood Friends   Cold Love Interests   Confident Protagonist   Couple Growth   Devoted Love Interests   Dishonest Protagonist   Distrustful Protagonist   Doting Love Interests   Enemies Become Lovers   First-time Interc**rse   Forced Marriage   Game Elements   Handsome Male Lead   Jealousy   Kuudere   Love at First Sight   Love Interest Falls in Love First   Marriage   Misunderstandings   Modern Day   Obsessive Love   Past Plays a Big Role   Past Trauma   Persistent Love Interests   Possessive Characters   Seduction   Shameless Protagonist   Strong Love Interests   Suicides   System Administrator   Time Loop   Time Paradox   Time Travel   Transported into a Game World   Unlucky Protagonist   Unreliable Narrator   Virtual Reality   Wealthy Characters   ",
	"rating": "(4.5 / 5.0, 259 votes)",
	"author": "Red Mouth White Teeth   红口白牙   ",
	"year": "\n2020",
	"ranking": "#6970   #762   #1885   #1193   #1595   ",
	"reviewcount": "71 Reviews sorted by",
	"description": "Qiu Yanzhi was a jaded university student who came across a popular virtual reality dating simulator. One capture target in particular, He Zhou, caught his eye immediately.\n\nBut why was this guy such an as*hole for no reason?? Game devs, WTF were you thinking???\n\nBut for some reason Qiu Yanzhi stuck around. He found that He Zhou wasn’t so bad after all. Qiu Yanzhi had fun in game, basking in the warmth and affection missing from his real life.\n\nThat was, until he couldn’t log out anymore.\n\nTrapped inside the game, Qiu Yanzhi saw only one way out: seducing the capture target to complete the main storyline.\n\nAnd if that meant he had to pretend, to lie, to scheme and deceive?\n\nHe would do it.\n\nAfter all…\n\nThis was just a game, right?>"
}