{
	"url": "https://www.novelupdates.com/series/starting-with-contract-pets/",
	"title": "Starting With Contract Pets - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/02/Starting-With-Contract-Pets.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Fantasy   Xuanhuan   ",
	"tags": "Academy   Alternate World   Beast Companions   Beautiful Female Lead   Bloodlines   Calm Protagonist   Clever Protagonist   Cohabitation   Cultivation   Devoted Love Interests   Dragons   Evolution   Familial Love   Fast Cultivation   Handsome Male Lead   Hidden Abilities   Hiding True Abilities   Male Protagonist   Master-Disciple Relationship   Mature Protagonist   Monster Tamer   Monsters   Mutated Creatures   Mythical Beasts   Pets   Poor to Rich   Power Couple   Power Struggle   Protagonist Falls in Love First   Romantic Subplot   Ruthless Protagonist   Secrets   Spatial Manipulation   Special Abilities   Spirits   Strong Love Interests   System Administrator   Time Skip   Transmigration   Underestimated Protagonist   Weak to Strong   World Hopping   Younger Brothers   ",
	"rating": "(2.9 / 5.0, 17 votes)",
	"author": "Ooty   ",
	"year": "\nN/A",
	"ranking": "#6970   #4764   #7689   #13807   #11007   ",
	"reviewcount": "7 Reviews sorted by",
	"description": "Su Bai wakes up and finds that the world has changed drastically. He realizes he has come to a world of pets. After accepting the new setting, he is determined to become a powerful Pet Tamer. \r\n\r\nOne day, Su Bai’s pet releases a beginner skill spark. Flames flutter and the sky turns to ashes… \r\n\r\nA water attribute beginner skill causes the boundless sea to fall from the sky, flooding thousands of miles of mountains and rivers… \r\n\r\nOne blow rips apart the claw, and endless sharp bursts explodes. One after another, worlds fall apart… \r\n\r\nA passerby: (ﾟДﾟ≡ﾟдﾟ)!? \r\n\r\nThis is a world of pets and monsters. Every teenager will develop a soul stone in the middle of their eyebrows. \r\n\r\nAfter placing the soul stones into stones, branches, water, and any other thing, a spirit egg unique to the owner would be born. \r\n\r\nOnce the spirit is hatched, the owner will receive his own beginner spirit contract book. Then, he can embark on the road of contracting and training various spirits and monsters. \r\n\r\nHowever, Su Bai seems to be doing things a little differently… \r\n\r\n[Tags]: Beginner spirit, pets, monsters, spirits, cultivation, evolution, daily ease, adventure>"
}