{
	"url": "https://www.novelupdates.com/series/the-gangster-baby-of-the-dukes-family/",
	"title": "The Gangster Baby of the Duke’s Family - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/01/The-Gangster-Baby-of-the-Dukes-Family.jpeg",
	"noveltype": "(KR)",
	"genre": "Comedy   Drama   Fantasy   Romance   ",
	"tags": "Child Protagonist   Childcare   European Ambience   Family   Female Protagonist   Reincarnated in Another World   Reincarnation   Villainess Noble Girls   ",
	"rating": "(4.1 / 5.0, 28 votes)",
	"author": "Eclair   에클레어   ",
	"year": "\n2022",
	"ranking": "#6970   #6152   #8964   #7720   #6399   ",
	"reviewcount": "No Reviews",
	"description": "My name is Leonora Hachania.\n\nI’m the daughter of a minor extra villain, but I have a great desire for power. I can’t leave the Hachanias as insignificant as the original!\n\n“Cloudy to the left!”\n“Do it!”\n\n“Cloudy to the right!”\n“Just Do it!”\n\nShowing off my sunglasses made with ink, I raised my voice.\n“Enoch, don’t cry!”\n\nThe third child, who made weak eye contact with me, was surprised and sniffed his runny nose. \n“Wahh, I won’t cry!”\n\nI succeeded.\n\n“Was it supposed to be this week? It’s like tr*sh.”\n“Gasp! Save-save me!”\n“Brother, why don’t you kill him quickly because it looks like it would be a better thing for him.”\n\nMy older brothers who used to be extras became the world’s greatest villains who can even blow the male lead away! The clumsy villain dad was a challenge though.\n\n“Lini, what else are you planning to do…”\n“Hoho, never mind. You’re planning something mean like my daughter. That’s good.”\n\nHe was converted to a duel personality villain.\n\nHaha! Good. I must use the original information to make my family significant and raise my wealth!\n\nI tried to escape the time-limit body by enjoying the life of a real villain.\n“I know the princess is a kind person, so wishing only for you to be kind to me would be greedy.”\n\nI think the human weapon that was revived for the family is a little broken.\n“But if there’s no subject to be kind to…”\n\nThe bright red flame from his hand burned the world map.\n“Shouldn’t you be kind to yourself?”>"
}