{
	"url": "https://www.novelupdates.com/series/non-human-seeking-re-employment/",
	"title": "Non-Human Seeking Re-employment - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/11/5d2c81fada01f51046.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Horror   Romance   Shounen Ai   Supernatural   ",
	"tags": "Amnesia   Arranged Marriage   Clingy Lover   Confident Protagonist   Cute Protagonist   Dense Protagonist   Doting Love Interests   Folklore   Game Elements   Ghosts   Handsome Male Lead   Human-Nonhuman Relationship   Humanoid Protagonist   Lack of Common Sense   Lazy Protagonist   Love at First Sight   Love Interest Falls in Love First   Misunderstandings   Mystery Solving   Overpowered Protagonist   Past Plays a Big Role   Power Couple   Protagonist Strong from the Start   Strong Love Interests   Survival Game   Unlimited Flow   World Hopping   ",
	"rating": "(4.5 / 5.0, 175 votes)",
	"author": "Méihuā Liù   梅花六   ",
	"year": "\n2019",
	"ranking": "#515   #300   #1149   #1227   #1043   ",
	"reviewcount": "30 Reviews sorted by",
	"description": "Shen Dongqing was a powerful, thousand-year-old ferocious ghost. He had just possessed a body and barely managed to relax for two days when he was pulled into a world where hundreds of ghosts were running amok.\n\nOn the first day of being pulled into the Infinite Nightmare Game:\n\nOther players were trembling, crying and wailing about wanting to go home.\n\nShen Dongqing was eating, sleeping, and playing Fight the Landlord (card game).\n\nThe second day:\n\nOther players were covering their heads and scurrying away like frightened rats as they were being chased by ghosts, and they were crying out loud for help.\n\nShen Dongqing was eating, sleeping and playing Fight the Landlord.\n\nThe third day.\n\nShen Dongqing……\n\nThe ghosts finally set their sights on this lazy player. The other players were finding joy in his misfortune, but in the end, no one had expected that the slim and pale Shen Dongqing would throw down his phone and directly dispatch the ghosts with his bare hands.\n\nOther ghosts: Can’t afford to mess with him, move, move.>"
}