{
	"url": "https://www.novelupdates.com/series/i-will-parry-everything-to-become-the-greatest-adventurer/",
	"title": "I Will Parry Everything to Become the Greatest Adventurer! - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/09/qajf8dp7sx7i2xs1obzqt9m5uy_6vm_m8_vm_6e7a.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Fantasy   Shounen   ",
	"tags": "Adapted to Manga   Adventurers   Demons   Dense Protagonist   Fantasy World   Guilds   Male Protagonist   Misunderstandings   Monsters   Protagonist Strong from the Start   Special Abilities   Unreliable Narrator   ",
	"rating": "(3.3 / 5.0, 35 votes)",
	"author": "Nabeshiki   鍋敷   ",
	"year": "\n2019",
	"ranking": "#6970   #6298   #5690   #5505   #7286   ",
	"reviewcount": "7 Reviews sorted by",
	"description": "This is the tale of a man who had mastered how to “Parry”.\r\n\r\n------------\r\n\r\n“I have no talent at all…”\r\n\r\nAt the age of 12, a young boy named Noru had decided to train himself in the mountains after being rejected by the capital’s official training centers for being “talentless”. He believed that, with enough hard work and effort, he could one day become like the protagonists that populate his childhood stories. Full of determination, he would practice every day with his makeshift wooden sword, endlessly repeating the only sword technique he knew—“Parry”.\r\n\r\nThe hours turned into days, the days turned into months, and the months turned into years.\r\n\r\nEventually, he had trained this one skill to such an extreme that he could snap a thousand branches with it. However, no matter how hard he tried, he couldn’t get the desired result, he couldn’t learn any new skills required to become a real adventurer. It may be time to let go of his dream. But he couldn’t. Not just yet. Knowing this, he returned to the capital again.\r\n\r\n-----------\r\n\r\nThis was a man of endless dedication, a man who used that dedication to become one of the strongest in the world. The only problem is, he didn’t know it yet.>"
}