{
	"url": "https://www.novelupdates.com/series/i-became-the-mother-of-the-male-leads-children/",
	"title": "I Became The Mother Of The Male Lead’s Children - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/01/I-Became-The-Mother-Of-The-Male-Leads-Children.jpeg",
	"noveltype": "(KR)",
	"genre": "Drama   Fantasy   Romance   ",
	"tags": "Aristocracy   Beautiful Female Lead   Calm Protagonist   Caring Protagonist   Childcare   Cold Love Interests   Cold Protagonist   Confident Protagonist   Contracts   Couple Growth   Cute Children   Determined Protagonist   European Ambience   Female Protagonist   Handsome Male Lead   Knights   Love Interest Falls in Love First   Marriage   Marriage of Convenience   Master-Servant Relationship   Mature Protagonist   Mob Protagonist   Nobles   Power Struggle   Pragmatic Protagonist   Pretend Lovers   Proactive Protagonist   Slow Romance   Smart Couple   Transmigration   Transported to Another World   ",
	"rating": "(3.8 / 5.0, 58 votes)",
	"author": "Seon Um   선움   ",
	"year": "\n2021",
	"ranking": "#3923   #4847   #3376   #6886   #2649   ",
	"reviewcount": "10 Reviews sorted by",
	"description": "She became the wife of a male lead inside the novel that she couldn’t finish.\r\n\r\nShe was also the supporting character who died out of jealousy of the relationship between the male lead and the heroine.\r\n\r\nDaisy, who didn’t want to face such a dark future, came up with a condition instead of marrying the male lead, Carlyx.\r\n\r\n“Please divorce me in two years.”\r\n\r\n“Sure.”\r\n\r\nDuring these 2 years, I will revive my family, gain honor and wealth, and then get out!\r\n\r\nAfter signing the contract with him, Daisy began to take care of the family.\r\n\r\nHowever, thanks to Carlyx who never took care of the family, the servants were working half-assedly, so Daisy decided to fix it.\r\n\r\nIn the meantime, she met with Carlyx’s children…\r\n\r\n“Henloo, my name is Ravi. Tino is two years old and I’m four years old.”\r\n\r\nOh my gosh, so cute! For Daisy, who bounced here and there to maintain the family for two years, those cute children were like a healing.\r\n\r\nAs she loved the children and got closer to them, Carlyx’s indifferent attitude seemed to change.\r\n\r\n“Show me your cheek.”\r\n\r\nChu! Plump lips softly left a trace on her cheek. Carlyx kissed me on the cheek?!\r\n\r\nCan I really get out of this house safely in two years?\r\n\r\n***\r\n\r\nSoon after, Carlyx, who had to go to the battlefield, came with a broken arm.\r\n\r\n“I want to spend more time with you.”\r\n\r\nI’m sure there was nobody in this empire who could hurt him, though?\r\n\r\nDaisy was right. Carlyx broke his bones willingly.>"
}