{
	"url": "https://www.novelupdates.com/series/monster-paradise/",
	"title": "Monster Paradise - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2017/11/Monster-Paradise.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Comedy   Fantasy   Supernatural   Xuanhuan   ",
	"tags": "Ability Steal   Adapted to Manhua   Artifacts   Artificial Intelligence   Beast Companions   Blood Manipulation   Calm Protagonist   Cautious Protagonist   Cheats   Cultivation   Dragons   Evolution   Fast Cultivation   Firearms   Game Elements   Gods   Guilds   Gunfighters   Handsome Male Lead   Hard-Working Protagonist   Heroes   Hiding True Abilities   Hiding True Identity   Hunters   Lucky Protagonist   Magical Technology   Male Protagonist   Modern Day   Monster Tamer   Monsters   Multiple Identities   Multiple Realms   Multiple Transported Individuals   Mutated Creatures   Poor to Rich   Psychic Powers   Secret Organizations   Siblings   Skill Assimilation   Special Abilities   Strategist   Strength-based Social Hierarchy   Sudden Strength Gain   Sudden Wealth   Summoning Magic   Sword Wielder   Transformation Ability   Transmigration   Underestimated Protagonist   Vampires   Weak to Strong   Wealthy Characters   Younger Sisters   ",
	"rating": "(3.7 / 5.0, 572 votes)",
	"author": "Nuclear Warhead Cooked in Wine   酒煮核弹头   ",
	"year": "\n2017",
	"ranking": "#2000   #1045   #110   #5009   #839   ",
	"reviewcount": "80 Reviews",
	"description": "800 years ago, 3000 dimensional gates opened across the entire world. In that moment, it was as if 3000 different colored eyes opened across the world as hordes of monsters swarmed out of these gates like tears.\n\nSome could destroy city walls with one strike; They had bodies the size of a giant and fed on humans\n\nSome latched onto humans, absorbing their bodies’ nutrients and enslaving humans\n\nSome infiltrated the humans’ cities, disguising themselves as normal human beings while feeding upon human blood to sustain themselves.\n\nIn a night, the Human race fell to the bottom of the food chain.\n\nThe world had turned into a paradise for monsters…>"
}