{
	"url": "https://www.novelupdates.com/series/novoland-yuchuanshuo/",
	"title": "Novoland: YuChuanShuo - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2018/10/yuchuanshuo.png",
	"noveltype": "(CN)",
	"genre": "Fantasy   Tragedy   ",
	"tags": "Alternate World   Politics   Wars   Weak to Strong   ",
	"rating": "(2.4 / 5.0, 7 votes)",
	"author": "Jin HeZai   今何在   ",
	"year": "\n2005",
	"ranking": "#2000   #2000   #12894   #10066   #12562   ",
	"reviewcount": "No Reviews",
	"description": "In the ancient and magical land of Novoland, there exists such a group of magical beings : they are light in body, and they can retract their wings and fly high on the night of the full moon. They are called the Winged People.\nThis is a story of the rise and fall of the Winged Dynasty. The Yi clan, descendants of the second dynasty of the Winged clan, and the Feng clan, descendantspowe of the first dynasty, conspired to overthrow the rule of the third dynasty and restore their kingship. However, due to the implementation of the unpopular 'Jian Kong Decree', the Yi clan divided the Winged People into nine classes, which caused the resentment of the lower Winged People, eventually leading to riots and the establishment of a new dynasty. However, the new Winged King was weak and conservative, and the Winged clan gradually declined under his leadership. At this time, the Ye Chen Legion of the Human Race annihilated the elite of the Winged Race, the Hexue Tuan, wiping them at once by taking advantage of the 'Changing Time of The Moon' event that only happens once in a thousand years. Now, the Hexue clan has become ancient history, and the technique of Hexue Yongxiang became an ancient myth.\nXiang Yi Zhi and Feng Ling Xue met in such a troubled world. One of them is a descendant of the Dark Moon, born with black wings, and his flight will always announce the coming of disaster, hatred, and war. Facing the various coups and wars, is it love or conspiracy? Is it justice or selfishness? At the beginning, the lovers who walked through the wind and snow together will finally be able to enter the spring together...\n>"
}