{
	"url": "https://www.novelupdates.com/series/seize-the-throne/",
	"title": "Seize the Throne - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/08/Seize-the-Throne.jpeg",
	"noveltype": "(CN)",
	"genre": "Drama   Psychological   Romance   Yaoi   ",
	"tags": "Body-double   Childcare   Childhood Friends   Cold Love Interests   Cute Children   Depression   Famous Protagonist   Handsome Male Lead   Lovers Reunited   Male Yandere   Manly Gay Couple   Misunderstandings   Modern Day   Mpreg   Multiple Reincarnated Individuals   Obsessive Love   Revenge   R*pe   Showbiz   Slow Romance   Strong Love Interests   System Administrator   Time Travel   Transmigration   Yandere   ",
	"rating": "(4.5 / 5.0, 59 votes)",
	"author": "Li Lanlan   梨蓝蓝   ",
	"year": "\n2021",
	"ranking": "#469   #2336   #6274   #6790   #4820   ",
	"reviewcount": "11 Reviews sorted by",
	"description": "Bian Yi was the antagonist of a BL Novel who got his body stolen by a transmigrator.\r\n\r\nBian Yi became aware of that fact only after being imprisoned for more than a decade.\r\n\r\nIn this book, Bian Yi and his childhood friend Kou Li, who also happened to be the Gong Protagonist, fell in love with each other and got married. However, when Kou Li suffered a decline in his business, Bian Yi left his son and ran away. The antagonist canon fodder who ran away didn’t expect that Kou Li would be able to rise again in a few days, nor did he expect that the son he abandoned would become an absolute genius in the future.\r\n\r\nThe transmigrator was sent to the moment Bian Yi left home. He, who was well aware of the plot, and had the same face as Bian Yi, brought big bags of gifts to Bian Yi and Kou Li’s home.\r\n\r\nThe door was opened and a storm brewed into the eyes of the man at the other side of the door.\r\n\r\nThe transmigrator tilted his head, smiled at Kou Li, and said to him: “What is it? You know how hard it is to raise a kid, right? Don’t be angry with me, I brought you a present.”\r\n\r\nSince then, both his husband and son no longer belonged to Bian Yi.\r\n\r\nEver since that moment, the trapped Bian Yi tried everything to escape. However, he failed to free himself every single time. In the end, he died with great resentment.\r\n\r\nBian Yi thought that this would be the end of his miserable life, but he never expected that a voice, who claimed to be a ‘Revenge System’, would find him.\r\n\r\nBian Yi then returned to the first year after being replaced.\r\n\r\nThe first thing Bian Yi did, once he came back, was to buy a knife at a supermarket and rush towards Kou Li’s house. As he held the knife against his former husband’s neck, he shouted crazily: “Are you f*cking blind?!”\r\n\r\nThere was blood dripping on the floor.\r\n\r\nBian Yi was pinned against the wall, and his neck was bitten roughly by that man.\r\n\r\nKou Li, whose lips were still stained with Bian Yi’s blood, was acting even madder than Bian Yi. When suddenly, Bian Yi heard that man’s hoarse voice ringing in his ears: “After seventeen years, you’re finally back.”>"
}