{
	"url": "https://www.novelupdates.com/series/a-genius-boy-who-was-exiled-from-his-family-home-for-not-being-able-to-use-magic-becomes-a-witchs-apprentice-and-masters-all-magic-in-the-right-way-this-is-how-you-use-your-magic-you-know/",
	"title": "A Genius Boy Who Was Exiled From His Family Home for “Not Being Able To Use Magic” Becomes a Witch’s Apprentice and Masters All Magic in the Right Way. This Is How You Use Your Magic, You Know? - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/02/A-Genius-Boy-Who-Was-Exiled-From-His-Family-Home-for-Not-Being-Able-To-Use-Magic-Becomes-a-Witchs-Apprentice-and-Masters-All-Magic-in-the-Right-Way-This-Is-How-You-Use-Your-Magic-You-Know.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Fantasy   Romance   Shounen   ",
	"tags": "Adapted to Manga   Age Progression   Beautiful Female Lead   Bloodlines   Child Abuse   Childhood Friends   Fallen Nobility   Fantasy World   Love Interest Falls in Love First   Magic   Male Protagonist   Master-Disciple Relationship   Sword And Magic   Time Skip   Underestimated Protagonist   Weak to Strong   ",
	"rating": "(3.2 / 5.0, 33 votes)",
	"author": "Miwa Mohi   みわもひ   ",
	"year": "\n2021",
	"ranking": "#2000   #2000   #5127   #8230   #6448   ",
	"reviewcount": "2 Reviews sorted by",
	"description": "'You’re a failure, don’t ever cross my threshold again!' \n\nIn a country where magic is everything, especially in a kingdom where everything is determined by the ability of ‘bloodline magic’ that only nobles are born with. Hermes, who was born as the second son of a certain noble family, was found to be a “failure” with no bloodline magic despite his high magical talent, and was exiled from the family. Hermes was almost killed in the depths of his disappointment, but then he was picked up by Rose, a “witch” he met, who saw his talent and made him her apprentice. \n\nAfter five years of training, he returns to King’s Landing with the most powerful magic of all – the ability to recreate all magic – and learns all kinds of magic he never knew he could. He corrects the wrong thinking spreading in the kingdom, saves his childhood friends who suffer from magic, destroys the incompetent position of the bloodline magic-dependent people who banished him, and eventually makes a name for himself as the savior of the kingdom.>"
}