{
	"url": "https://www.novelupdates.com/series/doberman/",
	"title": "Doberman - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/11/Doberman_1636613939.jpg",
	"noveltype": "(KR)",
	"genre": "Adult   Drama   Josei   Romance   Smut   ",
	"tags": "Beautiful Female Lead   Charismatic Protagonist   C*nnilingus   Crime   Cute Children   Drugs   Evil Organizations   Female Protagonist   F*llatio   Gambling   Gangs   Handsome Male Lead   Modern Day   Murders   Pets   R-18   Sibling Rivalry   Twins   ",
	"rating": "(3.9 / 5.0, 40 votes)",
	"author": "Chyomchyom   춈춈   ",
	"year": "\n2021",
	"ranking": "#3133   #2150   #8171   #12557   #7399   ",
	"reviewcount": "1 Review sorted by",
	"description": "'Do you want your passport back?'\r\n\r\nHe stared straight at her eyes that were clearly shining under her short bangs.\r\n\r\n'…Give it back.'\r\n\r\n'Then you will have to work hard for it.'\r\n\r\nWhile she was chewing the meat in her mouth hard, the next piece of meat came into her mouth right after. Avoiding it was not as simple because she thought the fork would become a weapon in this man's hand.\r\n\r\nThe meat that she barely chewed and fell over her neck in chunks.\r\n\r\n'What should I do to get it back?”\r\n\r\n'While growing up, did no adults tell you this? You can't just say what you want, so don't say it like that.'\r\n\r\nA large chunk of meat could not fall over and felt stuck somewhere in her throat. Sarin clenched her fist and tapped her chest.\r\n\r\n'Hmm…'\r\n\r\n'Well, if you'd just spent that money on laundry, we wouldn't have had a chance to face each other like this. Don't you think so?'\r\n\r\nIt was a simple favour until the money was received, and then it was malice. Owen's interest borders on malice. His golden eyes glistened. It looked like a completely crazy look, it gave her goosebumps from the inside of her wrist.\r\n\r\n'…My flight is just around the corner. I have to go back.'\r\n\r\nNot interested in feeding anymore, he laid down his fork carelessly. She could hear the sound of metal hitting the plate.\r\n\r\n'That's your situation.'\r\n\r\nWord is that her situation is not over yet.>"
}