{
	"url": "https://www.novelupdates.com/series/regressor-instruction-manual/",
	"title": "Regressor Instruction Manual - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/05/Regressor-Instruction-Manual.jpg",
	"noveltype": "(KR)",
	"genre": "Action   Adventure   Comedy   Fantasy   Harem   Mature   Psychological   Seinen   ",
	"tags": "Adapted to Manhwa   Adopted Children   Alchemy   Antihero Protagonist   Award-winning Work   Black Belly   Brotherhood   Cautious Protagonist   Clever Protagonist   Clingy Lover   Cold Protagonist   Contracts   Cruel Characters   Cunning Protagonist   Demon Lord   Demons   Depictions of Cruelty   Determined Protagonist   Devoted Love Interests   Dragons   Elves   Evil Gods   First-time Interc**rse   Friendship   Game Elements   Goddesses   Godly Powers   Gods   Guilds   Hard-Working Protagonist   Hiding True Abilities   Jealousy   Kingdoms   Loyal Subordinates   Male Protagonist   Management   Manipulative Characters   Masochistic Characters   Misunderstandings   Monsters   Multiple POV   Multiple Transported Individuals   Obsessive Love   Politics   Polygamy   Possessive Characters   Reverse R*pe   Romantic Subplot   Ruthless Protagonist   Sadistic Characters   Schemes And Conspiracies   Second Chance   Selfish Protagonist   Sharp-tongued Characters   Stalkers   Strategist   Strong Love Interests   Transported to Another World   Twisted Personality   Weak to Strong   Yandere   ",
	"rating": "(4.1 / 5.0, 706 votes)",
	"author": "wooden spoon   흙수저   ",
	"year": "\n2017",
	"ranking": "#114   #125   #365   #210   #325   ",
	"reviewcount": "206 Reviews",
	"description": "One day, I was summoned to this world.\n\nBeasts poured out, and an incredible crisis came.\n\nMy talents couldn’t have been worse.\n\n[The player’s talent level is at rock bottom.]\n\n[Almost all the numbers are hopeless.]\n\nWhether you have to become a warrior or a wizard.\n\nWhether you’ve gone back in time.\n\nYou have to take advantage of everything in order to survive.\n\n“What about it?”\n\n“I’ll use everything I have to survive!”>"
}