{
	"url": "https://www.novelupdates.com/series/the-disqualified-princes-conquest-of-the-inner-palace-the-prince-with-no-magic-power-takes-the-throne-with-the-royal-consort-of-inner-palace-on-his-side/",
	"title": "The Disqualified Prince’s Conquest of the Inner Palace the Prince With No Magic Power Takes the Throne With the Royal Consort of Inner Palace on His Side - Novel Updates",
	"image": "https://www.novelupdates.com/img/noimagefound.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Fantasy   Harem   Martial Arts   Mature   ",
	"tags": "Beautiful Female Lead   Charismatic Protagonist   Charming Protagonist   Complex Family Relationships   Cruel Characters   Cunning Protagonist   Demi-Humans   Disabilities   Discrimination   European Ambience   Family Conflict   Fantasy World   Handsome Male Lead   Hard-Working Protagonist   Harem-seeking Protagonist   Hated Protagonist   Hidden Abilities   Hiding True Identity   Kingdoms   Knights   Magic   Magical Technology   Male Protagonist   Ninjas   Organized Crime   Orphans   Polygamy   Power Struggle   Proactive Protagonist   Royalty   Schemes And Conspiracies   Secret Identity   Secret Organizations   Seduction   Sibling Rivalry   Strong Love Interests   Strong to Stronger   Sword And Magic   Sword Wielder   Twins   Weak to Strong   ",
	"rating": "(3.2 / 5.0, 17 votes)",
	"author": "Leonar D   レオナールD   ",
	"year": "\n2022",
	"ranking": "#2566   #2014   #6612   #3978   #10360   ",
	"reviewcount": "1 Review sorted by",
	"description": "The country had twin princes.\n\nThe younger brother had the greatest magical power of all successive royalty, while the elder brother was a ‘disqualified prince with no magical power’ with less than half the magical power of a commoner.\n\nWhile he was treated coldly by his parents and despised by the nobles and servants in the royal court, the disqualified prince, Prince Schwartz pinned his hopes on the ‘Succession Battle’.\n\nIf he wins the succession battle, the eyes of those who have mocked him will change. With this in mind, he challenges his twin brother to a duel, but is defeated by a magical blow from his twin brother.\n\nIn despair, Schwartz runs away from the royal court and disappears. ……5 years later, he returns to the court after a major problem arises that shakes the country.\n\nEnemies are killed. Women are seduced. The country is taken. The reversal of Schwartz, the ‘disqualified prince without magic’, is about to begin!>"
}