{
	"url": "https://www.novelupdates.com/series/hes-my-real-brother-duke/",
	"title": "He’s My Real Brother, Duke - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/01/Hes-My-Real-Brother-Duke.jpg",
	"noveltype": "(KR)",
	"genre": "Fantasy   Romance   ",
	"tags": "Abandoned Children   Aristocracy   Black Belly   Childcare   Cohabitation   Cold Love Interests   Contracts   Death of Loved Ones   Different Social Status   Doting Older Siblings   Enemies Become Lovers   European Ambience   Family Conflict   Female Protagonist   Handsome Male Lead   Love Interest Falls in Love First   Magic   Magic Formations   Misunderstandings   Multiple POV   Nobles   Obsessive Love   Orphans   Poor Protagonist   Possessive Characters   Reincarnation   Revenge   Secret Identity   Shapeshifters   Spies   Strong Love Interests   Transmigration   ",
	"rating": "(4.0 / 5.0, 77 votes)",
	"author": "여로은   ",
	"year": "\n2020",
	"ranking": "#3314   #3311   #2540   #6799   #1848   ",
	"reviewcount": "8 Reviews sorted by",
	"description": "In a fantasy novel, I possessed the hidden younger sister of the Male Lead, ‘Astel’. \n\nWhile my brother Cassian is struggling for the revenge of the family, it’s my job to find and deal with the final Villain that has not been revealed even at the end of the original novel!!!\n\nIn order to do that, I must first enter the Northern Duke Castle, where the family’s traitors are hiding.\n\nSomehow, I became an “imprint of companion” of  Duke Anais, a beast of beast and a leading candidate for the final villain.\n\nBesides……\n\n“Please kiss me now, Astel.”\n\nIn order to live, you’re required to have a daily skinship with your ‘imprint partner’.\n\nThere was no such thing in the contents of the original story!\n\n“Shall we go see your favorite sea today?”\n\n“I……I don’t think I can. I have to meet Sir Cassian today.”\n\nThe Duke gritted his teeth with a cold face. I was slightly scared as I saw him. Maybe he’s teething? Because he’s a wild beast!\n\n* * * \n\nOne day, after I received the Duke’s favor and consideration. My older brother Cassian left his son to me for a while.\n\nHowever, the Duke seems to have made a huge misunderstanding.\n\n“It will become our child.” \n\n“What……?”\n\n“Cassian Gray will disappear from this world now, so you will not become his bride.”\n\nYes……?\n\nWhen did I become Cassian Gray’s bride, aren’t we relatives?>"
}