{
	"url": "https://www.novelupdates.com/series/lord-of-the-mysterious-realms/",
	"title": "Lord of The Mysterious Realms - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/09/Lord-of-The-Mysterious-Realms.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Fantasy   Horror   Mystery   Supernatural   Xuanhuan   ",
	"tags": "Antique Shop   Appearance Different from Actual Age   Cunning Protagonist   Doting Parents   Eye Powers   Familial Love   Family   Hiding True Abilities   Hiding True Identity   Male Protagonist   Monsters   Secret Identity   Secret Organizations   Secretive Protagonist   Siblings   Transmigration   Transported to Another World   Younger Brothers   ",
	"rating": "(3.7 / 5.0, 24 votes)",
	"author": "咸鱼咸鱼仙   ",
	"year": "\nN/A",
	"ranking": "#2000   #2000   #10276   #12438   #11727   ",
	"reviewcount": "1 Review sorted by",
	"description": "Steampunk, magic and secret arts, the righteous moon gods and the mysterious realm enchantment are the key words of the new world.\r\n\r\nTime has hurriedly come to the end of the eighteenth epoch, and the epic of the ages has turned to the last page.\r\n\r\nUnder the fog-shrouded sky, a confused traveller opened his eyes.\r\n\r\nThe world tree is still young, the steam industry is rooted in the intricate three kingdoms.\r\n\r\nTwin demons come to the world, spying on the world from the shadows and whispering the evil words.\r\n\r\nThe undead lurks in the city, looking up at the gray mist-shrouded sky and sighing for the innocent's futility.\r\n\r\nThe real phantom sits behind the curtain, waiting for the final day to come.\r\n\r\nAbove the stage of destiny a figure flickers and the role of protagonist is still unknown.\r\n\r\nThe stranger looks up to the twin moons, angels and demons dance in the sky.\r\n\r\nThe hero carries the holy sword, lamenting the disaster that will come.\r\n\r\nThe uncrowned king hides in the shadows, secretly manipulating the changes of the world.\r\n\r\nThe clock strikes midnight, the cat scampers onto the shoulders of the black-robed man, and in front of them is an unknown path.>"
}