{
	"url": "https://www.novelupdates.com/series/repugnant-gateway/",
	"title": "Repugnant Gateway - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2017/04/dainghicchimon.jpg",
	"noveltype": "(CN)",
	"genre": "Martial Arts   Xianxia   ",
	"tags": "Adapted to Manhua   Beast Companions   Calm Protagonist   Cultivation   Male Protagonist   Orphans   Revenge   Righteous Protagonist   Transmigration   ",
	"rating": "(3.1 / 5.0, 39 votes)",
	"author": "Zhi Bai   知白   ",
	"year": "\nN/A",
	"ranking": "#2000   #2000   #5550   #9891   #7274   ",
	"reviewcount": "3 Reviews sorted by",
	"description": "One day in the faraway Blue Boorish Mountain inexplicably appeared groups of scoundrels who came to reside there. It was said that those scoundrels came from the You Kingdom, Yen Kingdom and many others due to their failures in battle. And due to its dangerous terrain, no one had dared to conquer the Blue Boorish Mountain. As a result, this place obviously became a paradise to the scoundrel and thieves. They resided there and ruled the place. They had also built up the Illusory Perennial Domicile, which meant a place that was their lifetime home. There was a group of scoundrels who had appointed themselves the Great Nine Bandits, and they were seen as the best baddies in the area. They built up a school in which the children of the Illusory Perennial Domicile would come and study only survival skills. In such a small place appeared an orphan student named An Zheng who also came to study there. He was really a useless orphan in the people’s eyes due to his cowardice. They even said that he was a chicken who did not dare to do anything for himself even in fighting for himself, and no one cared about such a coward except a ten-year-old child, Du ShouShou, his only friend. As a result, he was the center for such baddies to cause trouble. However, no one knew that orphan An Zheng would change his life forever as he went to a dead end.\n\nHow powerful was that orphan? How much effort did An Zheng have to make in order to satisfy his passions of the devilish elimination? How would the life of his friend, Du ShouShou change after his after death spawn? And might the Great Nine Bandits be the invincible ones? Was he good or evil? Was his power strong or weak? Was his world in perfect order or chaos? They were all questions that the little child An Zheng needed to discover during his journey.\n\n“Bring happiness to loyal people but chide the evil. However, if the treatment goes wrong, law will become a tool for the evil to force the good, preventing executors. Find a repugnant gateway to pass. Great things win cruel tricks. We learn from the idea of God but we reject the power of Him.”>"
}