{
	"url": "https://www.novelupdates.com/series/the-strongest-brave-who-craves-for-revenge-extinguish-with-the-power-of-darkness/",
	"title": "The Strongest Brave Who Craves for Revenge, Extinguish With the Power of Darkness - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/07/34404.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Fantasy   Mature   Psychological   Tragedy   ",
	"tags": "Adapted to Manga   Antihero Protagonist   Betrayal   Cannibalism   Cold Protagonist   Corruption   Cruel Characters   Dark   Death   Death of Loved Ones   Demon Lord   Demons   Depictions of Cruelty   Elemental Magic   Evil Protagonist   Former Hero   God Protagonist   Goddesses   Gore   Hated Protagonist   Heroes   Human-Nonhuman Relationship   Kingdoms   Magic   Male Protagonist   Masochistic Characters   Murders   Overpowered Protagonist   Resurrection   Revenge   R*pe   Schemes And Conspiracies   Sword And Magic   Sword Wielder   Twisted Personality   Yandere   ",
	"rating": "(3.4 / 5.0, 50 votes)",
	"author": "Ononata Manimani   斧名田マニマニ   ",
	"year": "\n2019",
	"ranking": "#2000   #3676   #4182   #9498   #4365   ",
	"reviewcount": "9 Reviews sorted by",
	"description": "Raul who had defeated the demon king as the strongest hero should have become the savior of the world.\r\n\r\nHaving his treasured companions and family killed by power hungry aristocrats, he was executed with false charges brought against him by the princess. Just before his life collapsed, at last his heart fell into darkness.\r\n\r\n...I will tear those traitors from limb to limb. Burn them at the stake. Sever them to pieces. Skewer them. I will kill every one of those bastards without mercy and make them taste hell's suffering.....!!!\r\n\r\nObtaining the power of darkness, Raul was revived. Sneering, he vowed revenge.\r\n\r\n“Oh, I’m looking forward to it – from now I'll bask in their blood as I please.”\r\n\r\nSeveral days after the hero's revival in the imperial capital where flowers bloomed in profusion, the parade that would advance towards tragedy began.>"
}