{
	"url": "https://www.novelupdates.com/series/the-villains-diary-the-heroines-character-crumbles/",
	"title": "The Villain’s Diary – The Heroine’s Character Crumbles - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/06/The-Villains-Diary-The-Heroines-Character-Crumbles.jpg",
	"noveltype": "(CN)",
	"genre": "Adventure   Comedy   Fantasy   Harem   Romance   ",
	"tags": "Ancient Times   Arranged Marriage   Black Belly   Carefree Protagonist   Cheats   Cold Love Interests   Cultivation   Death   Demonic Cultivation Technique   Demons   Dense Protagonist   Enemies Become Lovers   Fallen Nobility   Famous Protagonist   First-time Interc**rse   F*llatio   H*ndjob   Immortals   Lack of Common Sense   Loli   Love Interest Falls in Love First   Maids   Male Protagonist   Misunderstandings   Multiple POV   Near-Death Experience   Past Plays a Big Role   Persistent Love Interests   Pill Based Cultivation   Reverse R*pe   Schemes And Conspiracies   Sect Development   Servants   S*xual Cultivation Technique   Shameless Protagonist   S*aves   System Administrator   Time Travel   Transmigration   Twisted Personality   Weak Protagonist   Wealthy Characters   Witches   Yandere   ",
	"rating": "(4.1 / 5.0, 126 votes)",
	"author": "小捅瓜   ",
	"year": "\n2022",
	"ranking": "#71   #93   #1787   #37   #4168   ",
	"reviewcount": "11 Reviews sorted by",
	"description": "Jiang Mu, who transmigrated into the book, becomes the villain, and after failing to pass the plot set by the system dozens of times, finally gets the goldfinger: a diary.\n\n[It was sunny on March 5th, Ding Nanrong’s body is very explosive, but the clothes are so ugly, ugly, and ugly…]\nDing Nanrong: “Jiang Mu, don’t think I won’t kill you!”\n\n[On the evening of March 5th, Xue Menghan was about to break off the marriage. This nympho is so s*upid, what lines should I say?]\nXue Menghan: “You’re the nympho! You’re the one who’s s*upid! Who do you look down on!”\n\n————–\n\nI thought I would write a diary to get a reward, play the villain, finish the plot, and live a YOLO life.\n\nBut, I didn’t expect that the female protagonists actually had a copy of the diary, and they didn’t play cards according to the routine, and the plot became more and more crooked.\n\n—————\n\nThe more he wrote in the diary, the further the story went from the main story.\n\nThe more he wrote to set up the heroine with MC like it’s supposed to be, the closer they got with the villain (Jiang Mu).\n\nThe more he wrote in the diary, the stronger he got. (Although happy, but it’s troubling when he had to take a beating. And it doesn’t hurt at all, had to put an extra effort’s in his villain acting skills.)\n\nNothing ever goes as he wishes.>"
}