{
	"url": "https://www.novelupdates.com/series/the-crown-prince-chases-his-wife/",
	"title": "The Crown Prince Chases His Wife - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/09/The-Crown-Prince-Chases-His-Wife.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Drama   Fantasy   Historical   Romance   Slice of Life   ",
	"tags": "Ancient China   Aristocracy   Arranged Marriage   Arrogant Characters   Beautiful Female Lead   Broken Engagement   Calm Protagonist   Carefree Protagonist   Charming Protagonist   Confident Protagonist   Doting Love Interests   Female Protagonist   Handsome Male Lead   Hard-Working Protagonist   Hidden Abilities   Jealousy   Love Interest Falls in Love First   Love Rivals   Marriage   Multiple POV   Politics   Possessive Characters   Power Couple   Power Struggle   Quirky Characters   Revenge   Royalty   Schemes And Conspiracies   Shameless Protagonist   Sharp-tongued Characters   Spies   Strong Love Interests   Tragic Past   Unconditional Love   Unrequited Love   Villainess Noble Girls   Wealthy Characters   ",
	"rating": "(4.3 / 5.0, 14 votes)",
	"author": "Eleven Drinkers   十一酒徒   ",
	"year": "\n2022",
	"ranking": "#797   #750   #9972   #1628   #10056   ",
	"reviewcount": "1 Review sorted by",
	"description": "When Qin Yan was five years old, she left the capital with her mother and went to the Pingxi Army under the command of her grandfather, Duke of Zhenguo, in the Northwest. When she returned twelve years later, things were different.\n\nAfter the mother was attacked and disappeared, everyone in the Prime Minister Mansion only knew of Concubine Song, but not her mother, the honorable mistress. They only knew that there was only one Miss Nian in the mansion, and they did not know that there was also her, the only eldest young lady of the first wife.\n\nThe concubine took over her mother’s dowry and pretended to be rich and generous to win people’s hearts. The concubine-born younger sister, with the identity that belongs to Qin Yan, was mixed up like a fish in water in the circle of noble daughters in the capital, and she also intended to get involved with Qin Yan’s fiancé.\n\nThe people in Prime Minister Mansion thought that Qin Yan could only be at their mercy when she returned to the capital alone. However, they never thought that within a few days of returning to the capital, Qin Yan was granted the title of Princess of Zhaoren by the emperor and given a palace as the Princess Mansion.\n\nWhen Qin Yan took back the dowry that belonged to her mother, only then did her father Prime Minister Qin and Concubine Song knew that Qin Yan was the owner of Yu Qingfeng, the first bank in Great Xia.\n\nThe City Master of Gu City, an important town outside the Northwest Pass, was known as the owner of Yu Qingfeng, the first bank in Great Xia which claimed to be able to reach half the national treasury.\n\nHow many secrets have not been uncovered on Qin Yan?>"
}