{
	"url": "https://www.novelupdates.com/series/why-the-big-villain-hasnt-run-away/",
	"title": "Why The Big Villain Hasn’t Run Away - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/04/Why-The-Big-Villain-Hasnt-Run-Away.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Drama   Fantasy   Psychological   Romance   ",
	"tags": "Beautiful Female Lead   Black Belly   Caring Protagonist   College/University   Cute Protagonist   Dense Protagonist   Female Protagonist   First Love   Handsome Male Lead   Level System   Love Interest Falls in Love First   Loyal Subordinates   Mob Protagonist   Modern Day   Multiple Reincarnated Individuals   Orphans   Parallel Worlds   Past Plays a Big Role   System Administrator   Transmigration   Unconditional Love   Wealthy Characters   ",
	"rating": "(4.2 / 5.0, 96 votes)",
	"author": "Che Li Jiu   车厘酒   ",
	"year": "\n2021",
	"ranking": "#212   #350   #1666   #563   #2594   ",
	"reviewcount": "12 Reviews",
	"description": "Yan Luqing was reading the heart-abuse novel of the year when she was on the plane.\n\nAmong them, the most popular is not the male lead and female lead, but the villain who has been persecuted by countless lunatics, Gu Ci.\n\nWhen Gu Ci was young, his beauty was infinite, but his family’s financial situation fell behind and his parents were retaliated by their enemies. His beautiful obsidian-like eyes were blinded by poison. And in the end, he was secretly ‘hidden’ by a mentally ill woman who had a crush on him.\n\nAfter experiencing all this, the young man who was originally like a breeze and misty moon was completely blackened.\n\nWho does not feel heartache for a beauty who was strong but miserable? Yan Luqing also felt her heart ache and scolded that mentally ill woman very angrily.\n\nWho knows that when the plane crashed, she became the female partner, who tried to monopolize Gu Ci, that everyone shouts to beat.\n\nThe time happened to be the first day of the ‘Hiding Gu Ci In The Golden House’.\n\nRecalling the female partner’s end that was more inferior than the pigs and dogs in the original book, Yan Luqing: …Oh?\n\n***\n\nThe female partner in the original book deserves that kind of ending, but Yan Luqing can not commit the same mistakes.\n\nFrom the first day onwards, she will serve delicious food and drink to raise the big villain well. It was called ‘Hiding Gu Ci’ but in reality it was actually enshrining and worshipping him.\n\nShe treats Gu Ci’s eyes and buys whatever he wants to eat, even if he wants the stars she will pick them for him. If he wants flowers, she will pull them out and make a wreath for him. Even the flowers at home are all pulled bald.\n\nSo two months later, according to the original plot, it was the day for Gu Ci to escape.\n\nYan Luqing breathed a sigh of relief. The big villain doesn’t have to do it himself because she opened the door wide in a very proactive and catering manner, and said to him: “Congratulations, you are free now.”\n\nGu Ci looked at her for a long while, his beautiful black eyes darkened, and he suddenly smiled: “What if I said, I don’t want freedom?”\n\nYan Luqing: “???”\n\nWhat about your business empire? \n\nWhat about your ambition for revenge? \n\nD*mn, that’s not how the script was played!>"
}