{
	"url": "https://www.novelupdates.com/series/5-big-shots-kneeled-and-called-me-mom/",
	"title": "5 Big Shots Kneeled and Called Me Mom - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/02/bigshot5v1.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Drama   Romance   ",
	"tags": "Beautiful Female Lead   Businessmen   Celebrities   Complex Family Relationships   Cute Children   Family   Female Protagonist   Modern Day   Showbiz   Time Travel   Wealthy Characters   ",
	"rating": "(3.9 / 5.0, 109 votes)",
	"author": "女王不在家   ",
	"year": "\n2019",
	"ranking": "#2018   #1360   #2923   #2744   #3518   ",
	"reviewcount": "30 Reviews sorted by",
	"description": "25 years ago, Gu Yuan who had a terminal disease was found to possess a rare powerful gene.\n\nIn order to allow the gene to pass through the generation, she donated out 5 ova before the failure of her surgery.\n\n25 years later, she awakens. Her 5 ova had now turned into outstandings and famous men.\n\nMmmm….who is it that laughs at her for being old-fashion, backward, have nothing at all and penniless?\n\nThe world-renowned tycoon prince accompanied Gu Yuan for supper. The media was in an uproar, is the prince going to be in love?\n\nTycoon Prince: That’s my mother.\n\nThe media tycoon who controls the world public opinion, stake a thousand pieces of gold on one throw for Gu Yuan. The whole audience was in an uproar, an unknown girl going to marry into the noble family?\n\nMedia Tycoon: That’s my mother.\n\nThe film emperor with thousands of fans who received worldwide attention broke his 8 years practice and for the 1st time ever unexpectedly composed music for Gu Yuan. The whole internet was in an uproar, is this film emperor’s love of the century?\n\nFilm Emperor: That’s my mother.\n\n17 years old beautiful young boy genius with IQ that beyond compares named the asteroid he found after Gu Yuan. The world was in an uproar, is this love between an older woman and a young boy?\n\nGenius Boy: That’s my mother.\n\n……\n\nAll the supporting males and females who had ridiculed and bullies Gu Yuan before cried: She actually has how many good sons?!\n\nFinally, when the world’s most handsome and eligible top billionaire accompanies Gu Yuan for shopping, the crowds immediately shout loudly: She must be his mother! His mother! His mother!\n\nThe aloof top billionaire: She is the mother of my sons.>"
}