{
	"url": "https://www.novelupdates.com/series/little-mushroom/",
	"title": "Little Mushroom - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/08/Little-Mushroom.png",
	"noveltype": "(CN)",
	"genre": "Drama   Psychological   Romance   Sci-fi   Shounen Ai   ",
	"tags": "Adapted to Drama CD   Adapted to Manhua   Apathetic Protagonist   Apocalypse   Award-winning Work   Black Belly   Character Growth   Cold Love Interests   Cute Protagonist   Death   Depictions of Cruelty   Determined Protagonist   Devoted Love Interests   Dystopia   Genetic Modifications   Handsome Male Lead   Hiding True Identity   Human-Nonhuman Relationship   Humanoid Protagonist   Kind Love Interests   Monsters   Mutated Creatures   Naive Protagonist   Near-Death Experience   Shapeshifters   Slow Romance   Survival   ",
	"rating": "(4.8 / 5.0, 992 votes)",
	"author": "Yi Shi Si Zhou   一十四洲   ",
	"year": "\n2019",
	"ranking": "#905   #2183   #831   #3131   #338   ",
	"reviewcount": "258 Reviews sorted by",
	"description": "“Until the day humanity falls.”\n\nIn the year 2020, Earth’s magnetic poles disappeared and humankind was nearly wiped out by cosmic radiation. Within the span of a hundred years, living creatures began to mutate and devour each other while the remaining humans, numbering in the tens of thousands, struggled bitterly in their man-made bases. \n\nIn the Abyss, home to the mutated xenogenics, there lived a sentient little mushroom. Because it had been nourished by the blood and flesh of the deceased human An Ze, not only did it take on a similar-looking human form, but a similar name as well: An Zhe.\n\nAn Zhe is determined to go to the human base to search for his spore, which had been harvested by humans. Once there, however, he faces the omnipresent risk of discovery and certain death as he tries to keep his non-human nature hidden from the Judges, whose responsibility is to inspect for and eliminate xenogenics like himself. And of all the Judges, Colonel Lu Feng is the most perceptive and merciless—as soon as he determines that someone is a xenogenic, he will execute that person on the spot.\n\nBut An Zhe’s mutation goes undetected by Lu Feng’s eyes, and so a tale of humans and xenogenics unfolds…\n\nSilver Award winner at the 12th Chinese Nebula Awards for Chinese Science Fiction.>"
}