{
	"url": "https://www.novelupdates.com/series/goshujin-sama-to-yuku-isekai-survival/",
	"title": "Goshujin-sama to Yuku Isekai Survival! - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/11/goshujin-sama-to-yuku-isekai-survival-light-novel-52520.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Comedy   Fantasy   Harem   Mature   Seinen   Slice of Life   ",
	"tags": "Adapted to Manga   Alchemy   Animal Characteristics   Army Building   Artifact Crafting   Average-looking Protagonist   Beastkin   Beautiful Female Lead   Betrayal   Calm Protagonist   Caring Protagonist   Character Growth   Cheats   Clingy Lover   Couple Growth   Crafting   Cunning Protagonist   Demi-Humans   Demons   Doting Love Interests   Dragons   Early Romance   Elves   Fairies   Fantasy World   Farming   Female Master   First Love   First-time Interc**rse   Game Elements   Gamers   Hard-Working Protagonist   Human-Nonhuman Relationship   Jack of All Trades   Kind Love Interests   Kingdom Building   Kingdoms   Level System   Love Interest Falls in Love First   Male Protagonist   Monsters   Multiple POV   Naive Protagonist   Older Love Interests   Overpowered Protagonist   Polygamy   Pregnancy   Proactive Protagonist   Racism   Reverse R*pe   Romantic Subplot   Royalty   S*ave Protagonist   Special Abilities   Strong Love Interests   Survival   Sword And Magic   Threesome   Transported to Another World   Wars   Weak to Strong   ",
	"rating": "(3.6 / 5.0, 96 votes)",
	"author": "Ryuto   リュート   ",
	"year": "\n2018",
	"ranking": "#191   #519   #1042   #382   #1676   ",
	"reviewcount": "13 Reviews sorted by",
	"description": "The next thing I knew I was somewhere that was clearly not Earth! Why! I don’t know why I’m here!\n\nBut I have to survive anyway. Even if I stay silent, I’ll be thirsty, I’ll be hungry, and I might run into some dangerous creatures.\n\nOh, I can use the crafting menu from minecraft!? Somehow if I can focus on it, the keyboarding works too! There was a time for me too when I thought I had won.\n\nSome unknown creature to be encountered! A violent person who attacked me in my sleep! Sub-humans with a grudge against humans! Oh, yes, s*ave and protection, whatever you want to do. I will work hard, master.\n\nThis is a story about a main character who loves survival type PC games and suddenly wanders into another world and fights to survive with his ferocious but beautiful and cute master.>"
}