{
	"url": "https://www.novelupdates.com/series/the-hidden-dungeon-only-i-can-enter/",
	"title": "The Hidden Dungeon Only I Can Enter - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2017/07/HiddenDung.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Comedy   Ecchi   Fantasy   Harem   Romance   School Life   Shounen   Supernatural   ",
	"tags": "Academy   Adapted to Anime   Adapted to Manga   Adventurers   Aristocracy   Beautiful Female Lead   Brother Complex   Character Growth   Charismatic Protagonist   Charming Protagonist   Childhood Friends   Conditional Power   Confinement   Dense Protagonist   Determined Protagonist   Dungeons   Elemental Magic   Elves   Fantasy World   Female Master   Game Elements   Guilds   Handsome Male Lead   Harem-seeking Protagonist   Hidden Abilities   Level System   Love Interest Falls in Love First   Male Protagonist   Master-Disciple Relationship   Monsters   Nobles   Overpowered Protagonist   Perverted Protagonist   Pets   Politics   Polygamy   Poor to Rich   R-15   Sealed Power   Skill Assimilation   Skill Creation   Strong Love Interests   Sudden Strength Gain   Sudden Wealth   Sword And Magic   Weak to Strong   Yandere   ",
	"rating": "(3.5 / 5.0, 221 votes)",
	"author": "Seto Meguru   瀬戸メグル   ",
	"year": "\n2017",
	"ranking": "#6970   #4160   #609   #3957   #567   ",
	"reviewcount": "18 Reviews sorted by",
	"description": "Noir, third son of a “beggar noble,” lost his job and was at a loss, but fortune struck just as he was contemplating becoming an adventurer.\r\n\r\nHidden Dungeons that no one knows how to enter. Legendary places full of extremely rare magical beasts, magic tools for power beyond measure and items that would be considered a rarity all over the world.\r\nTo such a dungeon the entrance was opened.\r\n\r\n“Without telling anyone about this place I’ll secretly become the strongest.”\r\n\r\nThis world is harsh to nobles of poverty.\r\nWithout authority or honor, if I could at least acquire power――>"
}