{
	"url": "https://www.novelupdates.com/series/the-world-online/",
	"title": "The World Online - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2017/10/11388s.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Fantasy   Martial Arts   Mature   Sci-fi   ",
	"tags": "Accelerated Growth   Army Building   Arrogant Characters   Beast Companions   Betrayal   Body Tempering   Business Management   Clever Protagonist   Cultivation   Cute Children   Determined Protagonist   Domestic Affairs   Doting Older Siblings   Futuristic Setting   Guilds   Handsome Male Lead   Hard-Working Protagonist   Hiding True Identity   Kingdom Building   Level System   Loyal Subordinates   Male Protagonist   MMORPG   Nationalism   Politics   Racism   Romantic Subplot   Second Chance   Skill Books   Time Skip   Time Travel   Virtual Reality   Wealthy Characters   Younger Sisters   ",
	"rating": "(4.0 / 5.0, 857 votes)",
	"author": "Sheng Xiao Jian Ke   笙箫剑客   ",
	"year": "\n2016",
	"ranking": "#3567   #6293   #138   #432   #513   ",
	"reviewcount": "180 Reviews",
	"description": "Earth Online – a virtual MMORPG that takes place in the future year of 2190 – a game that everyone will bet their futures on. Set in a map that is ten times the size of real-world Earth, players battle for supremacy in the first game to feature personal adventure, territory construction, and grand warfare. For every death you experience in the game, your level would drop back to zero. Ouyang Shuo, an above average player, suffered the ultimate betrayal. For merely a piece of equipment, his sworn brother betrayed and backstabbed him. This time, after he reincarnated in the game, Ouyang Shuo swore to exact vengeance.\n\nHowever, in an unexpected turn of events, Ouyang Shuo found himself back five years before the betrayal – right before the launch of Earth Online. This time, armed with the knowledge from his past life, Ouyang Shuo would venture upon a new path. \n\nHow to perfectly complete quests? What historical battle maps would appear? How should one build up their territory? Utilizing the experience from the predecessors of his last life, Ouyang Shuo makes his bid for the top against all odds. Follow his journey as he seeks to lord over the world!\n\nA different kind of tale that blends historical characters and virtual reality gaming, with heavy emphasis on kingdom building and warfare.>"
}