{
	"url": "https://www.novelupdates.com/series/a-genius-healer-who-can-treat-instantly-but-was-banished-from-party-considered-doing-nothing-even-if-they-told-him-to-come-back-now-he-is-now-having-fun-as-a-dark-healer-now-so-the-treatment-will/",
	"title": "A Genius Healer Who Can Treat Instantly but Was Banished From Party Considered Doing Nothing ~ Even if They Told Him to Come Back Now, He Is Now Having Fun as a Dark Healer Now, So the Treatment Will Be Expensive, but Can You Pay for It? ~ - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/09/Dark-Healer_1632981224.jpg",
	"noveltype": "(JP)",
	"genre": "Comedy   Fantasy   Harem   Slice of Life   ",
	"tags": "Adapted to Manga   Adventurers   Betrayal   Caring Protagonist   Charismatic Protagonist   Cheats   Clever Protagonist   Demi-Humans   Dense Protagonist   Depictions of Cruelty   Discrimination   Elves   Fantasy World   Guilds   Healers   Kind Love Interests   Lack of Common Sense   Loli   Love Interest Falls in Love First   Magic   Male Protagonist   Medical Knowledge   Misunderstandings   Murders   Nobles   Orphans   Overpowered Protagonist   Persistent Love Interests   Poor Protagonist   Poor to Rich   Protagonist Strong from the Start   Royalty   Schemes And Conspiracies   S*aves   Underestimated Protagonist   ",
	"rating": "(3.2 / 5.0, 54 votes)",
	"author": "Hikasaku   Hishikawa Sakaku   ひかさく   菱川さかく   ",
	"year": "\n2020",
	"ranking": "#4265   #4055   #2855   #1376   #3776   ",
	"reviewcount": "8 Reviews sorted by",
	"description": "“You haven’t done anything lately. I don’t need you anymore,”\n\nOne day, Zenos was told by Party Leader, Aston.\n\nZenos is a favela-born healer and does not have an official license. Still, he was desperately honing his skills to get back for the party that had picked him up\n\nIn fact, if a friend was injured even slightly, he would be treated immediately. And he can also use protective magic, auto-recovery magic, and ability-strengthening magic that were hard to do, and Zenos' Party would be named as if they were invulnerable.\n\nHowever, the party members misunderstood that those who weren’t hurt as they got stronger and started to think of Zenos as baggage.\n\nAnd they started to think that the presence of Zenos, who did not have an official license and came from the favela, was just suck on party fame.\n\nAfter being kicked out of the party, Zenos saves the life of elf-s*ave girl who is badly injured.\n\n“I’m still alive…? I thought I was dead. ”\n\n“Haha, this much is just a scratch.”\n\n“… Amazing.”\n\nAfter helping a elf girl, Zenos decided to open a clinic as a dark healer on a street corner.\n\nEven though he did not have a license, his treatment was not trivial, even rumors about the dark healer helping the weak and earn a lot money from strong people spread by word of mouth, finally reaching the royal palace.\n\nMeanwhile, Zenos’s party suffered defeat and was seriously injured due to the absence of a good healer.\n\nHowever, even if he was told to come back now, he had made it so that they would charge high maintenance fees for people they didn’t like… Can you guys pay your bills?>"
}