{
	"url": "https://www.novelupdates.com/series/the-good-for-nothing-seventh-young-lady/",
	"title": "The Good for Nothing Seventh Young Lady - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2016/04/568c79c35e76a.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Comedy   Fantasy   Gender Bender   Josei   Martial Arts   Romance   Xuanhuan   ",
	"tags": "Academy   Alchemy   Ancient Times   Appearance Changes   Archery   Beast Companions   Beautiful Female Lead   Black Belly   Calm Protagonist   Cold Love Interests   Couple Growth   Cross-dressing   Cultivation   Cunning Protagonist   Curses   Death of Loved Ones   Demons   Dense Protagonist   Doting Love Interests   Dragons   Dwarfs   Eidetic Memory   Elves   Female Protagonist   Genius Protagonist   Gods   Handsome Male Lead   Hard-Working Protagonist   Hated Protagonist   Hiding True Abilities   Hiding True Identity   Human Experimentation   Kingdom Building   Late Romance   Loyal Subordinates   Magic   Magic Beasts   Magical Space   Mercenaries   Money Grubber   Multiple Identities   Older Love Interests   Overpowered Protagonist   Pharmacist   Poor to Rich   Popular Love Interests   Possessive Characters   Power Couple   Ruthless Protagonist   Sealed Power   Secret Organizations   Sharp-tongued Characters   Slow Romance   Smart Couple   Spirit Advisor   Strength-based Social Hierarchy   Strong Love Interests   Sword And Magic   Thieves   Transmigration   Transported to Another World   Ugly to Beautiful   Underestimated Protagonist   Wars   Weak to Strong   ",
	"rating": "(4.2 / 5.0, 708 votes)",
	"author": "North Night   夜北   ",
	"year": "\n2013",
	"ranking": "#2917   #3275   #43   #3796   #143   ",
	"reviewcount": "131 Reviews sorted by",
	"description": "She was the godly thief of the 24th century, yet she was reincarnated as a good-for-nothing idiot with no parents. Not only that, she had to bend her will according to her relatives’ mood. Idiot? tr*sh? Very well, sooner or later, she will show these group of silly earthlings what it means to be too late for regrets!\n\nBattle-qi? Magic? Her talent in both magic and martial arts will mortify every genius in existence. The position of the clan chief? The mythological Vermilion Bird? Want them? So sorry~ She already took them!\n\nBut who will tell her, that the cute boy who gets carsick easily was really the mythological Vermilion Bird? Then, what about the elder that’s residing in her body, just which deity does that mysterious soul belong to? Furthermore……\n\nWhy was it that other people’s companions were those kinds of domineering, and incomparably mighty type? Why was it the ones around her were either an evil merchant or a sly fox, a useless nerd or a playboy, the worst is this sick pretty boy! What happened to rule the world, and standing above all else? Please don’t joke with me!>"
}