{
	"url": "https://www.novelupdates.com/series/mr-peis-little-pity-is-too-good/",
	"title": "Mr Pei’s Little Pity Is Too Good - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/09/Mr-Peis-little-pity-is-too-good.png",
	"noveltype": "(CN)",
	"genre": "Romance   Yaoi   ",
	"tags": "Cold Love Interests   Depression   ",
	"rating": "(4.4 / 5.0, 11 votes)",
	"author": "柚子奶糖   ",
	"year": "\n2022",
	"ranking": "#1183   #1037   #10521   #3962   #10801   ",
	"reviewcount": "2 Reviews sorted by",
	"description": "\r\nThe poor little one who suffered from depression and aphasia curled up in the corner, and Master Pei hugged the person in his arms: Be good, don’t be afraid. Pei Chuan, the head of the famous Pei Group in city A, it is rumored that Mr. Pei has a cold temperament, ruthless, and inhumane. Until one day, Master Pei rescued a poor, bruised little man on the side of the road and brought him home. The poor little guy doesn’t talk or pay attention to others. He just hides quietly in the corner of the room every day. His cold and beautiful eyebrows are gentle and well-behaved, but they are so fragile that they seem to be broken when touched. Doctors later said he suffered from mild depression and psychogenic aphasia. According to rumors, Pei Ye, who is inhumane, took care of this poor little boy and took care of him in every possible way. Later, the whole upper circle of city A knew that there was a beautiful clinging spirit around Master Pei.\r\n\r\n In the nineteen years before Lin Suici’s resignation, he was hesitant to walk alone in the dark. He was illegitimate child who was hated and spurned by others, and no one loved him. It was Pei Chuan who held his hand and brought him out of the darkness that saw no light. For Lin Suici, Pei Chuan is his salvation and the light in his life. What Lin Suici didn’t know was that many years ago, he was the light that pulled Pei Chuan out of the abyss. Pei Chuan gave all his gentleness and patience to his Suishui. And Suici also gave him all the trust and dependence. The first sentence Suici said again was Pei Chuan’s name. Suici is detached and cold in front of outsiders, but only in front of Pei Chuan he will cry, act like a spoiled child, and scream at his husband with red ears.>"
}