{
	"url": "https://www.novelupdates.com/series/i-was-seduced-by-the-sick-male-lead/",
	"title": "I Was Seduced by the Sick Male Lead - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/08/I-Was-Seduced-by-the-Sick-Male-Lead.jpg",
	"noveltype": "(KR)",
	"genre": "Comedy   Fantasy   Romance   Shoujo   Slice of Life   ",
	"tags": "Adapted to Manhwa   Age Progression   Appearance Different from Actual Age   Aristocracy   Bickering Couple   Cute Protagonist   Dense Protagonist   European Ambience   Female Protagonist   Handsome Male Lead   Love Interest Falls in Love First   Nobles   Reincarnated in Another World   Seduction   Wealthy Characters   ",
	"rating": "(4.2 / 5.0, 66 votes)",
	"author": "Senri   센리   ",
	"year": "\n2020",
	"ranking": "#6970   #6206   #5177   #2540   #2010   ",
	"reviewcount": "6 Reviews sorted by",
	"description": "I was reincarnated as a daughter of the count’s family and the young lover of the male lead who recuperated as a child.\n\nThe daughter is a small-time villain who tried to separate the male lead and female lead which caused her family to get ruined.\n\nIt’s a cozy life that I got, but I can’t let my family get involved in other people’s love affairs.\n\nSo I was trying to get a decent distance from the male lead, who’s been recuperating, but he keeps picking a fight.\n\n“Cassis, go to the kitchen and complain about the side dishes.”\n\n“What? Mmph!”\n\n“Ogugu~ You eat well.”\n\n“Mmmmph!”\n\n“Huh? What? You want some carrots? Okay.”\n\nFor your information, carrots are the food that Cassis hates the most.\n\n***\n\nWhenever I met him, the male lead started to look sad, as if he had grown attached to me while we were bickering loudly.\n\nBesides, the way he looks at me is getting weird?\n\n“Evelyn, do you want me to get better soon?”\n\n“Of course I do. Then you won’t have to do this bothersome thing.”\n\n“….I wish it could keep hurting.”\n\n“You really. What are you talking about? I don’t like it.”\n\nI said a lot of mean things to get rid of him because we had to break apart anyway.\n\nBut it backfired…?\n\n“Evelyn. I’m hurt.”\n\n“Did I do something wrong to you, Cassis?”\n\n“No?”\n\nBut why do you keep getting hurt…?\n\nI’m screwed.\n\nThe male lead doesn’t intend to go home.\n\nAnd why are you fighting with the female lead over me?!>"
}