{
	"url": "https://www.novelupdates.com/series/pawahara-seijo-no-osananajimi-to-zetsuen-shitara-nanimokamo-ga-umaku-iku-yo-ni-natte-saikyo-no-boken-sha-ni-natta-tsuideni-yasashikute-kawaii-yome-mo-takusan-dekita-wn/",
	"title": "Pawahara Seijo no Osananajimi to Zetsuen Shitara, Nanimokamo ga Umaku Iku Yō ni Natte Saikyō no Bōken-sha ni Natta ~ Tsuideni Yasashikute Kawaii Yome mo Takusan Dekita ~ (WN) - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/10/Pawahara-Seijo-no-Osananajimi-to-Zetsuen-Shitara-Nanimokamo-ga-Umaku-Iku-Y-ni-Natte-Saiky-no-Bkensha-ni-Natta-Tsuideni-Yasashikute-Kawaii-Yome-mo-Takusan-Dekita-WN.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Comedy   Ecchi   Fantasy   Harem   Martial Arts   Romance   Shounen   ",
	"tags": "Accelerated Growth   Adventurers   Beautiful Female Lead   Childhood Friends   Clingy Lover   Conditional Power   Demi-Humans   Discrimination   Dragon Slayers   Dragons   Dwarfs   Elves   Enemies Become Allies   First-time Interc**rse   Game Elements   God-human Relationship   Goddesses   Godly Powers   Gods   Hidden Abilities   Homunculus   Human Experimentation   Immortals   Legends   Love Interest Falls in Love First   Lucky Protagonist   Male Protagonist   Marriage   Misunderstandings   Monsters   Multiple POV   Mythology   Older Love Interests   Overpowered Protagonist   Persistent Love Interests   Personality Changes   Phoenixes   Polygamy   Popular Love Interests   Psychopaths   Quirky Characters   R-15   Race Change   Saints   Saving the World   Skill Assimilation   Spear Wielder   Special Abilities   Strong Love Interests   Sudden Strength Gain   Sword And Magic   Sword Wielder   Transformation Ability   Tsundere   Unique Weapon User   Unique Weapons   Younger Love Interests   ",
	"rating": "(2.8 / 5.0, 81 votes)",
	"author": "くさもち   ",
	"year": "\n2020",
	"ranking": "#397   #732   #1220   #425   #3466   ",
	"reviewcount": "6 Reviews",
	"description": "Elma, my childhood friend-cum-girlfriend, was a saintess who was chosen by the Holy Sword, however, she had been selfishly and unjustly abusing me. Day after day she spat heartless words at me, and I continued to bear with it, even though my mind and body became worn-out. However, I have had enough of it.\n\n“——Alright. I’m done with you. You can do whatever you want now.”\n\n“…Huh? Eh?”\n\nSo I broke up with her and dissolved our party. I’d try to live free from now on. \n\nI did, and you know what? \n\nThe misfortunes I had so far did a one-eighty, everything went well, and before I noticed, I had become the strongest adventurer praised by everyone! Moreover, I was surrounded by cute girls who were so kind that Elma couldn’t even compare!\n\nThis is a story about me getting my compensation.>"
}