{
	"url": "https://www.novelupdates.com/series/face-slapping-the-general/",
	"title": "Face Slapping the General - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/05/Face-Slapping-the-General.png",
	"noveltype": "(CN)",
	"genre": "Action   Comedy   Drama   Mecha   Romance   Yaoi   ",
	"tags": "Bickering Couple   First Love   Futuristic Setting   Generals   Handsome Male Lead   Love Interest Falls in Love First   Military   Smart Couple   Soldiers   Strategic Battles   Strong Love Interests   Time Travel   Weak to Strong   ",
	"rating": "(4.1 / 5.0, 16 votes)",
	"author": "Superpanda   ",
	"year": "\n2016",
	"ranking": "#4265   #2000   #8439   #9693   #7180   ",
	"reviewcount": "4 Reviews sorted by",
	"description": "Wu Qiao’s only dream was to become a soldier. Therefore, when filling in his dream schools, he only wrote down the military academy. However, he never expected that the results of the genetic scan after the physical examination showed that he was extremely unsuitable for this profession. \r\n\r\nThe screen clearly read: \r\n\r\n[Probability of dragging a comrade on the battlefield: 99.5% \r\n\r\nProbability of death: 99.5% \r\n\r\nProbability of surrendering: 99.5% \r\n\r\nProbability of becoming a combat hero: 0.01%]\r\n\r\nThe results are based on the statistics and analysis of countless soldiers’ genes in the past, thus it’s impossible anything will be incorrect. Wu Qiao’s data was too shocking to the world — he could be called the ultimate waste in history. Taking into account the terrifying, dragging and the chance of surrendering to the enemy, the military academy ultimately didn’t admit Wu Qiao. Even though very few people have been eliminated because of their genes in the past. Because he didn’t list down any other schools, he had nothing to do …there were almost no labor jobs in this era. His family thought, since he couldn’t work, it would be best to start a family first. So they secretly matched his genes– looking for a suitable partner based on his genes. According to the results… the system found only one person.\r\n\r\nA few years ago, he became a five-star general because of his achievements in battle.\r\n\r\nIt was incredible to have only been matched with one person, they even became a five-star general just last year. He quickly replied.\r\n\r\nThe five-star general’s reply only contained eight characters: “That interstellar waste wood? Get out of here–”\r\n\r\nInterstellar waste wood slapped everyone in the face, including Xiao Gong’s…\r\n\r\nWu Qiao: “Why are you giving me up? Because of my 0.01% success rate?”\r\n\r\nGong: Under attack\r\n\r\nShou: To others, I may be calm on the surface, but my inner spirit is beaten up every day.>"
}