{
	"url": "https://www.novelupdates.com/series/the-former-supreme-saint-who-lost-everything-to-her-sister-is-cared-for-by-the-crown-prince-of-another-continent/",
	"title": "The Former Supreme Saint, Who Lost Everything to Her Sister, Is Cared For by the Crown Prince of Another Continent - Novel Updates",
	"image": "https://www.novelupdates.com/img/noimagefound.jpg",
	"noveltype": "(JP)",
	"genre": "Fantasy   Romance   Shoujo   ",
	"tags": "Artists   Broken Engagement   Dense Protagonist   Engagement   Female Protagonist   Hiding True Identity   Late Romance   Manipulative Characters   Nobles   Royalty   Saints   Time Skip   ",
	"rating": "(3.5 / 5.0, 47 votes)",
	"author": "Kuzuryuuzaka Mahoron   九頭竜坂まほろん   ",
	"year": "\n2021",
	"ranking": "#4617   #4207   #4716   #3739   #7334   ",
	"reviewcount": "7 Reviews sorted by",
	"description": "**The Former Supreme Saint, Who Lost Everything to Her Sister, Is Cared For by the Crown Prince of Another Continent\r\n\r\nAs I had been painting in my room, His Highness the Crown Prince had called off our engagement because I had not fulfilled my duties as the Supreme Saint.\r\n\r\nI had permission from His Majesty the King to paint, and I had done my job of putting up barriers all over the country, but…\r\n\r\nHis Royal Highness the Crown Prince did not listen to me and gave the position of Supreme Saint to my half-sister, Mira, and made her his fiancee.\r\n\r\nExpelled from the position of Supreme Saint and penniless, I crossed the sea to a neighboring country in search of my childhood friend.\r\n\r\nApparently, my paintings are blessed by gods and spirits, and the country of Hallstein seems to have been developed by the power of my paintings.\r\n\r\nWhat? Did the blessings of the spirits disappear when I was gone? My sister Mira is not able to create barriers throughout the country because of her lack of magical power?\r\n\r\nI’m doted on by the crown prince of the neighboring country, so I don’t need to be told such a thing now. I don’t even know that my country is in a critical situation since diplomatic relations with my country have been cut off due to the stormy seas.>"
}