{
	"url": "https://www.novelupdates.com/series/the-fantastical-beasts-at-worlds-end/",
	"title": "The Fantastical Beasts at World’s End - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/07/The-Fantastical-Beasts-at-Worlds-End.png",
	"noveltype": "(CN)",
	"genre": "Action   Fantasy   Horror   Mystery   Shounen Ai   Supernatural   ",
	"tags": "Animal Characteristics   Apocalypse   Beasts   Caring Protagonist   Clingy Lover   Fantasy World   Mutated Creatures   Mythical Beasts   Special Abilities   Thriller   ",
	"rating": "(4.1 / 5.0, 13 votes)",
	"author": "Mu Su Li   木苏里   ",
	"year": "\n2013",
	"ranking": "#5262   #2000   #11702   #11315   #10609   ",
	"reviewcount": "No Reviews",
	"description": "In an apocalyptic world where a highly corrosive fog has been decimating cities and causing huge numbers of casualties, citizens live in a constant state of panic and worry. With the government struggling to prevent further tragedies, it was difficult for people to carry on with hope when they’re uncertain about their own futures.\n\nYe Zhao is blessed with an uncanny ability to sense when this fog will appear. He uses this skill to alert his friends, Luo Xiaochen and Xia Zhiming, and those who will listen to his advice online. A life saved lives on for another day, and with Ye Zhao’s ‘sixth sense’ guiding them through the chaos, the three have been able to evade the worst of the fog and keep their little lives intact till now. \n\nSometimes, it really helps when you have a friend who is even more reliable than the weatherman… \n\nHowever, amongst all the chaos, Ye Zhao slowly realizes that his senses are becoming more and more sensitive. He was seeing things that normal people couldn’t see, hearing things that normal people couldn’t hear…What is this? Is he slowly going crazy? \n\nTo add the cherry on top of his chaotic life, he is unexpectedly reunited with his old flame, Nie Renyan, when Luo Xiaochen finds him lying unconscious near his apartment building. Once tight lovers, and now practically strangers, Ye Zhao finds himself with many questions and the burning urge to strangle the man who broke his heart by suddenly vanishing from his life. \n\nWhy did you leave? Where did you go? Why did you show your face after all these years? \n\nWith Nie Renyan’s opportune reappearance which only creates more questions than answers, Ye Zhao suddenly finds himself embroiled in a mystery that involves a world beyond his wildest imagination. What are these fantastical beasts? What does this have to do with the fog and with Ye Zhao himself? Nie Renyan, just what the hell are you?!>"
}