{
	"url": "https://www.novelupdates.com/series/the-woman-who-became-the-male-god/",
	"title": "The Woman who Became the “Male” God - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/07/The-Woman-who-Became-the-Male-God.jpg",
	"noveltype": "(CN)",
	"genre": "Gender Bender   Romance   Sci-fi   Xuanhuan   ",
	"tags": "Charismatic Protagonist   Clever Protagonist   Cold Love Interests   Conditional Power   Crossover   Cultivation   Different Social Status   Doting Love Interests   Fantasy World   Female Protagonist   Female to Male   Futuristic Setting   Genetic Modifications   Handsome Male Lead   Hard-Working Protagonist   Modern Knowledge   Orphans   Pharmacist   Pill Based Cultivation   Pill Concocting   Poor to Rich   Power Couple   Slow Romance   Strength-based Social Hierarchy   ",
	"rating": "(4.4 / 5.0, 42 votes)",
	"author": "Xue Yuan Specter   雪原幽灵   ",
	"year": "\n2017",
	"ranking": "#4617   #2420   #6167   #10658   #6223   ",
	"reviewcount": "6 Reviews sorted by",
	"description": "An Xian had a crossover from earth to the world of cultivation. As she arrived there, she practised conscientiously and diligently to become a well-known spiritual pharmacist. However, when crossing the final catastrophe, she unknowingly took the wrong medicine, causing her body to undergo abnormal changes and prompting her to fall into a deep slumber. When she finally woke up, it was already 1,800 years later. The world’s civilization had undergone a significant transformation. She also lost her feminine characteristics due to the disaster and the pill, making her unable to cultivate as she used to. She could only draw spiritual power from flowers and plants surrounding her. To use her brand-new identity, she began to grow flowers, open stores, sell medicines, and brainstorm for the future…\n\nThe medicine she developed had a miraculous effect on the treatment of mental illness.\n\nThe flowers she planted had grand plans to take over the world.\n\nShe was a woman who aspired to be a national “male” god.\n\nBut she had no idea that the man she had inadvertently picked up was the true male god and that he was about to bend himself for her.>"
}