{
	"url": "https://www.novelupdates.com/series/beware-of-the-brothers/",
	"title": "Beware of the Brothers - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/06/Beware-of-the-Brothers.jpg",
	"noveltype": "(KR)",
	"genre": "Drama   Fantasy   Romance   Shoujo   Slice of Life   ",
	"tags": "Abandoned Children   Abusive Characters   Adapted to Manhwa   Adopted Protagonist   Age Progression   Aristocracy   Arrogant Characters   Beautiful Female Lead   Brotherhood   Bullying   Calm Protagonist   Caring Protagonist   Cautious Protagonist   Character Growth   Charming Protagonist   Child Protagonist   Childhood Friends   Childhood Love   Complex Family Relationships   Curious Protagonist   Cute Children   Death of Loved Ones   Dense Protagonist   Doting Love Interests   Doting Older Siblings   Doting Parents   European Ambience   Female Protagonist   Handsome Male Lead   Hated Protagonist   Heartwarming   Helpful Protagonist   Playful Protagonist   Polite Protagonist   Possessive Characters   Second Chance   Siblings Not Related by Blood   ",
	"rating": "(3.6 / 5.0, 136 votes)",
	"author": "Plutos   플루토스   ",
	"year": "\n2017",
	"ranking": "#5262   #2000   #2434   #1881   #1384   ",
	"reviewcount": "42 Reviews sorted by",
	"description": "Hari, a destitute girl, got adopted by Duke Ernst at 7 years old when she lost her mother, as the Ernsts had themselves lost their youngest daughter Arina and sought Hari due to her resemblance to the late girl. Even though she received all kinds of persecution by the three Ernst sons in 20 years of life at the Ernst estate, she could finally escape that blood-and-tear inducing life when she was about to get married.\r\n\r\nBut what is this?\r\nWhen I woke up from my sleep, I'm back to that hellish childhood! Is this a dream?!\r\n\r\nHmph. If I can't wake up from this dream, I'll at least live without too much consideration for others now!\r\n\r\nJust like that, Hari decided to go astray. Eugene, the 'dutiful son' but cold, Cabel, the roughhousing knucklehead, and Erich, the angelic-looking bully and Arina's twin, all three be damned!>"
}