{
	"url": "https://www.novelupdates.com/series/higawari-teni-ore-wa-arayuru-sekai-de-musou-suru-%ef%bd%9e/",
	"title": "Higawari Teni ~ Ore wa Arayuru Sekai de Musou Suru  ~ - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/08/higawari.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Comedy   Fantasy   Harem   Sci-fi   Supernatural   Tragedy   ",
	"tags": "Cheats   Demon Lord   Immortals   Male Protagonist   Marriage   Multiple Transported Individuals   Overpowered Protagonist   Polygamy   Protagonist Strong from the Start   Summoned Hero   Sword And Magic   Transported to Another World   World Hopping   ",
	"rating": "(3.9 / 5.0, 107 votes)",
	"author": "Epina   えぴな   ",
	"year": "\n2016",
	"ranking": "#2000   #2000   #5427   #4754   #2894   ",
	"reviewcount": "8 Reviews sorted by",
	"description": "Hey, you. Have you been summoned to another world before?\r\n\r\nDefeat the Demon King as a Hero. Transferred with all the classmates. To be involved in a death game in a world like a game. Oh, Not summoned but the type where you get reincarnated with your previous memories, My condolence. Me? Of course it's a yes.\r\n\r\nWhat kind of Another World I was summoned? Its all, all kinds. Fantasy of Sword and Magic, a world that imitates a Game, Death Game which is not allowed to log out…… As far as I think of, it's all kinds.\r\n\r\nDo I have a cheat? That’s a good question. After the task in the another world ends, I’ll be summoned to different another world.\r\n\r\nThat is the curse that is put to me, the greatest cheat ability. It was only it seriously at first. I almost died many times. However, I was able to get all cheat ability by going around in various another worlds.\r\n\r\nMagic? Unlimited Magic? Holy Sword? Cursed Sword? Item Box? Beautiful girl Harem? There is, I have something anything you can think of. Well, Only the ability that I want the most I can’t get.\r\n\r\nWhoops, A summoning formation. It seems that there is a guy summoning me. Well then, You also be in good health. There is also some reason meeting you here. If you are troubled with something, Just summon me.\r\n\r\nBe it a Demon King that threatens the world.\r\n\r\nBe it a Dragon that eat vast lands.\r\n\r\nBe it a VRMMO game master.\r\n\r\nBe it a Reincarnated person that misunderstand his cheat.\r\n\r\nBe it my Foolish fate.\r\n\r\nAnd………….Be it the shitty god that put Another World transfer curse in me!\r\n\r\nI’ll make anyone surrender.>"
}