{
	"url": "https://www.novelupdates.com/series/because-i-reincarnated-as-a-succubus-ill-squeeze-out-milk/",
	"title": "Because I Reincarnated as a Succubus, I’ll Squeeze Out Milk - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2017/06/Image.jpg",
	"noveltype": "(JP)",
	"genre": "Comedy   Ecchi   Fantasy   Gender Bender   Romance   ",
	"tags": "Adapted to Manga   Adventurers   Beast Companions   Beautiful Female Lead   Demons   Dense Protagonist   Fantasy World   Female Protagonist   Human-Nonhuman Relationship   Humanoid Protagonist   Male to Female   Naive Protagonist   R-15   Reincarnation   Succubus   Weak Protagonist   ",
	"rating": "(3.8 / 5.0, 100 votes)",
	"author": "Kino Yuuki   木野裕喜   ",
	"year": "\n2016",
	"ranking": "#2000   #2000   #2978   #6184   #3140   ",
	"reviewcount": "8 Reviews sorted by",
	"description": "To drown men into dazzling pleasure and show them their loved ones in their dreams, that is a succubus.\r\n\r\nDue to an accident, a young 17 years old boy named Riichi Hourai is reincarnated into a succubus due to a misunderstanding by the Reincarnation Support Department. For a succubus to live, she squeezes out man’s life essence and must consume it but Riichi as a former man firmly refuses it and would rather die than do such behavior.\r\n\r\nDoes a substitute for a life essence kind of food exist?\r\n\r\nThere is! And surprisingly it’s milk!!\r\nHowever,  There’s no race called a cow in another world let alone drink milk from other races.\r\n\r\nAlthough the Rehabilitation Support Department gave him a dairy cow under special circumstances, he risks his own life raising the cattle who will become his life line in a parallel world and survive there while resisting his succubus nature.\r\n\r\nMoreover, It seems the cow wasn’t just any ordinary creature…\r\n\r\nContrary to his desire for a peaceful life, Riichi was dragged into conflicts that influenced the fate of the world without him noticing it.\r\n\r\nThough him and his best friend have both died in an accident and his best friend reincarnated a bit late, both of them haven’t noticed the existence of one another.\r\n\r\nCan Riichi meet his best friend ever again?!\r\n\r\nWill their friendship be the same like their past life?!\r\n\r\nA romantic comedy with their new cheat forms start here.>"
}