{
	"url": "https://www.novelupdates.com/series/antagonists-are-very-well-behaved-today/",
	"title": "Antagonists Are Very Well-Behaved Today - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/02/Antagonists-Are-Very-WellBehaved-Today.jpg",
	"noveltype": "(CN)",
	"genre": "Fantasy   Josei   Romance   Tragedy   ",
	"tags": "Beautiful Female Lead   Cute Protagonist   Female Protagonist   Goddesses   Gods   Handsome Male Lead   Lack of Common Sense   Possessive Characters   Power Couple   Reincarnation   Tragic Past   Transmigration   World Hopping   ",
	"rating": "(4.3 / 5.0, 30 votes)",
	"author": "Jadeite   ",
	"year": "\nN/A",
	"ranking": "#6970   #4731   #6796   #13807   #6362   ",
	"reviewcount": "11 Reviews sorted by",
	"description": "Join Big Shot as she embarks on a mission to protect God of War in different worlds and situations! \r\n\r\nThe system instructs her, 'Your mission is to cherish that man so that he doesn’t become depraved and turn into a first-class villain.' \r\n\r\nBig Shot tilts her head, looking adorable and innocent as she tries her best to understand. 'Oh! My mission is to become a great villain, instead of letting him be one! I will cherish and protect him as though he were a little flower!' ヽ(✿ﾟ▽ﾟ)ノ \r\n\r\nThe arrogant and stubborn young man was sullen. 'All men are evil. So I shall be the most evil— Huh? Wife, calm down! We can discuss everything, so please don’t be so rash. That man is going to die if you keep bashing him!' (งᓀ‸ᓂ)ง (ﾉ´Д｀)ﾉ \r\n\r\nThe evil governor already had plans laid out. He curled his lips into a sneer. 'The world is within my control. I want to— Wife, hold on! Don’t revolt! I will buy you candied fruit! I’m begging you to spare His Majesty’s life!' (╯‵□′)╯︵┻━┻ \r\n\r\nThe ruthless monarch gazed coldly at the world. 'As the king, I can gather the clouds with a wave of my palm and turn them into rain! No one dares to disobey my orders! I want to be an inept ruler… AH, my beloved concubine! I was careless with my words earlier on! I swear to be the best emperor through the ages for all time. You can hit me, just not my face… Be gentle…' ( *^-^) (*╯^╰)ρ \r\n\r\nA really cute, charming, and touching story about a remnant soul experiencing different lives while watched over by an adorable (but lacking-common-sense) girl.>"
}