{
	"url": "https://www.novelupdates.com/series/moon-laika-and-the-bloodsucking-princess/",
	"title": "Moon, Laika, and the Bloodsucking Princess - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2017/12/09451647.jpg",
	"noveltype": "(JP)",
	"genre": "Adventure   Drama   Fantasy   Romance   Sci-fi   Supernatural   ",
	"tags": "Adapted to Anime   Adapted to Manga   Male Protagonist   Tsundere   Vampires   ",
	"rating": "(3.6 / 5.0, 26 votes)",
	"author": "Keisuke Makino   牧野 圭祐   ",
	"year": "\n2016",
	"ranking": "#6970   #2000   #10681   #9890   #7610   ",
	"reviewcount": "No Reviews",
	"description": "The story of a young man who yearned for space and a vampire girl.\n\nThe first astronaut in the history of mankind was a vampire girl—-.\n\nIt’s the era where manned spaceflight has not yet succeeded.\n\nThe supreme leader of the republic announced the project to send humans up into orbit with rockets. He spoke passionately, “Before the United Kingdom does, let’s make mankind reach space!”\n\nBehind the scenes, at the end of the snowy fields of the republic, at the secret town , the “Nosferatu Project” that used vampires as a substitutes for humans for rocket flight experiments was moving forward. Taking advantage of a certain incident, First Lieutenant Liev Lepus was promoted from  Cosmonaut Cadet. He was ordered to supervise the vampire girl, Irina Luminesque, who was chosen by chance to be a guinea pig.\n\nStrict training. Continuous failed experiments. Can mankind actually reach space? The team was enveloped by such an atmosphere.\n\n“Before anyone else, I will travel to space. I want to take a look at the moon from outer space, where no one has gone before.”\n\nIrina had those exact feelings. In their chests was a pure longing for space.\n\nDespite being made fun of by the egoist top-brass and the whims of the times, they were here, putting everything they have into aiming for distant space. Spun by a young man who yearns for space and a vampire girl, a Cosmonauts’ Graffiti tale of space and adolescence is here.>"
}