{
	"url": "https://www.novelupdates.com/series/the-harem-rescue-project/",
	"title": "The Harem Rescue Project - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/06/The-Harem-Rescue-Project-Transmigration-into-a-Book-Character.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Drama   Harem   Martial Arts   Romance   Xianxia   Yuri   ",
	"tags": "Appearance Changes   Beautiful Female Lead   Demonic Cultivation Technique   Female Protagonist   Love Interest Falls in Love First   Master-Disciple Relationship   Persistent Love Interests   Strong Love Interests   System Administrator   Transmigration   Yandere   ",
	"rating": "(4.4 / 5.0, 42 votes)",
	"author": "Beicheng Mojing   北城墨景   ",
	"year": "\n2020",
	"ranking": "#1263   #1005   #5876   #6617   #7171   ",
	"reviewcount": "7 Reviews sorted by",
	"description": "Lin Qianshuang read a Cultivation Harem novel by mistake, reached a certain point, was rendered speechless and forced to vomit blood.\n\nThe male protagonist was a scumbag named Liang Jingxuan who was a bastard even before transmigrating. After transmigrating, the wretched male protagonist counterattacked the tall, rich and handsome villains. His golden finger allowed him to pick up countless girls, treating them as vulgar stand-ins saying, “She is like my white moonlight.” He collected various big beauties in the end.\n\nThe girls in the novel all have beautiful appearances, but when they encounter the scumbag, their IQ drops and they end up relying on the male protagonist like little birds, appearing cute and helpless.\n\n▼The Immortal Sect’s Sweet and Cute Little Sister – How could you be so blind! The scumbag is your father’s enemy, ah.\n\n▼The Enchanting and Beautiful Sage of the Demon Palace – Wake up ah, wake up! The scumbag treats you as a stand-in for his white moonlight!\n\n▼The Cold, Arrogant, and Unparalleled Lord of Tianshu City – Leaving such a large city behind, are you going to be the canary of the scumbag?\n\n▼The Hot and Sexy Nine-tailed Beast Emperor – Did you take the wrong medicine? It was the scumbag who dug out your wet nurse’s neidan, how could you save that scum! You even kissed him!!! Kissed!!!\n\n……\n\n(Your comments have been received. The Lord God has heard your demands.)\n\n(Congratulations to the host for joining the “Harem Rescue Project”, you can successfully leave the world after completing the above rescue missions for each character.)\n\nLin Qianshuang: ? Oh my god, can someone please tell her why has she become the person with the highest value of hatred among all his partners, the scumbag’s white moonlight!>"
}