{
	"url": "https://www.novelupdates.com/series/necropolis-immortal/",
	"title": "Necropolis Immortal - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/04/S__3203091.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Comedy   Xuanhuan   ",
	"tags": "Alchemy   Aristocracy   Army   Artifact Crafting   Artifacts   Battle Competition   Beast Companions   Beasts   Bodyguards   Calm Protagonist   Clever Protagonist   Confident Protagonist   Cultivation   Dao Comprehension   Dense Protagonist   Determined Protagonist   Disabilities   Divination   Dragons   Dungeons   Early Romance   Empires   Enemies Become Allies   Evil Gods   Fallen Nobility   Famous Protagonist   Feng Shui   Fox Spirits   Friendship   Ghosts   Gods   Hiding True Abilities   Immortals   Kingdoms   Loyal Subordinates   Lucky Protagonist   Magic Formations   Magical Space   Maids   Male Protagonist   Manipulative Characters   Military   Mind Control   Mythical Beasts   Necromancer   Nobles   Past Plays a Big Role   Phoenixes   Pill Concocting   Politics   Quirky Characters   Romantic Subplot   Schemes And Conspiracies   Sect Development   Sentient Objects   Servants   Shameless Protagonist   Souls   Strength-based Social Hierarchy   Sword Wielder   Teamwork   Thieves   Transmigration   Underestimated Protagonist   Weak to Strong   World Travel   Zombies   ",
	"rating": "(3.5 / 5.0, 181 votes)",
	"author": "Immortal Amidst Snow In July   ",
	"year": "\n2017",
	"ranking": "#196   #186   #525   #238   #3728   ",
	"reviewcount": "40 Reviews sorted by",
	"description": "A great war raged between cultivators a hundred thousand years ago. Immortals fell by the tens of thousands, the path of cultivation itself was severed, and after the dust settled, tombs forested the world.\n\nA hundred thousand years after the last legend faded, Lu Yun, commandant of tomb raiders, descends upon the world. Armed with the Tome of Life and Death, he has some burning questions to answer.\n\n……\n\n“This isn’t how you raid a tomb!” Lu Yun smirked at the cultivators frantically scurrying about the ancient tomb. “Do you want me to teach you?”\n\n……\n\nBut ah, can someone teach him how to cure his new body’s erectile dysfunction?>"
}