{
	"url": "https://www.novelupdates.com/series/big-brother-please-save-us/",
	"title": "Big Brother, Please Save Us! - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/06/zaeg.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adult   Adventure   Horror   Psychological   Supernatural   Tragedy   Yuri   ",
	"tags": "Alternate World   Apocalypse   Beautiful Female Lead   Betrayal   Calm Protagonist   Cannibalism   Cautious Protagonist   Charismatic Protagonist   Cold Protagonist   Confident Protagonist   Cunning Protagonist   Dense Protagonist   Determined Protagonist   Evil Religions   Fearless Protagonist   Game Elements   Love Interest Falls in Love First   Low-key Protagonist   Murders   Overpowered Protagonist   Poor Protagonist   Proactive Protagonist   Protagonist Strong from the Start   Saving the World   Strong Love Interests   Survival Game   System Administrator   Virtual Reality   Zombies   ",
	"rating": "(3.6 / 5.0, 31 votes)",
	"author": "Mei Bi   糜陛   ",
	"year": "\n2020",
	"ranking": "#2000   #2000   #7932   #6789   #8080   ",
	"reviewcount": "3 Reviews sorted by",
	"description": "As the last survivor of Doomsday world, Red Flame Witch Lin Rurui, who was dead, was reborn into an Escape Game.\n\nA cabin deep in the forest where the evil cannibal cult lurks, numerous ghosts that can be seen at Osaka street at night, Zombie village in the old forest of the deep mountain …\n\nPeople who were unfortunately selected began to scream again and again.\n\n“Ahhhh! The monster is out again!”\n\n“Please save me! Let me outta this game!”\n\n“Woo woo woo mommy I want to go home…”\n\nThe Escape Game is broadcasted live on big screens around the world, and seven billion people around the world were clutching at the heart for their fellow citizens.\n\nHearing screams, Lin Rurui calmly walked, surrounded by blood thirsty monsters.\n\n“Hey! That girl over there! Don’t go over there, are you looking for death!?”\n\nThe girl showed her hands and drew out a sword of flame, and as if the sun has descended from the sky, monsters are immediately annihilated, accompanied by a burnt aroma of barbecued meat.\n\nEveryone: “…”\n\n“Big Brother, please save us!”>"
}