{
	"url": "https://www.novelupdates.com/series/i-a-lonely-otaku-was-surrounded-by-some-of-the-most-beautiful-girls-on-campus-and-was-called-riajuu-before-i-knew-it/",
	"title": "I, a Lonely Otaku Was Surrounded by Some of the Most Beautiful Girls on Campus and Was Called Riajuu Before I Knew It - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/05/I-a-Lonely-Otaku-Was-Surrounded-by-Some-of-the-Most-Beautiful-Girls-on-Campus-and-Was-Called-Riajuu-Before-I-Knew-It.jpg",
	"noveltype": "(JP)",
	"genre": "Comedy   Drama   Harem   Romance   School Life   Slice of Life   ",
	"tags": "Anti-social Protagonist   Artificial Intelligence   Beautiful Female Lead   Brother Complex   Bullying   Childhood Friends   Childhood Love   Cold Protagonist   Cousins   Handsome Male Lead   Heterochromia   Incest   Kuudere   Late Romance   Loli   Loner Protagonist   Male Protagonist   Modern Day   Multiple POV   Otaku   Past Trauma   Programmer   Siblings Not Related by Blood   Teachers   Tsundere   Ugly to Beautiful   Wealthy Characters   Younger Sisters   ",
	"rating": "(3.5 / 5.0, 116 votes)",
	"author": "Nekokuro   ネコクロ   ",
	"year": "\n2019",
	"ranking": "#4080   #6302   #1775   #2699   #2803   ",
	"reviewcount": "25 Reviews sorted by",
	"description": "Our main character suffers from a communication disorder due to an event that occurred in his past.\n\nHe—was a boy name Kaito, and his only friend was a girl that he knew online.\n\nI don’t know the identity of this person at all…..maybe it isn’t even a girl….\n\nHowever to Kaito, no matter what type of person she was, she was still an important friend.\n\nEveryday the people around him would say 「Otaku, gross, you have no presence」nobody would even come near him except for school reasons.\n\nOn yet another day of his lonely life, his father remarried—fortunately or unfortunately, it changed his life completely.\n\nKaito obtained a family with a beautiful sister.\n\nIt would usually be something to be happy about.\n\nHowever, he despaired about it and made an oath in his heart\n\n(This girl, will definitely cry someday!)\n\nGradually, Kaito makes contact with other beautiful girls in the school.\n\nBecause of them, his peaceful lonely life began to change completely and was thrown into disarray.\n\nWill he end up in heaven or hell—>"
}