{
	"url": "https://www.novelupdates.com/series/records-of-dungeon-travel/",
	"title": "Records of Dungeon Travel - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/08/Records-of-Dungeon-Travel.jpeg",
	"noveltype": "(KR)",
	"genre": "Action   Adventure   Fantasy   Harem   Mystery   Supernatural   ",
	"tags": "Abandoned Children   Abusive Characters   Adapted to Manhwa   Adventurers   Alternate World   Beast Companions   Beastkin   Beasts   Betrayal   Boss-Subordinate Relationship   Complex Family Relationships   Conditional Power   Demi-Humans   Demons   Dungeon Master   Dungeons   Enemies Become Allies   Fantasy Creatures   Friends Become Enemies   Game Elements   Gate to Another World   Gunfighters   Hidden Abilities   Hiding True Abilities   Hiding True Identity   Human-Nonhuman Relationship   Hunters   Level System   Love Interest Falls in Love First   Low-key Protagonist   Loyal Subordinates   Magic   Magic Beasts   Male Protagonist   Master-Servant Relationship   Modern Day   Monster Girls   Monsters   Mysterious Past   Near-Death Experience   Past Plays a Big Role   Past Trauma   Post-apocalyptic   Protagonist Strong from the Start   Secret Identity   Secret Organizations   Secretive Protagonist   S*aves   Slow Growth at Start   Slow Romance   Special Abilities   Strong Love Interests   Strong to Stronger   Sword And Magic   Tragic Past   ",
	"rating": "(3.1 / 5.0, 47 votes)",
	"author": "Geulump   Northwood   글럼프   ",
	"year": "\n2017",
	"ranking": "#705   #671   #2073   #3061   #5984   ",
	"reviewcount": "3 Reviews sorted by",
	"description": "In the depths of the underground world lived the descendants who were born and raised by feeding on the teats of beasts.\r\n\r\nThese individuals with special abilities and enhanced physical abilities were known as dungeon babies.\r\n\r\nAmongst them, Kim Jin-Woo was born in the labyrinth on the lowest floor.\r\n\r\n“I’ve never tried to become strong. I just wanted to survive.”\r\n\r\nThis is a story of a lowly tunnel digger who ascends the throne to become the king of a labyrinth.>"
}