{
	"url": "https://www.novelupdates.com/series/when-i-was-transferred-to-another-world-i-became-the-adjutant-of-a-lady-commander-and-beared-the-brunt-of-a-lustful-harem-wn/",
	"title": "When I was Transferred to Another World, I Became the Adjutant of a Lady Commander and Beared the Brunt of a Lustful Harem! (WN) - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/09/When-I-was-Transferred-to-Another-World-I-Became-the-SecondinCommand-of-a-Lady-Commander-and-Beared-the-Brunt-of-a-Lustful-Harem-WN.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adult   Ecchi   Fantasy   Harem   Mature   Seinen   ",
	"tags": "Aristocracy   Army   Army Building   Beautiful Female Lead   Boss-Subordinate Relationship   Calm Protagonist   Cautious Protagonist   Clever Protagonist   Cunning Protagonist   European Ambience   Fantasy Creatures   First-time Interc**rse   Generals   Male Protagonist   Manipulative Characters   Military   Monsters   Nudity   Politics   Pragmatic Protagonist   R-18   Soldiers   Strategic Battles   Strategist   Strength-based Social Hierarchy   Sword And Magic   Threesome   Transported to Another World   Weak Protagonist   ",
	"rating": "(2.8 / 5.0, 48 votes)",
	"author": "Narita Harem King   成田ハーレム王   ",
	"year": "\n2017",
	"ranking": "#877   #1266   #4869   #1540   #4556   ",
	"reviewcount": "1 Review sorted by",
	"description": "When I was Transferred to Another World, I Became the Adjutant of a Lady Commander and Beared the Brunt of a Lustful Harem!\n\n~From a Safe Place, Let’s Rise to Greatness! While at it, have Wonderful s*x with Beautiful Women from Another World as Well!~\n\nYuushin Sanada was taking a shower when he suddenly got transported to another world. Being thrown outside buck-naked, he was more shocked to see that the place he has arrived at was the center of a battlefield, where powerful monsters are running rampant all over the place, and the soldiers, even though they were already strengthened and enhanced by magic, are still struggling to fight them off.\n\nSince the ability to use magic was the deciding factor in strength in this world, Yuushin, who has no way to defend himself, decided to approach a person who has the power, grasp their abilities and weaknesses, and secure a safe job to avoid having to fight on the front lines. It was then that he meets Lucy, a timid baroness and the commander of the defending forces, by luck.\n\nShowing off the underhanded tactics that he learned in his original world, Yuushin decides to help Lucy, and by giving her all the credit for his accomplishments, he then succeeds in securing a position as her adjutant.\n\nUpon investigating further, however, Yuushin discovers Lucy’s fear of powerful monsters, so in order to overcome that mental barrier, he decided to make her immediate superior experience the most wonderful part of being a woman – the incredible taste of s*x with a man.\n\nAfter that, came a series of battles and all sorts of problems, but by utilizing his scheming as the Aide-de-Camp of the Baroness, while also building up trust and affection to his allies and the like – mostly beautiful women of power, Yuushin began aiming to have the most powerful another world harem of his life – also in order for him to stay away from the front lines of course!>"
}