{
	"url": "https://www.novelupdates.com/series/my-foolish-snake-husband-wouldnt-stop-pestering-me/",
	"title": "My Foolish Snake Husband Wouldn’t Stop Pestering Me - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/02/My-Foolish-Snake-Husband-Wouldnt-Stop-Pestering-Me.jpg",
	"noveltype": "(CN)",
	"genre": "Shounen Ai   Supernatural   Tragedy   Xuanhuan   Yaoi   ",
	"tags": "Abusive Characters   Adultery   Affair   Appearance Different from Actual Age   Caring Protagonist   Character Growth   Cruel Characters   Cultivation   Depictions of Cruelty   Marriage   Modern Day   Mpreg   Past Plays a Big Role   Poor Protagonist   R*pe Victim Becomes Lover   Reincarnation   Revenge   R*pe   Sadistic Characters   Selfless Protagonist   Showbiz   Strong Love Interests   Tragic Past   ",
	"rating": "(2.8 / 5.0, 59 votes)",
	"author": "An Xi   安曦   ",
	"year": "\nN/A",
	"ranking": "#813   #1920   #4967   #6511   #5290   ",
	"reviewcount": "11 Reviews sorted by",
	"description": "The man he loves drains his blood and removes his scales to save another.\n\n“Duan Chen, whatever that you desire I will endure all pains to give them to you. But in the end, you are telling me that I am just the medicine you prepared for him.”\n\nDuan Chen married Yan Rui not because of his exquisite good looks but because his blood can save lives. Which is why he deceived this simple-minded snake to save his sweetheart. One lie after another, he unwittingly fell for his own deception.\n\nWhen Duan Chen fell for Yan Rui, he did not expect him to run off. Duan Chen searched all over the world for him until…..\n\nThe photos in the document folder scattered on the floor, something caught his attention and Duan Chen’s eyes reddened in an instant.\n\nYan Rui in the photograph was hiding in a rubbish dump looking back with hollow black eyes. It was as if he was devoid of the human soul. His body was reduced to skin and bones. Duan Chen shuddered and continued to flip the photographs all the way until the last. His eyes were now bloodshot. \n\n“My little crying bun, my heart is all yours, will you please return to my side?”>"
}