{
	"url": "https://www.novelupdates.com/series/north-x-northwest/",
	"title": "North x Northwest - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/02/North-x-Northwest.jpg",
	"noveltype": "(KR)",
	"genre": "Adventure   Drama   Fantasy   Mature   Romance   ",
	"tags": "Adapted to Manhwa   Adventurers   Beautiful Female Lead   Character Growth   Cross-dressing   Discrimination   Empires   Enemies Become Lovers   European Ambience   Fantasy Creatures   Female Protagonist   Fleet Battles   Handsome Male Lead   Hard-Working Protagonist   Hiding True Identity   Love Interest Falls in Love First   Love Triangles   Magic   Misunderstandings   Multiple POV   Nobles   Pirates   Power Couple   R-15   Rivalry   Secrets   Slow Romance   Soldiers   Strong Love Interests   Sword And Magic   Tomboyish Female Lead   Wealthy Characters   World Travel   ",
	"rating": "(4.0 / 5.0, 30 votes)",
	"author": "Song Yun   송윤   ",
	"year": "\n2017",
	"ranking": "#1780   #2135   #9035   #5101   #8313   ",
	"reviewcount": "3 Reviews sorted by",
	"description": "‘Lil Schweiz’, a famous pirate in the southern seas.\n\nWhile on a smooth voyage, shocking news fell upon her.\n\n“The Admiral is coming.”\n\nDespite the hot weather, chills ran down her spine. Lil took her eyes off her hands and looked up at Alain, the boatswain.\n\nNot that she didn’t hear him, but she wanted to check again.\n\n“Who?”\n\n“The Admiral of the Peninsula! That madman! Admiral Retiro!”\n\nThat infamous admiral, known for skinning the heads of pirates he captured and throwing their limbs as food for the cannibal fish, the one with an eccentric and bizarre reputation will come to the South.\n\n‘It will be for the best to not cross his path. We should get out of here before he arrives!’\n\nBut there’s one thing that Lil doesn’t know.\n\n[I, Lil, are notifying you, Ed, that you’ve been punished respectfully according to the Sesbron etiquette.]\nIt’s a setup!\n\n“I'm glad I have a role in this interesting play.”\n\nHe briefly looked up at the sunlight passing through the huge veil. The sky above his head soon became covered in several ivory lights.\n\n“It's a good one, it's going to be a lot of fun.”\n\nA marine romance fantasy between a pirate captain and the admiral!>"
}