{
	"url": "https://www.novelupdates.com/series/seizing-dreams/",
	"title": "Seizing Dreams - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/01/CE98F4E1-B1BF-4E30-B151-D1E7E1902D59.jpeg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Fantasy   Mature   Mystery   Psychological   Romance   School Life   Slice of Life   Supernatural   Yaoi   ",
	"tags": "Abusive Characters   Adapted to Drama CD   Arrogant Characters   Bickering Couple   Caring Protagonist   Character Growth   College/University   Complex Family Relationships   Couple Growth   Death of Loved Ones   Determined Protagonist   Dreams   Family Conflict   Fantasy Creatures   Fantasy World   First-time Interc**rse   Gate to Another World   Handsome Male Lead   Hard-Working Protagonist   Helpful Protagonist   Magic   Modern Day   Near-Death Experience   Past Trauma   Poor Protagonist   Protagonist Falls in Love First   Slow Romance   Suicides   Tragic Past   Zombies   ",
	"rating": "(4.6 / 5.0, 377 votes)",
	"author": "Fei Tian Ye Xiang   非天夜翔   ",
	"year": "\n2018",
	"ranking": "#4617   #2000   #1452   #852   #591   ",
	"reviewcount": "85 Reviews sorted by",
	"description": "In the dreamer's dream, the dreamed one awoke.\n— Borges\n\n“I exist between the heavens and earth, in the sunlight, in the wind, and in dreams.”\n\nOne night, Yu Hao, a college student who was at his wits’ end had an unexpected encounter with a mysterious visitor – “General” – who had dream travelled. He led Yu Hao in solving the countless riddles that abounded in the realm of the conscious, and lit up the fire beacons on the meandering Great Wall.\n\nThereafter, the darkness retreated, the sun rose, and when the long night was thoroughly lit up, the him who existed in reality was reborn.\n\nThe black dragon that roared, the lighthouse and demonic eye on the coastline, the rain forest before Chichén Itzá, the fierce beasts that wreaked havoc in the Colosseum…the bizarre projection of reality in one’s consciousness reflected the hidden place that the sunlight in reality couldn’t touch – the innumerable sins of the human heart.\n\nThe journey of seizing dreams continues, and one can only hope that the sun will continue illuminating the human heart.\n\n——\n\nFire beacons on the Great Wall were lit up to signal a border invasion.>"
}