{
	"url": "https://www.novelupdates.com/series/i-have-a-happy-ending-with-the-mistress-ex-boyfriend/",
	"title": "I Have a Happy Ending with the Mistress’ Ex-Boyfriend - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/07/I-Have-a-Happy-Ending-with-the-Mistress-ExBoyfriend.jpg",
	"noveltype": "(CN)",
	"genre": "Drama   Romance   Shounen Ai   Slice of Life   ",
	"tags": "Black Belly   Boss-Subordinate Relationship   Childcare   Cold Love Interests   Cooking   Cute Children   Cute Protagonist   Devoted Love Interests   Handsome Male Lead   Inferiority Complex   Love Rivals   Marriage of Convenience   Mismatched Couple   Modern Day   Mpreg   Past Trauma   Phobias   Showbiz   Strong Love Interests   Wealthy Characters   ",
	"rating": "(3.9 / 5.0, 169 votes)",
	"author": "Zhi Tang   稚棠   脆枣   ",
	"year": "\n2019",
	"ranking": "#2510   #2334   #2377   #1505   #2683   ",
	"reviewcount": "49 Reviews sorted by",
	"description": "When the starlet Jian Qiaoxin went to catch his boyfriend in the act, who could have thought that the mistress’s boyfriend, Chairman Yan Gan, also came to the scene?\n \nThe only difference was that Jian Qiaoxin was holding a phone, while Yan Gan was holding a knife.\n \nTherefore,\n \nThe scene of catching an adultery became a bloodbath; he was supposed to come here to confront his boyfriend about the cheating; now he is the one attempting to mediate the situation.\n \n“Chairman Yan, please calm down, put down your knife and spare his life. I can see that he knows he is wrong now. ”\n \nJian Qiao Xin went drinking to drown his sorrows after breaking up with his boyfriend; it just so happened that Yan Gan came drinking at the same club.A drunken Jian Quaoxin and Yan Gan shared the same bed that night.\n \nThe next morning, Jian Qiaoxin woke up with Chairman Yan sleeping right next to him; recalling the night that Yan Gan raised the knife at the adulterous couple, he quickly ran out of the room to save his own life.\n \nA few months later, Jian Qiaoxin’s crazy morning sickness routines had caught his manager’s attention: “f*ck, you think the big boss will let you off, you dare get pregnant during this time of your career?”\n \nJian Qiaoxin: “...\n \nKill me then. After all, this is his deed.\n \n**\n \nAfter the breakup, I found out I was pregnant with the mistress’s ex-boyfriend’s child, and that person is also my boss. I would like to hear about it.>"
}