{
	"url": "https://www.novelupdates.com/series/court-marriage/",
	"title": "Court Marriage - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/07/Court-Marriage.jpg",
	"noveltype": "(CN)",
	"genre": "Drama   Fantasy   Yaoi   ",
	"tags": "Ancient China   Ancient Times   Arranged Marriage   Bisexual Protagonist   Child Protagonist   Cross-dressing   Cute Children   Devoted Love Interests   Family   Seme Protagonist   Sickly Characters   Transmigration   ",
	"rating": "(3.9 / 5.0, 16 votes)",
	"author": "洛冰凌   ",
	"year": "\n2011",
	"ranking": "#2182   #2389   #10235   #5887   #9304   ",
	"reviewcount": "1 Review sorted by",
	"description": "The protagonist, a famous writer in his previous life ― now transmigrated as the Young Lady Gong Zhuoliang from a large wealthy family, found out that this pitiful boy was not only harassed by his step mother, but he was also treated and raised as a delicate girl by his own family ever since he was a child. But not only that, he, as a guy, was even forced to wear a bride's wedding clothes to substitute his sister.\n\nWhen the 'Young Lady' received news of this, he found it very unbearable for him to accept, and so he jumped into the water to commit suicide. The reborn him pitied Xiao Gong. He originally planned to expose his 'Mother''s family to his 'Husband''s family, and allow them to come deal with his family, However, discussing about the pros and cons with his ill Husband had confused him so much.\n\nReluctantly, he began to live his 'sexual life' with his Husband.\n\nFortunately, although this man is quite frail and autistic, he's really good-looking, and the other is really set on being a caring husband for his wife. Therefore, either Xiao Gong's mood would be bad or good, he would immediately close their door, and then push Qiao Xianggong down the bed to do this and that again and again.....\n\nIn short! This is a story of Xiao Gong's growth~\n\nIt is also about the history of the overthrow of the Qiao family's relatives~\n\n-\nLisha's notes:\n\nXianggong = Husband; Term for young man>"
}