{
	"url": "https://www.novelupdates.com/series/reincarnation-lord-is-extremely-hardcore/",
	"title": "Reincarnation – Lord is Extremely Hardcore - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/01/重生之爷太重口了.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Drama   Horror   Josei   Mature   Mystery   Psychological   Romance   School Life   ",
	"tags": "Beautiful Female Lead   Calm Protagonist   Cannibalism   Charming Protagonist   Cold Love Interests   Complex Family Relationships   Crime   Criminals   Cruel Characters   Depictions of Cruelty   Devoted Love Interests   Dolls/Puppets   Evil Protagonist   Female Protagonist   First Love   Genius Protagonist   Gore   Handsome Male Lead   Lack of Common Sense   Love Interest Falls in Love First   Male Yandere   Manipulative Characters   Modern Day   Murders   Obsessive Love   Possessive Characters   Power Couple   Psychopaths   Reincarnation   Revenge   Ruthless Protagonist   Second Chance   Secretive Protagonist   Serial Killers   Sister Complex   Slow Romance   Smart Couple   Student Council   Thriller   Tragic Past   Twins   Twisted Personality   Yandere   ",
	"rating": "(4.1 / 5.0, 207 votes)",
	"author": "黑心蘋果   ",
	"year": "\nN/A",
	"ranking": "#6970   #2000   #1258   #2700   #1711   ",
	"reviewcount": "47 Reviews sorted by",
	"description": "She reincarnated, she died when she was twenty, the murderer pushed her to the road in the glare of public eye. However, within the people —\n\nHer respectful father said to the murderer: Don’t take it to your heart, this is not your fault.\n\nHer kindness-loving mother said to the murderer: Don’t worry, I still got you, you’re much better than my real daughter.\n\nHer lovely brother said to the murderer: Tsk, this kind of woman should have just die earlier, her existence embarrasses me.\n\nHer beloved man said to the murderer: You’re the only one I loved from the start.\n\nThe murderer was moved to tears, as if she was the only pure white lotus that remains in this world; nobody notices her vicious and scarcely smile.\n\nHence —\n\nWhen everything resets, she swears she will take everything back and make her pay twice the price, she desires to become the princess where everyone comforts her for murdering a person too. She’ll definitely make that person who stole everything from her to experience the deepest agony in her soul.\n\n//\n\nBefore he was in love with her, he calmly said: “I can sense the smell of crime on her.”\n\nAfter he was in love with her, his face was cold but his heart was warm: “I can sense the smell that turns me into a crime on her.”\n\nShe said: “Can I keep your corpse into my collection when you die?”\n\nHe said: “Are you going to r*pe me day and night?”\n\nShe said: “I just want to make you into a mummy.”\n\nHe said: “I didn’t know you were so hardcore, using this kind of method to make me stay by your side forever.”>"
}