{
	"url": "https://www.novelupdates.com/series/weapon-master/",
	"title": "Weapon Master - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/04/CmQUNljdHjqEClufAAAAAKTZPxo399796396.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Fantasy   Harem   Martial Arts   Xuanhuan   ",
	"tags": "Accelerated Growth   Alchemy   Arrogant Characters   Battle Competition   Beast Companions   Beautiful Female Lead   Blacksmith   Cheats   Clever Protagonist   Confident Protagonist   Cultivation   Depictions of Cruelty   Determined Protagonist   Fast Cultivation   Fast Learner   Hidden Abilities   Hiding True Abilities   Magic   Male Protagonist   Overpowered Protagonist   Polygamy   Power Struggle   Schemes And Conspiracies   Skill Assimilation   Strong Love Interests   Transmigration   Underestimated Protagonist   Wars   World Travel   ",
	"rating": "(3.3 / 5.0, 23 votes)",
	"author": "Du You   独悠   ",
	"year": "\n2015",
	"ranking": "#6970   #2000   #7534   #9322   #9099   ",
	"reviewcount": "5 Reviews sorted by",
	"description": "Hundreds of years ago, Human, Celestial Clan and Demon Clan lived together on the Origin Continent. However, a great war broke out between the three races. Shan He, the leader of Human, had discovered a catalogue of methods to forge Divine Weapons. With this catalogue, Shan He led Human to defeat the other two clans and expelled them from the Origin Continent.\n\nThe peace did not last long. After the passing of Shan He, the once Glory Empire collapsed. Various forces of Human fell into a long period of wild war for the Divine Weapon Catalogue, but the catalogue was lost during the war.\n\nThe Demon Clan took advantage of the internal strife of Human. Under the lead of their new lord, Fen Tian, the Demon army invaded the Origin Continent violently.\n\nHuman soon lost a large portion of their territory. At that moment, a mysterious hero suddenly appeared on the battlefield. With a legendary Divine Weapon in hand, he severely injured Fen Tian and forced him to retreat. The united Human army chased the Demon army across the strait and to the Two Realm Plain on the Tranquil Continent.\n\nOnce again, the various forces of Human started wildly searching for the Divine Weapon Catalogue...>"
}