{
	"url": "https://www.novelupdates.com/series/duke-ashilleans-contractual-marriage/",
	"title": "Duke Ashillean’s Contractual Marriage - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/08/Duke-Ashilleans-Contractual-Marriage.jpg",
	"noveltype": "(KR)",
	"genre": "Fantasy   Romance   ",
	"tags": "Adapted to Manhwa   Aristocracy   Beautiful Female Lead   Cold Protagonist   Complex Family Relationships   Contracts   Couple Growth   Death   Divorce   Enemies Become Allies   Enemies Become Lovers   Female Protagonist   Gods   Handsome Male Lead   Knights   Marriage   Marriage of Convenience   Nobles   Orphans   Popular Love Interests   Protagonist Strong from the Start   Reincarnation   Royalty   Strong Love Interests   Sword Wielder   Tomboyish Female Lead   Villainess Noble Girls   Younger Sisters   ",
	"rating": "(4.0 / 5.0, 24 votes)",
	"author": "이슈앤   ",
	"year": "\n2020",
	"ranking": "#4617   #4834   #7846   #9697   #5976   ",
	"reviewcount": "2 Reviews sorted by",
	"description": "The Duke of Ashillean’s Contractual Marriage / The Contractual Marriage of the Duke of Ashillean\r\n\r\nIn the era of the tyrants.\r\nShe passed on her family, title, and everything to her smart younger sister, because she was only planning to eat and have fun for the rest of her life.\r\nThis smart younger sibling of hers will defeat the tyrant and become the king. \r\n\r\n“Sister, help me.”\r\n\r\nWhat should she do? Of course she had to help her. \r\n\r\n* * * * * * * * * * *\r\n\r\nAfter she helped her younger sister defeat the tyrant, her younger sister became the king and she became a Duke. \r\n\r\nThere’s only one thing to do now – to help her younger sister keep her oath to God, and to be able to do that, she first had to get married. \r\n\r\n“I know what oath you made to God. Please marry me for three years, just three years. Then after that, I will divorce you right away.”\r\n\r\nThe illegitimate son of the tyrant, the prince, has proposed a contractual marriage.\r\n\r\n“I will never love you because you don’t want love. I will just be your perfect, impeccable husband.”\r\n\r\nWhat is he saying? \r\n\r\n>"
}