{
	"url": "https://www.novelupdates.com/series/way-of-the-devil/",
	"title": "Way of the Devil - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2017/07/wayofthedevil.jpg",
	"noveltype": "(CN)",
	"genre": "Mature   Seinen   Supernatural   Xianxia   Xuanhuan   ",
	"tags": "Ancient Times   Antihero Protagonist   Apathetic Protagonist   Appearance Changes   Artifacts   Bloodlines   Body Tempering   Cheats   Clever Protagonist   Confident Protagonist   Cultivation   Dark   Demonic Cultivation Technique   Demons   Depictions of Cruelty   Determined Protagonist   Evil Protagonist   Evolution   Fantasy World   Fast Cultivation   Game Elements   Ghosts   Hard-Working Protagonist   Hidden Abilities   Leadership   Love Interest Falls in Love First   Loyal Subordinates   Male Protagonist   Marriage   Multiple Realms   Nobles   Pregnancy   Proactive Protagonist   Prophecies   Romantic Subplot   Ruthless Protagonist   Schemes And Conspiracies   Sect Development   S*aves   Souls   System Administrator   Time Skip   Transmigration   Transported to Another World   Underestimated Protagonist   Wars   Weak to Strong   ",
	"rating": "(4.0 / 5.0, 386 votes)",
	"author": "Get Lost   滚开   ",
	"year": "\n2017",
	"ranking": "#2000   #2000   #750   #5685   #1695   ",
	"reviewcount": "64 Reviews sorted by",
	"description": "Demons, devils, ghosts and monsters\n\nPlunge the weak mortals in horrors;\n\nArms of gods and blades of devils,\n\nShroud the world in untold evils.\n\nLu Sheng was an ordinary civil servant in the modern world. After waking from a drunken stupor one day, he found himself trapped in a dangerous world where demons, ghosts and supernatural monsters terrorize the land.\n\nIn this world, ordinary mortals live in dark fear and helplessness, without any means to fight against the supernatural.\n\nAs Lu Sheng struggles desperately for survival, he stumbles upon a game mod he had designed for a mobile phone app in his previous life. It unexpectedly becomes his special ability, which enables him to instantly level up any skill he learns, albeit at a cost.\n\nThus, Lu Sheng begins his journey, striving for power beyond the reach of a mortal as he treads the way...of the Devil…>"
}