{
	"url": "https://www.novelupdates.com/series/bewitching-prince-spoils-his-wife-genius-doctor-unscrupulous-consort/",
	"title": "Bewitching Prince Spoils His Wife: Genius Doctor Unscrupulous Consort - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2016/09/50777.png",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Comedy   Drama   Historical   Mystery   Romance   Xuanhuan   ",
	"tags": "Academy   Alchemy   Ancient China   Arranged Marriage   Arrogant Characters   Beast Companions   Beautiful Female Lead   Black Belly   Clever Protagonist   Cultivation   Devoted Love Interests   Doctors   Female Protagonist   Genius Protagonist   Handsome Male Lead   Hard-Working Protagonist   Love Interest Falls in Love First   Magic Formations   Magical Space   Medical Knowledge   Multiple Reincarnated Individuals   Mythical Beasts   Pets   Power Couple   Reincarnation   Ruthless Protagonist   Slow Romance   Strong Love Interests   Transmigration   Underestimated Protagonist   Weak to Strong   ",
	"rating": "(4.3 / 5.0, 527 votes)",
	"author": "Gu Ran Jin   顾染锦   ",
	"year": "\n2015",
	"ranking": "#1389   #1130   #129   #1346   #347   ",
	"reviewcount": "66 Reviews sorted by",
	"description": "She was the head of a powerful, medicine-orientated aristocratic family.\n\n    Crossing through a millennium, she ended up in the body of the General Household’s “tr*sh” young miss, whose engagement with the Crown Prince was just broken as she suffered under everybody’s taunts!\n\n    In the drafting feast, she was re-engaged by the Emperor to marry the famous disabled prince!\n\n    Everybody laughed, a blind tr*sh with a disabled wastrel. What a perfect match!\n\n    However, they didn’t know that in her hand, she grasped the long-lost primordial pill recipes! Her practice in medicine had reached the apex! Her contracted beasts were unique in the world!\n\n    What was the most frightening, was the disabled prince she was engaged to…….\n\n    A black-belly full of dirty tricks, with a heaven-opposing cultivation physique, he defeats all geniuses!\n\n    In his wheelchair during the day, yet entangling her in bed as he trained his waist muscles… MF! Is he really crippled!?>"
}