{
	"url": "https://www.novelupdates.com/series/sacred-chevalier/",
	"title": "Sacred Chevalier - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2018/12/l5a5g6z1m5pz3u46kkglg8xvkvfr_7hx_j2_rs_ead1.jpg",
	"noveltype": "(JP)",
	"genre": "Adult   Fantasy   Harem   Romance   ",
	"tags": "An*l   Academy   Adapted to Manga   Cheats   Death of Loved Ones   First-time Interc**rse   F*llatio   Male Protagonist   Multiple POV   Netori   Perverted Protagonist   Polygamy   R-18   ",
	"rating": "(4.0 / 5.0, 76 votes)",
	"author": "Touma Shinozaki   篠崎冬馬   ",
	"year": "\n2018",
	"ranking": "#5262   #2000   #6618   #3908   #4489   ",
	"reviewcount": "2 Reviews sorted by",
	"description": "The world of Goddess Ueros. Men can only get sexually aroused once or twice per month. But both men and women receive the Goddess’s blessing through sexual intercourse. Women would receive strength and beauty while Men would receive fortunes from the Goddess. Obviously, the level of blessing differed for each individual. A woman that were given stronger blessing were called a “Paladin”. And a man that were more sexually aroused were called “Chevalier” and were paired with a Paladin where they were sent to the battlefield.\r\n\r\n1. Women can only receive a Goddess’s blessing from the man they gave their virginity to. And that blessing does not last for eternity. In order to continue to receiving a blessing they must continue to have sex.\r\n\r\n2. No matter how strong the “Chevalier” is they could only get sexually aroused once a week normally. At the best once every three days. For that reason, a Chevalier would have sex with Paladin by even going far to take a “medicine” since they must receive a Goddess’s blessing.\r\n\r\nIn the world where the strong Paladins to changes the outcome of war the existence of Chevalier were necessary. But if a Chevalier were to continue to take medicines then he would die early. As a result, the duration for the Paladin to remain as a Paladin were short. In this world where such things were accepted as a normal outcome an irregular existence appeared.\r\n\r\nThis is a sweet, sad, and lewd story of man who would later be called the “Sacred Chevalier”.>"
}