{
	"url": "https://www.novelupdates.com/series/today-villain-husband-is-still-lying-about-amnesia/",
	"title": "Today Villain Husband is Still Lying About Amnesia - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/05/LyingAboutAmnesia2.jpg",
	"noveltype": "(CN)",
	"genre": "Fantasy   Romance   ",
	"tags": "Ancient Times   Beautiful Female Lead   Dense Protagonist   Female Protagonist   Handsome Male Lead   Love Interest Falls in Love First   Misunderstandings   Proactive Protagonist   Royalty   Transmigration   ",
	"rating": "(3.1 / 5.0, 16 votes)",
	"author": "You Xiao Mian   又小眠   ",
	"year": "\n2020",
	"ranking": "#2000   #2000   #9076   #9322   #8613   ",
	"reviewcount": "4 Reviews sorted by",
	"description": "Once Jiang Yu Ning transmigrated into a spy in a book and married the biggest villain Che Wang, Jing Zhan but died tragically on her wedding night.\r\n\r\nWhat a good death! She transmigrated over on the wedding night!\r\n\r\nWhat a coincidence, Jing Zhan actually said he lost his memory?\r\n\r\nThis aloof, aristocratic, cold, ascetic, non-woman lover villain who only has revenge in mind took her hand? !!\r\n\r\nJiang Yu Ning felt strange, constantly worried about her little life.\r\n\r\nAfter she confirmed that he had amnesia herself, she finally smiled, dropped off her guard, and turned around to sing.\r\n\r\n'Ah Zhan, you like me first.'\r\n\r\n'Oh?'\r\n\r\n'But I rejected you at the beginning.'\r\n\r\n'Why?'\r\n\r\n'Because your horse was too fierce, I was afraid of falling. But you love me to death, saying that you will be at my bidding for a lifetime.'\r\n\r\nJing Zhan sneered in his heart, while his face didn't fluctuate: 'En.'\r\n\r\n*\r\n\r\nLater, Jing Zhan pretended to lose his memory was exposed.\r\n\r\nJiang Yu Ning was so embarrassed that she wanted to separate from him. Jing Zhan, who had always been able to deal with anything with ease, panicked and hugged her tightly.\r\n\r\n'Wake up! What I said are fake! I've been lying to you, making a pass♪ at you!'\r\n\r\nJing Zhan buried in her neck, and said lowly: 'No, those became true later.'>"
}