{
	"url": "https://www.novelupdates.com/series/i-am-the-heiress-of-the-villain-family/",
	"title": "I Am the Heiress of the Villain Family - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/10/I-Am-the-Heiress-of-the-Villain-Family.jpg",
	"noveltype": "(KR)",
	"genre": "Drama   Fantasy   Romance   ",
	"tags": "Aristocracy   Character Growth   Child Protagonist   European Ambience   Fantasy World   Female Protagonist   Hiding True Identity   Money Grubber   Nobles   Orphans   Poor to Rich   Reincarnated in Another World   Reincarnation   ",
	"rating": "(4.0 / 5.0, 21 votes)",
	"author": "Dalseul   달슬   ",
	"year": "\n2021",
	"ranking": "#2000   #3155   #9029   #11529   #6622   ",
	"reviewcount": "1 Review sorted by",
	"description": "It's been 10 years since I was reincarnated as an extra in a novel.\r\nI was only in charge of nursing the Landlord Grandfather until his death, but from the villainous family which was said to be crowded with killers, a person was sent over.\r\n\r\n“The late Duke of Blasco has passed over all the inheritance.”\r\n“Excuse me, how about the other heir, other than me…?”\r\n“There is none. Since the gist of the will has decided that Miss Catyshia is the only heiress.”\r\n\r\nHowever, it was impossible for ‘that’ Duke Blasco Family to welcome an unknown young child who didn’t even have their bloodline to take the inheritance.\r\nDo you think I’ll follow you to that place because I’m crazy?\r\n\r\n“I refuse—”\r\n“Excluding the inheritance tax, there is cash and a personal vault at the central bank.”\r\n“Gasp…!”\r\n“As well as the net profit that comes from the Artem, Liden, and Gelpor territories.”\r\n\r\nJust what are you seeing people as?\r\nDo I look like a person who will sell their life for money?\r\n\r\n“You can take ownership of the information guild that the late Duke ran during his lifetime, the art and ancient relic collections that he had, and everything else in Blasco’s name.”\r\n“I will go!”\r\n\r\nSnob No.1 who risked her life for money was right here.\r\n\r\nI am 10 years old. When I came to my senses, I became a millionaire. Since it has become like this, let’s watch my money until the end!>"
}