{
	"url": "https://www.novelupdates.com/series/the-undead-king-of-the-palace-of-darkness/",
	"title": "The Undead King of the Palace of Darkness (WN) - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/04/昏き宮殿の死者の王.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Fantasy   Romance   Shounen   ",
	"tags": "Adapted to Manga   Animal Characteristics   Beautiful Female Lead   Blood Manipulation   Character Growth   Clever Protagonist   Cruel Characters   Cunning Protagonist   Dead Protagonist   Demon Lord   Dense Protagonist   Depictions of Cruelty   Determined Protagonist   Evolution   Eye Powers   Fantasy World   Hiding True Abilities   Human-Nonhuman Relationship   Humanoid Protagonist   Knights   Loyal Subordinates   Male Protagonist   Necromancer   Quiet Characters   R-15   Selfish Protagonist   Slow Romance   Strong Love Interests   Time Skip   Transformation Ability   Vampires   Wars   Weak to Strong   Werebeasts   ",
	"rating": "(4.4 / 5.0, 167 votes)",
	"author": "Tsukikage   槻影   ",
	"year": "\n2019",
	"ranking": "#845   #563   #1241   #949   #1930   ",
	"reviewcount": "24 Reviews sorted by",
	"description": "I don’t want to die. I want to be free. To that end, I shall….reconcile myself to the fate of becoming a “monster”.\n\nA strange disease that racks one’s entire body with intense never-ending pain, until the person slowly withers away and eventually dies. After a few years of braving through the pain, the boy is in no luxury to even feel despair. With nary a soul to tend to him, he breathes his last.\n\nThe next time he opened his eyes, the boy had become an “Undead” of the lowest rank through the power of an evil Necromancer.\n\nThe boy rejoices at having his earnest desire fulfilled, which is a body that will never feel pain. However, he realizes that he is still under someone’s control and how it was no different from when he was cooped up in the hospital ward.\n\nBut the world would not leave alone the boy who only wished for peace.\n\nThe Necromancer who revives the boy from the dead, names him “End” and attempts to gain control over him.\n\nThe Undead Knights, lay their lives on the line to persistently chase after and annihilate the beings of the darkness.\n\nWith countless monsters under their command, the Demon Lords rule over their own lands while they all contend for ultimate supremacy.\n\nThe motivation being survival and freedom. The requirements being caution and power.\n\nThis is the tale of the cowardly King of the Undead. In his pursuit for freedom, he heads into battle and turns tail at times. He knows when to fear his opponents and when to waver in his decisions.>"
}