{
	"url": "https://www.novelupdates.com/series/first-of-all-lets-hide-my-younger-brother/",
	"title": "First of All, Let’s Hide My Younger Brother - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/06/ScreenShot2019-06-17at8.34.59PM-boring.jpg",
	"noveltype": "(KR)",
	"genre": "Drama   Fantasy   Mature   Psychological   Romance   ",
	"tags": "Academy   Adapted to Manhwa   Androgynous Characters   Aristocracy   Beautiful Female Lead   Broken Engagement   Cross-dressing   Determined Protagonist   European Ambience   Female Protagonist   Handsome Male Lead   Kidnappings   Knights   Love Interest Falls in Love First   Male Yandere   Nobles   Obsessive Love   Persistent Love Interests   Possessive Characters   Royalty   Schemes And Conspiracies   S*xual Abuse   Siblings   Strong Love Interests   Sword And Magic   Sword Wielder   Time Skip   Tragic Past   Transmigration   Twisted Personality   Wizards   Younger Love Interests   ",
	"rating": "(3.8 / 5.0, 149 votes)",
	"author": "Chae Ji-Hu   채지후   ",
	"year": "\n2019",
	"ranking": "#5262   #6200   #2983   #7040   #1612   ",
	"reviewcount": "13 Reviews sorted by",
	"description": "I got into manhwa 19+ of the BL genre. And so it turned out that I became the only sister of the protagonist …\n\nThis story has a very tragic ending, in which a madman destroys the family of the protagonist and kidnaps him, imprisoning him.\n\nUnfortunately, the first victim to be killed is me!!! A character who goes to save her kidnapped brother and dies a terrible death.\n\nNow, I need to think about this carefully. How can I, my brother and my family be safe? First, get my brother out of the public eye.\n\nTherefore, I carefully hid my younger brother and decided to go out in public.\n\nBut that’s not all.\n\n“Haven’t seen you for a long time, Kayla.”\n\n“!..”\n\n“Now, should I take a fee for what you did to my eye?”\n\nNow the madman’s target was me, not my little brother. All my 5 years of hard work have gone in vain.>"
}