{
	"url": "https://www.novelupdates.com/series/i-treated-the-mastermind-and-ran-away/",
	"title": "I Treated The Mastermind And Ran Away - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/08/I-Treated-The-Mastermind-And-Ran-Away.jpg",
	"noveltype": "(KR)",
	"genre": "Drama   Fantasy   Romance   ",
	"tags": "Abandoned Children   Aristocracy   Beautiful Female Lead   Child Abuse   Curses   Depictions of Cruelty   European Ambience   Female Protagonist   Handsome Male Lead   Hidden Abilities   Misunderstandings   Mob Protagonist   Nobles   Power Struggle   Priests   Reincarnated in Another World   Reincarnation   Siblings Not Related by Blood   ",
	"rating": "(3.5 / 5.0, 39 votes)",
	"author": "이이리   ",
	"year": "\n2021",
	"ranking": "#4617   #4154   #4275   #3822   #3928   ",
	"reviewcount": "6 Reviews sorted by",
	"description": "I was reborn as an extra who was only used for her enormous power and then abandoned.\n\nAdopted by the Count’s family and subjected to all kinds of abuse and humiliation, she endured without using her power. All to be kidnapped by the male protagonist of the novel, the cursed mastermind Grand Duke.\n\n*\n\n“I heard a prophecy that said you can lift my curse.”\n\n“On one condition. I need money to buy my way out of this empire. And it would be even better if I had a suitable position.”\n\nI pretended to be Cordelia, the heroine and female lead of the prophecy, and scammed him. All I wanted was freedom, not romance. Our agreement went smoothly.\n\n……. Until it was discovered that I was not the female lead.\n\n“Here you are. How dare you deceive me and run away?”\n\nHis dark red eyes, hidden behind the black eyepatch, stared at me. He slowly caressed my face with his bloodied hand and said in a chilling voice, “When you lied to me, you were determined to do so, right? The weight of responsibility will not be light.”\n\n–Even though I tried to twist the original story, I ended up dying like this. I squeezed my eyes shut. Gently pressing my lips with his thumb, he said languidly, “Marry me.”\n\nThere was something wrong with the mastermind.>"
}