{
	"url": "https://www.novelupdates.com/series/dense-fog/",
	"title": "Dense Fog - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/01/Dense-Fog.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Drama   Fantasy   Romance   School Life   Shounen Ai   Slice of Life   Supernatural   Yaoi   ",
	"tags": "Absent Parents   Adapted to Drama CD   Animal Characteristics   Character Growth   College/University   Family Conflict   Friendship   Love Interest Falls in Love First   Modern Day   Non-humanoid Protagonist   Shapeshifters   Slow Romance   Tragic Past   ",
	"rating": "(4.6 / 5.0, 36 votes)",
	"author": "Yan Liang Yu   颜凉雨   ",
	"year": "\n2020",
	"ranking": "#6970   #2000   #8075   #9890   #6034   ",
	"reviewcount": "2 Reviews sorted by",
	"description": "A spell of dense fog awakens the animal inside.\n\nUnder a heavy fog seen only once every century, the whole university had stopped classes and was under lockdown. Yet, there would still be disobedient classmates.\n\nFor example, Lin Wu who climbed over the school fence.\n\nFor example, Wang Ye who was receiving a confession from the prettiest girl on campus.\n\nAs a result, Lin Wu, straddling the top of the fence, heard the most awe-inspiring reason for rejection in all of history—\n\nThe school flower: “I like you.”\n\nWang Ye: “Sorry.”\n\nSchool flower: “Why?”\n\nWang Ye: “It isn’t your fault. It’s mine”.\n\nSchool flower: “You can’t possibly be using that overdone excuse, like ‘I don’t like women’?”\n\nWang Ye: “I don’t like humans.”\n\nThree days later, the fog cleared up. Lin Wu discovered that he suddenly had overwhelming urges to run around. Moreover, every nightfall, he wanted to sing loudly towards the moon.\n\nStudents and teachers alike all experienced different changes in their bodies. This strange phenomenon of “wild awakenings” accompanied a chain of foggy spells across various regions and began to spread to the rest of the world.\n\nLin Wu: “Thanks to the power of your lucky words, all the humans in the world now aren’t quite human anymore.”\n\nWang Ye: …>"
}