{
	"url": "https://www.novelupdates.com/series/feigned-pity/",
	"title": "Feigned Pity - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/01/Feigned-Pity.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Romance   School Life   Slice of Life   ",
	"tags": "Female Protagonist   Modern Day   ",
	"rating": "(3.4 / 5.0, 13 votes)",
	"author": "叶韶华   ",
	"year": "\n2020",
	"ranking": "#818   #2000   #8580   #4879   #9995   ",
	"reviewcount": "2 Reviews sorted by",
	"description": "An ‘unwanted child’ appeared at Gu’s household; well-behaved, good-looking, and she looked weak and easy to bully.\n\nOn the first day of her arrival, the notorious Young Master Gu knocked over the bowl she brought to him, leaving a faint red blemish on her hand.\n\nShe whimpered with tears in her eyes looking very pitiful as Gu Jing Yuan pretended to be tough and aloof.\n\nGu Jing Yuan skipped classes, missed examinations, and engaged in fights… He became the first person to repeat a grade in Fu Middle School. He was without scruples and no one could control him; except for Tao Yi Xi.\n\nHer red blemished slender hand delivered a set of test papers, “Ge-ge, your homework.”\n\n“Get lost.”\n\n“If you don’t accept it, the teacher will scold me,” she cried. Her tears were like raindrops on a pear blossom, so pitiful.\n\n“…” Fuck. His heart inexplicably softened.\n\nLater on, as long as Tao Yi Xi cried, he could not help but compromise.\n\nThe impression of a weak baby chick was deeply engraved into his heart. Until one day, she took on five strong men alone. Covered in bruises and bleeding but she did not shed a single tear. She looked incredibly ferocious.\n\nGu Jing Yuan, “…” Did he get cheated?!\n\nThe first time they met:\n\nShe tenderly called, “Ge-ge.” \n\nBut he sneered, “I don’t have a sister.”\n\nWho would have expected that later on, he would trap her in his arms, bite her ear, and mutter, “call me Ge-ge.”\n\nTao Yi Xi: Did she act so well that everything went out of her control?…\n\nWhen Tao Yi Xi just arrived, he chided in disgust: “Don’t touch me!”\n\nAfter that, when Tao Yi Xi wanted to leave, he hugged her tightly and begged her in a low voice, “please don’t go.”\n\nWhen they met again, he had already matured into a business big shot, donned in a western suit. When he saw her, his gaze just lightly swept over her, like the past events never happened.\n\nIf he did not want to acknowledge her, then so be it! \n\nYet, in the middle of the night, smelling of alcohol, he pressed her against the wall, with red-rimmed eyes.\n\n“I like you so much, why must you leave?”>"
}