{
	"url": "https://www.novelupdates.com/series/reincarnating-in-a-depressing-game-ive-been-reincarnated-in-a-galge-that-ive-known-all-too-well-so-im-going-to-destroy-all-the-depressing-flag-and-live-freely/",
	"title": "Reincarnating in a Depressing Game! I’ve Been Reincarnated in a Galge That I’ve Known All Too Well, so I’m Going To Destroy All the Depressing Flag and Live Freely! - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/04/Reincarnating-in-a-Depressing-Game-Ive-Been-Reincarnated-in-a-Galge-That-Ive-Known-All-Too-Well-so-Im-Going-To-Destroy-All-the.jpg",
	"noveltype": "(JP)",
	"genre": "Comedy   Drama   Fantasy   Harem   Psychological   Romance   Slice of Life   Supernatural   ",
	"tags": "Age Progression   Beautiful Female Lead   Calm Protagonist   Cautious Protagonist   Charismatic Protagonist   Charming Protagonist   Cheats   Childhood Friends   Clumsy Love Interests   Curses   Cute Protagonist   Early Romance   Galge   Game Elements   Handsome Male Lead   Hard-Working Protagonist   Jealousy   Kind Love Interests   Love Interest Falls in Love First   Love Rivals   Love Triangles   Magic   Male Protagonist   Master-Servant Relationship   Obsessive Love   R-15   Reincarnated in a Game World   Reincarnation   Spatial Manipulation   Strong Love Interests   Time Manipulation   Tsundere   Yandere   ",
	"rating": "(3.5 / 5.0, 54 votes)",
	"author": "穂積潜   ",
	"year": "\n2020",
	"ranking": "#367   #1713   #3006   #856   #5626   ",
	"reviewcount": "5 Reviews sorted by",
	"description": "A middle-aged man who once spent his youth on gal games found himself waking up in the world of his old favorite galge, “Under the Clear Blue Sky” popularly known as “Kumosora” as the protagonist Naruse Yuuki.\n\nKumosora is a typical visual novel drama game that he used to play and is completely familiar on how to capture the game’s heroine’s route. Now he’s ready to embark on capturing the heroine – NOT!\n\nWhy?! Because the way to get the happy ending is too difficult!\n\nThat’s right. Kumosora is a typical Japanese Romance-horror style galge set in the countryside with lots of depressing elements! And the game developer is a nasty guy known for his R18 humiliation game! No matter what route the protagonist takes he must endure a gruesome, painful and excruciating ordeal!\n\n“I will never capture any heroine! I’m going to smash all these depressive flags before they even appear!”\n\nUsing his knowledge as a former broker and the knowledge about the future. The middle-aged man builds up his financial strength to gain power.\n\n“A depressing event at the head shrine, buy it and block it! Yakuza trying something to do lascivious to the heroine? Hire a mercenary and crush them!”\n\nThis is the story of a man who reincarnated in a depressing game and refuses to capture any heroines. And using his financial power, he forcibly destroys any depressing flags.\n\nBut the saved heroine won’t stay silent…\n\n“Puhihi. Yu-kun. good morning”\n\n“Oi! Heroine – san, stay away! I don’t want to go down on your [3000 years of Loneliness] route!”>"
}