{
	"url": "https://www.novelupdates.com/series/gorgeously-enchanting-elementalist-insidious-evil-emperors-airheaded-concubine/",
	"title": "Gorgeously Enchanting Elementalist: Insidious Evil Emperor’s Airheaded Concubine - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2018/08/20939s.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Comedy   Drama   Fantasy   Martial Arts   Romance   Xuanhuan   ",
	"tags": "Beast Companions   Black Belly   Doctors   Female Protagonist   Magic   Poisons   Reincarnation   Ugly to Beautiful   Weak to Strong   ",
	"rating": "(3.7 / 5.0, 20 votes)",
	"author": "夜夕月   ",
	"year": "\nN/A",
	"ranking": "#2000   #2000   #8211   #8229   #7190   ",
	"reviewcount": "3 Reviews sorted by",
	"description": "She was one of the best assassins of the modern world; a sly, black belly, cutely stupid woman. She passed through into a mysterious world and into the body of a trash young girl that everyone brutally reviled. Idiot and ugly, they don't know that she was a Seven Element Elementalist with a Dual Cultivation Body. Various Spirit Beasts and Devil Beasts would rush to make a contract with her. See how she plays the world at the ends of her fingertips and exact revenge on the people who made her life a living hell.\r\n\r\nJust who is this bewitching villain?\r\n\r\nHey! I’m going to talk to you about something! I am not just a bewitching villain, I am your soon to be husband!\r\n\r\nThe woman roared: Who wants you to be my husband?\r\n\r\nBewitching Villain: Well, if you don’t want me to become your future husband, then why don’t you become my future wife instead?”\r\n\r\nThis world is nothing without you. How could you leave me alone? Even if you reincarnate a millennium later, I will still be here waiting for you.\r\n\r\nHe was a tyrannical emperor born between the heavens and earth thousands of years ago. He did not hesitate to defy the world, to turn the world upside down, to expend his Spiritual Force only for her to reincarnate.\r\n\r\nHe was the Demon Emperor born between the heavens and earth, Just so she can reincarnate, he fell into a deep, profound slumber, “Little Zi’er, as long as you live, even if it costs my life, I will do it for you. Just to know that you live, would make my wounded heart......whole.”>"
}