{
	"url": "https://www.novelupdates.com/series/transmigrator-meets-reincarnator/",
	"title": "Transmigrator Meets Reincarnator - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2017/09/cover04.jpg",
	"noveltype": "(CN)",
	"genre": "Drama   Historical   Josei   Romance   Slice of Life   ",
	"tags": "Abusive Characters   Ancient China   Arranged Marriage   Beautiful Female Lead   Bickering Couple   Business Management   Calm Protagonist   Carefree Protagonist   Charming Protagonist   Clever Protagonist   Cold Love Interests   Confident Protagonist   Cooking   Couple Growth   Female Protagonist   Handsome Male Lead   Jealousy   Love Interest Falls in Love First   Male Yandere   Misunderstandings   Multiple Reincarnated Individuals   Pragmatic Protagonist   Pregnancy   Previous Life Talent   Reincarnation   Royalty   R*pe   Second Chance   S*xual Abuse   Slow Romance   Strong Love Interests   Transmigration   Tsundere   ",
	"rating": "(4.2 / 5.0, 1235 votes)",
	"author": "Snow Mountain Mists   Xue Shan Lan   雪山岚   ",
	"year": "\n2016",
	"ranking": "#946   #4143   #39   #189   #75   ",
	"reviewcount": "250 Reviews sorted by",
	"description": "All Chu Lian had done was to read a book where the female lead had cheated on her wonderful husband. While wondering why, before she knew it, she was waking up in the body of that very same female lead!\n\nWait, did that mean the handsome husband from the book was hers now? Chu Lian decided to welcome him with open arms!\n\nHowever, what she got wasn’t the kind husband she had been expecting. Instead, his personality seemed to have been completely flipped! He left her all alone on their wedding night… and just five days into their marriage, her dear husband abandoned his loving wife and left to enlist in the army!\n\nFine! Be that way! She could pass her days perfectly well somehow, even if she had to do it alone!\n\nChu Lian put her household in order, charmed the rest of her new family, and did a little business on the side. She even opened up some new trade routes! Her days passed peacefully and leisurely… Until her dear husband got into trouble at the frontline of the war.\n\nHmph, isn’t he crawling back to me for help in the end? Forget it, I’ll go save him myself!>"
}