{
	"url": "https://www.novelupdates.com/series/the-return-of-cambrian-period/",
	"title": "The Return of Cambrian Period - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/12/The-Return-of-Cambrian-Period.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Mature   Romance   Sci-fi   Supernatural   Yaoi   ",
	"tags": "Accelerated Growth   Apocalypse   Caring Protagonist   Clever Protagonist   Curious Protagonist   Evolution   First Love   Gunfighters   Handsome Male Lead   Hard-Working Protagonist   Mature Protagonist   Military   Modern Day   Mutated Creatures   Mutations   Near-Death Experience   Post-apocalyptic   Proactive Protagonist   Saving the World   Scientists   Soldiers   Special Abilities   Strategic Battles   Strength-based Social Hierarchy   Strong Love Interests   Survival   Teamwork   Tsundere   Weak to Strong   Younger Love Interests   ",
	"rating": "(4.3 / 5.0, 58 votes)",
	"author": "Shui Qian Cheng   水千丞   ",
	"year": "\n2014",
	"ranking": "#2000   #2000   #5814   #6711   #4665   ",
	"reviewcount": "11 Reviews sorted by",
	"description": "In the history of geology, more than 500 million years ago, there was a period of the Paleozoic Era known as the Cambrian Period. This period, being the first period of the Paleozoic Era, does not only have a significant meaning for geological research, but also is the most insane, splendid and mysterious period in paleontological history.\n\nBefore the Cambrian Period, the Earth’s species were relatively monotonous. When the Cambrian Period started, just after millions of years, which is a relatively short period of time in terms of geology, all kind of species on Earth suddenly evolved wildly. Countless of invertebrates, arthropods, mollusks, brachiopods, annelids etc. have appeared on the planet without any warning, greatly enriching the diversity of the Earth’s species. This million years period is known as the “Cambrian Explosion”. And after billions of evolutionary years, the Earth today blooms with diverse lives.\n\nThe cause of the Cambrian Explosion is a huge mystery and also the biggest paradox of Darwin’s theory of evolution.\n\nWhat if… the Cambrian Period is coming back in this era when human civilization has already conquered the entire planet, and the global species will once again evolve wildly, what kind of challenge will this planet encounter? What kind of fate will humans, who are falling from the top of the food chain, face?>"
}