{
	"url": "https://www.novelupdates.com/series/i-hated-it-even-more/",
	"title": "I Hated It Even More - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/02/I-Hated-It-Even-More.jpeg",
	"noveltype": "(KR)",
	"genre": "Drama   Fantasy   Josei   Romance   Shoujo   ",
	"tags": "Abandoned Children   Absent Parents   Aristocracy   Beautiful Female Lead   Clever Protagonist   Empires   Female Protagonist   Nobles   Protagonist Strong from the Start   Royalty   Villainess Noble Girls   ",
	"rating": "(4.0 / 5.0, 22 votes)",
	"author": "Mokapanna   모카판나   ",
	"year": "\n2021",
	"ranking": "#2000   #2000   #10966   #10658   #7117   ",
	"reviewcount": "No Reviews",
	"description": "In my seventeenth summer, three months before I went into isolation, the first daughter of Marquis Leonard, my “sister” returned, having disappeared shortly after birth.\n\nEveryone in the mansion loved her, and only her. \n\nIt didn’t matter.\n\nBecause from the very beginning, I’d known that my parents were utter tr*sh.\n\nI would’ve helped and organized all the documents for land management, but I saw no point in bothering the family that would soon fall. \n\nA family that would fall, should I, the one who actually did all the work instead of the Marquis, disappear.\n\nSo, all I need to do is to isolate myself and get away from this place…\n\n--It was extremely cold! It must've been a long time ago.\nA self-proclaimed junior spirit I encounter ever so often, tells surprising stories.\n\n“Then who will protect you?”\nMy 'sister', no, that woman, tried to 'protect me' under the guise of being a real sister. \n\n“What do you think, young Lady? If it's this much of a loan, wouldn't it be useful? Go ahead and run before someone snatches it away.” \nThe wily duke, who'd signed a mutual deal with me, would be entitled to a loss.\n\nAnd…\n\n“I’ve prayed to God, whom I’ve never prayed to before.” \nWhen I saw my sweet childhood friend, who said just that, it seemed that in the end, we would no longer be just friends.>"
}