{
	"url": "https://www.novelupdates.com/series/my-classmate-is-200-million-years-old/",
	"title": "My Classmate is 200 Million Years Old - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2018/08/e796afe4b8a2e5ad90.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Comedy   Drama   Martial Arts   School Life   Sci-fi   ",
	"tags": "Adapted to Drama   Aliens   Appearance Changes   Cold Protagonist   Female Protagonist   Lack of Common Sense   Military   Modern Day   Overpowered Protagonist   Protagonist Strong from the Start   Reincarnation   Sister Complex   Stoic Characters   ",
	"rating": "(3.9 / 5.0, 125 votes)",
	"author": "疯丢子   ",
	"year": "\n2010",
	"ranking": "#6970   #6283   #2419   #6187   #3564   ",
	"reviewcount": "12 Reviews sorted by",
	"description": "The suicide of a high school girl following the rejection of her crush whom she confessed to roused the soul of a Scorpio Planet Marshal from her 200 million years of slumber — she reincarnated into the body of Xuan Mo. And so, she decided to live on Earth on behalf of the girl! However, it was quite the miserable situation for an alien to own two different sets of memories. She had to use her peculiar mental power to peep into the previous owner’s memories regarding everyday, mundane matters while trying to rein in her cutting aura pretending to be a normal human…\n\nBut her shocking performance during military training definitely must have floored everyone. Okay fine, her incredible finesse aside, what’s with the consecutive bullseye for every single round during their shooting competition? Was this something a normal female student is able to achieve? Shouldn’t you explain yourself a little damnit! And what’s with the multiple grade jumps, and being contended for by the various prestigious universities? What kinda havoc you try’na wreck with your low-key flaunting? I mean it’s a good thing she’s caught the eye of a special organisation and was entrusted with important tasks, but what’s with all aloof rule-breaking gameplay? She’s practically the walking definition of “hated by even the gods”.\n\nWhat’s even stranger was that Xuan Mo’s only ever interested in warring matters and battling; she’ll only ever pay her ferociously blooming blossom luck as much heed as she minds the passing cloud with the mindset of crossing the bridge when she reaches it (wipes sweat) and can you be less insensitive when handling the various Earthlings’ endless crushing and eye-candying you?!\n\nThis all screeches to a halt however when she discovers the existence of someone else from her home-planet, so she’ll be needing a raincheck with the getting a “spouse” part of mortal life on the Blue Planet. Of course, we’re discussing this on the premise that she wanted to return home…>"
}