{
	"url": "https://www.novelupdates.com/series/xian-xian/",
	"title": "Xian Xian - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/09/Xian-Xian.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Drama   Romance   Xianxia   ",
	"tags": "Abandoned Children   Ancient China   Beautiful Female Lead   Bickering Couple   Calm Protagonist   Cold Love Interests   Cold Protagonist   Demons   Fated Lovers   Female Protagonist   God Protagonist   Handsome Male Lead   Hiding True Identity   Immortals   Love at First Sight   Misunderstandings   Multiple Reincarnated Individuals   Mystery Solving   Older Love Interests   Past Plays a Big Role   Past Trauma   Power Couple   Power Struggle   Proactive Protagonist   Protagonist Falls in Love First   Protagonist Strong from the Start   Royalty   Second Chance   Secret Identity   Slow Romance   Strong Love Interests   ",
	"rating": "(4.1 / 5.0, 39 votes)",
	"author": "September Flowing Fire   九月流火   ",
	"year": "\n2021",
	"ranking": "#2000   #2000   #7311   #11529   #8392   ",
	"reviewcount": "10 Reviews sorted by",
	"description": "Li Chao Ge had killed many people in her previous life.\n\nWhen a family looked down on her, she obliterated the family. When the man she liked slept with her imperial sister, she killed the imperial sister. When her mother wanted to pass the throne to her younger brother, she killed her mother.\n\nAs Li Chao Ge wished, she became the female empress of the dynasty. She was sorry for many people, but never for Pei Ji An. But in the end, she was killed by Pei Ji’an.\n\nLi Chao Ge didn’t understand, she was good to Pei Ji An, then why did Pei Ji An kill her?\n\nJust because she had separated him and the imperial sister?\n\nAfter rebirth, Li Chao Ge aggressively went to Pei Ji An’s engagement banquet to question him but suddenly saw Pei Ji An’s cousin.\n\nThe person was cold and elegant, like an immortal, very much in line with Li Chao Ge’s aesthetics. Li Chao Ge got tempted and decided to change her mind and rob the person first.\n\nQin Ke was one of four Lord of Heaven, he was the in-charge of justice. He was cold, ruthless, and unloving.\n\nIt was a sin for the immortal to move the mortal heart. Under his hand, countless immortals were deprived of their immortal bones and entered the cycle of reincarnation.\n\nBecause of some reasons, the catastrophe of Ji An failed, and Qin Ke went down to assist him to overcome the tribulation, and he became the cousin of Ji An, Gu Ming Ke.\n\nBut in the mortal world, the cold Lord of Heaven was robbed by a cruel woman.\n\nQin Ke thought this was just a catastrophe, and she was just an illusion. But in the end, he unknowingly sank into the illusion, unable to extricate himself.>"
}