{
	"url": "https://www.novelupdates.com/series/im-villainess-but-im-the-richest/",
	"title": "I’m Villainess but I’m The Richest - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/09/20200906_161847-1.jpg",
	"noveltype": "(KR)",
	"genre": "Comedy   Fantasy   Romance   Shoujo   ",
	"tags": "Adapted to Manhwa   Aristocracy   Arrogant Characters   Beastkin   Beautiful Female Lead   Dragons   European Ambience   Female Protagonist   Handsome Male Lead   Nobles   Villainess Noble Girls   Wealthy Characters   Werebeasts   ",
	"rating": "(4.1 / 5.0, 43 votes)",
	"author": "도레다   ",
	"year": "\n2019",
	"ranking": "#2000   #2000   #7129   #8982   #3505   ",
	"reviewcount": "3 Reviews sorted by",
	"description": "In a romance fantasy novel, I am just an extra that only causes problems for other people.\n\nObviously, my reputations is lacking, but I have the most money!\n\n“I’m going to live my life by being a ‘failure’ moderately, but spending my money invisibly!\n\nI also want to have a cat and a dog that I’ve been dreaming of, spending my money like water, and maintaining a proper unfavorable reputation. YOLO, my flower path of life!. By the way, I realized that there’s something strange. Even if I try hard to get my reputation ruined…\n\n“You recognized the swindler in advance, you’re so wise.”\nWhat? I really thought he was a good person.\n\n“You have a dragon, father is proud of you.”\nNo, I picked it up because I thought it was a cat.\n\nFinally, after a series of ‘unwanted’ successes…\n“The future of the Duke Pharadi depends on you Ashtelin. Please be my master!”\n\nIn this life, where I have been laid back and comfortable, the future of overworked and overburdened begins to come!\n\n***\n\nAshtelin took a deep breath while watching the dragon, Ferdnan, who she thought was a cat. It’s time to part away with the dragon.\n\n“Ferdnan, can we go our separate ways now?”\n“No. We’ve …. kissed.”\n\n“What!? No!? When have we ever done that!?”\n“If you don’t remember, let’s do it again.”\n\nThe problem is ….\n“Did you forget the night we spent together?”\n\nThis dragon really doesn’t know how to back off!>"
}