{
	"url": "https://www.novelupdates.com/series/unruly-phoenix-xiaoyao/",
	"title": "Unruly Phoenix Xiaoyao - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2016/12/tumblr_inline_ohtu61Mx3o1tyfb4b_540.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Gender Bender   Josei   Romance   ",
	"tags": "Ancient China   Beast Companions   Betrayal   Cannibalism   Complex Family Relationships   Cross-dressing   Dense Protagonist   Doting Older Siblings   Doting Parents   Female Protagonist   Handsome Male Lead   Loyal Subordinates   Manipulative Characters   Military   Misunderstandings   Mysterious Family Background   Pets   Politics   Pregnancy   Protagonist Strong from the Start   Royalty   Schemes And Conspiracies   Shameless Protagonist   Special Abilities   Time Skip   Transmigration   ",
	"rating": "(4.2 / 5.0, 459 votes)",
	"author": "Mei Guo   梅果   ",
	"year": "\n2015",
	"ranking": "#6970   #6142   #352   #832   #629   ",
	"reviewcount": "85 Reviews sorted by",
	"description": "The fat cat Black Tubby said, “Supreme Commander is a good person, meow!”\n\nThe bird Grandfather Sparrow said, “Supreme Commander is a good person, chirp!”\n\nThe little mouse Oil Jar also said, “Supreme Commander is a good person, squeak!”\n\nFurthermore, the weasel Great Immortal said, “You and Supreme Commander are a match made in Heaven~”\n\nAll of the little animals told Ning Xiaoyao about Supreme Commander, Supreme Commander, Supreme Commander! So, Ning Xiaoyao believed that this Supreme Commander named Lou Zigui had to be a good guy. As to whether or not they were a match made in Heaven…\n\nThe fat cat Black Tubby clawed at Ning Xiaoyao. “You wrote the decree sentencing Supreme Commander to death in the execution grounds, ah! You fatuous, self-indulgent ruler!!!”\n\nNing Xiayao replied, “…”\n\n—\n\nNing Xiaoyao is a genetically evolved army doctor from a zombie-infested apocalyptic world. One day, she transmigrates to the past as the next emperor of an ancient country. But wait, isn’t she a girl?!\n\nAs it turns out, she’s a disguised stand-in for her baby brother under the “loving” care of the empress dowager, her mother and future murderer. Faced with her impending death, Ning Xiaoyao must thwart the schemes of her family to survive in a palace allied against her. But how does a zombie-killing expert with supernormal strength, healing powers, and the ability to understand animals deal with the intricacies of court politics?\n\n“If nothing else works, I’ll just beat them all up!”>"
}