{
	"url": "https://www.novelupdates.com/series/the-superstar-happned-to-find-me/",
	"title": "The Superstar Happned To Find Me - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/01/The-Superstar-Happned-To-Find-Me.jpg",
	"noveltype": "(CN)",
	"genre": "Fantasy   Romance   Shoujo   ",
	"tags": "Animal Characteristics   Beautiful Female Lead   Childhood Friends   Doting Older Siblings   Female Protagonist   Handsome Male Lead   Siblings Not Related by Blood   Wealthy Characters   ",
	"rating": "(4.0 / 5.0, 1 votes)",
	"author": "Green Apricot of the North   ",
	"year": "\nN/A",
	"ranking": "#2000   #2000   #12850   #13810   #13074   ",
	"reviewcount": "1 Review sorted by",
	"description": "The little princess of the southern sea’s mermaid clan slipped out to play. As a result, it was picked up by the superstar Mo Heng and featured on a parent and child variety show. Fans: Where did this little pheasant come from, and why is it freeloading from our big brother’s popularity! On the first episode, the exquisite Tangtang made an appearance —— Fans: Ah~ Baby Tangtang, we love you! From now on, Mo Heng will just be a passer-by! The whole world loves Mo Tangtang! A massive group of big brothers fought over Mo Tangtang in order to pamper and spoil her. All the villains who wanted to capture mermaids instantly switched sides: Hush! Anyone who leaks this out is a dog! Chapter on Big Brother- As Big Brother Mo Heng was fretting over his dispatchment to a desolate site by the production crew, Mo Tangtang held out a pearl: “Big Brother, don’t be scared. My teardrop pearl will protect you ah” Chapter on Male Lead – The young master of the Gu Family, Gu Tingwei, had an uncharacteristically high IQ but low EQ. He loved hiding in his family’s biology laboratory to dissect bizarre life forms. One day, Gu Tingwei pointed to those specimens and asked her, “Tangtang, do you know what’s the difference between you and them?” Mo Tangtang shivered: She was alive. Was that little demon finally going to bare his fangs?? Gu Tingwei replied, “You are my wife!” Mo Tangtang: …>"
}