{
	"url": "https://www.novelupdates.com/series/do-you-think-someone-like-you-can-defeat-the-demon-king/",
	"title": "Do You Think Someone Like You Can Defeat the Demon King? (WN) - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2018/07/Do-You-Think-Someone-Like-You-Can-Defeat-the-Demon-King.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Drama   Fantasy   Horror   Mature   Tragedy   Yuri   ",
	"tags": "Adapted to Manga   Adventurers   Betrayal   Cohabitation   Curses   Dark   Demon Lord   Demons   Depictions of Cruelty   Discrimination   Fantasy World   Game Elements   Healers   Heroes   Hiding True Identity   Human Experimentation   Loli   Master-Servant Relationship   Monsters   Mysterious Past   Mystery Solving   Nobles   R-15   Religions   Schemes And Conspiracies   S*ave Protagonist   S*aves   Special Abilities   Sword And Magic   Underestimated Protagonist   Unique Weapon User   Unique Weapons   Weak to Strong   ",
	"rating": "(4.4 / 5.0, 183 votes)",
	"author": "kiki   ",
	"year": "\n2018",
	"ranking": "#1217   #3765   #1873   #3869   #1306   ",
	"reviewcount": "24 Reviews sorted by",
	"description": "According to the god’s prophecy, the girl Flamm was chosen to be one of the members of the demon king’s subjugation journey.\n\nEveryone was a hero possessed a top class power. However, for some reason only Flamm did not possess the power to fight, and all of her status values were 0.\n\nWhile having ashamed thoughts, nevertheless she continued to put great efforts to be useful to the heroes.\n\nHowever, one day, she was tricked by one of the party members, said that she “was not necessary anymore,” and sold off to a slave trader.\n\nFlamm was forced to live within a coarse environment as a slave.\n\nHowever, there she encountered a “cursed sword,” and realized the true value of the weakest power “Inverse.”\n\nThe girl, who acquired the power to fight, was honestly indifferent to the demon king already and decided to live peacefully as an adventurer alongside a girl slave she met.\n\n——This is a story of one girl who continued to crawl up from the very bottom in order to regain her peaceful everyday life.>"
}