{
	"url": "https://www.novelupdates.com/series/the-grandmaster-strategist/",
	"title": "The Grandmaster Strategist - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2016/11/s1814323_zpssedx2vem.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Drama   Martial Arts   Mature   Romance   Tragedy   ",
	"tags": "Age Progression   Alternate World   Ancient China   Aristocracy   Assassins   Betrayal   Bookworm   Boss-Subordinate Relationship   Brainwashing   Calm Protagonist   Clever Protagonist   Dark   Death of Loved Ones   Empires   Hidden Abilities   Kingdoms   Loyal Subordinates   Male Protagonist   Manipulative Characters   Medical Knowledge   Military   Nobles   Poetry   Politics   Quirky Characters   Royalty   R*pe   Schemes And Conspiracies   Sickly Characters   Strategic Battles   Strategist   Torture   Wars   Weak Protagonist   Writers   ",
	"rating": "(4.6 / 5.0, 439 votes)",
	"author": "Follow The Crowd   随波逐流   ",
	"year": "\n2004-2006",
	"ranking": "#3017   #2845   #767   #3631   #667   ",
	"reviewcount": "63 Reviews sorted by",
	"description": "This is an alternate history.  Decades after the fall of the Eastern Jin Dynasty, the world is still in chaos, although there is hope for reunification.\n\nOf poor background, Jiang Zhe, styled Suiyun, has finally, after ten years of hard work, passed the imperial examinations and become a scholar within Hanlin Academy.  Unwittingly, he becomes involved in the succession dispute of the Great Yong Dynasty.  He faces conspiracies and machinations and countless battles of strength and wits.  Intending to avoid court politics, he ultimately has no choice but to become involved.  With no alternative, Jiang Zhe can only follow the crowd, joining the chaotic political turmoil.  In this conniving world, he uses his intelligence and knowledge to provide for himself and his companions a stable environment to survive.\n\nWatch nations fall, great men rise, and supreme martial artists kneel before the quiet whispers of a frail, unassuming scholar.>"
}