{
	"url": "https://www.novelupdates.com/series/a-filthy-rich-hamster-in-the-apocalypse/",
	"title": "A Filthy Rich Hamster in the Apocalypse - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/04/20200421183115.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Comedy   Romance   Sci-fi   Shounen Ai   ",
	"tags": "Aliens   Amnesia   Animal Characteristics   Apocalypse   Cute Protagonist   Doting Love Interests   Friendship   Handsome Male Lead   Heartwarming   Hiding True Identity   Human-Nonhuman Relationship   Magical Space   Mercenaries   Modern Day   Naive Protagonist   Overpowered Protagonist   Power Couple   Royalty   Shapeshifters   Special Abilities   Strong Love Interests   Zombies   ",
	"rating": "(4.1 / 5.0, 207 votes)",
	"author": "Huà Xī   画兮   ",
	"year": "\n2020",
	"ranking": "#3802   #2687   #1620   #1470   #1366   ",
	"reviewcount": "51 Reviews sorted by",
	"description": "Little Hamster, “Daddy daddy, I have food! All of it is yours! Even me!!!”\n\nWuYi (May 1) is a little hamster nicknamed ChòuChòu (Stinky). He has a very handsome and charismatic daddy owner and he lived every day happily without worries.\n\nBut then suddenly, one day a zombie crisis emerged on earth and the world descended into the dangerous apocalyptic era. However, along with the appearance of zombies, humans, animals, and plants alike also awakened abilities for the first time.\n\nThe little hamster fell asleep and woke up to find that he had become the same type of two-legged creature like his daddy and his original small two cheeks for food storage had become extremely huge!\n\nThe little hamster rolled about with joy. The first thing he wanted to do was tell his daddy.\n\nAfter braving endless trials, climbing mountains and conquering seas, the little hamster finally found his daddy under mortal danger. Nie Xiao was then saved from the jaws of a third-grade zombie.\n\n“Daddy, baby found you at last!”\n\nNie Xiao was completely flabbergasted; “…” What’s going on, xidangpa??? (xidangpa:happy to be a father = mainly used to ridicule the situation in which a man finally catches up with the goddess, but the goddess is pregnant with someone else’s child. In desperation, the man has to take over.)\n\nEveryone from the base started to calculate with their fingers: Holy shit! Sure enough, our Boss’ talent was already abnormal from when he was seven, he already has a child this big!>"
}