{
	"url": "https://www.novelupdates.com/series/kaleidoscope-of-death/",
	"title": "Kaleidoscope of Death - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/07/Kaleidoscope-of-Death.png",
	"noveltype": "(CN)",
	"genre": "Comedy   Drama   Horror   Mystery   Psychological   Romance   Shounen Ai   Supernatural   Tragedy   ",
	"tags": "Adapted to Drama   Adapted to Drama CD   Alternate World   Amnesia   Appearance Changes   Calm Protagonist   Cannibalism   Character Growth   Cheats   Clever Protagonist   Comedic Undertone   Cooking   Cross-dressing   Death   Death of Loved Ones   Dense Protagonist   Depictions of Cruelty   Devoted Love Interests   Fantasy World   Fast Learner   Gate to Another World   Ghosts   Gore   Handsome Male Lead   Hiding True Identity   Late Romance   Limited Lifespan   Love Interest Falls in Love First   Modern Day   Monsters   Multiple Realms   Near-Death Experience   Persistent Love Interests   Possessive Characters   Power Couple   Shameless Protagonist   Sharp-tongued Characters   Slow Romance   Smart Couple   Spirits   Strong Love Interests   Survival   Survival Game   Teamwork   Terminal Illness   Unlimited Flow   Weak to Strong   World Travel   Younger Love Interests   ",
	"rating": "(4.7 / 5.0, 727 votes)",
	"author": "Xī Zǐxù   西子绪   ",
	"year": "\n2018",
	"ranking": "#317   #629   #852   #459   #337   ",
	"reviewcount": "203 Reviews sorted by",
	"description": "It started off peculiarly; first, his domestic cat refused to let him cuddle it.\n\nLin Qiushi soon found that a sense of disharmony and incongruity began to pervade everything around him.\n\nThen, one odd day, he pushed open a door, and he discovered that the hallway he was familiar with turned into a boundless corridor.\n\nAt both ends of this corridor were twelve, identical iron gates.\n\nThus, the story began.\n\nRuan Nanzhu said to Lin Qiushi, “When you gaze into the abyss, the abyss gazes back.”\n\nUpon hearing this, Lin Qiushi sank into deep contemplation. He then pulled down the zipper of his trousers and aimed at the abyss…\n\nRuan Nanzhu: “…Put your pants on properly!”>"
}