{
	"url": "https://www.novelupdates.com/series/when-the-fair-rich-beauty-becomes-the-poor-girl/",
	"title": "When the Fair Rich Beauty Becomes the Poor Girl - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/05/When-the-Fair-Rich-Beauty-Becomes-the-Poor-Girl.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Drama   Romance   School Life   Supernatural   ",
	"tags": "Beautiful Female Lead   Body Swap   Calm Protagonist   Character Growth   Clever Protagonist   Cold Protagonist   Complex Family Relationships   Different Social Status   Female Protagonist   Handsome Male Lead   Late Romance   Love Interest Falls in Love First   Modern Day   Second Chance   Siblings   Twins   ",
	"rating": "(3.5 / 5.0, 8 votes)",
	"author": "西淅   ",
	"year": "\n2019",
	"ranking": "#2000   #2000   #12012   #10839   #12261   ",
	"reviewcount": "1 Review sorted by",
	"description": "Jiang Bao never thought she would have a younger twin sister.….. they were fraternal twins with totally different looks and personalities, and the other twin had always been wandering outside.\n\nShe was 16 when she enrolled in Massachusetts (MIT), where she lived in a manor with a horseracing track. She was the top rich and beautiful young lady in the social circle, with an overbearing personality.\n\nLin Can was the meal ticket for her whole family, with low self-esteem. She was arranged to work as a hostess and was discriminated against in school and by the members of her 18 line girl group. \n\nWhen the fair rich beauty and the poor girl exchange bodies, everyone around them notices that the girl who always wanted fame and experienced extreme bullying and criticism, and the prideful and aloof girl are different from before..\n\nNotes:\n1. Fair Rich Beauty is directly translated from the Chinese term 白富美 (baifumei), which is a positive term and refers to a girl who is fair-skinned, rich, and beautiful in appearance.\n2. 18 line girl group, or 十八线女团 (shi ba xian nu tuan), is a chinese term that refers to an unpopular girl group, often known to take more measures to gain traction compared to famous groups. A K-pop equivalent term would be a nugu girl group.>"
}