{
	"url": "https://www.novelupdates.com/series/i-can-talk-to-cats/",
	"title": "I Can Talk to Cats - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/05/125214s.jpg",
	"noveltype": "(CN)",
	"genre": "Fantasy   Slice of Life   Supernatural   ",
	"tags": "Animal Rearing   Beautiful Female Lead   Business Management   Carefree Protagonist   Easy Going Life   Female Protagonist   Handsome Male Lead   Love Interest Falls in Love First   Modern Day   Pets   Restaurant   Romantic Subplot   Slow Romance   Special Abilities   Store Owner   Wishes   ",
	"rating": "(4.6 / 5.0, 99 votes)",
	"author": "Tong Ren Keng   同仁坑   ",
	"year": "\n2020",
	"ranking": "#3314   #3317   #3206   #6415   #3257   ",
	"reviewcount": "21 Reviews sorted by",
	"description": "After Lin Lan dumped her cheating boyfriend and resigned from her job, she was faced with both unemployment and a broken heart. Her current situation is a bit grim and requires serious attention. Thinking about it this way, she put on her sunglasses and boarded the plane, flying by herself without her now ex-boyfriend.\n\nSo why was something wrong with her body after the vacation? Like now, she stood at the door of her small building, and accidentally saw someone holding a pet carrier. A pair of white furry paws were pulling at the mesh covering, and its meowing was desperate: 'Save me! Help me! The sh*t-shoveling officer (Chinese slang for cat owner) is taking me to get an injection!” \n\nAnother time: After successfully getting her revenge against the immoral couple, Lin Lan was discouraged and returned to her hometown, preparing to inherit the family property. She didn't think that she would suddenly gain an ability. When she discovered that she could communicate with her pet cat without any difficulty, she thought of an idea. \n\nA short while later, pedestrians began to discover that a new cat cafe was opened in the area. The owner sat behind the glass window, with several cats laying on her legs, and around her feet. She sat drowsily in the sun every day, unbothered if her business was prosperous or not. People that hurried by envied her carefree lifestyle.\n\nHowever, one day, they found out that not only did she own the shop, but her family owned the entire building…>"
}