{
	"url": "https://www.novelupdates.com/series/spare-tire-is-gone/",
	"title": "Spare Tire is Gone - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/05/sparetire1.jpg",
	"noveltype": "(CN)",
	"genre": "Romance   Yaoi   ",
	"tags": "Acting   Amnesia   Celebrities   Manly Gay Couple   Possession   Showbiz   Time Loop   Time Skip   Transmigration   Writers   ",
	"rating": "(4.0 / 5.0, 52 votes)",
	"author": "Can’t Play Chess   不会下棋   ",
	"year": "\n2020",
	"ranking": "#1768   #1669   #4606   #2385   #3740   ",
	"reviewcount": "13 Reviews sorted by",
	"description": "When he was 21 years old, wealthy heir Qi Cong’s body was seized by a transmigrator of unknown origins, his consciousness sinking into a series of strange and grotesque dreams.\n\nThree years later, Qi Cong woke up: his family was bankrupt, his studies were ruined, and even his loyal dog of a man (who had just been about to become his boyfriend) had left the country!\n\nEven worse, his only remaining good friend told him, in these past three years, he willingly acted as a fallback guy for a phoenix man*, loving that person with crazy desperation. After all kinds of devotion and sacrifice for the other party, he had even emptied out his own family’s assets.\n\nNow, the phoenix man was experiencing a meteoric rise in his career, enjoying the days adoring his True Love. Utterly heartbroken, Qi Cong-the-spare had just tried to commit suicide.\n\nQi Cong: Swearing.jpg\n\nRepressing his anger, Qi Cong began to clean up the awful mess left by that transmigrator and eagerly searched for the whereabouts of his loyal dog boyfriend. Eventually, the boyfriend was found, but…\n\nQi Cong looked ahead at the person surrounded by a mass of reporters, the internationally acclaimed film star whose body exuded an air of untouchable iciness, “….???”\n\nWho was this garish and flashy guy?  Why did he look so similar to that dirt-poor, hard-working, down-to-earth, loyal dog of a boyfriend of his?\n\n[*phoenix man – slang for someone who worked his way up from the poor countryside to the city]>"
}