{
	"url": "https://www.novelupdates.com/series/speak-money-not-love-with-the-master/",
	"title": "Speak Money Not Love with the Master - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/07/A92CBB64-EFFA-4460-8221-5F91A83564BA.jpeg",
	"noveltype": "(CN)",
	"genre": "Romance   ",
	"tags": "Acting   Beautiful Female Lead   Cold Love Interests   Cold Protagonist   Female Protagonist   Modern Day   Showbiz   Wealthy Characters   ",
	"rating": "(3.2 / 5.0, 26 votes)",
	"author": "简图   ",
	"year": "\n2019",
	"ranking": "#2000   #2000   #7605   #6619   #8798   ",
	"reviewcount": "4 Reviews sorted by",
	"description": "Luo Chengyu, the head honcho of the rich and powerful Luo Family in Sijiu City, bore an iron fist and black heart. Cold, proud, and aloof, he’s taken the entire Luo Family into his grasp in his 30s. He’s become known as the emotionless, profit-centered robot by the people in the circle. Luo Chengyu’s private life is kept extremely under wraps, with no traces to find at all. The public wondered whether he was some kind of closed-in monk at an ancient temple or just excellent at hiding himself?\n\nAs for Ye Wei: When she made her first debut, a single shot of her naked back had made her become famed as the entertainment circle’s most sexiest goddess. The outstandingly cold temperament and small mole on her eyelid added even more points to her charm. In the circle, they say that she doesn’t put anyone in her eyes. Many business tycoons and young masters from prestigious families went to woo her, but she’s remained unmoved.\n\nTwo completely unrelated people in the eyes of others unexpectedly have a secret relationship.\n\nYe Wei carried herself with a clear, thoughtful mind. When it came to the relationship between the man and woman, she wouldn’t cause a fuss. Between them, romantic feelings were never involved.\n\nThis carried on until Master Luo’s control became too much and crossed the boundaries. Ye Wei threw the Hermès bag in her hands. Damn it, this daddy doesn’t want to play with you anymore.\n\nYe Wei then disappeared without any warning after which Master Luo’s eyes gave off a terrifying gleam. With a single wave of a hand, he blocked off all of her economic sources, not believing she had the ability to resist.\n\nA month went by, but Ye Wei was still gone without hearing a word from her.\n\nWhen Luo Chengyu found Ye Wei, she was happily fishing in leisure in the yacht on the seas around Malaysia.\n\nShe asked him: “You eat fish?”\n\nMaster Luo clenched his teeth so hard that they cracked, spitting out just one word: “Yes.”\n\nThe wise man does not trek into the river of love, whilst the fool is controlled by love.\n\nBut for those in the world who are not controlled by love, who can coldly endure a life without passion.>"
}