{
	"url": "https://www.novelupdates.com/series/the-strongest-god/",
	"title": "The Strongest God - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/04/The-Strongest-God.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Shounen Ai   Sports   ",
	"tags": "Adapted to Drama   Battle Competition   Calm Protagonist   Carefree Protagonist   Clumsy Love Interests   Cold Love Interests   Comedic Undertone   Confident Protagonist   Dense Protagonist   e-Sports   Famous Protagonist   Friendship   Gamers   Glasses-wearing Love Interests   Guilds   Love Interest Falls in Love First   Manly Gay Couple   Modern Day   Power Couple   Protagonist Strong from the Start   Seme Protagonist   Shameless Protagonist   Slow Romance   Smart Couple   Strategic Battles   Strong Love Interests   Teamwork   Weak to Strong   ",
	"rating": "(4.4 / 5.0, 78 votes)",
	"author": "Die Zhiling   蝶之灵   ",
	"year": "\n2014",
	"ranking": "#1263   #1039   #5267   #10064   #4398   ",
	"reviewcount": "9 Reviews sorted by",
	"description": "Liu Chuan came from a great family background with a well-known professor as a father and a successful businesswoman as a mother, who came from a wealthy family. What most of the world didn’t know, except for a selected few, was that he was also a first-class god in the country’s e-sports league. He had led his team to win many different competitions and was the only one in the country to lead their team to win the Annual Grand Slam. However one day, he had vanished unexpectedly and retired from the e-sports league for personal reasons. \n\nLater, he returned home when his school suspension period was almost over and he followed his parents’ wishes. He had to return to school to graduate and ended up having to stay at a dorm in room 301.\n\nThose who were into games or followed the e-sports community, all know or admired various professional players. However, what they didn’t expect was that one of their gods was just within arms reach, and even more so, a first-class one too.\n\nThis is the first part of the god series. The first two parts have been finished. The plots do not affect each other.\n\nE-sport God Series 1 “The Strongest God”\n\nE-sport God Series 2 “God Level Summoner”\n\nE-sport God Series 3 “The King’s Return”>"
}