{
	"url": "https://www.novelupdates.com/series/blossoming-love-with-a-score-of-700/",
	"title": "Blossoming Love With A Score of 700 - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/08/Blossoming-Love-With-A-Score-of.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Josei   Romance   School Life   ",
	"tags": "Age Progression   Beautiful Female Lead   Cold Love Interests   Early Romance   Female Protagonist   Handsome Male Lead   ",
	"rating": "(4.2 / 5.0, 15 votes)",
	"author": "Qi Jian   栖见   ",
	"year": "\n2020",
	"ranking": "#5262   #2000   #10171   #7728   #10342   ",
	"reviewcount": "2 Reviews sorted by",
	"description": "In First Experimental High School, Tao Zhi, a girl of great influence, had always dominated the world of her school and the finals' examination room.\r\n\r\nOne day, there were rumors that Miss Tao had somehow fallen in love with the legendary elite student who was the hope of First High in defeating the Affiliated High School— the provincial champion in the college entrance examination, Jiang Qi Huai.\r\n\r\nTao Zhi knew all about the types of girls that this legendary God likes:\r\n\r\n1. The girl had to be good and obedient.\r\n2.  She needed to have good academic records. Candidates who had the accumulated scores below 700 points were basically out of the question.\r\n\r\nTao Zhi didn't fit into either criteria, so she relentlessly worked on countless exercises and turned into a ruthless question-answering machine for half a month. Then, she obtained 350 points in the monthly exams.\r\n\r\nAfter the results came out, Tao Zhi blocked Jiang Qi Huai in the small alley. On the surface, their discussion seemed threatening, 'Look, I like you this much, so how about you be benevolent and let me take the test again?'\r\n\r\nHis peachy eyes raised lazily with a cold expression, 'You can get 700 with just two exams?'\r\n\r\nTao Zhi was very nonchalant as she casually replied, 'I got 350 for the first test, so doesn't that mean I can get 700 for the second test?'\r\n\r\nJiang Qihuai, '...'>"
}