{
	"url": "https://www.novelupdates.com/series/lets-talk-about-that-guy-who-transmigrated-to-pursue-me/",
	"title": "Let’s Talk About That Guy Who Transmigrated to Pursue Me - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/07/letstalk2.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Drama   Psychological   Romance   Shounen Ai   Xianxia   ",
	"tags": "Betrayal   Black Belly   Calm Protagonist   Caring Protagonist   Character Growth   Cultivation   Daoism   Demons   Devoted Love Interests   Half-human Protagonist   Hard-Working Protagonist   Immortals   Jealousy   Love Interest Falls in Love First   Male Yandere   Mob Protagonist   Mysterious Family Background   Mysterious Past   Mythical Beasts   Naive Protagonist   Obsessive Love   Past Plays a Big Role   Past Trauma   Possessive Characters   Schemes And Conspiracies   Senpai-Kouhai Relationship   Slow Romance   Strong Love Interests   Sword Wielder   Tragic Past   Transformation Ability   Transmigration   Unconditional Love   Unreliable Narrator   Younger Love Interests   ",
	"rating": "(4.2 / 5.0, 270 votes)",
	"author": "Mo Xiao Xian   莫晓贤   ",
	"year": "\n2016",
	"ranking": "#1183   #3471   #1988   #765   #1675   ",
	"reviewcount": "76 Reviews sorted by",
	"description": "Wen Xuan was the head disciple of Water Cloud Sect’s sect leader. He spent the first half of his lifetime respecting his teachers and placing importance in the way of Dao. Friendly towards other fellow disciples, he was everyone’s role model.\n\nHe once believed that he would spend a lifetime like this. Until one day, he met a younger fellow disciple (shidi) who was unbelievably skilled.\n\nThis shidi told him that this world was actually a novel. And he, Wen Xuan, would become the most unsightly, petty little villain in this leveling up style cultivation novel. With the next half of his lifetime on a bumpy spiral downward after an erroneous decision, he will be betrayed and deserted by friends and family, cast away and end up dying miserably alone.\n\n“After dinner for leisure, many people would use a mocking tone of disdain to discuss your disastrous life. But no one knew how you survived through all those years. No one saw how you struggled to hold on to your principles in your lonesome. No one cared about the suffering you experienced and your perseverance. But I saw it. I know. I care.”\n\n“That’s why I came to this world. To become your support.”>"
}