{
	"url": "https://www.novelupdates.com/series/smash-all-pots-and-pans-to-go-to-school/",
	"title": "Smash All Pots and Pans To Go to School - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/01/Smash-all-pots-and-pans-to-go-to-school.jpeg",
	"noveltype": "(CN)",
	"genre": "Action   Comedy   Mecha   Romance   School Life   Sci-fi   ",
	"tags": "Absent Parents   Battle Academy   Brotherhood   Calm Protagonist   Carefree Protagonist   Character Growth   Clever Protagonist   Confident Protagonist   Engineer   Evil Organizations   Fast Learner   Female Protagonist   Futuristic Setting   Genius Protagonist   Handsome Male Lead   Hard-Working Protagonist   Hiding True Abilities   Military   Money Grubber   Orphans   Poor Protagonist   Power Couple   Shameless Protagonist   Slow Romance   Strong Love Interests   Strong to Stronger   Transmigration   Weak to Strong   ",
	"rating": "(4.6 / 5.0, 124 votes)",
	"author": "Hong Ci Bei   红刺北   ",
	"year": "\n2020",
	"ranking": "#234   #137   #2066   #194   #3561   ",
	"reviewcount": "42 Reviews",
	"description": "The former top engineering student Wei San transmigrated into an interstellar child who was deprived of education. By picking up garbage and turning waste into treasure, she finally saved a sum of money before the opening season of school and immediately signed up.\n\nShe planned to become a Mecha Engineer in the future. It was said that it can make a lot of money and was closely related to her own original specialization. Plan pass √\n\nUnexpectedly, because of her greed for cheap tuition fees, Wei San reported to the wrong major and became a mecha individual fighter——those violent maniacs who licks blood all day\n\nWei·Gentle & Quiet·Impoverished·Engineer: “……”\n\nHowever, the environment could not make her give in, and Wei San decided to learn by herself in her spare time.\n\nDuring the training period of a certain competition, the media interviewed and photographed the individual fighters of each school in turn, which was broadcast live on the whole interstellar network. The audience could see that everyone was training desperately, such as gravity pressurization, close combat, long-distance entanglement and so on.\n\n【YY’s melee is too strong. Who dares to melee when the light saber is out!】\n\n【ww’s whipping skills are too superb, NB(F****** great)! ! !】\n\nThen Wei San was recorded sitting cross legged in the training hall, looking down and concentrating on reading a book.\n\n【What’s that Wei San looking at?】\n\nAs the camera zoomed in, the cover of the book in Wei San’s hand was immediately seen clearly by the whole star network: “Qing Fei teaches you to become a mecha master in 21 days”\n\nAudience：……\n\nAs long as one hears the title of the novel, they could tell it wasn’t read by serious people. \n\nThe next day, the star net headline: A military academy student was overwhelmed and mentally disordered during training, trying to change careers.>"
}