{
	"url": "https://www.novelupdates.com/series/from-sidekick-to-bigshot/",
	"title": "From Sidekick to Bigshot - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/04/From-Sidekick-to-Bigshot_1618419651.jpg",
	"noveltype": "(CN)",
	"genre": "Drama   Romance   Slice of Life   ",
	"tags": "Apathetic Protagonist   Beautiful Female Lead   Calm Protagonist   Caring Protagonist   Clever Protagonist   Cohabitation   Cute Protagonist   Devoted Love Interests   Doctors   Doting Love Interests   Doting Older Siblings   Doting Parents   Familial Love   Family   Family Conflict   Female Protagonist   Genius Protagonist   Handsome Male Lead   Hidden Abilities   Hiding True Identity   Love Interest Falls in Love First   Medical Knowledge   Modern Day   Multiple Identities   Personality Changes   Power Couple   Second Chance   Sickly Characters   Slow Romance   Smart Couple   Strong Love Interests   Unconditional Love   ",
	"rating": "(3.7 / 5.0, 36 votes)",
	"author": "Er Fengchong   耳丰虫   ",
	"year": "\n2020",
	"ranking": "#2000   #4772   #6745   #9503   #7488   ",
	"reviewcount": "11 Reviews sorted by",
	"description": "Previously, Jian Yiling was the supporting character who was destined to be cannon fodder. However now, with the memories of future events, Jian Yiling who had crossed into the novel transformed into a hidden big shot. Not only is Jian Yiling not interested in the male protagonist, but she also leaves the people around her in astonishment and bewilderment.\n\nOriginally, her brothers hated her. Now, they were all fiercely protective of her.\n\n“Yiling gets frightened easily. Don’t scare her.”\n\n“Yiling hasn’t been to distant places. Don’t scam her.”\n\n“Yiling has a weak body. Don’t bully her.”\n\nEveryone else wanted to cry in disbelief. Are you sure that she is cute and easily bullied? Who dares to bully her! When they all thought that the Jian brothers were enough to deal with, there was another one that topped the rest.\n\nMaster Sheng: “Yiling is very delicate. She shouldn’t be angered. If you make her angry, I’ll cut you up and make you into a broth!”\n\nEveryone else: “Master Sheng, I think there’s something wrong with your eyes! I recommend you to go to the ophthalmologist!”>"
}