{
	"url": "https://www.novelupdates.com/series/married-to-the-male-leads-paranoid-uncle/",
	"title": "Married To The Male Lead’s Paranoid Uncle - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/08/Married-To-The-Male-Leads-Paranoid-Uncle.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Fantasy   Romance   ",
	"tags": "Arranged Marriage   Black Belly   Disabilities   Female Protagonist   Handsome Male Lead   Love Interest Falls in Love First   Male Yandere   Modern Day   Multiple Transported Individuals   Transmigration   ",
	"rating": "(3.1 / 5.0, 26 votes)",
	"author": "艾鱼   ",
	"year": "\n2019",
	"ranking": "#5262   #957   #8086   #10477   #6571   ",
	"reviewcount": "2 Reviews sorted by",
	"description": "When Shi Yin woke up, she found herself transmigrated inside the book. She had become the weak female lead who was abused by the male lead and later committed suicide while being pregnant.\n\nAt the dinner table, when the commercial marriage between her and the male lead was being finalized. Shi Yin pointed to the male lead’s uncle, who was terminally ill, and said, “I want to marry Young Uncle Cheng Yuan!”\n\nAfter marrying the male lead’s young uncle, Shi Yin patiently waited for the day when Zhou Cheng Yuan would die and she became single again.\n\nBut, why was this man getting better and better day by day?\n\nShi Yin said, “Hurry up and die, I wanted to be a widow quickly!”\n\nZhou Cheng Yuan said, “Either you choose to live with me, or you can choose to die with me.”\n\nShi Yin said, “Let’s live together.”\n\nWhen Shi Yin first met Zhou Cheng Yuan, she thought Cheng Yuan was a cold and abstinent tyrant.  But, after spending a long time with him, Shi Yin discovered that this guy was actually black-bellied and paranoid.\n\nEvery time Shi Yiin looked at other men, he would stick to her and with a dissatisfied voice said, “How can Yin Yin look at others?”\n\nEvery time Shi Yin was bullied and cried by him at night, he would smile and contentedly said, “Yin Yin is crying, I am very happy.”>"
}