{
	"url": "https://www.novelupdates.com/series/i-married-because-i-wanted-to-live-a-normal-life/",
	"title": "I Married Because I Wanted To Live A Normal Life - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/09/I-Married-Because-I-Wanted-To-Live-A-Normal-Life.jpg",
	"noveltype": "(KR)",
	"genre": "Fantasy   Romance   ",
	"tags": "Aristocracy   Clumsy Love Interests   European Ambience   Fantasy World   Female Protagonist   Marriage   Mob Protagonist   Nobles   Transmigration   ",
	"rating": "(4.0 / 5.0, 14 votes)",
	"author": "Warm Wish   온소망   ",
	"year": "\n2022",
	"ranking": "#1768   #2198   #10404   #2518   #9313   ",
	"reviewcount": "1 Review sorted by",
	"description": "I was reincarnated as an extra in a world that would soon be destroyed.\n\nI did not know who I was.\n\nWith the mentality of only seeking my own way of life, I decided to run away inheriting a mansion as a dowry. So, I took the gardener who tended the flowers in our house and we had the ceremony.\n\n“Liddell, wasn’t it hard today?”\n\n“Liddell, do you want to eat first?”\n\n“It’s the weekend, why not go out together?”\n\nDoing a good job, looking only at me! I thought I could have a happy marriage because I would make money and do my best.\n\n“Why did you marry a man who had no position, no wealth, no power?”\n\nMy former fiancé, who broke off the engagement out of the blue, who now shows up and claims me, asked me.\n\n“…Liddell. Is your marriage going well?”\n\n“Absolutely, what could be wrong?”\n\n“Why, after marriage, was your husband different from what I thought he was… Wasn’t he normal?”\n\nWhy does my former fiancé ask me this?\n\nMoreover, my husband, whom I only considered docile.\n\n“Hisch, just… What is that?”\n\nHe hid his hand behind his back while holding a monster the size of a house and with a tearful expression, he said:\n\n“But, for Liddell…to get hurt, I hate it.”\n\nI married because I wanted to live a normal life, but the identity of my modest husband is the most suspicious.>"
}