{
	"url": "https://www.novelupdates.com/series/true-martial-world/",
	"title": "True Martial World - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2016/04/640-1.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Drama   Fantasy   Mature   Mystery   Xuanhuan   ",
	"tags": "Adapted to Manhua   Archery   Arrogant Characters   Artifacts   Battle Competition   Beautiful Female Lead   Bloodlines   Body Tempering   Calm Protagonist   Cultivation   Cunning Protagonist   Dao Companion   Dao Comprehension   Demi-Humans   Demons   Devoted Love Interests   Doting Older Siblings   Elemental Magic   Gods   Handsome Male Lead   Heavenly Tribulation   Long Separations   Lucky Protagonist   Magic Formations   Magical Space   Male Protagonist   Monsters   Multiple Realms   Poor to Rich   Romantic Subplot   S*xual Cultivation Technique   Siblings Not Related by Blood   Slow Romance   Spatial Manipulation   Sword Wielder   Time Skip   Transmigration   Transported to Another World   Underestimated Protagonist   Wars   Weak to Strong   World Travel   World Tree   ",
	"rating": "(3.9 / 5.0, 1904 votes)",
	"author": "Cocooned Cow   蚕茧里的牛   ",
	"year": "\n2015",
	"ranking": "#6970   #6152   #11   #3971   #88   ",
	"reviewcount": "206 Reviews sorted by",
	"description": "The Human Emperor and his opponents were embroiled in a 33 day long final battle involved the strongest experts. After destroying the Abyssal World and sealing the Abyssal demon king’s godly weapon‘ a mysterious purple card disappeared into the space-time vortex‘ and tunneled through infinite space-time.\n\nIn the vast wilderness‘ where martial arts was still slowly growing in its infancy‘ several peerless masters tried to find their path in the world of martial arts.\n\nA young adult named Yi Yun from modern Earth had unwittingly stumbled into such a world and began that journey with a purple card of unknown origin.\n\nIt’s a magnificent yet unknown true martial art world. This is the story of a normal young adult turning into a legendary peerless expert.>"
}