{
	"url": "https://www.novelupdates.com/series/the-immortal-demon-king-and-the-impaired-hero/",
	"title": "The Immortal Demon King and the Impaired Hero - Novel Updates",
	"image": "https://www.novelupdates.com/img/noimagefound.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Comedy   Fantasy   Mystery   Romance   Tragedy   ",
	"tags": "Demon Lord   Gods   Immortals   Magic   Male Protagonist   Overpowered Protagonist   Protagonist Strong from the Start   Reincarnation   ",
	"rating": "(4.3 / 5.0, 86 votes)",
	"author": "矢野優斗   ",
	"year": "\n2015",
	"ranking": "#2000   #2000   #5656   #791   #4699   ",
	"reviewcount": "1 Review sorted by",
	"description": "The demon king was summoned from Japan to fight off the hero. After a long grueling fight he finally won against the hero. But something strange happened. After he had defeated but not killed the hero the holy sword floated up and stabbed the hero in the chest and then immediately disappeared. And this isn’t the only time it happened. Every hero after that that wielded the holy sword was killed by it immediately after the hero lost to the demon king.\n\nThe demon king was heartbroken upon witnessing this\n\nHe tried different ways to save the heroes from their fate.\n\nHe tried destroying the sword but that was impossible.\n\nHe tried stealing the sword but it always kept disappearing.\n\nHe tried telling the heroes the truth about the sword but most won’t believe him.\n\nAnd those that did believe him were immediately killed by the sword.\n\nThe demon king watched this go on for nearly 500 years repeatedly. And with each hero he defeat he gets stronger and stronger to the point where no hero can beat him anymore. He had gotten so powerful that the holy sword can’t even harm him anymore.\n\nHe had given up on life and tried to kill himself. But he had already gotten so strong he had achieved pseudo-immortality and even he couldn’t kill himself.\n\nSo for 500 years he was continually tormented by that sword. The sword took everything from him.\n\nIt took his friends, his family,and his lovers.\n\nAnd so the demon king sits in an empty castle in seclusion waiting for the next hero to come to their death.\n\nUntil one day a young hero girl came to his castle….. without the holy sword.\n\nShe was apparently a newly summoned hero that wasn’t deemed worthy by the sword.\n\nThis was the happiest moment of the demon King’s life>"
}