{
	"url": "https://www.novelupdates.com/series/sweet-villain/",
	"title": "Sweet Villain - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/06/Sweet-Villain.jpg",
	"noveltype": "(KR)",
	"genre": "Adult   Drama   Josei   Mature   Psychological   Romance   Smut   ",
	"tags": "Absent Parents   Abusive Characters   Beautiful Female Lead   Bickering Couple   Bullying   Businessmen   Calm Protagonist   Character Growth   Charming Protagonist   Childcare   Clingy Lover   Cold Protagonist   College/University   Confinement   Cruel Characters   Cute Children   Dark   Death of Loved Ones   Evil Organizations   Female Protagonist   First-time Interc**rse   Forced into a Relationship   Forced Marriage   Handsome Male Lead   Hard-Working Protagonist   Jealousy   Love at First Sight   Male Yandere   Manipulative Characters   Marriage of Convenience   Modern Day   Near-Death Experience   Obsessive Love   Older Love Interests   Past Trauma   Perverted Protagonist   Possessive Characters   Pregnancy   R-18   R*pe Victim Becomes Lover   R*pe   Sadistic Characters   Secret Crush   Secret Relationship   Seduction   S*xual Abuse   Sibling Rivalry   Stubborn Protagonist   Unrequited Love   Weak Protagonist   Yandere   ",
	"rating": "(3.2 / 5.0, 33 votes)",
	"author": "Fiorenti   피오렌티   ",
	"year": "\n2020",
	"ranking": "#6970   #2000   #10194   #10839   #7515   ",
	"reviewcount": "No Reviews",
	"description": "“Everyone gets what they deserve.”\r\n\r\nShe thought he was the savior who would prevent the fall of her family, but he was an invader who drove her to the bottom.\r\n\r\n“I gave you a choice, and the decision is up to you, Ms. Han Seo-Yoon.”\r\n\r\n“Up to me... Why are you doing this? What did I do wrong?”\r\n\r\n‘Not because you did anything wrong, but because you stand out.’\r\n\r\nTension and excitement are turned into hatred and contempt, and Seo-Yoon's heart is trampled down before she can even confirm the identity of her emotions.\r\n\r\nLove? Of course she didn't love him.\r\n\r\nInsanity and obsession felt in a calm consensus.\r\n\r\nThe more they tried to escape, the more they were tied up, the affectionate oppression.\r\n\r\n“Nothing started it, as you said, but it makes no sense to end it.”\r\n\r\nIs there any way to get away from him before being thoroughly broken?\r\n>"
}