{
	"url": "https://www.novelupdates.com/series/oh-no-after-i-reincarnated-my-moms-became-son-cons/",
	"title": "Oh no! After I Reincarnated, My Moms Became Son-cons! - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2017/02/ee7bb9fe-888f-48f8-b5b4-6eafecde4c13.jpg",
	"noveltype": "(CN)",
	"genre": "Adult   Adventure   Drama   Ecchi   Fantasy   Harem   Mature   ",
	"tags": "Beautiful Female Lead   Betrayal   Caring Protagonist   Character Growth   Clever Protagonist   Clingy Lover   Complex Family Relationships   Death   Death of Loved Ones   Depictions of Cruelty   Doting Parents   Dragons   Elves   Empires   Engagement   Familial Love   Fanaticism   F*llatio   Half-human Protagonist   Handsome Male Lead   Incest   Kidnappings   Kingdoms   Kuudere   Love Interest Falls in Love First   Lucky Protagonist   Magic   Male Protagonist   Marriage   M*sturbation   Multiple POV   Mysterious Family Background   Mysterious Illness   Nobles   Obsessive Love   Older Love Interests   Parent Complex   Personality Changes   Polygamy   Pregnancy   Romantic Subplot   Royalty   R*pe   Sadistic Characters   S*aves   Strong Love Interests   Threesome   Time Skip   Transmigration   Tsundere   Weak to Strong   Wealthy Characters   Yandere   ",
	"rating": "(3.7 / 5.0, 749 votes)",
	"author": "川香麻辣鸡肉锅   ",
	"year": "\n2016",
	"ranking": "#6970   #2000   #175   #487   #379   ",
	"reviewcount": "125 Reviews sorted by",
	"description": "One day, I fell into the river and drowned. The God of River looked at me, and said: “You’re very brave, young one, so let me give you a mother as a reward. Would you like a golden-haired big-breasted elf mother with an extreme yandere personality, or a black-haired big-breasted sadistic human mother with a tsundere personality?” Me: “I choose… your mom, dammit! What I really want is to quickly reincarnate!!” The God of River smiled at me: “You are a honest lad indeed, so let me gift you both mothers. From now on, you will have two mothers!” Me: “Did you even listen to what I said?!”>"
}