{
	"url": "https://www.novelupdates.com/series/the-most-popular-comedian/",
	"title": "The Most Popular Comedian - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/12/The-Most-Popular-Comedian.jpeg",
	"noveltype": "(CN)",
	"genre": "Comedy   Romance   Slice of Life   Yaoi   ",
	"tags": "Buddhism   Calm Protagonist   Carefree Protagonist   Caring Protagonist   Charismatic Protagonist   Clever Protagonist   Confident Protagonist   Cute Protagonist   Devoted Love Interests   Doting Love Interests   Doting Older Siblings   Family   Famous Protagonist   Friendship   Handsome Male Lead   Kind Love Interests   Love Interest Falls in Love First   Modern Day   Music   Popular Love Interests   Shameless Protagonist   Showbiz   ",
	"rating": "(4.5 / 5.0, 67 votes)",
	"author": "马户子君   ",
	"year": "\n2020",
	"ranking": "#2000   #6271   #4410   #4537   #3124   ",
	"reviewcount": "11 Reviews sorted by",
	"description": "Rong Yuheng, a rich second generation, was driven out of the house by his father and had no choice but to sneak off to participate in an audition to start his career.\n\nWhile introducing himself on the audition stage:\n\nThe host: “Please briefly describe your experiences.”\n\nRong Yuheng: “I’ve lived life like a joke for the first half of my life.”\n\nAudience: “He must have a hidden, tragic past!”\n\nIn his promotion, Rong Yuheng, with his comedy skills, muddled along and made a name for himself as he debuted as a comedian among a group of idols.\n\nAudience: “……So, it turned out to be a joke like this!”\n\nMeanwhile, Wen Zecheng, a top star in the entertainment industry, made his debut at a young age and won three awards, his road to stardom shining and bright.\n\nIt was commonly known in the industry that Wen Zecheng was a serious, rigorous, cold, and restrained man without any hint of scandal.\n\nThey danced together for the first time on the audition stage.\n\nRong Yuheng, with his mouth filled with obscenities, said, “Wen-laoshi, let’s rock! Raise your butt higher! You can do it right?”\n\nWen Zecheng: “……”\n\n—\n\nOn a certain year, underneath dark, windy skies.\n\nWen Zecheng, “Raise your butt higher, you can do it right?”\n\nRong Yuheng, “……” Huhuhu.>"
}