{
	"url": "https://www.novelupdates.com/series/strange-grief-wants-to-retire-the-weakest-hunter-dreams-of-a-hero/",
	"title": "Strange Grief Wants to Retire ~ The Weakest Hunter Dreams of a Hero ~ - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/04/Nageki_1_1.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Comedy   Fantasy   Harem   Shounen   ",
	"tags": "Adapted to Manga   Alchemy   Artifacts   Average-looking Protagonist   Award-winning Work   Brother Complex   Cautious Protagonist   Childhood Friends   Cowardly Protagonist   Dense Protagonist   Dungeons   Famous Protagonist   Fantasy World   Guilds   Lack of Common Sense   Loli   Loyal Subordinates   Male Protagonist   Misunderstandings   Monsters   Multiple POV   R-15   Shameless Protagonist   Sword And Magic   Unique Weapon User   Weak Protagonist   Yandere   Younger Sisters   ",
	"rating": "(3.9 / 5.0, 172 votes)",
	"author": "Tsukikage   槻影   ",
	"year": "\n2018",
	"ranking": "#176   #272   #777   #319   #2088   ",
	"reviewcount": "26 Reviews sorted by",
	"description": "Existing all over the world sleeps treasure tools with special powers.\n\nRiches, Prestige, and finally Power.\n\nChasing glory, an era where Treasure Hunters rampage through Treasure Shrines without regard for danger.\n\nTogether with his childhood friends, Cry shares the dream of becoming a hunter. On their first expedition he notices that out of the six of them, he is the only one without any talent.\n\nHowever, that was only the beginning of their adventures.\n\n“It’s too unreasonable. I want to quit this dangerous job already. I’m gonna throw up. ”\n\n“Ok, got it. In other words we should get strong enough to cover your part too. Nice handicap.”\n\n“Don’t worry Cry-chan. We’ll make sure to protect you.”\n\n“Ah, stop. If you step there you’ll disappear without even leaving dust behind. Take care, ok leader?”\n\nProtected by his childhood friends that are too strong, relying on his juniors and other hunters – they aim at being heroes and obtaining treasure.\n\nWill Cry be able to quit being a hunter while still in one piece?>"
}