{
	"url": "https://www.novelupdates.com/series/zither-emperor/",
	"title": "Zither Emperor - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2016/05/Zither-Emperor.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Comedy   Fantasy   Harem   Martial Arts   Xuanhuan   ",
	"tags": "Adapted to Manhua   Ancient Times   Cultivation   Dragons   Gods   Heaven   Kingdoms   Legends   Magic   Male Protagonist   Music   Naive Protagonist   Overpowered Protagonist   Polygamy   Romantic Subplot   Royalty   Souls   ",
	"rating": "(3.7 / 5.0, 196 votes)",
	"author": "Tang Jia San Shao   唐家三少   ",
	"year": "\n2009",
	"ranking": "#5262   #2000   #1561   #3144   #2360   ",
	"reviewcount": "15 Reviews sorted by",
	"description": "Nine harmonic zither chords shook the universe, who dared to not acknowledge the lord?\n\nThe curtains on a grand era of Rainbow Magic was raised.\n\nHe, the Zither Emperor, brought about heaven-shaking reform to the continent.\n\nAn ancient soul, pure and of strong heart, was born as the once in a generation Zither genius quietly by the ocean under clear blue skies.\n\nThis individual, a mere pure-hearted youth, gradually ascended to regency as the Zither Emperor of legends, demonstrating an unprecedented strength in musical magic and overcoming the conventional standards of society.\n\nRed, Orange, Yellow, Green, Cyan, Indigo, and Violet; the colors of the Rainbow served as the ranking system of martial arts and magic.\n\nBecause of his profound skill, what was once a useless disregarded vocation became a legendary talent deeply intertwined with his immortal legacy. The legacy of an unparalleled genius who shone so brightly, no one could ignore his brilliance.\n\nEven the acclaimed near-invincible dragon, in front of the Zither Emperor, cannot lift its bowed prideful head, because it was addressing a god. The pioneer of musical magic, responsible for reforming the previous Rainbow ranking system and entering the unknown level of Rainbow Magic, had become the standard measure for all martial arts and magic. Dragons were no longer the unequalled creatures of old.\n\nA godly master of sound, a matchless spiritual mage, he raised this trash vocation to become the most legendary craft on the continent. However, this was all fiction, right?\n\nAn ancient soul, pure and of strong heart, was born as the once in a generation Zither genius quietly by the ocean under clear blue skies. This individual, a mere pure-hearted youth, gradually ascended to regency as the Zither Emperor of legends, demonstrating an unprecedented strength in musical magic and overcoming the conventional standards of society. Was he only the Zither Emperor, though?>"
}