{
	"url": "https://www.novelupdates.com/series/train-elementary-level-spell-magic-arrow-to-the-absolute-limit-the-exiled-noble-student-not-giving-up-train-to-become-the-strongest/",
	"title": "Train Elementary Level Spell, Magic Arrow to the Absolute Limit ~The Exiled Noble Student Not Giving up, Train to Become the Strongest~ - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/07/Train-Elementary-Level-Spell-Magic-Arrow-to-the-Absolute-Limit-The-Exiled-Noble-Student-Not-Giving-up-Train-to-Become-the-Strongest.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Fantasy   Harem   School Life   ",
	"tags": "Academy   Adapted to Manga   Adventurers   Calm Protagonist   Character Growth   Depictions of Cruelty   Discrimination   Emotionally Weak Protagonist   Episodic   Fallen Nobility   Fantasy World   Handsome Male Lead   Hiding True Identity   Inferiority Complex   Magic   Male Protagonist   Past Plays a Big Role   Protagonist Strong from the Start   Siblings   Timid Protagonist   War Records   Wizards   ",
	"rating": "(3.5 / 5.0, 46 votes)",
	"author": "Pemopemosan   ぺもぺもさん   ",
	"year": "\n2020",
	"ranking": "#2773   #4165   #2077   #4536   #4422   ",
	"reviewcount": "10 Reviews sorted by",
	"description": "Albert, who had learned the beginner-level spell Magic Arrow at a very young age, was expected to do great things in the future. However, he was unable to learn any other spells.\n\nAlbert’s father was a noble who heavily valued his dignity, so he banished his good-for-nothing son and granted him a house to stay in. There, Albert would live out more than ten years reading Magic Arrow spellbooks.  \n\nAfter day after day of practice, he would unknowingly break the limit of his spell. \n\nTo a young lady despairing that she would miss her exam, Albert would say:\n\n“I’ll take you there with Magic Arrow.”\n\n“How are you gonna do that using a spell with a firing range of 50 meters?”\n\nThis is the story of a man pushing through hardships using his dysfunctional spell and eventually becoming the strongest magician⁠—all while convinced that his Magic Arrow is only slightly stronger than most.>"
}