{
	"url": "https://www.novelupdates.com/series/reincarnation-of-the-businesswoman-at-school/",
	"title": "Reincarnation Of The Businesswoman At School - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2018/01/59b0f3496c7b7.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Comedy   Drama   Fantasy   Josei   Romance   Supernatural   ",
	"tags": "Adapted to Manhua   Assassins   Beautiful Female Lead   Black Belly   Business Management   Calm Protagonist   Cheats   Clever Protagonist   Cold Love Interests   Cold Protagonist   Cultivation   Cunning Protagonist   Depictions of Cruelty   Familial Love   Female Protagonist   First Love   First-time Interc**rse   Handsome Male Lead   Hard-Working Protagonist   Hidden Abilities   Modern Day   Ninjas   Poor to Rich   Power Couple   Protagonist Strong from the Start   Racism   Reincarnation   Revenge   Ruthless Protagonist   Second Chance   Special Abilities   Strong Love Interests   Strong to Stronger   Transmigration   Unconditional Love   Wealthy Characters   Zombies   ",
	"rating": "(3.5 / 5.0, 164 votes)",
	"author": "Warm Color Su   苏暖色   ",
	"year": "\nN/A",
	"ranking": "#2000   #2000   #2394   #3009   #2453   ",
	"reviewcount": "43 Reviews sorted by",
	"description": "She was originally a puppet of her family. Pursued by the police for being a business spy and hitman, she was betrayed and fell into the sea.\r\n\r\nWhen she opened her eyes again, she had turned into an ordinary high school student. Because of a disgraceful birth, she had been crowded out by her relatives. Because of inferiority complex and antisocial behavior, she was bullied by her classmates.\r\n\r\nBut now she is no longer someone who acts timid. Cheat her, and she will break your bones.\r\n\r\nShe possesses formidable Jade pupils capable of seeing through walls. Other people have difficulty breaking through jade, their sight for antiques is based on gambles, but she only needs a look.\r\n\r\nAn undertaking begins as she creates legends in the world of business.\r\n\r\nOnce upon a time, they laughed at her poor and destitute state. Now looking at her net worth of 10 billion, it can’t be explained.\r\n\r\nTo the relatives that come to hug her thighs, she must apologize: “We broke off relations long ago, so get lost!”>"
}