{
	"url": "https://www.novelupdates.com/series/this-omega-is-sweet-and-wild/",
	"title": "This Omega is Sweet and Wild - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/07/TOSW.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Romance   School Life   Sports   Yaoi   ",
	"tags": "Bickering Couple   Charismatic Protagonist   Charming Protagonist   Cold Love Interests   Coming of Age   Complex Family Relationships   Confident Protagonist   Dense Protagonist   Determined Protagonist   Devoted Love Interests   Doting Love Interests   Handsome Male Lead   Hard-Working Protagonist   Heartwarming   Love Interest Falls in Love First   Manly Gay Couple   Multiple POV   Omegaverse   Orphans   Power Couple   Strong Love Interests   Tsundere   ",
	"rating": "(4.7 / 5.0, 364 votes)",
	"author": "Mò Lǐ   莫里_   ",
	"year": "\n2020",
	"ranking": "#2463   #3155   #1341   #1191   #838   ",
	"reviewcount": "96 Reviews sorted by",
	"description": "Li Cheng is an omega, but he is thoroughly like an alpha.\n\nHe regards teachers like friends, is unrivalled in the swimming pool and also has 80 betas as his lil’ brothers.\n\nOne day, Li Cheng loudly declares ⸺ He’s determined to win the campus male god alpha Xiao Yiheng over. He must become his!\n\n“Xiao Yiheng is smart, handsome, and tall! Moreover, he has long legs and a perky butt. His strong XX capability can be seen with just a glance! Only this kind of alpha is worthy of me!”\n\nLong-legged, perky-butt, and has strong XX capability Xiao Yiheng: “……”\n\nTo show his determination, Li Cheng proclaims that he would give him a love bento every morning.\n\nThe next day, Li Cheng stayed up all night playing games and can’t get up.\n\nThe third day, Li Cheng danced the night away with others and can’t get up.\n\nThe fourth day, Li Cheng fought with the gang from the neighbouring school and can’t get up.\n\nThen came the fifth day… The sixth day… The seventh day…\n\nJust when Li Cheng is just about to forget his plan of courting the male god, Xiao Yiheng obstructs him inside one of the locker room’s cubicles before his swimming training.\n\n“Xiao Yiheng, w-what do y-you want with Laozi?”\n\n“Because I was waiting for your lunch box, I haven’t eaten breakfast for a whole week.” Xiao Yiheng had a cold expression. With a fake smile, he continued, “But… Your pheromone smells quite delicious.”>"
}