{
	"url": "https://www.novelupdates.com/series/warlock-of-the-magus-world/",
	"title": "Warlock of the Magus World - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/05/Warlock-of-the-Magus-World_1653417756.jpg",
	"noveltype": "(CN)",
	"genre": "Adventure   Mature   Sci-fi   Seinen   Xuanhuan   ",
	"tags": "Academy   Alchemy   Apathetic Protagonist   Appearance Changes   Artifacts   Artificial Intelligence   Beasts   Biochip   Bloodlines   Cheats   Clever Protagonist   Cold Protagonist   Cruel Characters   Cultivation   Cunning Protagonist   Dark   Depictions of Cruelty   Determined Protagonist   Dishonest Protagonist   Dreams   Evil Protagonist   Evolution   Fantasy World   Game Elements   Gate to Another World   God Protagonist   Gods   Gore   Handsome Male Lead   Hidden Abilities   Human Experimentation   Knights   Magic   Male Protagonist   Manipulative Characters   Past Plays a Big Role   Polygamy   Pragmatic Protagonist   Pregnancy   Proactive Protagonist   Racism   Reincarnation   Ruthless Protagonist   Schemes And Conspiracies   Selfish Protagonist   Seven Deadly Sins   Souls   Stoic Characters   Strength-based Social Hierarchy   Sword And Magic   Time Skip   Transmigration   Underestimated Protagonist   Weak to Strong   World Hopping   World Travel   ",
	"rating": "(4.0 / 5.0, 2975 votes)",
	"author": "The Plagiarist   Wen Chao Gong   文抄公   ",
	"year": "\n2015",
	"ranking": "#3567   #4049   #7   #149   #18   ",
	"reviewcount": "482 Reviews sorted by",
	"description": "When a futuristic scientist is transported into the body of a young man in a fantasy world, his curiosity and desire for power push him to pursue magic. In a world without mercy, Leylin has no qualms about doing anything if it means benefits. He is cold, ruthless and calculating, never forming attachments that could impede his ultimate goal… \n\nHonor? Who needs that… Hmmm… that guy seems too powerful for me to take on now… I better keep a low profile for now.\n\nYou want me to help you? What do I get out of it? Nothing? Bye.\n\nHmm… that guy looks like he might cause me problems in the future. Better kill him before he becomes a problem…>"
}