{
	"url": "https://www.novelupdates.com/series/reborn-as-a-substitute/",
	"title": "Reborn as a Substitute - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/03/Reborn-as-a-Substitute.jpg",
	"noveltype": "(CN)",
	"genre": "Drama   Fantasy   Psychological   Romance   Yaoi   ",
	"tags": "Artists   Betrayal   Brother Complex   Calm Protagonist   Celebrities   Character Growth   Charismatic Protagonist   Comedic Undertone   Couple Growth   Flashbacks   Handsome Male Lead   Hiding True Identity   Love Interest Falls in Love First   Male Yandere   Manly Gay Couple   Misunderstandings   Modern Day   Multiple POV   Music   Naive Protagonist   Near-Death Experience   Obsessive Love   Past Plays a Big Role   Past Trauma   Poor Protagonist   Possessive Characters   Previous Life Talent   Resurrection   Revenge   Showbiz   Strong Love Interests   Transmigration   Unconditional Love   Unrequited Love   Wealthy Characters   Younger Love Interests   ",
	"rating": "(4.2 / 5.0, 142 votes)",
	"author": "PDG   ",
	"year": "\n2021",
	"ranking": "#874   #373   #3706   #1551   #3685   ",
	"reviewcount": "31 Reviews sorted by",
	"description": "In his previous life, Ji Sheng was a popular star who was framed and eventually died in disgrace.\n\nReborn as an 18th tier artist, Ji Sheng is determined to take revenge. In order to climb to the top of the world of fame and fortune, he does not hesitate to send himself to the bed of Xie Xuanming, his enemy in the previous life.\n\nXie Xuanming is handsome, rich and can be considered a perfect lover.\n\nIt’s a pity that there is a white moonlight in his heart.\n\nOn the first meeting after rebirth, Xie Xuanming squeezed Ji Sheng’s chin and narrowed his eyes.\n\nXie Xuanming: You look like him.\n\nJi Sheng: Hehe, I knew it in my previous life.\n\nOne day, Xie Xuanming was drunk and crazy, dragging Ji Sheng to visit the white moonlight’s grave.\n\nXie Xuanming hugged the tombstone tenderly: I knew him for several years, but he never loved me.\n\nJi Sheng: Hmm, no love, no love.\n\nXie Xuanming stroked the nameplate with the tips of his fingers: Obviously he approached me first and my heart was stirred, only to find that he was playing games.\n\nJi Sheng: Yeah, acting, acting.\n\nXie Xuanming: Come closer, let him see. It’s not like I am alone, it’s not like no one wants me.\n\nJi Sheng had no choice, stepped forward and froze.\n\nJi Sheng: Wait, isn’t this my grave?>"
}