{
	"url": "https://www.novelupdates.com/series/daddy-i-dont-want-to-marry/",
	"title": "Daddy, I Don’t Want to Marry! - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/04/Daddy-I-Dont-Want-to-Marry_1649062588.jpg",
	"noveltype": "(KR)",
	"genre": "Adventure   Comedy   Drama   Fantasy   Romance   ",
	"tags": "Adapted to Manhwa   Aristocracy   Arrogant Characters   Artifacts   Beautiful Female Lead   Betrayal   Caring Protagonist   Character Growth   Charming Protagonist   Clingy Lover   Complex Family Relationships   Couple Growth   Cute Protagonist   Dense Protagonist   Depression   Determined Protagonist   Devoted Love Interests   Doting Love Interests   Dragons   Early Romance   Empires   European Ambience   Familial Love   Family   Family Conflict   Famous Parents   Famous Protagonist   Female Protagonist   First Love   Friendship   Handsome Male Lead   Heartwarming   Heroes   Jealousy   Kingdoms   Love at First Sight   Love Interest Falls in Love First   Loyal Subordinates   Maids   Marriage   Misunderstandings   Multiple POV   Nobles   Parent Complex   Past Plays a Big Role   Past Trauma   Politics   Possessive Characters   Pretend Lovers   Priests   Reincarnation   Royalty   Schemes And Conspiracies   Second Chance   Single Parent   Stoic Characters   Strength-based Social Hierarchy   Strong Love Interests   Sword And Magic   Tragic Past   Transmigration   Tsundere   Unconditional Love   Villainess Noble Girls   Wealthy Characters   ",
	"rating": "(4.1 / 5.0, 191 votes)",
	"author": "Hong Hee Su   Hong Heesu   ",
	"year": "\n2019",
	"ranking": "#1888   #1512   #1182   #2359   #392   ",
	"reviewcount": "35 Reviews sorted by",
	"description": "I’m Jubelian? The daughter of the duke and the villainess of this novel?\n\nI managed to avoid my death with some previous knowledge about my life, as this was my second time at it. Now, I should be able to live a peaceful life!\n\n“I’m not going to marry a man unless he has everything. I want the most wealthy, famous, and competent man there is.”\n\nI dreamt of a glamorous life as the daughter of the duke, but my father tells me the Crown Prince who is known to be a lunatic is to be my husband! As an extraordinary measure, I couldn’t help but start a contract relationship. That is, with a handsome side character that looks better than the main one.\n\n“Why are you trying to avoid being engaged to the prince?”\n\n“He’s scary. I heard that he even kills his own entourage if he doesn’t like them.”\n\nA few days later, the prince sent a terrible letter to me.\n\n“I will not kill you.”\n\nOh no, did I set up another death trap for myself?\n\n>"
}