{
	"url": "https://www.novelupdates.com/series/this-killer-is-easy-to-deceive/",
	"title": "This Killer Is Easy To Deceive - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/10/This-Killer-Is-Easy-To-Deceive.jpg",
	"noveltype": "(CN)",
	"genre": "Josei   Martial Arts   Romance   ",
	"tags": "Ancient China   Assassins   Beautiful Female Lead   Dancers   Early Romance   Female Protagonist   First-time Interc**rse   Multiple Identities   Proactive Protagonist   Secret Identity   Secret Organizations   Seduction   Strong Love Interests   ",
	"rating": "(4.5 / 5.0, 57 votes)",
	"author": "Mo Yan   莫顏   ",
	"year": "\nN/A",
	"ranking": "#2000   #2000   #6089   #7042   #5964   ",
	"reviewcount": "9 Reviews sorted by",
	"description": "*The Four Great Female Constables – Book 2/4\n\n\nThe first time Hua Qianqian met Yeqing, she was angry.\n\n“Are you a killer?”\n\n“Are you a constable?”  \n\nA killer meets a constable.\n\nSimilar to a dog seeing a cat, there are extreme ferocity and a murderous aura.\n\n“I will arrest him and bring him to justice first, then later, you can find a chance to kill him.  Then both of us won’t suffer a loss, what do you say?”\n\nYeqing was speechless.  As a constable, she did not stop him from killing and even negotiated with him?\n\nThe second time they met, she smiled.\n\n“Why didn’t you do a proper job as a killer but work as a male prostitute to let your chrysanthemum be poked?  Did you lose your job?”\n\n“Similarly, you quit your job as a constable and became a dancer, are you unable to hold on to your job?”\n\n“Che! Being a constable is only a part-time job. A dancer makes a lot of money, don’t you know that?”\n\nYeqing was speechless again. Is the unconventional constable making fun of a professional killer?\n\nThe third time they met, she became familiar with him.\n\n“it’s been a long time since we met.  Did you change your job to become a painter? Ah……are you painting me?”\n\nHolding up the portrait she cast an ambiguous look at him.  To be on the receiving end of a secret crush is a bit embarrassing.\n\nYeqing said coldly.  “That is your reward poster.  Someone put up a bounty for your head.”>"
}