{
	"url": "https://www.novelupdates.com/series/those-years-when-i-was-cannon-fodder/",
	"title": "Those Years When I Was Cannon Fodder - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/07/Those-years-when-I-was-Cannon-fodder.jpg",
	"noveltype": "(CN)",
	"genre": "Psychological   Xianxia   ",
	"tags": "Age Progression   Ancient Times   Familial Love   Female Protagonist   Friendship   Mob Protagonist   Pragmatic Protagonist   Proactive Protagonist   Siblings   Slow Growth at Start   Transmigration   Unique Cultivation Technique   Weak to Strong   World Travel   ",
	"rating": "(4.3 / 5.0, 3 votes)",
	"author": "君临lin123   ",
	"year": "\n2021",
	"ranking": "#2000   #2000   #12708   #7720   #11659   ",
	"reviewcount": "No Reviews",
	"description": "At first, Chu Yu thought that she had transmigrated into a typical ancient housefighting novel. And all she had to do was grow up and get married quickly, and then, it would be perfect if her husband died and no one cared about her. Who would have thought that when she walked out of the backyard, she found out, hoho, this is a xianxia with a genius female protagonist- her eldest sister. Her eldest sister, Chu Qiong, had the golden finger of an immortal mansion. Her second sister, Chu Fan, who was suspected of being transmigrated from the same world as her (Captain Chu?), had a golden finger as well.\n\nAnd she, a cannon fodder, the little Chu Yu, having poor qualifications and a short lifespan, vowed that she will never give up and be ridiculed!\n\nShe will fight against fate! Live long!\n\nStrive to live until the end of the world, and live longer than deities.\n\nFortunately, she got a book of exercises that can be automatically practiced.\n\nFortunately, she can sell goods across all dimensions and accumulate resources.\n\nFortunately, she has two lovely sisters who will never give up on her, and think that she is prodigal.\n\nThe road to self-cultivation is extremely cruel, and many amazing and talented people fall halfway, but the three sisters want to see the scenery at the peak of this immortal road.\n\nLeisurely on the fairy road, the sword points to longevity.\n\n>"
}