{
	"url": "https://www.novelupdates.com/series/part-time-taoist-priest/",
	"title": "Part-Time Taoist Priest - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/05/006pqawsgy1fmtcokj85ej30b40fkgnk.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Fantasy   Romance   Shounen Ai   Supernatural   ",
	"tags": "Adapted to Drama CD   Adapted to Manhua   Buddhism   Calm Protagonist   Caring Protagonist   Clever Protagonist   Conditional Power   Dreams   Exorcism   Fast Learner   Feng Shui   Folklore   Ghosts   Handsome Male Lead   Hard-Working Protagonist   Late Romance   Love Interest Falls in Love First   Modern Day   Mystery Solving   Overpowered Protagonist   Pragmatic Protagonist   Quirky Characters   Religions   Slow Romance   ",
	"rating": "(4.5 / 5.0, 99 votes)",
	"author": "Marshmallow Bunny   拉棉花糖的兔子   ",
	"year": "\n2018",
	"ranking": "#2000   #6224   #3751   #7465   #2461   ",
	"reviewcount": "8 Reviews sorted by",
	"description": "The most important duty of a Taoist priest is getting rid of monsters, exorcising ghosts, and raising his temple’s reputation! Xie Lingya, though, is not a Taoist priest. He just has the Immortal Roots…\n\nSome people can learn in a day what takes others ten years of hard work. Xie Lingya is like this–other people have to cleanse themselves and meditate to draw talismans, but he can do it as easy as drinking a glass of water. Unfortunately, in this era, graduating from a renowned university is much more valuable than the talent for cultivation. He who has the Immortal Roots finally chose to study finance.\n\nHowever, the world is unpredictable. His uncle, a Taoist priest, died unexpectedly, leaving his temple to Xie Lingya. His last wish was for his nephew to find the right person to inherit his sect’s teachings.\n\nSo Xie Lingya, who had no intentions to become a Taoist, ended up as… the owner of a Taoist temple. He began to earnestly manage the deserted little place, striving to gain believers. He also struggled to recruit priests, in hope of finding a suitable successor for his uncle. After a chance encounter, his target became Shi Changxuan, who came from an influential Taoist family and had outstanding skills. Not scared off by the man’s aloof personality, he struck up a conversation and tried to get his phone number. He didn’t realize this move could be easily misunderstood…>"
}