{
	"url": "https://www.novelupdates.com/series/after-i-possessed-the-tmall-genie-of-the-school-adonis/",
	"title": "After I Possessed the Tmall Genie of the School Adonis - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/10/After-I-Possessed-the-Tmall-Genie-of-the-School-Adonis.jpeg",
	"noveltype": "(CN)",
	"genre": "Fantasy   Romance   School Life   Shounen Ai   Slice of Life   Supernatural   Yaoi   ",
	"tags": "Academy   Clever Protagonist   Cold Love Interests   Comedic Undertone   Coming of Age   Confident Protagonist   Death of Loved Ones   Doting Love Interests   Eidetic Memory   Familial Love   Family   Family Conflict   First Love   Friendship   Handsome Male Lead   Hard-Working Protagonist   Heartwarming   Kind Love Interests   Late Romance   Love Interest Falls in Love First   Manly Gay Couple   Modern Day   Mysterious Family Background   Slow Romance   Smart Couple   Unconditional Love   ",
	"rating": "(4.6 / 5.0, 227 votes)",
	"author": "Lin Ang Si   林盎司   ",
	"year": "\n2019",
	"ranking": "#2566   #228   #1935   #2002   #1751   ",
	"reviewcount": "53 Reviews sorted by",
	"description": "If life were likened to god rolling the dice, then Lù YúnFēi is a 6. He’s handsome and smart, save for his abysmal proficiency in English. That is until he met Biān JìnYuán — Bian JinYuan is tall and cool, top of his grade in every exam, and his English results definitely destroy Lu YunFei’s twice over. If he’s a 6, then this guy is simply 666!\n\nSince YunFei is already here, why would there be a need for JinYuan? It’s hard for a mountain to accommodate two tigers, unless one is a male while the other is female. Lu YunFei looked at the other party’s gender, and silently crossed that thought out.\n\nHowever, not long after he started to treat Bian JinYuan as a rival, he found that after 9pm, he would mysteriously possess Bian JinYuan’s Tmall Genie. (A cat mascot similar to Amazon Alexa or Google Home.)\n\nAfter possessing the Tmall Genie, Lu YunFei realised that his rival is actually a pauper prince. Lu YunFei who possessed looks, height, and wealth looked at his cards which were almost overflowing with money, and decided to establish his friendship relations. Therefore, since Bian JinYuan lacked money, Lu YunFei hired him to be his English tutor.\n\nBian JinYuan bought a cake and couldn’t bear to eat it so that he could bring it home for his family. Lu YunFei bought him a large slice of cake the next day.\n\nHaving done good deeds everyday, Lu YunFei felt that the invisible red scarf on his chest had gotten brighter.\n\nUntil there was a hot post on the school forum: 《Exposé on Lu YunFei – getting the top student to be your lackey, do you really think that it’s all that to have money! 》\n\nThe original poster listed down various instances: bag-carrying, bringing water, peeling chestnuts; the school genius was ordered about as if he were a servant. Everyone was enjoying the gossip, when Bian JinYuan who had never posted in the forum before, posted for the first time with his real name.\n\nBian JinYuan: I don’t need the money, I’m willing, why do you care?\n\nEveryone was scared dumb.\n\nLu YunFei worried about whether he should bother Bian JinYuan less.\n\n“That’s not necessary, I like being bothered by you.”\n\n“Forget it,” Lu YunFei rejected.\n\nBian JinYuan thought for a bit: “Then let me rephrase — that’s not necessary, I like you.”\n\nLu YunFei: ???!!!\n\nLu YunFei never expected that the mountain is wide and holds many types of tigers. Together, two male tigers can not only run fast, but also fall in love!>"
}