{
	"url": "https://www.novelupdates.com/series/welcome-to-the-nightmare-live/",
	"title": "Welcome to the Nightmare Live - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/06/Welcome-to-the-Nightmare-Live.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Comedy   Drama   Horror   Mystery   Shounen Ai   Supernatural   Yaoi   ",
	"tags": "Acting   Black Belly   Charming Protagonist   Clever Protagonist   Comedic Undertone   Cunning Protagonist   Ghosts   Handsome Male Lead   Hard-Working Protagonist   Human-Nonhuman Relationship   Male Yandere   Manipulative Characters   Mystery Solving   Proactive Protagonist   Protagonist Strong from the Start   Shameless Protagonist   Slow Romance   Strong Love Interests   Unlimited Flow   Unlucky Protagonist   ",
	"rating": "(4.6 / 5.0, 80 votes)",
	"author": "Tang Ốc   桑沃   ",
	"year": "\n2021",
	"ranking": "#604   #373   #3980   #762   #3090   ",
	"reviewcount": "12 Reviews sorted by",
	"description": "Wen Jianyan was a fraudster that was best at deceiving people.\n\nOne day, he was suddenly forced to become a novice anchor in the Nightmare live broadcast room.\n\nWen Jianyan: “…..”\n\nA newcomer became the most-watched anchor because he was too good at deceiving people.\n\nHe lied to his teammates to deceive the audience and NPCs. He could deceive people as well as ghosts.\n\nSooner or later this guy will overturn!\n\nThere were more and more spectators who were gloating with schadenfreude, looking forward for that day.\n\nBut…why was the mission in this live room getting more and more strange?\n\n【Senior achor’s side quest: Kiss the evil spirit for 30 seconds】\n\n【Reward: Unknown】\n\n【Top anchor’s main quest: Undress the evil god for three minutes】\n\n【Reward: Unknown】\n\nAudience: Oh, the streamer has mastered a new wealth code? Hurry up, there’s something our paying viewers can’t watch!\n\nThe top boss approached step by step, whispering temptations:\n\n“How is it? Selling CP? We can make the fake thing real.”\n\nWen Jianyan: “…..”\n\nI’m sorry, I’m very principled, thank you for not deceiving yourself.\n\n— Don’t come here!>"
}