{
	"url": "https://www.novelupdates.com/series/my-son-is-a-reborn-villain/",
	"title": "My Son is a Reborn Villain - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/11/000000.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Drama   Fantasy   Romance   Slice of Life   ",
	"tags": "Abandoned Children   Age Progression   Beautiful Female Lead   Childcare   Cute Children   Familial Love   Family Conflict   Female Protagonist   Handsome Male Lead   Late Romance   Love Interest Falls in Love First   Modern Day   Multiple POV   Multiple Protagonists   Multiple Reincarnated Individuals   Mysterious Family Background   Orphans   Pregnancy   Reincarnation   Second Chance   Showbiz   Single Parent   Transmigration   Wealthy Characters   ",
	"rating": "(4.3 / 5.0, 276 votes)",
	"author": "余书乔   ",
	"year": "\n2020",
	"ranking": "#213   #597   #714   #540   #963   ",
	"reviewcount": "65 Reviews sorted by",
	"description": "Chi Wen’s short life has been bumpy. Ever since he could remember things, he was already living in the orphanage, growing up without a family. Later, he entered the entertainment industry and became a first generation film emperor. However, he finally ended up in ruin. In the end, Chi Wen jumped off the top floor of a building, but did not expect that he would get a chance to open his eyes again…\n\nBack to his infancy, Chi Wen coldly looked at the woman who was laughing stupidly in front of him. He waited, waited until the moment she finally abandoned him.\n\n…\n\n　Fu Yuanruo was transmigrated as the cannon fodder in the novel ‘First Generation Movie Queen.’ When she first transmigrated, it happened to be the plot point when the malicious cannon fodder tried to frame the female lead for the last time. After that, her evil deeds would be exposed. The whole netizens mocked, and her father angrily drove her out of the house. A former wealthy and pampered young miss fall into the mud and finally died after accidentally falling into the water…\n\nBecause of the high popularity of the original book, the author used the daughter of the original female and male lead as the protagonist for the second book. The villain who had been against the main couple of this sequel also met his just end and died tragically. After his death, the female lead let out some vague words that made readers speculated that this villain was the illegitimate son of the prequel’s cannon fodder.\n\nAfter recalling the plot, Fu Yuanruo stared at the pregnancy report in her hand. She was torn: should she give birth or not?>"
}