{
	"url": "https://www.novelupdates.com/series/phoenix-top-and-dragon-bottom/",
	"title": "Phoenix Top and Dragon Bottom - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/09/Phoenix-Top-and-Dragon-Bottom.jpg",
	"noveltype": "(CN)",
	"genre": "Xuanhuan   Yaoi   ",
	"tags": "Cultivation   Enemies Become Lovers   Second Chance   ",
	"rating": "(4.3 / 5.0, 24 votes)",
	"author": "涯兮   ",
	"year": "\n2013",
	"ranking": "#2000   #2000   #9587   #11077   #9658   ",
	"reviewcount": "1 Review sorted by",
	"description": "The moment the two swords met, the bleak smile in Feng Xuanyang’s eyes made him instantly astonished, as if he was about to lose something important, causing his heart to be squeezed tightly and he couldn’t breathe. However, when he want to regret, it is hard to recover.The hand holding the Chi Huang sword dropped slowly before him, and the cold sharp sword immediately entered the body with the piercing sound of meat, drawing away the hot blood. Feng Xuanyang smiled miserably, the smile that was about to die, reflecting the red lotus mark, splendid the whole world. He slowly stretched out his hand and pulled hard, and the sword was completely submerged in his heart. But-he also embraced the man in blue that he thought about day and night.\n\n“Qing Han, I have been tired for more than 20 years..The scenery in front of him began to become misty and misty, and his arrogant life was about to come to an end, “I would like to one day, hand in hand with you in Jianghu , the world is old…”\n\n——If there is an afterlife, I just hope that we will come again, Qinghan… Qinghan…\n\n‘Who said that fire and water were never compatible, who said that you and I were destined to kill each other.’ \n\nIn the vast world, the red sun reflected the sad silhouettes of the couple embracing and kissing, casting a sad blood.\n\n‘——Xuanyang, let us walk in Naihe Bridge and drink Mengpo Tang together .’\n\n‘——Xuanyang, wait for me, wait for me…’\n\nThe sound of flowing water came from his ears, it was the cold rain or the tears of broken strings. Opening his eyes leisurely from the confusion, Long Qinghan looked at the surrounding scenery with his eyes.}>"
}