{
	"url": "https://www.novelupdates.com/series/evil-emperors-wild-consort/",
	"title": "Evil Emperor’s Wild Consort - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/03/Evil-Emperors-Wild-Consort.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Fantasy   Josei   Martial Arts   Romance   Xianxia   ",
	"tags": "Amnesia   Arrogant Characters   Beast Companions   Beautiful Female Lead   Calm Protagonist   Clever Protagonist   Cold Protagonist   Complex Family Relationships   Cultivation   Devoted Love Interests   Doctors   Doting Love Interests   Dragons   Family Conflict   Female Protagonist   Genius Protagonist   Handsome Male Lead   Love Interest Falls in Love First   Loyal Subordinates   Magical Space   Medical Knowledge   Mysterious Family Background   Mythical Beasts   Persistent Love Interests   Pets   Phoenixes   Poisons   Politics   Popular Love Interests   Possessive Characters   Power Couple   Reincarnation   Ruthless Protagonist   Sister Complex   Slow Romance   Special Abilities   Spirits   Strong Love Interests   Strong to Stronger   Summoning Magic   Time Skip   ",
	"rating": "(4.0 / 5.0, 614 votes)",
	"author": "Xiao Qi Ye   萧七爷   ",
	"year": "\n2015",
	"ranking": "#6970   #6242   #94   #880   #589   ",
	"reviewcount": "84 Reviews sorted by",
	"description": "She has come a long way. \n\nOrphaned, born a weakling, and being the infamous good-for-nothing of Azure Dragon Country. Gu Ruoyun was the shame of the proud Gu household. Falsely accused of a crime she did not commit, she was betrayed by her family and beaten to death by her own grandfather. But life took a fateful twist on that very day — she was revived. \n\nNewly awakened, she is now the Master of an ancient treasure that resides within her body. Precious cultivation pills, treasures beyond her wildest imagination and spiritual beasts, all within her grasp… She is the apple of the eye of all under the heavens, including that of a mysterious, handsome man.\n\nNow she only has one goal — to conquer the world.>"
}