{
	"url": "https://www.novelupdates.com/series/the-villain-has-something-to-say/",
	"title": "The Villain Has Something to Say - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/01/4877s.jpg",
	"noveltype": "(CN)",
	"genre": "Drama   Mature   Romance   Tragedy   Xianxia   Yaoi   ",
	"tags": "Adapted to Manhua   Androgynous Characters   Beasts   Brotherhood   Calm Protagonist   Caring Protagonist   Charming Protagonist   Cold Love Interests   Cultivation   Demons   Destiny   Devoted Love Interests   Doting Love Interests   Famous Protagonist   First-time Interc**rse   Genius Protagonist   Hard-Working Protagonist   Long Separations   Lovers Reunited   Manly Gay Couple   Master-Disciple Relationship   Misunderstandings   Multiple Reincarnated Individuals   Mystery Solving   Older Love Interests   Playful Protagonist   Popular Love Interests   Possessive Characters   Power Couple   Proactive Protagonist   Protagonist Falls in Love First   Reincarnation   Second Chance   Strong Love Interests   Strong to Stronger   Sword Wielder   Time Skip   Time Travel   Transmigration   Unconditional Love   Unique Cultivation Technique   ",
	"rating": "(4.3 / 5.0, 275 votes)",
	"author": "Mo Chen Huan   莫晨欢   ",
	"year": "\n2016",
	"ranking": "#4080   #6348   #1073   #9500   #443   ",
	"reviewcount": "63 Reviews sorted by",
	"description": "As the head disciple of the number one sect in the world, Luo Jianqing had a brilliant reputation. He was the most respected senior brother of his junior brothers and sisters: the last disciple of the cultivation world’s number one cultivator, Luo Jianqing greatly respected his master’s teachings, not crossing his limits by even half a step.\n\nAfterwards…… he was stabbed to death just like that by the main character with his sword. His master’s sword.\n\nLuo Jianqing: “……”\n\nThe heavens wants me dead, yet I refuse to die! See if the will of the heavens is more fearsome, or if the will of my sword is more stubborn!\n\nWu Yin: “Jianqing, I have something to say to you.”\n\nLuo Jianqing: “Master, I also have something to say to you.”\n\nWu Yin: “… you speak first?”\n\nLuo Jianqing: “You speak first.”\n\nWu Yin: “I like you.” \n\nLuo Jianqing: “I want to top you.”\n\nWu Yin: “……”>"
}