{
	"url": "https://www.novelupdates.com/series/imperfections/",
	"title": "Imperfections - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2018/07/Imperfections.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Drama   Mecha   Romance   Sci-fi   Shounen Ai   ",
	"tags": "Adapted to Anime   Adapted to Drama CD   Adapted to Manhua   Androids   Anti-social Protagonist   Appearance Different from Actual Age   Arms Dealers   Army   Arrogant Characters   Artificial Intelligence   Award-winning Work   Betrayal   Biochip   Calm Protagonist   Character Growth   Charismatic Protagonist   Clever Protagonist   Confident Protagonist   Cosmic Wars   Couple Growth   Death of Loved Ones   Depictions of Cruelty   Devoted Love Interests   Discrimination   Dystopia   Engineer   Famous Protagonist   Former Hero   Futuristic Setting   Handsome Male Lead   Hiding True Identity   Human Experimentation   Leadership   Loyal Subordinates   Manipulative Characters   Manly Gay Couple   Marriage   Mature Protagonist   Military   Multiple Identities   Multiple POV   Murders   Mutated Creatures   Near-Death Experience   Organized Crime   Outer Space   Past Plays a Big Role   Pirates   Politics   Power Couple   Protagonist Strong from the Start   Psychic Powers   Quirky Characters   Ruthless Protagonist   Schemes And Conspiracies   Scientists   Smart Couple   Social Outcasts   Soldiers   Stoic Characters   Teachers   Technological Gap   Unconditional Love   Unique Weapons   Unlucky Protagonist   Younger Love Interests   ",
	"rating": "(4.5 / 5.0, 236 votes)",
	"author": "Priest   ",
	"year": "\n2017",
	"ranking": "#4265   #3594   #2523   #1759   #872   ",
	"reviewcount": "39 Reviews sorted by",
	"description": "It was the best of times, it was the worst of times.\n\n—— Dickens《A Tale of Two Cities》\n\nI took my hatred and plot for revenge with me down the mire, to the depths of the abyss, and returned as a ghost of the past. I want to plant the seeds of the rotten truth, nourish their deadly thorns with fresh blood so that they grow and pierce through this civilization built on lies. \n\nI reached the bottom of the abyss...only to find a shining star. >"
}