{
	"url": "https://www.novelupdates.com/series/love-from-the-male-protagonists-harem/",
	"title": "Love from the Male Protagonist’s Harem - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/04/Love-from-the-Male-Protagonists-Harem.png",
	"noveltype": "(CN)",
	"genre": "Comedy   Drama   Historical   Romance   Xianxia   Yuri   ",
	"tags": "Ancient China   Beautiful Female Lead   Bisexual Protagonist   Character Growth   Cold Love Interests   Corruption   Cross-dressing   Cruel Characters   Dense Protagonist   Female Protagonist   Flashbacks   Kind Love Interests   Loneliness   Love Interest Falls in Love First   Mysterious Past   Non-linear Storytelling   Past Plays a Big Role   Possessive Characters   Schemes And Conspiracies   Secret Identity   Shameless Protagonist   Slow Romance   Strong Love Interests   Yandere   ",
	"rating": "(4.3 / 5.0, 46 votes)",
	"author": "楚柒墨   ",
	"year": "\n2018",
	"ranking": "#1553   #1195   #4166   #1283   #6168   ",
	"reviewcount": "9 Reviews sorted by",
	"description": "Wearing the game upgrade system into a stallion text, Xia Ge felt that she was suffocating. After several thoughts, Xia Ge, who is familiar with the plot, decided to hold the male protagonist’s thick thighs tightly. Then…cuckolded him.\n\nXia Ge: I really didn’t mean to OTZ\n\nMale protagonist (drawing a knife): Ha ha.\n\nSerious old-fashioned master sister (in contemplation: I think I like you.)\n\nXia Ge: …Don’t be like this. I’m scared.\n\nHot-tempered killer young lady: I think you look pretty!\n\nXia Ge: Thank you, you are also pretty _(:3」∠)_, but just look at it (desperate.JPG)\n\nBeautiful devil woman: Do you want to die or marry?\n\nXia Ge: I want to go home TAT\n\nLater, Xia Ge left and thought about it.\n\nI always feel that I am not the one teasing the harem of the male protagonist, but was teased by the male protagonist’s harem instead (violent tears)\n\n——Xia Ge, listen, from now on, I will be your magnificent army with thousands of men and horses, and you will be incomparable in the whole world.>"
}