{
	"url": "https://www.novelupdates.com/series/our-tyrant-became-young/",
	"title": "Our Tyrant Became Young - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/05/Our-Tyrant-Became-Young.jpg",
	"noveltype": "(KR)",
	"genre": "Action   Adventure   Comedy   Fantasy   Romance   Shoujo   Slice of Life   ",
	"tags": "Appearance Different from Actual Age   Aristocracy   Curses   Early Romance   Female Protagonist   Nobles   Reincarnated in Another World   Reincarnation   Royalty   Shota   ",
	"rating": "(4.3 / 5.0, 12 votes)",
	"author": "Koara   코오아라   ",
	"year": "\n2020",
	"ranking": "#6970   #3783   #9728   #7988   #7484   ",
	"reviewcount": "2 Reviews sorted by",
	"description": "I had possessed a character inside of a book. Into the book where I pushed the ‘ Female Lead x Emperor’ pairing. The day I shed tears over the two characters that don’t end up together, I was sent here to experience the whole story. Of course I am!\n\n“Stand in line to hear my prophecy!”\n\nI began to make money from the contents of the book. Guys! You don’t have to end up together, but you have a lot of money but I don’t. So after three months, I am brought to the Imperial City by the name of the Emperor after spending money in prophecy, following the original truth, the law of Man-go, the golden almighty. Then I met the Emperor for the first time–\n\n“You know everything.”\n\n“Yes, I know a lot.”\n\n“Yes, then can you tell me when I’ll come back to my original state.”\n\nFinally, the emperor appeared beyond the white cloth was a four-year-old kid.\n\n…why is he so young?\n\n***\n\nOne day, in order not to be caught pretending to be a fake prophet, she struggled to find a way to solve the curse next to the baby emperor. He asked.\n\n“Don’t you see me as a baby?”\n\n“Yes.”\n\nPersyllion’s eyebrows raised because of her firm answer. He didn’t like her simple reaction, so he looked at her face and raised his thumb.\n\n“You look like a baby who is the cutest, most thrilling, and always gives us new cuteness……?”\n\n“…….”\n\n“Like an angel from heaven that had a task to defeat all evil with your cuteness!”\n\n“Get out!”\n\nEven before he finished talking, Persyllion threw a rabbit doll. Eyy, I should have bought a cat doll instead of a rabbit doll.>"
}