{
	"url": "https://www.novelupdates.com/series/devils-son-in-law/",
	"title": "Devil’s Son-in-Law - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/11/Devils-SoninLaw.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Fantasy   Harem   Mature   Xuanhuan   ",
	"tags": "Alchemy   Angels   Artifacts   Artificial Intelligence   Beautiful Female Lead   Blacksmith   Caring Protagonist   Cheats   Clever Protagonist   Cold Love Interests   Cultivation   Cunning Protagonist   Demi-Humans   Dragons   Dwarfs   Early Romance   Elves   Enemies Become Allies   Enemies Become Lovers   Eye Powers   Fast Cultivation   First-time Interc**rse   F*llatio   Game Elements   Gods   Harem-seeking Protagonist   Hidden Abilities   Hiding True Identity   Human-Nonhuman Relationship   Inheritance   Kingdom Building   Kingdoms   Loli   Magic Formations   Male Protagonist   Misunderstandings   Multiple Identities   Multiple Realms   Older Love Interests   Perverted Protagonist   Phoenixes   Politics   Polygamy   Pregnancy   Proactive Protagonist   Protagonist Falls in Love First   Reverse R*pe   Romantic Subplot   R*pe   Schemes And Conspiracies   Sentient Objects   Seven Deadly Sins   Slow Romance   Strong Love Interests   System Administrator   Threesome   Time Skip   Transmigration   Underestimated Protagonist   Unique Cultivation Technique   Weak to Strong   World Travel   Younger Love Interests   ",
	"rating": "(3.9 / 5.0, 219 votes)",
	"author": "点精灵   ",
	"year": "\n2014",
	"ranking": "#374   #261   #542   #591   #1331   ",
	"reviewcount": "36 Reviews sorted by",
	"description": "Chen Rui, a gamer from earth, is reborn in a human body in another world, falling into the legendary, evil, brutal Demon Realm, inhabited by Devils called Mozu and where humans are treated as food. He has to survive while facing horrifying devils, poison dragons, and a variety of powerful enemies by using on a strange Super System chip and his wits, surrounded by the Devil’s beauties such as the black-bellied lolita princess, the iceberg queen, the violent scythe, and the charming succubus.\n\nWanting to live in the Devil’s world is hard! Wanting to live in the Devil’s world as a human is harder! Wanting a human to be the devil’s son-in-law is hardest!\n\nLet us see how a small otaku uses his power and strategy step by step starting from an ordinary human to writing the legend as the devil’s greatest son-in-law.>"
}