{
	"url": "https://www.novelupdates.com/series/i-am-a-gao-fushuai-villain/",
	"title": "I am a Gao Fushuai Villain - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/06/gaofushuai1.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Drama   Harem   Martial Arts   Mystery   Romance   Xuanhuan   ",
	"tags": "Accelerated Growth   Alternate World   Antihero Protagonist   Beautiful Female Lead   Black Belly   Bodyguards   Broken Engagement   Business Management   Businessmen   Calm Protagonist   Carefree Protagonist   Caring Protagonist   Charismatic Protagonist   Clever Protagonist   Cold Love Interests   Confident Protagonist   Cunning Protagonist   Doctors   Early Romance   First-time Interc**rse   F*llatio   Gangs   Genius Protagonist   Handsome Male Lead   Harem-seeking Protagonist   Jack of All Trades   Level System   Loyal Subordinates   Male Protagonist   Manipulative Characters   Medical Knowledge   Mercenaries   Modern Day   Netori   Older Love Interests   Playboys   Polygamy   Ruthless Protagonist   Shameless Protagonist   Strong Love Interests   System Administrator   Threesome   Transmigration   Twins   Wealthy Characters   Younger Love Interests   ",
	"rating": "(3.8 / 5.0, 376 votes)",
	"author": "向往的都市神豪   ",
	"year": "\n2019",
	"ranking": "#129   #70   #507   #144   #1632   ",
	"reviewcount": "63 Reviews sorted by",
	"description": "Lin Yuan traversed to an urban romance novel. His identity is a Gao Fushuai  and he is also a villain. Fortunately, he can make choices to get corresponding rewards. Note- Gao Fushuai means tall, rich, and handsome (Mr.Perfect).\n\n【Ding! The heroine expressed her disgust for you! Please make a choice! 】\n\n【Choice 1: Be the embodiment of licking dog and apologize to her. Reward: ‘Master Level Martial Arts’! 】\n\n【Choice 2: Resolutely retire from marriage, refuse to lick the dog! Reward: ‘God-level Medical Skills’! 】\n\nHe can also grab the opportunities of the protagonist and plunder his luck to get stronger.\n\n“Ding! Charm is increased by 50 points!”\n\n“Ding! Strength is increased by 20 points!”\n\nWho says that the villain is destined to be trampled by the protagonist?\n\nI want to personally smash the protagonist’s halo!\n\nSystem: Now you are the protagonist.\n\n“No, I just want to be a villain.”>"
}