{
	"url": "https://www.novelupdates.com/series/ill-just-live-on-as-a-villainess/",
	"title": "I’ll Just Live On As A Villainess - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/05/Ill-Just-Live-As-A-Villain.jpg",
	"noveltype": "(KR)",
	"genre": "Comedy   Fantasy   Romance   Shoujo   ",
	"tags": "Adapted to Manhwa   Aristocracy   Beautiful Female Lead   Boss-Subordinate Relationship   Broken Engagement   Calm Protagonist   Caring Protagonist   Coming of Age   Contracts   Cute Story   Demons   Dense Protagonist   Devoted Love Interests   Dwarfs   Elves   European Ambience   Fantasy World   Female Protagonist   Handsome Male Lead   Hiding True Abilities   Kind Love Interests   Knights   Love Interest Falls in Love First   Loyal Subordinates   Magic Beasts   Master-Servant Relationship   Misunderstandings   Nobles   Older Love Interests   Quirky Characters   Reincarnation   Royalty   Strong Love Interests   Sword And Magic   Transmigration   Villainess Noble Girls   ",
	"rating": "(4.1 / 5.0, 111 votes)",
	"author": "Kim Daham   김다함   ",
	"year": "\n2018",
	"ranking": "#2000   #2000   #3191   #3008   #1427   ",
	"reviewcount": "14 Reviews sorted by",
	"description": "I reincarnated into a villain from a book that attempted murder!\r\n\r\nBut…\r\n\r\n“I didn’t do it, so why do I have to fix it?”\r\n\r\nI thought about it for a moment. Let’s just get it over with!\r\n\r\n“…It’s cold, isn’t it?”\r\n\r\nI was banished somewhere cold. Extremely cold.\r\n\r\nI’m about to die, but I only have piles of woods that don’t burn well!\r\n\r\nI called out to Theoharis, the demon of flames, to live, and…\r\n\r\n“You called me just to light a fire?”\r\n\r\n“All right, just quickly light it.”\r\n\r\nThis demon is an inexhaustible nuisance!\r\n\r\n“You called me. So you should be responsible for me.”\r\n\r\n“Be responsible? Why should I?”\r\n\r\n“The contract is for life.”\r\n\r\nHey, I just wanted to light a fire!\r\n\r\nThis is a story about a villain who wants to live peacefully, and the demon Theoharis, who wants to have his contract fulfilled.\r\n\r\nKim Da-ham’s featured romance fantasy novel,>"
}