{
	"url": "https://www.novelupdates.com/series/welcome-to-the-bad-end-route-looks-like-its-heading-towards-a-bad-end-so-ill-take-the-harem-end-route-instead/",
	"title": "Welcome, to the Bad End Route ~Looks Like It’s Heading Towards a Bad End, so I’ll Take the Harem End Route Instead~ - Novel Updates",
	"image": "https://www.novelupdates.com/img/noimagefound.jpg",
	"noveltype": "(JP)",
	"genre": "Comedy   Drama   Harem   Romance   School Life   Slice of Life   ",
	"tags": "Beautiful Female Lead   Handsome Male Lead   Male Protagonist   Modern Day   Multiple POV   Netori   Older Love Interests   Polygamy   Senpai-Kouhai Relationship   Tsundere   Younger Love Interests   ",
	"rating": "(3.9 / 5.0, 27 votes)",
	"author": "酔いどれ悪魔   ",
	"year": "\n2022",
	"ranking": "#24   #61   #5672   #105   #8059   ",
	"reviewcount": "3 Reviews sorted by",
	"description": "“Sorry, I’m going out with my friends today.”\n\nThis was what Tendou Susumu, the popular protagonist, told the girls.\n\nThat voice woke up something in me, Jimichi Ikuto, someone who was simply leading an ordinary life, and spurned me to action.\n\nI got my hair done and dyed it a bit, switched from glasses to contacts, then finally made the most out of my parent’s connections.\n\nI, who had changed a lot in both appearance and personality, had gathered people around me. However, I wasn’t interested in them at all.\n\nWhat caught my attention more were the four female students that surrounded Susumu Tendou. Although apparently, all of them took a liking to Tendou.\n\nBut you, why the hell are you like that? If you just kept your mouth shut and had let the things stay as it was, it would be a normal, happy ending.\n\nAh, you were the one at fault, weren’t you? Those girls came to me because you kept on making choices like that.\n\nThis was the first time I had come this far…hmm? What was I talking about? I didn’t even know anymore.\n\nBut for some reason, I just felt compelled to say this. “Welcome, to the Bad End Route.”>"
}