{
	"url": "https://www.novelupdates.com/series/the-reborn-otakus-code-of-practice-for-the-apocalypse/",
	"title": "The Reborn Otaku’s Code of Practice for the Apocalypse - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/09/The-Reborn-Otakus-Code-of-Practice-for-the-Apocalypse.jpeg",
	"noveltype": "(CN)",
	"genre": "Action   Adult   Adventure   Mature   Romance   Slice of Life   Supernatural   Yaoi   ",
	"tags": "Adopted Children   Apocalypse   Average-looking Protagonist   Calm Protagonist   Couple Growth   Devoted Love Interests   Early Romance   Farming   Handsome Male Lead   Hard-Working Protagonist   Heartwarming   Leadership   Love Interest Falls in Love First   Loyal Subordinates   Lucky Protagonist   Mature Protagonist   Pets   Post-apocalyptic   Power Couple   Reincarnation   Second Chance   Smart Couple   Special Abilities   Strategic Battles   Strong Love Interests   Survival   Teamwork   Time Travel   Zombies   ",
	"rating": "(4.4 / 5.0, 710 votes)",
	"author": "Warm Charge   暖荷   ",
	"year": "\n2016",
	"ranking": "#1740   #787   #307   #530   #260   ",
	"reviewcount": "170 Reviews sorted by",
	"description": "Lacking a pocket dimension, power,  a thigh to hug onto, and the three life advantages (money, power, and looks), he had been cautiously living in the apocalypse for ten years, getting closer to falling inside the zombie’s mouths. \n\nUnexpectedly, he had the terrible luck, to be caught in a fight between two gangs and die, it really left people feeling disappointed. When he opened his eyes, he had returned to a decade ago, three months before the apocalypse!\n\nLike before he still lacked an ability, an ordinary person without a pocket dimension, but he did have ten full years of experience living in the apocalypse! Even if he didn’t fight zombies, didn’t hunt monsters, he could still live a carefree farming life in the safe zone.\n\nFind a safe house, utilise all kinds of skills from his previous life to farm in exchange for meat, and if possible, find a person to peacefully spend the rest of his life with; ordinary people had their own ordinary little pieces of happiness.\n\nOriginally believing he had picked up a beauty he returned home to prepare a golden house, but on the contrary he was the one being pushed down……someone once said, whether it is people or matters, by no means can you only look at the surface!>"
}