{
	"url": "https://www.novelupdates.com/series/the-omega-cant-pretend-to-be-a-beta-after-accidentally-witnessing-the-major-generals-susceptible-period/",
	"title": "The Omega Can’t Pretend to Be a Beta After Accidentally Witnessing the Major General’s Susceptible Period - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/08/The-Omega-Cant-Pretend-to-Be-a-Beta-After-Accidentally-Witnessing-the-Major-Generals-Susceptible-Period.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Comedy   Fantasy   Mecha   Romance   Shounen Ai   Supernatural   ",
	"tags": "Artificial Intelligence   Crime   Genius Protagonist   Introverted Protagonist   Military   Mystery Solving   Older Love Interests   Omegaverse   Outer Space   Secret Identity   Secretive Protagonist   Smart Couple   ",
	"rating": "(4.3 / 5.0, 27 votes)",
	"author": "Fei Tang   翡唐   ",
	"year": "\n2021",
	"ranking": "#419   #1129   #7244   #1081   #7972   ",
	"reviewcount": "4 Reviews",
	"description": "The top alpha, Major General Ji Cheying, disguises himself as a down-on-his-luck beta in order to carry out a secret mission. One day, when he goes out to take out the garbage, while wearing a pair of torn socks, he comes across the poor nephew of his landlord, Xie Quan, a good-looking beta who was staying in the dirty and terrible basement.\n\nThe two look at each other, each feeling a little sorry for the other.\n\nNo one expected that one of these two miserable people was the prestigious Major General Ji and the other was the most powerful mecha engineer in the Empire. And to Ji Cheying’s further surprise, this beautiful beta confessed his passionate love for him!\n\nHe was torn again and again under the prudent choice to refuse the other, after all, this is a mission, not the time to talk about love.\n\nWhen the mission was over and it was time to talk about love, it was Xie Quan’s turn to become baffled, “Who do you think likes you? Who confessed? I didn’t, I’m not, don’t talk nonsense.”\n\nJi Cheying: ???!\n\nIt was only then that Xie Quan unexpectedly realized that the Imperial Major General seemed to have mistakenly thought that he was in love with him.\n\nA few months later, Major General Ji, who had entered his susceptible period, was violent and fierce, not able to be approached by strangers. However, his eyes were red and he was tugging at Xie Quan, his voice hoarse, “You little liar, cheating on my feelings and not taking responsibility.”\n\nXie Quan sighed, lifted his hair, and tore off the invisible gland patch, finally revealing the omega gland at the back of his neck, “Bite it. I’ll give you a bite.”\n\nJi Cheying gritted his teeth, “You’re a f*cking omega?”\n\nTrue love has nothing to do with identity and gender.>"
}