{
	"url": "https://www.novelupdates.com/series/nine-yang-sword-saint/",
	"title": "Nine Yang Sword Saint - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2016/12/23-691-0-1b.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adult   Ecchi   Harem   Martial Arts   Mature   Sci-fi   Xuanhuan   ",
	"tags": "Accelerated Growth   Army Building   Arranged Marriage   Average-looking Protagonist   Beautiful Female Lead   Betrayal   Bloodlines   Clan Building   Confident Protagonist   Cultivation   Determined Protagonist   Enemies Become Allies   Enemies Become Lovers   Fast Cultivation   Friends Become Enemies   Genius Protagonist   Male Protagonist   Netori   Older Love Interests   Politics   Polygamy   Pregnancy   Revenge   Romantic Subplot   R*pe   Special Abilities   Strategic Battles   Strength-based Social Hierarchy   Sword Wielder   Technological Gap   Transplanted Memories   Transported to Another World   Underestimated Protagonist   Wars   Weak to Strong   ",
	"rating": "(3.7 / 5.0, 262 votes)",
	"author": "Silent Cake And Pastries   Silent Pastry   沉默的糕点   ",
	"year": "\n2013",
	"ranking": "#2000   #2000   #1616   #6619   #1775   ",
	"reviewcount": "28 Reviews sorted by",
	"description": "Freshman student Yang Dingtian possesses the Nine Yang Body, found only 1 in million. His Yang Fire is incomparably vigorous and thus, he cannot be near a female’s charms for his entire life. On the night of his 19th birthday, he decided to bid farewell to his virgin life. After stealing and tasting the forbidden fruit, he spontaneously combusted as the result! \n\nIn death he crossed over to another world; a world that held respect for Martial Power. His, originally, catastrophic Nine Yang Body was the Nine Yang Body that couldn’t be seen in a millennium! He was saved by a mysterious old man when he was at his last moments and the old man received him for a disciple, then betrothed his daughter to him. Thus, in this odd way, Yang Dingtian became the successor of the largest clan under Heaven, and became the number-one-beauty-under-heaven’s fiance.>"
}