{
	"url": "https://www.novelupdates.com/series/delivery-boy-and-masked-girl-a-delivery-boy-discovers-the-secret-of-a-beautiful-gal-at-his-delivery-destination/",
	"title": "Delivery Boy and Masked Girl – A Delivery Boy Discovers the Secret of a Beautiful Gal at His Delivery Destination - Novel Updates",
	"image": "https://www.novelupdates.com/img/noimagefound.jpg",
	"noveltype": "(JP)",
	"genre": "Comedy   Romance   School Life   Slice of Life   ",
	"tags": "Beautiful Female Lead   Kind Love Interests   Male Protagonist   Modern Day   Part-Time Job   ",
	"rating": "(4.0 / 5.0, 31 votes)",
	"author": "丸深 丸深 (まろやか)   ",
	"year": "\n2021",
	"ranking": "#4617   #3598   #5399   #4124   #7201   ",
	"reviewcount": "3 Reviews sorted by",
	"description": "One day, Hasumi Yuuga, a boy who works part-time at an online food delivery service, has to deliver a package to the house of Shizuki Miori, a beautiful gal who’s a part of his class.\r\n\r\nHowever, when he reaches her place and watches the door open, he finds out that the girl was dressed in a very subdued and simple outfit, quite the opposite of the flamboyant figure that she usually looks like in class.\r\n\r\n'P-Please don't tell anyone about this...?'\r\n\r\n'I don't really care, I won't tell anyone.'\r\n\r\nA gal with a big heart yet she’s just a normal girl at home. The two share such a secret, and continue to interact through various more deliveries. They fix a broken router together, lend and borrow manga from time to time, and one day Yuuga takes shelter from the rain in Miori's room.\r\n\r\nIn this way, Yuga gradually becomes the only person that Shizuki can actually trust.\r\n\r\n'Can we stay like this... just for a little bit longer...?'\r\n\r\n'I'm sorry for hugging you all of a sudden...'\r\n\r\n'Hasumi-kun, why are you helping me out so much...?'\r\n\r\nYuuga, who is an unsociable but meddlesome person, and Miori, who is unable to reveal her true self to anyone. This is a delivery-type romantic comedy about two such people.>"
}