{
	"url": "https://www.novelupdates.com/series/i-rely-on-selling-meng-to-upgrade/",
	"title": "I Rely On Selling Meng To Upgrade - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/05/output-onlinejpgtools.jpg",
	"noveltype": "(CN)",
	"genre": "Adventure   Comedy   Fantasy   Romance   Sci-fi   Shounen Ai   ",
	"tags": "Animal Characteristics   Beast Companions   Beasts   Clumsy Love Interests   Cute Protagonist   Doting Love Interests   Futuristic Setting   Human-Nonhuman Relationship   Insects   Kuudere   Military   Mpreg   Mysterious Family Background   Mysterious Past   Non-humanoid Protagonist   Outer Space   Overpowered Protagonist   Past Plays a Big Role   Power Couple   Strong Love Interests   System Administrator   Transformation Ability   Transmigration   ",
	"rating": "(4.5 / 5.0, 48 votes)",
	"author": "Yòu Mò   右默   ",
	"year": "\n2018",
	"ranking": "#2000   #2000   #5875   #5957   #5067   ",
	"reviewcount": "13 Reviews sorted by",
	"description": "Jin Wuxiu was born again. This is not terrible. It is not terrible to cross a world where mutant bugs and wormholes were running around the interstellar.\n\nThe point is … he reincarnated as a panda, and also obtained a meng selling system. \n\nThe panda’s heart collapsed, and his life was gone. He clearly has an explosive fighting capacity, but he had to rely on selling meng to upgrade!\n\nPeople all over the star are excited! The combat strength of the Marshal family’s companion beast is invincible in the world. With only one paw, it can kill all the mutant bugs!\n\nMore importantly……It’s absolutely cute.\n\nAnd the panda who is rumored to be holding the Grand Marshal’s thigh, slowly and adorably showed the tiny and barely visible wound on his paw to the Marshal, while grieving, “It hurts, I’m injured.”\n\n【Ding! Congratulations on the success of the host selling Meng, and get three points Meng value. 】\n\nThe Grand Marshal is expressionless, and the panda that can blow up a group of insects with a single punch, only knows how to sell meng.\n\nWho knows that the panda looked up and asked with a pitiful look, what does the bamboo taste like today?>"
}