{
	"url": "https://www.novelupdates.com/series/the-tutor-is-perfect-meal/",
	"title": "The Tutor is Perfect Meal - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/03/The-Tutor-is-Perfect-Meal.jpg",
	"noveltype": "(KR)",
	"genre": "Harem   Josei   Romance   Smut   ",
	"tags": "Affair   Beautiful Female Lead   Cunning Protagonist   Different Social Status   Doting Love Interests   Empires   European Ambience   Female Protagonist   First-time Interc**rse   Forced into a Relationship   Handsome Male Lead   Love Rivals   Male Yandere   Mature Protagonist   Obsessive Love   Reverse Harem   ",
	"rating": "(3.8 / 5.0, 21 votes)",
	"author": "Eve Lily   이브 릴리   ",
	"year": "\n2020",
	"ranking": "#6970   #4174   #8679   #8229   #5867   ",
	"reviewcount": "2 Reviews sorted by",
	"description": "Norwell accidentally witnessed her disciple, Kaya, masturbating. She concedes to Kaya’s threat that he will speak of everything inappropriate that she has done if she refuses to have a relationship with him.\r\n\r\nEventually, Adrian - Kaya’s guardian and Norwell’s lover - finds out about their relationship.\r\n\r\n* * *\r\n\r\n“How did the Young Duke do it?”\r\n\r\nAdrian strongly held Norwell in his arms and turned her over. Then he put his hand on Norwell’s belly and let her raise her ass. He pressed down her upper body until her posture was blatantly shameful.\r\n\r\n“Tell me what’s different from me.”\r\n\r\nPressing hard on Norwell’s waist, he stretched out two of his fingers into her bulging lower body. Adrian’s thick hand shook her vaginal wall into her already slippery hole.\r\n\r\n“What part has made you lustful?”\r\n\r\nAdrian’s hand moved back and forth through Norwell’s hole much faster than a pen*s could. Norwell was forced to take Adrian’s hand as she screamed with her face stuck in her carpet.\r\n\r\n“Which part? Answer me!”\r\n\r\n-Slap!-\r\n\r\n“Ah!”\r\n\r\nAdrian smacked her soaring ass with his left hand. The spot that was hit by his big hand quickly turned red.\r\n\r\n“Have you done this too?”\r\n\r\nHe pulled out his finger, and put his ere*t pen*s into the hole.\r\n\r\nNorwell’s hole has not yet been released, so that all of Adrian’s big pen*s has not been accepted.\r\n\r\nHer moan was closer to that of a scream.>"
}