{
	"url": "https://www.novelupdates.com/series/colossus-hunter/",
	"title": "Colossus Hunter - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2017/07/God-Hunter.jpeg",
	"noveltype": "(KR)",
	"genre": "Action   Adventure   Fantasy   Martial Arts   Shounen   Supernatural   Tragedy   ",
	"tags": "Apocalypse   Beast Companions   Body Swap   Cheats   Childhood Friends   Death of Loved Ones   Demon Lord   Demons   Dragons   Evolution   Game Elements   Gods   Heroes   Hunters   Level System   Lucky Protagonist   Male Protagonist   Monster Tamer   Monsters   Multiple Identities   Multiple POV   Multiple Reincarnated Individuals   Pets   Second Chance   Spirit Users   Spirits   Sword And Magic   Sword Wielder   Time Travel   ",
	"rating": "(4.1 / 5.0, 209 votes)",
	"author": "Onhu   온후   ",
	"year": "\n2016",
	"ranking": "#6970   #6194   #1950   #1406   #2127   ",
	"reviewcount": "22 Reviews",
	"description": "He returned from the hopeless future!\n\nIn the midst of the clash between gods and devils, Hansung begins his journey.\n\nOh Hansung, the ultimate hero bearing the class Magic Swordsman and the only titled Hero left in the world destroys the evil cult: The Order of Alethea who worship Chronos, the God of Time. Whom his friend Minshik is a part of. After the cult’s destruction, Minshik who is in a state beyond repair spoke out with these words: “If our God reversed the flow of time, I wanted to be a greater hero than you…”\n\nFrom destroying a Demon Dragon to the Demon King, and finally, to where Hansung is killing things that are even worse, the hero is stuck in an endless cycle of suffering until he dies. In a miraculous event, Minshik’s ring, a ring Hansung kept after his friend’s death started to glow in his dying breath and caused him to reincarnate into the past. Unfortunately, Hansung and Minshik are reincarnated into the time where Hansung’s parents died in a car crash and he’s forced to live with his somewhat abusive uncle, wherein two years' time many monsters will start invading. Minshik starts out immediately to gain the class Magic Swordsman and doesn’t realize Hansung also reincarnated. In his concealed state Hansung formulates his plan to save the world by going after an even stronger class.>"
}