{
	"url": "https://www.novelupdates.com/series/who-stole-the-empress/",
	"title": "Who Stole The Empress - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/06/Who-Stole-The-Empress.jpg",
	"noveltype": "(KR)",
	"genre": "Fantasy   Mature   Psychological   Romance   Tragedy   ",
	"tags": "Affair   Apathetic Protagonist   Aristocracy   Artifacts   Beautiful Female Lead   Betrayal   Calm Protagonist   Clingy Lover   Depictions of Cruelty   Enemies Become Lovers   European Ambience   Female Protagonist   Generals   Handsome Male Lead   Love Interest Falls in Love First   Maids   Past Trauma   Possessive Characters   R-15   Royalty   R*pe   Smart Couple   Tragic Past   ",
	"rating": "(4.0 / 5.0, 62 votes)",
	"author": "Lee Jihye   ",
	"year": "\n2021",
	"ranking": "#1809   #1314   #2514   #4531   #2625   ",
	"reviewcount": "16 Reviews sorted by",
	"description": "\r\n\r\n\r\n\r\n\r\n“You have no idea how repulsed I was every time I saw you limping.'\r\n\r\n....These wounds had made her look disgusting. \r\n\r\nIt was for this reason that the emperor abandoned the empress in the heavy snow. \r\n\r\nAlong with the sword that was stained with the blood of her family and friends. \r\n\r\n**  \r\n  \r\n  \r\nEndless snow. \r\n  \r\nLeft alone in a world that was blindingly white, Roselyn was willing to accept death.  \r\n  \r\nThere was no reason for her to live. She had no family, no friends, and no desires left. \r\n  \r\nShe laid down her cold, freezing body on the white snow and gazed at the black sky.  \r\n  \r\nThe bitter cold soon thawed. It was then that she realized that freezing to death wasn't so bad after all.  \r\n  \r\n“You were banished to death, but you're still lying here in this snow, as if you're going to rule over it.'  \r\n  \r\nThis man.  \r\n  \r\n'Your life….if you're throwing it away, I'll be more than happy to pick you up and take you away.'  \r\n  \r\n\r\nTamon Krasis, the enemy general. \r\n\r\n“You are mine now, Empress.”\r\n  \r\nShe was abandoned. He stole her and ran away.\r\n\r\n>"
}