{
	"url": "https://www.novelupdates.com/series/embers/",
	"title": "Embers - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/11/Embers.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Romance   School Life   Shounen Ai   Slice of Life   ",
	"tags": "Character Growth   Complex Family Relationships   Cute Story   Doting Love Interests   Modern Day   Power Couple   Protagonist Falls in Love First   Ruthless Protagonist   Strong Love Interests   Wealthy Characters   ",
	"rating": "(4.3 / 5.0, 56 votes)",
	"author": "南木北牙   ",
	"year": "\n2020",
	"ranking": "#2000   #2000   #6015   #7143   #5054   ",
	"reviewcount": "2 Reviews sorted by",
	"description": "Because of you, I became a better me.\n\nThe first time Sheng Renxing met Xing Ye, the other had dragged him into a skirmish.\n\nThat fight had been exhilarating.\n\nThe second time they met, Xing Ye had just finished a round in the ring. He had stood in the centre, entire body covered in wounds, his downcast gaze bypassing everyone else to land on Sheng Renxing.\n\nSheng Renxing had taken him home.\n\nThe third time, Sheng Renxing had arrived at his new school with a head full of red hair. He was met with the sight of Xing Ye in the classroom, all properly-decked out in his school uniform.\n\nTheir grades: Sheng Renxing scored 148 points while Xing Ye scored 18 points.\n\nLater:\n\nBlood continued to drip down Xing Ye’s brow ridge. He pressed Sheng Renxing against the door with one hand, his teeth sunk into the boxing glove of his other hand. There was a vicious light in his eyes— “Stay out of my business. Keep your sympathy. The people here aren’t your friends—they’re all madmen or human scum.”\n\nSheng Renxing: “…Can the human scum in front of me let go?”\n\nHe was the weeds set ablaze amidst the night sky. Even after exhausting everything he had, all that could be seen by passing strangers were flashes of embers and ashes.\n\nBut one day, a phoenix descended from the skies and made the weeds his home.>"
}