{
	"url": "https://www.novelupdates.com/series/villain-seized-the-assassin-heroine-at-the-start/",
	"title": "Villain Seized the Assassin Heroine at the Start! - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/08/Villain-seized-the-Assassin-Heroine-at-the-Start.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Comedy   Drama   Ecchi   Harem   Martial Arts   Romance   Xuanhuan   ",
	"tags": "Accelerated Growth   Adultery   Alternate World   Antihero Protagonist   Arranged Marriage   Arrogant Characters   Beautiful Female Lead   Black Belly   Bodyguards   Broken Engagement   Business Management   Businessmen   Calm Protagonist   Carefree Protagonist   Cheats   Clever Protagonist   Cold Love Interests   Cold Protagonist   Confident Protagonist   Cunning Protagonist   Death   Doting Parents   Evil Protagonist   Gangs   Genius Protagonist   Handsome Male Lead   Harem-seeking Protagonist   Jack of All Trades   Level System   Loyal Subordinates   Maids   Male Protagonist   Manipulative Characters   Mercenaries   Modern Day   Netori   Older Love Interests   Playboys   Proactive Protagonist   R*pe   Ruthless Protagonist   Sadistic Characters   Servants   Shameless Protagonist   Sudden Strength Gain   System Administrator   Transmigration   Wealthy Characters   Younger Love Interests   Younger Sisters   ",
	"rating": "(3.1 / 5.0, 102 votes)",
	"author": "Sister Doll   ",
	"year": "\n2021",
	"ranking": "#2210   #3210   #2618   #5814   #4235   ",
	"reviewcount": "17 Reviews",
	"description": "Waking up at the start, Li Mubai found himself transmigrated into a superbly rich, handsome person who inherited a worth over trillion dollars from his family.\r\n\r\nHe had family backing and was handsome.\r\n\r\nHe could spend any amount of money.\r\n\r\nIf one encountered such a situation, they would even wake up laughing from their dreams.\r\n\r\nBut what sucked was that he just transmigrated over and would immediately end up getting assassinated?\r\n\r\nThe one who wanted to assassinate him was an assassin heroine in the book!\r\n\r\nHow could he stand this!\r\n\r\nAt this moment, Li Mu Bai awakened the Heavenly Destiny Villain System!\r\n\r\nThe opening draws were the Combat prowess of the Master-Level, Villain Halo, loyalty potion...\r\n\r\n'Assassination?'\r\n\r\n'Oh, I think all she had to do was send 'dishes'....'\r\n\r\nLi Mubai smiled slightly. For the upcoming assassination attempt, he began to feel a sense of anticipation.>"
}