{
	"url": "https://www.novelupdates.com/series/bloody-moon/",
	"title": "Bloody Moon - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/09/Bloody-Moon.jpg",
	"noveltype": "(KR)",
	"genre": "Drama   Fantasy   Mature   Romance   Supernatural   Yaoi   ",
	"tags": "Abusive Characters   Aggressive Characters   Ancient Times   Arrogant Characters   Assassins   Blind Protagonist   Child Abuse   Confinement   Conflicting Loyalties   Depictions of Cruelty   Depression   Disabilities   Doting Love Interests   Empires   Eye Powers   Family Conflict   Fantasy World   First-time Interc**rse   Handsome Male Lead   Hiding True Abilities   Hiding True Identity   Kind Love Interests   Kingdoms   Knights   Love Interest Falls in Love First   Loyal Subordinates   Military   Misunderstandings   Mysterious Family Background   Obsessive Love   Past Trauma   Prophecies   Prostit**es   Royalty   R*pe   Schemes And Conspiracies   Special Abilities   Spies   Torture   Wars   Weak Protagonist   Wealthy Characters   ",
	"rating": "(3.9 / 5.0, 39 votes)",
	"author": "BAMIL-SSI   바밀씨   ",
	"year": "\n2016",
	"ranking": "#3923   #3443   #7130   #6708   #6385   ",
	"reviewcount": "5 Reviews sorted by",
	"description": "For seven years the Ibeden Empire has been at war with five nations. One of the most troublesome, is a small kingdom of Kemened. This small nation should have been easily defeated but it is still holding out after seven long, arduous years. The reason comes down to one person, the unknown assassin. As the name suggests, nothing is known about this person who strikes without detection leaving behind nothing but a corpse with burned out eyes.\n\nAs the First Prince of Ibeden closes in on the Kemened Kingdom, his subordinate Count Custer is killed in a brothel. His burned out eyes, like bloody moons, leave no doubt as to identity of person who killed him. Yet again it was the unknown assassin.\n\nThere is a secret beneath the maze of the Kemened Kingdom, as The First Prince will soon discover it goes much deeper than assassin’s or Kingdoms, it’s a matter of fate, and it will change everything>"
}