{
	"url": "https://www.novelupdates.com/series/e-sports-group-pampered-omega/",
	"title": "E-Sport’s Group Pampered Omega - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/04/Esports-group-pampered-Omega.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Comedy   Romance   Sports   Yaoi   ",
	"tags": "Character Growth   Couple Growth   Cute Protagonist   Dense Protagonist   Doting Love Interests   e-Sports   Game Elements   Handsome Male Lead   Love at First Sight   Love Interest Falls in Love First   Naive Protagonist   Omegaverse   ",
	"rating": "(3.9 / 5.0, 50 votes)",
	"author": "楚青晏   ",
	"year": "\n2020",
	"ranking": "#6970   #2000   #5193   #2714   #4365   ",
	"reviewcount": "6 Reviews sorted by",
	"description": "The holographic gaming league is a showcase for Alpha players, and Polaris, a team that had faded out, actually recruited a wizard whose other identity is an Omega in order to return to the professional gaming world.\n \nThe little wizard was very beautiful, but standing in a group of tall alpha players, his head couldn’t even be seen, and from time to time he would have to tug on the corner of captain Lin Mingfei’s shirt.\n \nThe entire league felt that they could ridicule the former King of Magic, Lin Ming Fei, who had fallen from the high god-like altar.\n \nLater, Xia Tong used a forbidden spell to bind them together in the arena, and the little wizard knocked them over one by one with his staff, yelling angrily, 'Apologize to our captain!If you don’t apologize, you will all be sent home! If you apologize, I will sing for you!\n \n'Shit, he's so cute!' exclaimed the captives in unison.\n \nXia Tong, as the only Omega in the holographic gaming industry, is not only the mascot of the P-team, but also the object that all teams are trying to poach and for whom fanboys and fangirls scream about everywhere.\n \nThe day after winning the league tournament, an alpha in a suit knocked on the door of the P team’s club.\n \n'Xia Tong is my lost custom mate. Please have your club return him immediately and let him go back with me to have a baby.'\n \nLin Ming Fei's bare, lean upper body stood in front of the door, a cigarette in his mouth, his powerful pheromones like a mountain of water: 'Do you have the guts to say that again?'>"
}