{
	"url": "https://www.novelupdates.com/series/rebirth-of-the-little-lucky-star-in-the-80s/",
	"title": "Rebirth of the Little Lucky Star in the ‘80s - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/11/Rebirth-of-the-little-lucky-star-in-the-s.jpg",
	"noveltype": "(CN)",
	"genre": "Fantasy   Romance   ",
	"tags": "Child Protagonist   Doting Parents   Female Protagonist   Handsome Male Lead   Lucky Protagonist   Poor to Rich   ",
	"rating": "(3.7 / 5.0, 11 votes)",
	"author": "Biting Peaches   咬桃子   ",
	"year": "\nN/A",
	"ranking": "#3314   #2000   #10627   #5190   #9705   ",
	"reviewcount": "1 Review sorted by",
	"description": "As a little lucky star loved by everyone in heaven, she was demoted to the world once she made a mistake and became a newborn baby. Only by saving the poorest and unluckiest family in the village can she return to the heavens! The family has nothing, how miserable! The family is poor not to say, but also the grandfather is paralyzed, the grandmother is blind, the father was killed, the mother is seriously ill, four brothers have been blackened …… And uncles, aunts act as demons all day;  miserable children next door are crying!\n\nThe only good thing is that this family spoils their daughter so much that it’s ridiculous! It’s not enough for the whole family to pet her. But also the whole village together!\n\nFubao: Innate Pet Physique; can’t help it  ╮(╯▽╰)╭\n\nA certain demon: Let go of that girl and let me spoil her!\n\nBull Demon King: Fubao, draw me some good luck charms. I’ll give you a cow who can plow ten mu of land a day!\n\nShennong: Fubao, draw me some good luck charms and I’ll help you heal your grandpa’s leg injury!\n\nGod of wealth: Fubao, draw me some lucky charms. I’ll tell you the way to get rich!\n\nOld Fuxing: Fubao, when will you come back? Grandpa misses you.\n\nA black-bellied man who has been saved by her and insisted on giving his body to her: Fubao, can you recruit peach blossoms? I think I’m missing a wife.\n\n“…” I’m sorry Big brother, I won’t slip away okay?\n\nBig brother, don’t pester me, will you? I still want to return to heaven! \n\nDemon: “Maybe we can work together.” It’s time to capture your heart.>"
}