{
	"url": "https://www.novelupdates.com/series/i-pretend-to-be-good-you-pretend-to-be-pure/",
	"title": "I Pretend to Be Good, You Pretend to Be Pure - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/05/I-Pretend-to-Be-Good-You-Pretend-to-Be-Pure.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Romance   Yaoi   ",
	"tags": "College/University   Comedic Undertone   Devoted Love Interests   First-time Interc**rse   Love at First Sight   Misunderstandings   Modern Day   Younger Love Interests   ",
	"rating": "(4.2 / 5.0, 25 votes)",
	"author": "Amnesia Rose   失忆玫瑰   ",
	"year": "\n2022",
	"ranking": "#5262   #4670   #9009   #6339   #8707   ",
	"reviewcount": "3 Reviews sorted by",
	"description": "Freshman year military training, under the scorching sun:\n\nNew school grass Ran Ningmu, his shoulders are wide and his legs – long, his temperament is that of dark spring. He is busy capturing the smiles of countless xuejie.\n\nFormer school grass An Youxi, his face is refreshing and his eyebrows – clear, his temperament is that of clear water. He is busy capturing the events of the military training.\n\nThen, when the two looked at each other:\nRan Ningmu: Cute, I want to do him.\nAn Youxi: Cute, I want to be done by him.\n\nThen, after the two got together at rocket speed:\nRan Ningmu thought An Youxi liked the little milk dog type, so even if he is obviously a big bad wolf he must still disguise himself as a grass-grazing sheep.\nAn Youxi thought Ran Ningmu liked the pure type, so even if he really wants to lick the wolf dog’s fur he must still not say anything.\n\nBut in reality:\nRan Ningmu: Drinking √, Fighting √, Dyed Hair √, Tattoos √, Inappropriate Clothing √, Underground Motor Racing King √\nAn Youxi: 30 GB of “research” √ Innumerable amount of smut books √ Full set of shameless man x man animations √ Professional coquettish shou vixen famous among the online voice acting community √\n\nUntil one day, when An Youxi was performing a live dubbing, Ran Ningmu suddenly entered through the door. In his surprise, An Youxi accidentally unplugged his headphones causing the room to be instantly filled with the sexy low hoarse voice of the gong VA on the opposite side.\n\nAn Youxi and Ran Ningmu: “…..”\nRan Ningmu took a deep breath and easily shut the door with a slam along the way.\n\nTwo hours later:\nRan Ningmu: So you’re actually a seductive shou.\nAn Youxi: So you’re actually a wolfdog.\n\nIn fact, doing it only once per week was troubling for Ran Ningmu as well. After speaking to the other party, don’t even ask about Ran Ningmu’s mood, he is filled with regret.\n\nRan Ningmu: Had I known from the beginning that gege likes the wild type, I wouldn’t have had to pretend for so long.>"
}