{
	"url": "https://www.novelupdates.com/series/the-real-reason-were-getting-married/",
	"title": "The Real Reason We’re Getting Married - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/05/The-Real-Reason-Were-Getting-Married.jpeg",
	"noveltype": "(KR)",
	"genre": "Fantasy   Romance   Shoujo   ",
	"tags": "Aristocracy   Arranged Marriage   Beautiful Female Lead   Empires   European Ambience   Female Protagonist   Handsome Male Lead   Nobles   Older Love Interests   ",
	"rating": "(3.3 / 5.0, 15 votes)",
	"author": "이터늘   ",
	"year": "\n2021",
	"ranking": "#2000   #2000   #10996   #11313   #8805   ",
	"reviewcount": "No Reviews",
	"description": "“I missed you.”\n\n“I missed you, Yedi. For the past two years, every single day.”\n\nTwo years ago.\n\n“I have a young girl to introduce to the Baron.”\n\nAt the emperor’s words, Navy officer Edward took a breath in surprise.\n\nHe gave him the title as a reward for the victory in the war, and this time he paired him up with a girl.\n\nIsn’t she the daughter of the Grand Duke’s family and the emperor’s niece?\n\n“Your Majesty, why don’t you reconsider this marriage?”\n\nOn his first meeting with Yelodia, Edward politely rejected the emperor’s offer.\n\nBut.\n\n“I guess he doesn’t want to get engaged to me.”\n\nYelodia, whose specialty is horseback riding and running away from home, seems very serenity with her marriage.\n\nYelodia, who is both eccentric and honest, gradually realizes how she feels.\n\n“I think I like Edward, you know, Baron.”\n\nEdward is only troubled by the sudden confession of his sixteen-year-old fiancee.\n\n“However, Yelodia is too……”\n\n“Too?”\n\n“Aren’t you too young?”\n\nWith about a month left before her adulthood, Yelodia’s was unhappy with her life.\n\nIn front of Yelodia, who is cute and adorable as a puppy, Edward, who especially embarrassed by her, is dragged by her helplessly.\n\n“Please don’t cry. I don’t know what I’m going to do if Yelodia cries.”\n\nWill the two of them be able to get married safely?>"
}