{
	"url": "https://www.novelupdates.com/series/my-body-has-been-possessed-by-someone/",
	"title": "My Body Has Been Possessed By Someone - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/08/My-Body-Has-Been-Possessed-By-Someone-2.jpg",
	"noveltype": "(KR)",
	"genre": "Drama   Fantasy   Josei   Romance   Shoujo   ",
	"tags": "Abusive Characters   Aggressive Characters   Aristocracy   Arrogant Characters   Beautiful Female Lead   Blackmail   Body Swap   Bullying   Calm Protagonist   Clever Protagonist   Cold Love Interests   Complex Family Relationships   Contracts   Cruel Characters   Cunning Protagonist   Depictions of Cruelty   Determined Protagonist   Divorce   European Ambience   Family   Family Conflict   Female Protagonist   Handsome Male Lead   Marriage   Mysterious Family Background   Mysterious Past   Nobles   Outcasts   Possession   Royalty   Siblings   Sister Complex   Survival   Tragic Past   Transported to Another World   Unrequited Love   ",
	"rating": "(4.0 / 5.0, 52 votes)",
	"author": "Shin Solar   신솔라   ",
	"year": "\n2020",
	"ranking": "#2000   #2000   #5159   #7359   #3927   ",
	"reviewcount": "8 Reviews sorted by",
	"description": "“Listen to me. I’m the only one you can count on.”\r\n“…….”\r\n“I’m the only one for you.”\r\n“…….”\r\n“Only me.”\r\n\r\nWhat an abominable delusion.\r\n\r\n* * *\r\n\r\nFor more than 10 years, my body was possessed by someone else. It would have been nice of ‘that person’ if she used my body and returned it in a good condition, but not only did she get married with my own body, she’s also clinging to her husband like a stalker..?!\r\n\r\n“First, let’s get divorced.”\r\n\r\nI tried to start a new life by dumping my husband, who has been treating me like trash, and my family who treated me like dirt.\r\n\r\nBut.\r\n\r\n“Leaving? You will leave me?”\r\n\r\nMy husband who doesn’t believe me.\r\n\r\n“Why are you taking his side, sister?”\r\n\r\nA younger brother who’s suddenly jealous.\r\n\r\n“Stay in this house. You can’t go anywhere.”\r\n\r\nEven my father who hated me all along is suddenly obsessed? What’s wrong with them all of a sudden?>"
}