{
	"url": "https://www.novelupdates.com/series/the-reconciliation/",
	"title": "The Reconciliation - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/03/16-52be986.jpg",
	"noveltype": "(CN)",
	"genre": "Drama   Romance   Yuri   ",
	"tags": "Acting   Beautiful Female Lead   Celebrities   Devoted Love Interests   Doting Love Interests   Famous Protagonist   Modern Day   Wealthy Characters   ",
	"rating": "(4.1 / 5.0, 39 votes)",
	"author": "鱼霜   ",
	"year": "\n2019",
	"ranking": "#2000   #6320   #7551   #7470   #7794   ",
	"reviewcount": "3 Reviews sorted by",
	"description": "At the beginning of the year, 26 year old Yu Xi obtained the Mangolia Award and White Tree Award for her drama Blossoming Spring Flowers and became the entertainment circle’s youngest female Grand Slam winner. Channel X broadcasted an exclusive interview program with her live.\n\n\nBefore the camera, the host held the card over for the audience under the stage to see and smiled, “Now, let’s see what challenge Miss Yu picked out!”\n\n\nAs the screen behind Yu Xi magnified the contents of the card, cheering and shouting erupted from below the stage. The card contained one sentence: Call your first love on stage.\n\n\nYu Xi pursed her lips and gave a weak smile, taking the phone the host handed her.\n\n\nThe phone’s speakerphone was turned on and the audience became quiet. The phone rang for a long time. Just when the audience was about to get discouraged, they heard a slightly deep voice, “Hey.”\n\n\nThe brief greeting, spoken in a very unfamiliar and cold tone, left everyone above and below the stage stunned. The voice was not that of a man’s but that of a woman’s.\n\n\nThe host was in a daze for a moment, before hesitantly asking, “Miss Yu, did you accidentally call the wrong person?”\n\n\nYu Xi lightly smiled, graceful and elegant, two words falling from her red lips, “I didn’t”.\n\n\nImmediately, the entire internet blew up! Weibo was in turmoil! Two headlines trended: #GrandSlamQueenIsActuallyGay# #YuXiComingOut#>"
}