{
	"url": "https://www.novelupdates.com/series/to-save-my-favourite-character-i-decided-to-destroy-the-games-plot/",
	"title": "To Save My Favourite Character, I Decided To Destroy the Game’s Plot - Novel Updates",
	"image": "https://www.novelupdates.com/img/noimagefound.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Fantasy   Harem   Martial Arts   School Life   Shounen   ",
	"tags": "Calm Protagonist   Determined Protagonist   Hard-Working Protagonist   Magic   Male Protagonist   Reincarnated in a Game World   Reincarnated in Another World   Spear Wielder   Sword And Magic   Transported into a Game World   Weak to Strong   ",
	"rating": "(4.6 / 5.0, 5 votes)",
	"author": "物書きをするオタリス   ",
	"year": "\n2022",
	"ranking": "#2000   #515   #12325   #7587   #12542   ",
	"reviewcount": "No Reviews",
	"description": "Arcadia Quest. A game that has won over many a heart with over a hundred different plot routes, which is supported by a vast yet well-designed character base. In these myriad of characters and routes, there was one character, Crescentia, who faced ruin no matter the route followed. The protagonist of this work is a NEET gamer that loved Crescentia. He played Arcadia Quest over and over without minding the time to find a route where Crescentia could be saved. But despite trying for years, he had never succeeded in finding such a route. That day too, he fell asleep after yet another failure.\r\n\r\nWhen he woke up the next day, he found that he’d been reincarnated in the world of Arcadia Quest!! The protagonist was overjoyed that he now had to chance to save Crescentia with his own two hands. But he was reincarnated as a mob character who couldn’t be considered strong by any means. If anything, he was a small-fry at best. A small-fry that could be taken out by a strong breeze.\r\n\r\nBut the protagonist wasn’t discouraged. ‘If I’m a small-fry, I just need to train harder. If I don’t have any talent, I just need to train harder. If saving Crescentia is going to be extremely difficult, I just need to train harder.’\r\n\r\nEverything is for his favourite character. Supplanting a lack of talent with outstanding hard work, the mob gamer grows strong enough to destroy the game’s plot.>"
}