{
	"url": "https://www.novelupdates.com/series/the-wife-wants-a-divorce-every-day/",
	"title": "The Wife Wants A Divorce Every day - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/08/The-Wife-Wants-A-Divorce-Every-day.jpg",
	"noveltype": "(CN)",
	"genre": "Fantasy   Romance   ",
	"tags": "Arranged Marriage   Beautiful Female Lead   Bickering Couple   Cold Love Interests   Cold Protagonist   Family Business   Female Protagonist   Handsome Male Lead   Marriage   Modern Day   Possessive Characters   Slow Romance   Transmigration   ",
	"rating": "(3.4 / 5.0, 27 votes)",
	"author": "信用卡   ",
	"year": "\n2021",
	"ranking": "#5262   #4688   #7308   #11739   #7901   ",
	"reviewcount": "9 Reviews sorted by",
	"description": "The iron-willed CEO Jiang Wanwan accidentally passes away and finds herself inside a dog-blood novel, becoming the cannon fodder girl who eventually dies tragically in it.  At this time, she just crossed over to find herself in an expensive and exquisite wedding dress with a handsome man in a wedding ceremony.\n\nJiang Wanwan: Did I transmigrate at a bad time? What do you want me to do on the night of the wedding? As it turns out, she was thinking too much, and her handsome husband sent her straight to the guest bedroom that night, without even looking back. \n\nJiang Wanwan: Men are all floating clouds, the life of a domineering female president is my favourite. \n\nBig Brother Xi: ???? Come back, that’s not what you said before you got married!!!\n\n **** A handsome and wealthy business tycoon, XI Heming, is forced by his family to have a clingy fiancée who loves him to death because of an inexplicable engagement and is forced to have a wedding. But what he didn’t expect was that his previously petulant little wife, who only wooed, suddenly changed after the wedding. She was no longer jealous of his team of secretaries and didn’t even bother to give him a look, but also set up her own company in a blaze of glory. With the benefit of hindsight, Xi Heming discovered that he had to call his wife to make an appointment, queue up if he wanted to speak to her, and go to major parties to meet her by chance\n\n ……\n\nWatching Jiang Wanwan with her handsome male assistant clinking glasses with his business rival at a c*cktail party, Xi Heming was completely sour! What made him even more jealous was that the people around him were all attracted to Jiang Wanwan. \n\nCompetitor: Jiang Wanwan is the woman I admire most. \n\nBest Friends: Jiang Wanwan is my dream girl! \n\nThe little white flower who used to be infatuated with him: Jiang is always the goddess of my heart. \n\nCousin: I’m not going to lie, I want to marry my sister-in-law. \n\nXI Heming: ？？？？\n\nAngry Xi Heming: I’m her husband!!!\n\nA bashful Jiang Wanwan: How about we divorce, you don’t hold me back from getting rich.>"
}