{
	"url": "https://www.novelupdates.com/series/the-heaven-sword-and-the-dragon-sabre/",
	"title": "The Heaven Sword and the Dragon Sabre - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2015/09/dragonsabre.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Harem   Romance   Wuxia   ",
	"tags": "Adapted to Drama   Adapted to Manhua   Adapted to Movie   Blacksmith   Doctors   Healers   Male Protagonist   Past Plays a Big Role   Sword Wielder   ",
	"rating": "(3.9 / 5.0, 35 votes)",
	"author": "Jin Yong   ",
	"year": "\n1961",
	"ranking": "#2000   #2000   #11707   #13810   #9367   ",
	"reviewcount": "No Reviews",
	"description": "The Heaven Sword and Dragon Sabre was first serialized by Jin Yong in newspapers from 6 July 1961 to 2 September 1963.\r\n\r\nThe book is the third of the Condor Trilogy. The story has undergone two revisions. The second edition was released in 1979 and and the third edition was published in 2005.\r\n\r\nSet in the late Yuan dynasty, the story revolves around a pair of priceless and extremely powerful weapons, the Heaven Reliant Sword (倚天劍) and Dragon Slaying Saber (屠龍刀), which are coveted by many martial artists in the jianghu. Either or both of them are thought to allow their wielder to rule the wulin (martial artists' community), according to a widely circulated mantra which goes, 'Honoured by the wulin, the precious Saber slays the Dragon. It commands the world. Who dares to disobey? If the Heaven Reliant does not appear, who can challenge it?' (武林至尊，寶刀屠龍，號令天下，莫敢不從！倚天不出，誰與爭鋒？). The origins of this mantra are not known at the beginning of the story.\r\n\r\nThe protagonist, Zhang Wuji, is of mixed heritage: His father, Zhang Cuishan, is an apprentice of Zhang Sanfeng, the highly revered leader of the Wudang Sect; his mother, Yin Susu, is the daughter of Yin Tianzheng, the chief of the 'unorthodox' Heavenly Eagle Cult. He spent his childhood on a reclusive northern island, where he was born, with only his parents and his godfather, Xie Xun, to keep him company. When he is about 10 years old, he returns to the Chinese mainland with his parents. They soon find themselves the target of several martial artists, who try to force them to reveal the whereabouts of Xie Xun and the Dragon Slaying Saber. His parents refuse and commit suicide. At the same time, Zhang Wuji is wounded by the Xuanming Elders, but he survives after seeking medical treatment from Hu Qingniu, an eccentric physician.>"
}