{
	"url": "https://www.novelupdates.com/series/hes-mine-no-objections-allowed/",
	"title": "He’s Mine, No Objections Allowed - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/07/Hes-Mine-No-Objections-Allowed.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Drama   Josei   Romance   Slice of Life   ",
	"tags": "Acting   Beautiful Female Lead   Business Management   Carefree Protagonist   Celebrities   Charming Protagonist   Clever Protagonist   Cold Love Interests   Comedic Undertone   Confident Protagonist   Couple Growth   Cunning Protagonist   Determined Protagonist   Devoted Love Interests   Doting Love Interests   Early Romance   Famous Protagonist   Female Protagonist   Handsome Male Lead   Hard-Working Protagonist   Hated Protagonist   Heartwarming   Love at First Sight   Marriage   Military   Modern Day   Playful Protagonist   Popular Love Interests   Possessive Characters   Power Couple   Protagonist Falls in Love First   Protagonist Strong from the Start   Quirky Characters   Seduction   Shameless Protagonist   Showbiz   Strong Love Interests   Tragic Past   Tsundere   Unconditional Love   Underestimated Protagonist   Wealthy Characters   ",
	"rating": "(4.6 / 5.0, 477 votes)",
	"author": "Jiàng Zi Bèi   酱子贝   ",
	"year": "\n2019",
	"ranking": "#836   #1217   #856   #177   #646   ",
	"reviewcount": "117 Reviews sorted by",
	"description": "Su Yi has played many vicious female supporting roles such as a mistress, a witch, a villainess, and what not, earning the title, “National Villainess,” receiving quite a few haters.\n\nShe then fell in love with a veteran who had NO. IMPERFECTIONS. AT. ALL! (Su Yi said in all seriousness). It was just that he wasn’t quite pleased with her reputation...\n\nTherefore Su Yi ran back to the company, crying. “I want to change my public image! I don’t want to be a villainess anymore! I want to play a white lotus flower, it’d be great if I could be the wife of a soldier who would sacrifice everything for love!”\n\nEven so there was one thing Su Yi was certain about right from the start.\n\nChu Ying was hers, no objections allowed!>"
}