{
	"url": "https://www.novelupdates.com/series/what-failure-to-transitionsuccess-ln/",
	"title": "What, Failure to Transition!?……Success!? (LN) - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/12/What-Failure-to-Transition-Success.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adult   Adventure   Ecchi   Fantasy   Harem   Mature   Seinen   ",
	"tags": "Adapted to Manga   Adventurers   Cheats   F*llatio   Low-key Protagonist   Male Protagonist   Mature Protagonist   Modern Day   Multiple Reincarnated Individuals   Nobles   Nudity   Perverted Protagonist   Poor to Rich   Prostit**es   R-18   Reincarnation   Returning from Another World   Romantic Subplot   Special Abilities   Sword And Magic   System Administrator   Transported to Another World   ",
	"rating": "(3.5 / 5.0, 74 votes)",
	"author": "ほーち   ",
	"year": "\n2017",
	"ranking": "#1233   #788   #3500   #1606   #3613   ",
	"reviewcount": "7 Reviews",
	"description": "A hapless factory worker, Todo Yoichi (35 years old, single and living on credit), is involved in a truck accident with a young man with a name similar to his own.\n\nA woman who claims to be ‘the administrator’ appears and tells him that the young man was the one supposed to be reincarnated, and he was only been involved by an accident due to naming error.\n\nWhile the young man before him was given the cheat abilities and was reincarnated to a different world with swords and magic, the administrator was forced to reuse Yoichi’s original body because there was no more in stock to establish a new existence for him, as all of it was already given to the young man before him. \n\nThe same could be said for the cheat abilities as well, and all that he managed to get was the ‘Standard Skill Pack’, which includes [Appraisal], [Storage], [Language Comprehension], and [Return], skills commonly found in ‘Isekai’ Light Novels that Yoichi had read.\n\nFinally, I’m gonna get out of this life in debt! Yoichi thought, looking forward to enjoying his life anew in a different world, but no matter how he looked at it, he could only find himself back in his former world. He was also unable to use the skills given to him, as there was no indication whatsoever as to how to use them in the first place.\n\nTo get rid of his sorrow, he went to a hotel that offers ‘special services’ and had some ‘fun’ for a while, and soon as he fell asleep, he was transferred again to the white space, with the ‘administrator’ kneeling before him in apology for making another mistake.\n\nAfter having his ‘Standard Skill Set’ boosted as a compensation to the mistake, as well as making the skills available of course, he woke up back to Japan, and having tried out his skills in his real world, Yoichi noticed that an unknown land called “Jana’s Forest” was also set as the home point of his [Return], while setting his home in Japan as a return point. He immediately used this skill, only to realize that he could travel back and forth between the other world and Japan!\n\nGot problems with money, weapons and ammo? Use cheat skills to solve them all!\n\nGot a Hero or Demon Lord you don’t like? Use modern weapons to shut them down!\n\nYakuza, Mafia and even Government Agencies, as long as you have these skills, you have nothing to fear!>"
}