{
	"url": "https://www.novelupdates.com/series/transmigrated-as-the-male-leads-white-moonlight-substitute/",
	"title": "Transmigrated As The Male Lead’s White Moonlight Substitute - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/04/Transmigrated-As-The-Male-Leads-White-Moonlight-Substitute.jpg",
	"noveltype": "(CN)",
	"genre": "Adult   Comedy   Drama   Fantasy   Mature   Romance   ",
	"tags": "Beautiful Female Lead   Carefree Protagonist   Childcare   Cute Protagonist   Female Protagonist   Handsome Male Lead   Modern Day   Pregnancy   Reincarnation   Strong Love Interests   Transmigration   Transported to Another World   Wealthy Characters   ",
	"rating": "(3.1 / 5.0, 27 votes)",
	"author": "姜时一   ",
	"year": "\n2020",
	"ranking": "#2000   #3130   #8384   #11314   #8588   ",
	"reviewcount": "2 Reviews sorted by",
	"description": "Jiang Mian was involved in a car accident on the way home from a celebration banquet and ended up in a novel.\n\nWhen she opened her eyes, she became the stand-in for the paranoid male protagonist’s Bai Yueguang[White Moonlight]. After the White Moonlight came back, she was kicked away by the male protagonist.\n\nKnowing the tragic end of the substitute, Jiang Mian refused to be his White Moonlight substitute! ! I want to break up! At the mention of breaking up, she passed out in pain!\n\nOnly then did she know that she also had a punishment mechanism that was designed to collapse if she broke up with the ML.\n\nJiang Mian (smiling): I can’t mention breaking up, can’t I let the male lead dump me! In order to get rid of the paranoid male protagonist, all kinds of demon. J\nJiang Mian: I want that diamond ring. If you don’t buy it, you don’t love me!\nJiang Mian: You don’t love me anymore, I want to break up with you!\nJiang Mian: So I’m just her stand-in, it’s not me that you love at all!\nShen Shiyan: Don’t make trouble! \n\nAfter finally breaking up, Jiang Mian sent a circle of friends to say that he would never love again, while dressed up and flirting with his good sisters. As a result, as soon as he arrived at the bar, he ran into the paranoid male protagonist. Jiang Mian was petrified on the spot!\n\n Jiang Mian: What should I do if my substitute accidentally rolls over? Wait online, very urgent! Ah, the hero is here! ! !\nShen Shiyan caught someone who was about to run, and smiled overcastly: Where to go? >"
}