{
	"url": "https://www.novelupdates.com/series/keizoku-wa-maryoku-nari-munou-mahou-ga-benri-mahou-ni/",
	"title": "Keizoku wa Maryoku Nari -Munou Mahou ga Benri Mahou ni- - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/05/Keizoku-wa-Maryoku-Nari.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Comedy   Ecchi   Fantasy   Harem   Romance   Slice of Life   Supernatural   ",
	"tags": "Adapted to Manga   Age Progression   Artifacts   Child Protagonist   Demon Lord   Devoted Love Interests   Fantasy Creatures   Former Hero   Heroes   Kind Love Interests   Magic   Male Protagonist   Modern Knowledge   Multiple Reincarnated Individuals   Nobles   Overpowered Protagonist   Polygamy   Previous Life Talent   Protagonist Strong from the Start   Reincarnated in Another World   Reincarnation   Royalty   Sentient Objects   Skill Creation   Strong to Stronger   Summoned Hero   Sword And Magic   Transported to Another World   Unique Weapon User   Unique Weapons   Weak to Strong   ",
	"rating": "(3.6 / 5.0, 66 votes)",
	"author": "Ricky   リッキー   ",
	"year": "\n2018",
	"ranking": "#1625   #1664   #2785   #2313   #2623   ",
	"reviewcount": "2 Reviews",
	"description": "“Need magic power and aptitude to use magic”\n\nI knew this in my childhood. But I still do not know the aptitude magic …. So I should train my magic until I understand it! And every day, I, in my free time, kept silent on my magic in my own way …. And as time passes, they now know that my aptitude magic is “creation magic”. \n\nI was delighted to think that creation magic is a hit. However, the surrounding adults were sad when they knew that it was creation magic … for some reason …. “Creation magic is rare, but it’s considered incompetent magic.” Apparently, creation magic seems to be an incompetent magic that wastes the use of magic and can not make even simple things. \n\nI tried actually … but I could not really create anything. However, while trying repeatedly, I found a secret about creation magic. Furthermore, using the magic that has been trained so far, I will turn my incompetent magic into useful magic!>"
}