{
	"url": "https://www.novelupdates.com/series/cannon-fodder-counterattack-investigation-system/",
	"title": "Cannon Fodder Counterattack Investigation System - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/01/Cannon-Fodder-Counterattack-Investigation-System.png",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Comedy   Martial Arts   Mystery   Romance   Supernatural   Xuanhuan   Yaoi   ",
	"tags": "Ancient China   Black Belly   Child Abuse   Childish Protagonist   Clever Protagonist   Cultivation   Daoism   Dense Protagonist   Enemies Become Lovers   Familiars   Fox Spirits   Game Elements   Incest   Level System   Love Interest Falls in Love First   Mystery Solving   Possessive Characters   R*pe   Senpai-Kouhai Relationship   Straight Uke   System Administrator   Transmigration   Transported to Another World   ",
	"rating": "(4.1 / 5.0, 102 votes)",
	"author": "风舲   ",
	"year": "\n2017",
	"ranking": "#3314   #4171   #2642   #2550   #2553   ",
	"reviewcount": "15 Reviews sorted by",
	"description": "“Is this really a f*cking cannon fodder counterattack system???” Zhou ZiRuo transmigrated into a game and became a shapeshifting, cannon fodder, baby fox demon.\n\nAs a new (male) fox demon, he thought his task was only to counterattack the gold-fingered, peerless, super explosively cool, iceberg protagonist. \n\nBut why did the iceberg protagonist seem like he was possessed by a death god, with NPCs dropping dead left and right everywhere he went?\n\nWhy must he help the protagonist investigate the incidents or else the counterattack percentage would fall through the floor, leading to his death?\n\nAs Zhou ZiRou wearily investigated the supernatural cases, at the same time, he walked down the grand path of counterattacking the protagonist and kicking him to the curb.\n\nYet no one knew that under the iceberg protagonist’s calm and proper exterior was a heart that was both kuudere and wicked.\n\nSystem: Congratulations! The counterattack was successful!\n\nZhou ZiRou: You motherf*cker, you never said that I’d counterattack into the role of the female lead ahhh!!!>"
}