{
	"url": "https://www.novelupdates.com/series/the-hero-banished-me-saying-i-dont-want-incompetents-but-all-my-other-friends-followed-me/",
	"title": "The Hero Banished Me Saying, “I Don’t Want Incompetents,” but All My Other Friends Followed Me - Novel Updates",
	"image": "https://www.novelupdates.com/img/noimagefound.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Comedy   Ecchi   Fantasy   Harem   Mature   Romance   ",
	"tags": "Absent Parents   Aggressive Characters   Dancers   Demon Lord   Demons   Depictions of Cruelty   Elemental Magic   Elves   Forced Living Arrangements   Former Hero   God-human Relationship   Godly Powers   Gods   Heroes   Kind Love Interests   Knights   Love Interest Falls in Love First   Male Protagonist   Manipulative Characters   Multiple POV   Overpowered Protagonist   Polygamy   Priestesses   Priests   Psychopaths   R-15   Religions   Reluctant Protagonist   Saints   Strong Love Interests   Strong to Stronger   Succubus   Unique Weapon User   Unique Weapons   ",
	"rating": "(3.2 / 5.0, 42 votes)",
	"author": "Hametsu   Ruin   破滅   ",
	"year": "\n2020",
	"ranking": "#3314   #4192   #3781   #6260   #4712   ",
	"reviewcount": "7 Reviews sorted by",
	"description": "'I don't want incompetent people. Get out of my party right now!'\r\n\r\nThe protagonist, Kagura, was shouted down by the hero and was told he was fired. The hero's party consisted of Kagura, the hero and three girls.\r\n\r\nEven though he knew the lowly inner thoughts of the hero, Kagura still accepted the fact he was fired.\r\n\r\nKagura was a knight of the church.\r\nBecause of his position, he could not quit on his own, but it was natural for him to stay in the wild and eat preserved food. He was fed up with the harsh journey of defeating the Demon King and the constant lack of sleep because he was always on guard duty.\r\n\r\nFired? That would be great!\r\n\r\nI'll take this opportunity to quit the church, get my severance pay, and then take over the family business and relax!\r\nThe three girls who used to be part of the hero's party came to see Kagura, who had been exiled in high spirits.\r\n\r\n'If Kagura-sama isn't with us, there's no reason for us to be in that hero's party!'\r\n\r\n...... Apparently, all of them were in the party for me, not the hero.>"
}