{
	"url": "https://www.novelupdates.com/series/realize-online-a-gamer-who-loves-to-play-with-bug-tricks-overruns-the-esports-world-with-his-inhuman-skills/",
	"title": "Realize Online – A Gamer Who Loves to Play with Bug Tricks Overruns the eSports World with His Inhuman Skills - Novel Updates",
	"image": "https://www.novelupdates.com/img/noimagefound.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Fantasy   School Life   Sci-fi   Shounen   ",
	"tags": "Artificial Intelligence   Beautiful Female Lead   e-Sports   Futuristic Setting   Gamers   Hiding True Identity   Male Protagonist   MMORPG   Ninjas   Secretive Protagonist   Virtual Reality   ",
	"rating": "(2.7 / 5.0, 11 votes)",
	"author": "Kumano Genkotsu   熊乃げん骨   ",
	"year": "\n2021",
	"ranking": "#2000   #2000   #9521   #5640   #11771   ",
	"reviewcount": "3 Reviews sorted by",
	"description": "An extremely popular VRMMO “Real World Online” with a total of one billion players.\n\nSora Aoi, a high school student, thinks about the game even when he sleeps and eats, and even logs in secretly during his breaks at school.\n\nBut he doesn’t want to stand out, so he plays the game solo nowadays. He hides his face, helps people as a hobby in the game in order to imitate a hero.\n\nThen one day, he meets Rena Ginjo, a very beautiful girl who transferred to his school, and his life changes completely.\n\n“You’re the mysterious ‘Aoki Hayate (Blue Gale)’-san hero that’s all over the internet, right?　If you don’t want your true identity to be revealed, will you do what I say?”\n\nFor some reason, she knows who he is, and Sora can’t help but show his gaming skills in front of many people.\n\n“I don’t want to stand out too much, but I can’t stop playing games!”\n\nHaving devoted his entire youth to gaming, he shocks the world with a skill far beyond that of a professional gamer!\n\nA super ambitious work of VRMMO x Augmented Reality x eSports!\n\nThis is the passionate and youthful heroic tale of a boy who yearns to be a hero.>"
}