{
	"url": "https://www.novelupdates.com/series/saving-a-simple-and-kind-viscountess-whose-engagement-was-broken-and-sentenced-to-the-labyrinth-prison/",
	"title": "Saving a Simple and Kind Viscountess Whose Engagement Was Broken and Sentenced to the Labyrinth Prison - Novel Updates",
	"image": "https://www.novelupdates.com/img/noimagefound.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Comedy   Fantasy   Mystery   Romance   Tragedy   ",
	"tags": "Academy   Broken Engagement   Demons   Devoted Love Interests   Doting Love Interests   Dreams   Dungeons   European Ambience   Magic   Magic Beasts   Male Protagonist   Nobles   Protagonist Falls in Love First   Royalty   Schemes And Conspiracies   Summoning Magic   Unconditional Love   Villainess Noble Girls   ",
	"rating": "(3.8 / 5.0, 53 votes)",
	"author": "サンボン   ",
	"year": "\n2022",
	"ranking": "#714   #3219   #3669   #353   #6446   ",
	"reviewcount": "5 Reviews sorted by",
	"description": "On the night of his eighth birthday, “Ivan,” the eldest son of Countess “Escobal,” an aristocrat of the great Astoria Empire, had a strange dream.\n\nIt’s a dream of the empire’s crown prince and his cronies breaking their engagements with their fiancées.\n\nThe farce, however, comes to an end with the arrival of the emperor.\n\n[For causing chaos in the Astoria Empire, the Crown Prince and all others involved in the broken engagement are sentenced to “Labyrinth Prison.”]\n\nAlthough Ivan dreams every day that he is only a bystander to the scene in which the crown princes are thrown into a labyrinth from which no one has yet returned, his curiosity leads him to become a participant in the dream himself.\n\nFrom inside the labyrinth, Ivan sees the ugly fight between the nobles and the terrible demons who live there.\n\nWhen Ivan flees to avoid being attacked by a demon, he is defended by a woman.\n\nHowever, the woman who is protecting Ivan is devoured by a demon.\n\nIn her final moments, she gives Ivan a friendly smile.\n\nIvan wakes up from a nightmare, and from then on, after thousands of nightmares, tries to traverse the labyrinth to save “Nadia”, the daughter of Viscount Jest.\n\nTime passes. Ivan enrolls in the Imperial Academy and meets the real Nadia.\n\nIvan makes a promise.\n\n“I will save Nadia in reality.”\n\nThis is the story of a man who fights to save the woman he loves through thousands of nightmares and real-life situations, until he finally finds happiness.>"
}