{
	"url": "https://www.novelupdates.com/series/the-baby-raising-a-devil/",
	"title": "The Baby Raising A Devil - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/11/The-Baby-Raising-A-Devil.jpeg",
	"noveltype": "(KR)",
	"genre": "Adventure   Comedy   Fantasy   Psychological   Romance   Slice of Life   ",
	"tags": "Abandoned Children   Abusive Characters   Adopted Children   Adopted Protagonist   Age Regression   Antihero Protagonist   Aristocracy   Army   Calm Protagonist   Character Growth   Charismatic Protagonist   Child Abuse   Child Protagonist   Childcare   Childhood Friends   Cute Protagonist   Demons   Doting Older Siblings   Doting Parents   Empires   European Ambience   Familial Love   Family   Female Protagonist   God Protagonist   Gods   Hiding True Abilities   Kidnappings   Kind Love Interests   Kingdoms   Mind Break   Mind Control   Money Grubber   Mysterious Family Background   Mystery Solving   Nobles   Past Plays a Big Role   Past Trauma   Reincarnation   Religions   Revenge   Royalty   Ruthless Protagonist   Saints   Second Chance   Secret Organizations   Sister Complex   Smart Couple   Time Skip   Time Travel   Tragic Past   ",
	"rating": "(4.4 / 5.0, 313 votes)",
	"author": "리샤   ",
	"year": "\n2018",
	"ranking": "#1678   #1368   #495   #865   #218   ",
	"reviewcount": "68 Reviews sorted by",
	"description": "Three regressions, 4th life.\n\nAlthough she was prophesied and raised as the child of fate, she was sacrificed when the real child of fate appears.\n\n‘This country is no good, let’s defect!’\n\nLeblaine chooses to be adopted to earn money until defecting. There was nothing wrong this far, but the place she chose was a family full of villains. She tried to trick those bad guys in order to live comfortably before defecting…\n\n“My daughter is the cutest in the world.”\n\n“Give her the building. She can use it as her bathroom.”\n\n“It’s okay, Leblaine told me not hit you, but she didn’t say not to kill you?”\n\n“Who made my sister cry!”\n\n‘…they’re spiralling out of control, what should I do?’\n\n***\n\n“You can’t hit or kill people just because you don’t like them.”\n\nMy family was quiet even though I purposely looked sad.\n\n‘Then there’s nothing I can do!’\n\nI looked back at my family with a sharp gaze and said solemnly.\n\n“I’m going to sleep without a blanket.”\n\n“I’m wrong, kid!”\n\n“I’m sorry!”\n\n“I won’t kill anyone!”\n\nGood.>"
}