{
	"url": "https://www.novelupdates.com/series/neet-receives-a-dating-sim-game-leveling-system/",
	"title": "NEET Receives a Dating Sim Game Leveling System - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/05/5871911103_1495804357126.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Fantasy   Harem   Martial Arts   School Life   Supernatural   ",
	"tags": "Alternate World   Appearance Changes   Beautiful Female Lead   Brother Complex   Calm Protagonist   Caring Protagonist   Character Growth   Cheats   Cohabitation   Demons   Dense Protagonist   Fat to Fit   Galge   Game Elements   Ghosts   Handsome Male Lead   Hard-Working Protagonist   Hidden Abilities   Hiding True Identity   Honest Protagonist   Indecisive Protagonist   Late Romance   Level System   Loli   Male Protagonist   Mature Protagonist   Modern Day   Monsters   Multiple POV   Mysterious Family Background   Mysterious Past   Mystery Solving   Otaku   Past Plays a Big Role   Personality Changes   Polygamy   Reincarnated in Another World   Reincarnation   Romantic Subplot   Secret Organizations   Siblings Not Related by Blood   Sister Complex   Special Abilities   Spirit Users   Spirits   System Administrator   Time Manipulation   Transmigration   Trap   Ugly to Beautiful   Weak to Strong   Younger Sisters   ",
	"rating": "(3.6 / 5.0, 603 votes)",
	"author": "Idle Fish Goes Ashore   咸鱼上岸   ",
	"year": "\n2016",
	"ranking": "#2000   #2000   #152   #5189   #721   ",
	"reviewcount": "82 Reviews sorted by",
	"description": "A 30-year-old NEET is reincarnated into the body of an otaku that choked to death on instant noodles. As he comes to grips with his new life, he realizes that this world is subtly different from Earth. The denizens of this world are far better looking, and this new world also possesses futuristic technology as well as mysterious Yin Yang masters!\r\n\r\nAfter reincarnating, he realized that he was endowed with a miraculous game-like system, which enables him to increase his own stats and transcend the limits of the human body. This system even has a game-breaking ability to save and load in real life!\r\n\r\nIn this new world that’s akin to a 2-D game, he just wants to enjoy life and head for a glorious future… However, he is quickly embroiled in a complex plot. Can he unlock his true potential and utilize his system to break the shackles that confine him and discover the truth about his previous body’s circumstances?>"
}