{
	"url": "https://www.novelupdates.com/series/the-lazy-prince-abandons-his-homeland-%e3%80%9c-a-life-of-decadence-begins-with-captivity/",
	"title": "The Lazy Prince Abandons His Homeland 〜 a Life of Decadence Begins with Captivity - Novel Updates",
	"image": "https://www.novelupdates.com/img/noimagefound.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Supernatural   ",
	"tags": "",
	"rating": "(3.0 / 5.0, 3 votes)",
	"author": "モノクロウサギ   ",
	"year": "\n2022",
	"ranking": "#2000   #2000   #13492   #12622   #13513   ",
	"reviewcount": "No Reviews",
	"description": "The Land Kingdom, a small country, has been forced to go to war with the Froysel Empire, one of the greatest powers on the continent, for a very silly reason. In the face of the Empire’s steady invasion of its land, the overrun Land Kingdom’s army had no choice but to flee for the royal capital.\r\n\r\nIn the midst of all this, Lute, the sixth in line of succession to the Land Kingdom and a bastard fourth prince is entrusted with a rear force with the task of helping the main army escape.\r\n\r\nLed by Lute are fifty-three soldiers who have willingly volunteered to fight under his command. The approaching force, however, is an imperial army of 10,000 soldiers, wrapped in equipment that utilizes overwhelming technological power. The troops led by Lute do not have a chance in hell of winning, and the order to lead those men is in fact just meant as a sacrifice. Lute’s appointment as commander is not based on the belief that he could buy more time. It is just that it didn’t matter if he died, and he has the right rank for a commander position. After all, in addition to the fact that he is a bastard, he is called ‘the incompetent prince’ for being a useless prince who only does the bare mininum of work for the royal family due to his brazen and lazy personality!\r\n\r\nHowever, even such an incompetent and lazy prince is not without a human heart. Lute can’t help but act for the sake of his subordinates, who have chosen to remain on the site of their death on their own fanciful whims.\r\n\r\n── The ‘incompetent’ Lute, has two horrible secrets.\r\n\r\nThis is the story of a prince of a small country who regards laziness as supreme and struggles to obtain the life he wants in an era of turmoil. It’s the story of the ‘cool-headed, lazy’ Lute, who is counted as one of the ‘conquerors’ of history in later generations!>"
}