{
	"url": "https://www.novelupdates.com/series/the-lv-99-middle-boss-starts-his-second-life-with-subordinates/",
	"title": "The LV.99 Middle Boss, Starts His Second Life with Subordinates! - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/03/The-LV-Middle-Boss-Starts-His-Second-Life-with-Subordinates.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Comedy   Drama   Fantasy   Harem   Mystery   ",
	"tags": "Adapted to Manga   Adventurers   Antihero Protagonist   Appearance Different from Actual Age   Boss-Subordinate Relationship   Death   Demi-Humans   Demon Lord   Demons   Dense Protagonist   Dungeons   Fairies   Fantasy World   Goblins   Heroes   Human-Nonhuman Relationship   Humanoid Protagonist   Level System   Magic   Male Protagonist   Management   Mature Protagonist   Misunderstandings   Monsters   Near-Death Experience   Obsessive Love   Protagonist Strong from the Start   Reincarnation   Romantic Subplot   Special Abilities   Strong Love Interests   Strong to Stronger   Summoning Magic   Underestimated Protagonist   Vampires   Yandere   Younger Love Interests   ",
	"rating": "(3.4 / 5.0, 43 votes)",
	"author": "Sawatari Kazami   猿渡かざみ   ",
	"year": "\n2018",
	"ranking": "#2000   #2000   #5254   #6882   #6305   ",
	"reviewcount": "1 Review sorted by",
	"description": "This dungeon is no good!\n\nOne day, Narugoa, a single monster, is appointed as the mid-boss of the first dungeon, the Cave of Silence, which is the closest dungeon to the heroes’ home base. The dungeon is full of unmotivated employees (monsters), and Narugoa decides that this is not good enough, so he begins a major reform of the dungeon.\n\nBut then the legendary heroes who had already defeated the Demon King arrived, and Narugoa challenged the heroes alone to protect his beloved employees, but was defeated, and somehow was reincarnated in a world 100 years later!\n\nIn a world 100 years in the future, a painful mid-boss fantasy unfolds with the employees of the legendary Cave of Silence, which has become a great labyrinth! Here it comes!\n\nMagic exists, but the protagonist cannot use it. It is a world where God exists. There is also gore.–Mangadex.org>"
}