{
	"url": "https://www.novelupdates.com/series/wicked-island-of-ireland/",
	"title": "Wicked Island Of Ireland - Novel Updates",
	"image": "https://www.novelupdates.com/img/noimagefound.jpg",
	"noveltype": "(KR)",
	"genre": "Adult   Josei   Mystery   Romance   Smut   ",
	"tags": "Adopted Protagonist   Amnesia   Beautiful Female Lead   Bestiality   Charming Protagonist   Childhood Friends   Childhood Love   Female Protagonist   Handsome Male Lead   Human Experimentation   Loneliness   Marriage   Medical Knowledge   Modern Day   Obsessive Love   Possessive Characters   R-18   Racism   Shy Characters   Sickly Characters   Wealthy Characters   ",
	"rating": "(4.0 / 5.0, 10 votes)",
	"author": "Rose Line   로즈라인   ",
	"year": "\n2019",
	"ranking": "#6970   #2000   #11674   #6881   #10568   ",
	"reviewcount": "No Reviews",
	"description": "Isu was trapped in a building on a deserted island.\r\n\r\nShe had no memories, no recollection of how she got here.\r\n\r\nShe was rescued by one of the survivors of a plane crash that took place on the island.\r\n\r\nHayden Wight. A young gentleman from the United Kingdom. Representative of a security company.\r\n\r\nMeeting him could have been a blessing, giving her the chance to escape from vicious criminals.\r\n\r\nFrom his eyes to his lips and his whole body, the man also seemed to want to give her a chance to start a new life.\r\n\r\n***\r\n\r\n“I don’t know my name or my age. I don’t even know what kinds of danger I am in. That’s why it’s a bit difficult for me to be next to a man.”\r\n\r\nIsu expressed concern.\r\n\r\n“I mean, you could also be in danger if you were to get involved with me.”\r\n\r\nA warm breeze blew in from the sea.\r\n\r\nAs the sand particles began to fly through the air, Hayden covered Isu’s face with his hand and replied,\r\n\r\n“Then I’ll have to receive higher compensation. I don’t intend for you to pay me with your body, so you can rest easy.”\r\n\r\nUnlike usual, Isu could barely control her expression. The memory of last night suddenly came to mind.\r\n\r\nHis blue eyes focused on Isu.\r\n\r\n“Y-you’re staring at me like a filthy beast.”\r\n\r\nIsu stammered, unable to respond properly.\r\n\r\nJust then, the question that followed took her breath away.\r\n\r\n“Who was it that pretended to be asleep and turned me on?”\r\n\r\nShe knew he had seen it all last night.>"
}