{
	"url": "https://www.novelupdates.com/series/second-story-online-aiming-to-become-the-worlds-number-1-ideal-witch/",
	"title": "Second Story Online: Aiming To Become The World’s Number 1. Ideal Witch - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/02/image0.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Comedy   Fantasy   Sci-fi   Slice of Life   ",
	"tags": "Alchemy   Beast Companions   Carefree Protagonist   Crafting   Cunning Protagonist   Cute Protagonist   Determined Protagonist   Familiars   Fantasy Creatures   Farming   Female Protagonist   Friendship   Futuristic Setting   Gamers   Grinding   Guilds   Heartwarming   Hiding True Identity   Kuudere   Level System   Loyal Subordinates   Merchants   Misunderstandings   MMORPG   Quirky Characters   Romantic Subplot   Skill Assimilation   Summoning Magic   Teamwork   Virtual Reality   Wars   Witches   ",
	"rating": "(4.3 / 5.0, 83 votes)",
	"author": "Iroha (彩帆)   彩帆   ",
	"year": "\n2016",
	"ranking": "#4080   #2872   #3940   #6028   #3351   ",
	"reviewcount": "3 Reviews sorted by",
	"description": "“To the person in search of a second story—become the hero that saves the common people from despair, defeat the demon king and his minions, or just settle for a casual life as a leisurely villager. You can become any kind of person you want in this world.\r\n\r\nLet’s start your second story now! The story you spin becomes part of the history of Second Story Online!”\r\n\r\nThe game has finished its beta phase and is now promoting through such a catch phrase. It’s an online game not much different from other VRMMOs with a fantasy setting. If there’s a slight difference, then it could be that this game is filled with a lot of roleplayers.\r\n\r\nI am a player of such a game; moreover, a roleplayer. I started to play this game because I had always wanted to be a witch. From today onwards, I will do my best to roleplay the ideal witch!\r\n\r\nAlthough roleplayer Chloe tries hard to become the ideal witch.. it seems like her ideal picture of a witch is slightly skewed.>"
}