{
	"url": "https://www.novelupdates.com/series/i-was-connected-to-earths-black-market-from-another-world-with-the-skill-market/",
	"title": "I Was Connected to Earth’s Black Market From Another World With The Skill [Market]! - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/10/I-Was-Connected-to-Earths-Black-Market-From-Another-World-With-The-Skill-Market.jpeg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Fantasy   Harem   Shounen   ",
	"tags": "Beastkin   Cautious Protagonist   Demi-Humans   Demon Lord   Determined Protagonist   Dwarfs   Early Romance   Elves   Firearms   Game Elements   Gunfighters   Hard-Working Protagonist   Heroes   Human-Nonhuman Relationship   Kingdom Building   Kingdoms   Magic   Magic Beasts   Male Protagonist   Medieval   Merchants   Monsters   Multiple Transported Individuals   Polygamy   R-15   Ruthless Protagonist   S*aves   Summoned Hero   Summoning Magic   Sword And Magic   Technological Gap   Transported to Another World   Wars   Weak to Strong   ",
	"rating": "(3.9 / 5.0, 33 votes)",
	"author": "Yen Isawa   石和￥   ",
	"year": "\n2018",
	"ranking": "#344   #1181   #4086   #1077   #5842   ",
	"reviewcount": "6 Reviews sorted by",
	"description": "Takefu Yoshiaki, an ordinary office worker, is summoned from modern Japan to another world. However, Yoshiaki, who was only caught up in the 'Hero Summoning', is branded as incompetent by the king and is punished!\r\n\r\nWhile the heroes are attacking together, Yoshiaki decides to use his special skill, [Market]! And then there appears ― Simon, a shady looking arms dealer from the Earth (and a drug addict)!\r\n\r\nAfter negotiating with Simon, Yoshiaki somehow manages to escape his predicament with a pistol (a Spanish copy of the M1911) and an automatic rifle (AKM).\r\n\r\nWith nowhere else to go, Yoshiaki finds himself helping a young dwarf girl named Mirril...?\r\n\r\nYoshiaki's encounter with Dwarves, Beastman and Elves, all of whom have been oppressed by humans, forces him to make a decision. He will make full use of the power of the [Market] and arm the sub-humans with modern weapons from Earth!\r\n\r\nThe legend of the man who would later be known as the Demon King begins now...!!>"
}