{
	"url": "https://www.novelupdates.com/series/rebirth-of-the-thief-who-roamed-the-world/",
	"title": "Rebirth of the Thief Who Roamed The World - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2015/08/chongshengzhi.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Fantasy   Martial Arts   Supernatural   ",
	"tags": "Angels   Appearance Changes   Army   Army Building   Artificial Intelligence   Assassins   Average-looking Protagonist   Beautiful Female Lead   Calm Protagonist   Clever Protagonist   Crafting   Cunning Protagonist   Demons   Determined Protagonist   Devoted Love Interests   Dragons   Dungeons   Dwarfs   Economics   Elves   Fairies   Familial Love   Fantasy Creatures   Fated Lovers   Game Ranking System   Gamers   Guilds   Hard-Working Protagonist   Hiding True Identity   Knights   Leadership   Level System   Loyal Subordinates   Magic   Male Protagonist   Mature Protagonist   Medieval   Mercenaries   MMORPG   Modern Day   Money Grubber   Monsters   Necromancer   Nobles   Orcs   Overpowered Protagonist   Past Plays a Big Role   Pets   Poor to Rich   Power Couple   Priests   Revenge   Romantic Subplot   Schemes And Conspiracies   Second Chance   Skill Books   S*aves   Special Abilities   Sword And Magic   Thieves   Time Travel   Tragic Past   Unreliable Narrator   Virtual Reality   Wars   ",
	"rating": "(3.9 / 5.0, 1051 votes)",
	"author": "Mad Snail   发飙的蜗牛   ",
	"year": "\n2010",
	"ranking": "#4265   #2000   #16   #123   #99   ",
	"reviewcount": "138 Reviews sorted by",
	"description": "The world’s largest VRMMO, Conviction, was almost like a second world for humanity. It had integrated itself into the real world’s economy, with both corporations and individuals seeking their fortunes through the game. \n\nIn this game, Nie Yan prided himself on his Level 180 Thief. He could barely be considered among the top experts in the game. Though, that was the only thing he could take pride in. He was penniless and unable to advance in life; a situation he was forced into by the enemy of his father. If it weren’t for the little money he made by selling off items in Conviction, he would’ve barely been able to eat. In the end, he chose to settle his matters once and for all. He assassinated his father’s enemy. He lay dying shortly after being shot in the pursuit. \n\nHowever, that wasn’t the end of his story. Instead, he awoke moments later to find that he had reincarnated into his past self. Armed with his experience and knowledge of future events, he sets out to live his life anew.>"
}