{
	"url": "https://www.novelupdates.com/series/captivated-by-you/",
	"title": "Captivated by You - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2017/03/novelimage.png",
	"noveltype": "(CN)",
	"genre": "Drama   Josei   Romance   ",
	"tags": "Female Protagonist   Modern Day   Popular Love Interests   Voice Actors   ",
	"rating": "(4.1 / 5.0, 102 votes)",
	"author": "Going Fishing   Gui Yu   归渔   ",
	"year": "\n2017",
	"ranking": "#6970   #2000   #4296   #3075   #4094   ",
	"reviewcount": "16 Reviews sorted by",
	"description": "Secretly Captivated was a somewhat annoyingly low-profile Internet CV (Character Voice). In all of his life, he had only dubbed in two radio dramas, yet he stably sat on his throne of the number one CV in the Internet dubbing circle.\r\n\r\nHe was romantic, gorgeous, charming, and touching. When he spoke, you would think that he was looking at you with a somewhat smiling expression in his eyes that made you hold your breath.\r\n\r\nWould you fall in love with a person because of his voice, regardless of his appearance, age, or family background? Would you fall in love with this person without the slightest hesitation solely because of his voice?\r\n\r\nIf you asked Mo Lan questions like these, she would definitely say she would while nodding her head without the slightest hesitation.\r\n\r\nMo Lan believed that the first time she met Gu Yemi was on the high-speed railway that was driving towards Hangzhou, when she had kindly reminded him that the railway train already reached the station. However, the first time Gu Yemi met her was actually very late at night in a train on Line 2 of the Nanjing Subway.\r\n\r\nAfterwards, the Internet dubber CV Secretly Captivated who had already mysteriously hid away for three years announced that he would begin acting in new projects and became active in the Internet dubbing circle again. And after that, he announced that henceforth, he would withdraw from the circle again.\r\n\r\nActually, the fact that Gu Yemi only briefly retired in order to find that girl who made a smiling expression from the corners of her eyes to the tips of her eyebrows when talking about him was probably not even known by Mo Lan. Afterwards, he told her that in the second half of his life, he only wanted to be captivated by her. With these sincere words, he offered to give me his only and eternal life in the Internet dubbing circle.>"
}