{
	"url": "https://www.novelupdates.com/series/after-an-infinite-flow-player-retires/",
	"title": "After an Infinite Flow Player Retires - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/04/After-an-Infinite-Flow-Player-Retires.jpg",
	"noveltype": "(CN)",
	"genre": "Horror   Shounen Ai   Supernatural   ",
	"tags": "Appearance Different from Actual Age   Calm Protagonist   Clingy Lover   Comedic Undertone   Death   Enemies Become Lovers   Flashbacks   Game Ranking System   Ghosts   Handsome Male Lead   Human-Nonhuman Relationship   Lazy Protagonist   Love Interest Falls in Love First   Male Yandere   Obsessive Love   Past Plays a Big Role   Persistent Love Interests   Possessive Characters   Protagonist Strong from the Start   Salaryman   Schemes And Conspiracies   Secret Identity   Secret Organizations   Seeing Things Other Humans Can't   Slow Romance   Strong Love Interests   Survival Game   Yandere   Younger Love Interests   ",
	"rating": "(4.4 / 5.0, 100 votes)",
	"author": "Tang Ốc   桑沃   ",
	"year": "\n2020",
	"ranking": "#1874   #1391   #2358   #1881   #1308   ",
	"reviewcount": "14 Reviews sorted by",
	"description": "As a renowned fierce god in the infinite flow world, Ye Jia deliberately hid his strength after clearing it and found an idle job in the Logistics Department of the Paranormal Investigation and Management Bureau.\n\nHe originally thought that he would be able to return to his salted fish life and live comfortably.\n\nBut what Ye Jia didn’t expect was……\n\nOne day, he opened the fridge and was met with an evil spirit’s vicious head, “Boss, boss. Did you miss me…..”\n\nYe Jia: “………”\n\nHe slammed the door shut and fell into deep thought.\n\nWasn’t there something wrong with this world?\n\nThe TV behind him was broadcasting news:\n\nRecently there has been a surge in paranormal events and the number of missing persons has sharply increased. It is currently under investigation…..\n\n*\n\nWith the infinite flow escape game unexpectedly crashing, countless demons and ghosts trapped in it were released, bringing disaster to the world.\n\nOnly Ye Jia who cleared the game knew the truth.\n\nAll of these……..were old acquaintances………\n\nYe Jia: My life is too difficult.\n\n#I clearly just want to be an ordinary corporate s*ave#\n\nFinally, one day, he saw an unexpected monster.\n\nAfter two seconds of silence, Ye Jia greeted dryly: “…….You came out too. What a coincidence.”\n\nThe man before him smiled and slowly approached him, “My boyfriend ran away from home. Of course, I should come out to catch him and bring him back.”\n\nYe Jia: “……..”\n\nWho would have thought that, along with the global sensation of ghost doors opening in the mortal world, there was also…..\n\nHis peach blossom debt.\n\nIt can’t be, sir. This is also okay?>"
}