{
	"url": "https://www.novelupdates.com/series/the-duchess-and-the-devil/",
	"title": "The Duchess and the Devil - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/09/xxlarge_7.jpeg",
	"noveltype": "(KR)",
	"genre": "Drama   Fantasy   Mystery   Romance   Smut   Tragedy   ",
	"tags": "Aristocracy   Beautiful Female Lead   Character Growth   Clever Protagonist   C*nnilingus   Contracts   Couple Growth   Cunning Protagonist   Death   Demi-Humans   Demon Lord   Demons   Depression   Determined Protagonist   Empires   European Ambience   Family   Fantasy World   Female Protagonist   First Love   First-time Interc**rse   F*llatio   Handsome Male Lead   Hiding True Identity   Investigations   Jealousy   Kingdoms   Loneliness   Long Separations   Love Interest Falls in Love First   Lovers Reunited   Magic   Marriage   Marriage of Convenience   Mysterious Past   Mystery Solving   Nobles   Nudity   Possession   Power Struggle   Pregnancy   R-18   Returning from Another World   Royalty   Second Chance   Slow Romance   Special Abilities   Strong Love Interests   Wealthy Characters   ",
	"rating": "(4.2 / 5.0, 106 votes)",
	"author": "Mongsu   몽슈   ",
	"year": "\n2020",
	"ranking": "#3633   #4782   #2152   #6111   #1168   ",
	"reviewcount": "25 Reviews sorted by",
	"description": "Her husband, Derrick Vaisil, who had a funeral four days ago, suddenly came back to life. But this man was so different from before he died!\n\n“I’m hungry, wife.”\n\nFrom regularly turning up in the dining room that he had always avoided,\n\n“How about we use the same bedroom?”\n\nTo a furtive suggestion of combining their bedrooms that they had always been using separately.\n\nWhat in the world happened to this man?\n\n*\n\n“You always give off this delicious smell…………. but how can I bear with it?”\n\nRight now, at this moment, Judith felt like he was a cruel predator who would completely devour her from head to toe easily.\n\n“You, uh, what the hell are you?”\n\nHe, who tormented her as he repeatedly sucked on her soft earlobe and put his tongue inside her ear, chuckled.\n\n“What am I?”\n\nDerrick kissed her chin and whispered languidly.\n\n“I am your husband, Judith.”>"
}