{
	"url": "https://www.novelupdates.com/series/an-s-class-adventurer-banished-as-the-tank-of-the-party-uses-his-slave-release-skill-to-build-the-strongest-country-in-history/",
	"title": "An S-class Adventurer, Banished as the Tank of the Party, Uses His “S*ave Release” Skill To Build the Strongest Country in History! - Novel Updates",
	"image": "https://www.novelupdates.com/img/noimagefound.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adult   Adventure   Ecchi   Fantasy   Harem   Mature   Romance   ",
	"tags": "An*l   Adventurers   Angels   Appearance Different from Actual Age   Artifacts   Artificial Intelligence   Beastkin   Blacksmith   Charismatic Protagonist   Charming Protagonist   Childhood Friends   Childhood Love   Clingy Lover   Clones   C*nnilingus   Conditional Power   Demi-Humans   Demons   Dense Protagonist   Dolls/Puppets   Domestic Affairs   Dragons   Dwarfs   Elves   Exorcism   Fantasy World   Farming   F*llatio   Guilds   Handsome Male Lead   Heroes   Hidden Abilities   Human-Nonhuman Relationship   Love Interest Falls in Love First   Magic   Magic Beasts   Magic Formations   Magical Space   Magical Technology   Male Protagonist   Multiple POV   Mythology   Older Love Interests   Or*y   Polygamy   Proactive Protagonist   Protagonist Strong from the Start   Shikigami   Skill Assimilation   S*aves   Strong Love Interests   Strong to Stronger   Succubus   Summoning Magic   Sword And Magic   Sword Wielder   Transformation Ability   Underestimated Protagonist   Unreliable Narrator   Witches   Younger Love Interests   ",
	"rating": "(3.1 / 5.0, 44 votes)",
	"author": "Mukaihara Yukito   向原 行人   ",
	"year": "\n2020",
	"ranking": "#2917   #2310   #3160   #911   #5587   ",
	"reviewcount": "4 Reviews sorted by",
	"description": "I became an S-class adventurer with my childhood friends, using the strength that I’m proud of to attract enemies and have my friends defeat them in the meantime, continuing to play the so-called “tank” role.\n\nI was a paladin, a job specializing in protecting my companions, but perhaps because everyone was protected by me, they did not learn any defense or evasion skills, but only improved their attack skills.\n\nIn such a situation, they forgot that they are protected by my skills, and they fired me …… Wait, I don’t care what happens, okay!? Even though your natural defensive power are as good as paper.\n\nBut since I had been through a terrible time on my way up to become an S-class adventurer, I decided to take it easy for once and went to the Adventurers’ Guild to accept a request for a relaxing day alone.\n\nI was told that they had tried to cultivate the land in the past, but the monsters that appeared were so strong that all the farmers had run away, so the vast land would be given as a reward to anyone who succeeds. they were rewarded with a large tract of land.\n\nWhen I went there after being told that “Alex, an S-class adventurer, would be fine!” …… I found that there was not even a village or a house around it, and it’s beyond of what you call the countryside, because it was a land inhabited by monsters.\n\nThe land was deserted, with farming tools left unattended, and there was a monster that I had never seen before, and when I managed to defeat it, I acquired the “s*ave Release” skill.\n\nI was told that if I used this skill, it would summon one person of the opposite sex, who is ens*aved somewhere in the world, to me.\n\nI thought it would be better for the world if I used this skill, and I activated it immediately, and a beautiful elf girl appeared.\n\nAfter that, a girl with architecture skill, a princess from a foreign country who was a prisoner …… and I kept freeing people who were ens*aved, and before I knew it, a country was formed and I was treated like a king.>"
}