{
	"url": "https://www.novelupdates.com/series/i-am-a-duchess-who-has-rewound-nine-times-but-my-tenth-life-seems-to-be-a-reward-mode/",
	"title": "I Am a Duchess Who Has Rewound Nine Times, but My Tenth Life Seems to Be a Reward Mode - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/08/702.jpg",
	"noveltype": "(JP)",
	"genre": "Comedy   Drama   Fantasy   Romance   Shoujo   Slice of Life   Tragedy   ",
	"tags": "Angels   Aristocracy   Average-looking Protagonist   Beast Companions   Broken Engagement   Child Abuse   Childcare   Comedic Undertone   Demon Lord   Demons   Different Social Status   Elemental Magic   Female Protagonist   Gods   Hard-Working Protagonist   Harsh Training   Lack of Common Sense   Magic   Maids   Martial Spirits   Misunderstandings   Multiple Realms   Multiple Reincarnated Individuals   Nobles   Overpowered Protagonist   Past Plays a Big Role   Previous Life Talent   Protagonist Strong from the Start   Reincarnation   Royalty   Saints   Second Chance   Sickly Characters   Spirit Users   Spirits   Summoning Magic   Sword And Magic   Time Loop   Time Manipulation   Transformation Ability   Villainess Noble Girls   ",
	"rating": "(4.0 / 5.0, 180 votes)",
	"author": "Shinoda Mikan   志野田みかん   ",
	"year": "\n2020",
	"ranking": "#2836   #3492   #1389   #2161   #1336   ",
	"reviewcount": "35 Reviews sorted by",
	"description": "After her fiancé was stolen by Mia, a saint who came from another world, Duchess Alicia Grants was sentenced to death and executed.\r\n\r\nEvery time she died, her life was rewound. Each time, Prince Maximilian would be captivated by Mia!\r\n\r\nAs such, Alicia kept being executed, executed, and executed!\r\n\r\nIt was in her tenth life when she was finally reborn as the poor Baroness Ally.\r\n\r\n‘I’m no longer involved with princes and saints!’\r\n\r\nThen she decided to work as a maid in the royal palace for her sickly younger brother.\r\n\r\nFor some reason, Prince Maximilian didn’t give any attention to Saint Mia and began to dote on Baroness Ally…>"
}