{
	"url": "https://www.novelupdates.com/series/i-the-clock-user-was-kicked-out-of-the-craftsmens-guild-for-being-incompetent-but-at-the-dungeons-depths-i-awakened-my-true-power-even-though-i-was-told-to-return-because-they-couldnt/",
	"title": "I, the “Clock User”, Was Kicked Out of the Craftsmen’s Guild for Being Incompetent, but at the Dungeon’s Depths, I Awakened My True Power – Even Though I Was Told to Return Because They Couldn’t Handle the Work, It’s Too Late Now, and I Will Live Freely as an SSS-class Adventurer - Novel Updates",
	"image": "https://www.novelupdates.com/img/noimagefound.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Drama   Fantasy   Harem   ",
	"tags": "Absent Parents   Adventurers   Betrayal   Brother Complex   Bullying   Depictions of Cruelty   Distrustful Protagonist   Dungeons   Guilds   Hidden Abilities   Kidnappings   Loli   Love Interest Falls in Love First   Male Protagonist   Mind Break   Monsters   Naive Protagonist   Netorare   Overpowered Protagonist   Revenge   R*pe   Schemes And Conspiracies   S*ave Harem   S*aves   Sudden Strength Gain   Underestimated Protagonist   Weak to Strong   Yandere   Younger Sisters   ",
	"rating": "(2.6 / 5.0, 55 votes)",
	"author": "桜 霧 琥珀   ",
	"year": "\n2021",
	"ranking": "#4080   #3413   #3071   #1064   #6224   ",
	"reviewcount": "9 Reviews sorted by",
	"description": "Cyclo Owen. As a genius boy engineer, he was a person of great promise in the circles of magical tool production. However, at the age of 16, he was given the job skill of 'Clock User' in a skill-giving ceremony. In this world, it was forbidden for those with job skills to work in any other occupation. Thus, Cyclo's path as a genius engineer was cut off.\r\n\r\nHowever, Cyclo did not despair and worked diligently as a watchmaker and contributed to the craftsmen's guild by using his job skill as a Clock User. One day, however, the guildmaster of the craftsmen's guild banished him from the guild, saying that the guild did not need a watchmaker, a profession with little usefulness. Cyclo, who has lost his job, faces further despair. He happens to hear that a police officer is planning to rape Miranda Lilibel, the neighborhood apothecary's lady. Since the police is involved, he cannot carelessly report the crime. So Cyclo decides to stop the plan that night. He tries to restrain the police officer who is about to attack Miranda's house, but he is detained by the officer instead. He is then accused of trying to rape Miranda, and when Miranda hears the commotion, she tells Cyclo she has misjudged him.\r\n\r\nCyclo is thus made a criminal for attempted rape, and is sent to a remote area to explore the worst dungeon in the world. In the frontier, imprisoned adventurers are considered to be at the bottom of the heap, so Cyclo is looked down upon. Furthermore, due to rumors spread by his younger sister, Alice Owen, a well-known genius alchemist among adventurers, he is treated as incompetent here as well.\r\n\r\nHe is then mistreated by adventurers who makes uses him as a baggage carrier, and is pushed down to the bottom of a valley in the dungeon.\r\n\r\nAt the very bottom of the dungeon, Cyclo wished he could use his Clock User abilities to stop his internal clock. Then his hunger stopped. This led Cyclo to understand that his skill coul manipulate anything that could be counted as a clock.\r\n\r\nThus awakening to his true power, Cyclo escaped from the deepest part of the worst dungeon. In recognition of his achievements and abilities, he is recognized as an SSS-class adventurer.\r\n\r\nOn the other hand, those who had driven Cyclo to misfortune are now faced with misfortune in Cyclo's absence.>"
}