{
	"url": "https://www.novelupdates.com/series/the-life-i-started-with-my-step-sisters/",
	"title": "The Life I Started with My Stepsisters (?) - Novel Updates",
	"image": "https://www.novelupdates.com/img/noimagefound.jpg",
	"noveltype": "(JP)",
	"genre": "Adult   Comedy   Drama   Harem   Romance   Slice of Life   ",
	"tags": "An*l   BDSM   Beautiful Female Lead   Charismatic Protagonist   Charming Protagonist   C*nnilingus   Cohabitation   Cunning Protagonist   Exhibitionism   First-time Interc**rse   F*llatio   Handsome Male Lead   H*ndjob   Loli   Love Interest Falls in Love First   Male Protagonist   Masochistic Characters   M*sturbation   Modern Day   Multiple POV   Netorare   Netori   Orphans   Perverted Protagonist   Popular Love Interests   Possessive Characters   R-18   Sadistic Characters   Threesome   Toys   Tsundere   ",
	"rating": "(3.8 / 5.0, 99 votes)",
	"author": "黒影たかし   ",
	"year": "\n2016",
	"ranking": "#2000   #2000   #3620   #3694   #2774   ",
	"reviewcount": "3 Reviews sorted by",
	"description": "Mitsuru Takahashi is a 19 years old technical college student, who has a preference for early teens, especially middle schoolers.\r\n\r\nHe grew up in a motherless family with only his father.\r\n\r\nOne day his father invited him to eat together at a restaurant.\r\n\r\nNoticing a woman could be involved from his father’s recent behavior, he realized that his father wanted to talk to him about remarrying.\r\n\r\nThe woman that his father introduced, who would become his step-mother, was a 25 years old former hostess…\r\n\r\nMoreover, the step-mother’s two sisters, a second-year middle schooler and a sixth-year elementary schooler, would also live together with him. Mitsuru expected to live a storylike life where he could flirt with his 6 years older sister-like step-mother and his 2 little sister-like aunts.\r\n\r\nA new family, with beings similar to sisters. Thinking of his new life, Mitsuru’s crotch was beginning to swell in expectation!\r\n\r\nIt’s the well-known sister-in-law story.\r\n\r\nThis is a story about starting a friendly yet a bit dirty life with little sister-like beings and an older sister-like mother.>"
}