{
	"url": "https://www.novelupdates.com/series/ore-no-koto-ga-daisukina-osananajimi-to-tsuriau-yo-doryoku-shite-itara-ano-toki-tasuketa-aidoru-ga-tenko-shite-kite-gakko-ga-shuraba-to-ka-shite-imasu/",
	"title": "Ore No Koto Ga Daisukina Osananajimi To Tsuriau Yō Doryoku Shite Itara, Ano Toki Tasuketa Aidoru Ga Tenkō Shite Kite Gakkō Ga Shuraba To-ka Shite Imasu - Novel Updates",
	"image": "https://www.novelupdates.com/img/noimagefound.jpg",
	"noveltype": "(JP)",
	"genre": "Comedy   Ecchi   Harem   Romance   School Life   ",
	"tags": "Anti-social Protagonist   Beautiful Female Lead   Brother Complex   Childhood Friends   Early Romance   Male Protagonist   Obsessive Love   Persistent Love Interests   Strong Love Interests   Yandere   ",
	"rating": "(3.7 / 5.0, 17 votes)",
	"author": "Hiryu Satsuki   皐月陽龍   ",
	"year": "\n2022",
	"ranking": "#661   #1364   #8696   #2413   #9186   ",
	"reviewcount": "1 Review sorted by",
	"description": "\r\nAone Mirai had a childhood friend. She looks gorgeous, has beautiful eyes, and is huge (the important information)\r\nThe existence of Kujou Rei, who is also an idol of the school, stimulated a sense of inferiority in Mirai. Making him refuse her no matter how many times she confessed her feelings.\r\n\r\nHowever.\r\n'Just how many times do I have to say before you finally understand? Don't sneak into my futon.'\r\nEntering my completely naked\r\n\r\n'Good morning to you too, Mi-chan's Mii-chan.'\r\nShe would start to worship my son\r\n\r\n'Yahello, A-chan. Will A-chan also participate?'\r\nTrying to get my little sister, Arata, to join her indecent wasy of life,\r\nShe is just a completely messed up person.\r\n\r\n\r\n\r\n\r\nAnd ... It was around the time when Mirai also tried hard to cure his own (inferiority) complex.\r\n\r\n'Today, I transferred to this class. I'm Ayaka Kirinaga.'\r\nAn active idol transferred in from another school ...! ??\r\n\r\n'Arre? But you're not dating Mirai-kun, right?'\r\n'... My relationship with Mirai-kun is that which involves direct bonding of our bodies, though?'\r\n\r\nIn addition to that, being targeted by Nishiaya Hoshi, who had fun teasing Mirai, and Haruyama Saku, who became friends with Ayaka ...?\r\n\r\nThe school was now already transformed into a carnage. Then where does the future of Mirai guides him as he survives this ... ?>"
}