{
	"url": "https://www.novelupdates.com/series/the-villainous-shizun-is-as-beautiful-as-a-flower/",
	"title": "The Villainous Shizun Is As Beautiful As A Flower - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/02/The-Villainous-Shizun-Is-As-Beautiful-As-A-Flower.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Fantasy   Romance   Shounen Ai   Xianxia   ",
	"tags": "Amnesia   Cultivation   Devoted Love Interests   Doting Love Interests   Heartwarming   Immortals   Love Interest Falls in Love First   Master-Disciple Relationship   Misunderstandings   Multiple Reincarnated Individuals   Mysterious Past   Past Plays a Big Role   Possessive Characters   Power Couple   Slow Romance   Strong Love Interests   Transmigration   Younger Love Interests   ",
	"rating": "(4.3 / 5.0, 63 votes)",
	"author": "封空   ",
	"year": "\n2020",
	"ranking": "#4617   #3174   #5035   #6028   #4017   ",
	"reviewcount": "9 Reviews sorted by",
	"description": "Shen Liuxiang stayed up all night reading a novel about a white lotus protagonist shou and his easy road to power. Having finished it, he thumped his chest and stomped his foot in unhappiness. \n\nIn the novel, there was a villainous shizun who shared his name.\n\nHe was as beautiful as a flower, but would rather ruin his own looks to imitate others.\n\nHe was infatuated with the Bingshan Sword Venerable, who had his heart set on the protagonist shou. Foolish and shameless, he continued to entangle with and chase after the other.\n\nHe severed his connection to his father, the Venerable Emperor, and renounced his ties to his senior brother in the Sect. He fought to the death with his blood brother, the Demon Venerable. \n\nFor the Sword Venerable, he was even willing to get rid of his toughest rival-in-love—his own disciple, who would later become number one in the cultivation world!\n\nAfter going to sleep, Shen Liuxiang woke up to find himself transmigrated as the villain Shizun in the book.\n\n'Strive to look like the protagonist shou? Wake up, this immortal is the most beautiful in the world!'\n\n'Sword Venerable, who? Is he stronger than my father, the Venerable Emperor?! Is he more handsome than my senior brother in the Sect?! Is he fiercer than my blood brother, Demon Venerable?!”\n\nFacing the protagonist's greatest backer in the future, Zhou Xuanlan, Shen Liuxiang decided to grab onto the opportunity, seize his good fortune, and stifle the danger in the cradle.\n\nHowever, his disciple was too well-behaved. \n\n'All spiritual treasures in heaven and on earth belong to Shizun. All ancient relics belong to Shizun. This disciple also belongs to Shizun.'\n\nShen Liuxiang: '...Alright, I’ll give you a chance QAQ'\n\nInitially an indifferent shizun, Shen Liuxiang slowly became fiercely protective of his disciple. His disciple, in turn, was upright, righteous, and increasingly loyal towards him. However, right at this time, Shen Liuxiang miscalculated. The Zhou Xuanlan from the original novel had returned!\n\n'Shizun has changed so much,' the man spoke with a dangerous air, hugging him from behind, the low voice resounding right beside his ear, “but I like it very much.'\n\nShen Liuxiang cried. He wanted his obedient disciple back!>"
}