{
	"url": "https://www.novelupdates.com/series/im-pregnant-with-the-hope-of-the-entire-planet/",
	"title": "I’m Pregnant with the Hope of the Entire Planet - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/03/Im-Pregnant-with-the-Hope-of-the-Entire-Planet.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Fantasy   Romance   Sci-fi   Yaoi   ",
	"tags": "Black Belly   Cooking   Cute Children   Dragons   Elves   Farming   Futuristic Setting   Handsome Male Lead   Human-Nonhuman Relationship   Love Interest Falls in Love First   Love Rivals   Mpreg   Politics   Power Couple   Previous Life Talent   Proactive Protagonist   Religions   Showbiz   Transmigration   Transported to Another World   ",
	"rating": "(3.9 / 5.0, 74 votes)",
	"author": "Zhi Tang   稚棠   ",
	"year": "\n2020",
	"ranking": "#2510   #2291   #2832   #1281   #3255   ",
	"reviewcount": "14 Reviews sorted by",
	"description": "After a one-night stand, a normal human named Jian Luo found out that he was pregnant. Not only that, it was possible that what he was carrying was… not a human being.\n\nIn the 25th year of the Interstellar century, all human beings have migrated to the Dark Star. Here, their status is low. The natives of Dark Star are powerful and arrogant. They are the supreme powerhouses ruling the universe but their race’s birth rate seems to have been declining as of late. For the last thousands of years, no new life has been born.\n\nOne day, Jianluo vomited after being unable to bear his morning sickness: “Ugh…” \n\nThe Dark Star cubs in his stomach instantly sent out an uneasy aura that covered a radius of a few kilometers, causing all of the Dark Star’s natives to suddenly freeze up!\n\nAfter thousands of years! A cub was finally about to be born!\n\nAll they wanted to know was, who was the father of those cubs?!\n\nLater, the wisest and most elegant high priest declared: “Only I can give the child the best education.”\n\nThe richest man in the universe smiled: “The child will have my surname. Here, you can pick any galaxy you want.\n\n???: “Have some pride, don’t harass other people’s wife!”>"
}