{
	"url": "https://www.novelupdates.com/series/i-leveled-up-from-being-a-parasite-but-i-may-have-grown-too-much/",
	"title": "I Leveled up from Being a Parasite, But I May Have Grown Too Much - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2017/09/I-Leveled-up-from-Being-a-Parasite-But-I-May-Have-Grown-Too-Much-Vol.-2.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Comedy   Drama   Fantasy   Harem   Romance   Shounen   Slice of Life   ",
	"tags": "Adventurers   Beasts   Beautiful Female Lead   Carefree Protagonist   Cheats   Demi-Humans   Demons   Dense Protagonist   Dungeons   Easy Going Life   Farming   Game Elements   God-human Relationship   Goddesses   Hiding True Abilities   Lazy Protagonist   Level System   Male Protagonist   Misunderstandings   Monsters   Neet   Nobles   Overpowered Protagonist   Parasites   R-15   Schemes And Conspiracies   Secretive Protagonist   Skill Assimilation   Special Abilities   Strong Love Interests   Strong to Stronger   Sword And Magic   Transported to Another World   Unreliable Narrator   Vampires   Weak to Strong   ",
	"rating": "(3.5 / 5.0, 338 votes)",
	"author": "Igaki Hisahiro   Nijikan Charge Juubyou Keep   二時間チャージ十秒キープ   伊垣久大   ",
	"year": "\n2016",
	"ranking": "#1874   #1224   #386   #1762   #184   ",
	"reviewcount": "21 Reviews sorted by",
	"description": "Caught up in a ritual performed by a deity of another world, Eiji Choukai was then transported to another realm. The otherworldly deity responsible of the ritual looked at Eiji’s potential incarnations and quickly pulled out Classes like those from, “I Reincarnated Into a Vending Machine.” \n\nBut it seems the Classes available for the average person was not available to him. Only the “Parasite” Class was shown.\n\nWithout choice, Eiji grudgingly choose the Parasite Class. \n\nHis reincarnation into this new world seemed somewhat despondent, but after using his newfound powers, he suddenly realizes its true potential. It seems he’s able to amplify himself countless times by obtaining the powers of others. This luck of his was too good to be true. Seems his level might rise a little bit too much.>"
}