{
	"url": "https://www.novelupdates.com/series/jaku-chara-tomozaki-kun/",
	"title": "Jaku-chara Tomozaki-kun - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2017/07/Yowa-chara-Tomozaki-kun.jpg",
	"noveltype": "(JP)",
	"genre": "Comedy   Drama   Romance   School Life   Seinen   Slice of Life   ",
	"tags": "Adapted to Anime   Adapted to Drama CD   Adapted to Manga   Anti-social Protagonist   Award-winning Work   Beautiful Female Lead   Bookworm   Character Growth   Clever Protagonist   Gamers   Loner Protagonist   Male Protagonist   Modern Day   Personality Changes   Philosophical   Social Outcasts   Tsundere   ",
	"rating": "(4.3 / 5.0, 199 votes)",
	"author": "Yaku Yuuki   屋久ユウキ   ",
	"year": "\n2016",
	"ranking": "#2000   #2000   #2684   #10477   #1432   ",
	"reviewcount": "22 Reviews sorted by",
	"description": "This stands at the forefront of strategy guides to Life (a shitty video game)!\n\nLife is a bad video game. This commonplace phrase is, unfortunate as it might be, the truth.\n\nAfter all, Life has no simple, easy rules. The rules it does have are nothing but irrational and unfair. The strong claim that Life has a high level of freedom, but the weak have no choice but to cope with an overwhelmingly disadvantageous design.\n\nThat’s why it’s a sh*t game.\n\nSince I, Japan’s leading gamer who has experienced and mastered a multitude of games, say so, there can be no mistake.\n\n— However, that person, on top of having mastered gaming to about the same level as I, declared to me that Life is a god-tier game.\n\nDestined to be a top-tier character, that person is the school’s perfect heroine, Hinami Aoi. And to top it off, she even says she will teach me the rules of Life?\n\n…… Normally, I wouldn’t believe such a thing. However, Hinami Aoi is someone who does not fit into a frame like ‘normal’ at all!\n\nFrom the winner of the 10th Shogakukan Light Novel Award for Excellence. A low-tier character takes on life’s strategy guide, but with instruction from a pretty girl!>"
}