{
	"url": "https://www.novelupdates.com/series/dont-you-like-me/",
	"title": "Don’t You Like Me - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/04/dylm-re-cropped.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Fantasy   Romance   School Life   Supernatural   Yaoi   ",
	"tags": "Adapted to Drama CD   Arrogant Characters   Cohabitation   Cute Story   Dense Protagonist   Determined Protagonist   Devoted Love Interests   Doting Love Interests   Enemies Become Lovers   Fated Lovers   First-time Interc**rse   Ghosts   Handsome Male Lead   Hard-Working Protagonist   Heartwarming   Hiding True Abilities   Love Interest Falls in Love First   Misunderstandings   Modern Day   Naive Protagonist   Popular Love Interests   Roommates   Secretive Protagonist   Secrets   Seeing Things Other Humans Can't   Shameless Protagonist   Spirits   Tsundere   Wealthy Characters   ",
	"rating": "(4.6 / 5.0, 754 votes)",
	"author": "Lu Tianyi   吕天逸   ",
	"year": "\n2017",
	"ranking": "#1453   #3867   #666   #1058   #231   ",
	"reviewcount": "131 Reviews sorted by",
	"description": "Short, rich, and handsome, Lin Feiran was always the center of attention. But after transferring schools in his second year of high school, he discovered that his limelight was snatched by his Adonis classmate, Gu Kaifeng.\n\nLin Feiran was very resentful, and he and Gu Kaifeng became archnemesis (one-sidedly). Although the two lived together, they were like strangers.\n\nWhen Lin Feiran went back home to attend his grandfather’s funeral, he accidentally inherited the Yin-Yang eyes that had been passed down from generation to generation. After gaining the ability to see ghosts, the timid Lin Feiran discovered that his two-person dormitory was actually a sixteen-person (ghost) room. Every day, he was scared to the point of collapsing.\n\nThe more aggravating thing is that because of Gu Kaifeng’s innate body constitution, he possessed an abundant amount of Yang energy. Lin Feiran found out that whenever he touched Gu Kaifeng, Gu Kaifeng’s Yang energy could temporarily disable his Yin-Yang eyes. A light touch would disable it for five minutes, a kiss for an hour, and so on…\n\nLin Feiran had no choice but to throw himself into his archnemesis’s embrace. This complete reversal in attitude to being intimate with Gu Kaifeng persisted every day from morning till night.\n\nWhen sleeping, he must squeeze in the same bed as Gu Kaifeng. Going to the toilet? He must drag Gu Kaifeng with him. Homework? It must be done hand-in-hand with Gu Kaifeng… He also had to try his best to persuade the teacher to make him Gu Kaifeng’s deskmate. Every day in class, he would rub Gu Kaifeng’s calf with his foot beneath the desks…\n\nFollowing the clingy little bastard’s sudden change in personality, the initially shocked Gu Kaifeng gradually became smitten. Every day he would chase Lin Feiran to flirt with him, make crazy confessions, and even routinely push him against the wall and kiss him…\n\nGu Kaifeng: “Don’t you like me? I like you, so let’s be together.”\n\nLin Feiran: “I don’t like you! Don’t come over!”\n\nGu Kaifeng: “……”\n\nFive minutes later, to avoid seeing ghosts, Lin Feiran sneakily came to touch Gu Kaifeng.\n\nGu Kaifeng turned around, stopping his hand: “After you just rejected me, you come back to flirt with me!?”\n\nLin Feiran: “Who’s flirting with you! I was careless and touched you; don’t imagine that I like you back.”\n\nOh, that’s it.>"
}