{
	"url": "https://www.novelupdates.com/series/a-trivial-extra-in-a-dating-sim/",
	"title": "A Trivial Extra in a Dating Sim - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/10/52697.jpg",
	"noveltype": "(KR)",
	"genre": "Action   Comedy   Fantasy   Harem   Romance   Shoujo   Supernatural   ",
	"tags": "Abusive Characters   Adapted to Manhwa   Aristocracy   Arrogant Characters   Beautiful Female Lead   Calm Protagonist   Charismatic Protagonist   Clever Protagonist   Cold Love Interests   Confident Protagonist   Conflicting Loyalties   Empires   European Ambience   Fantasy World   Female Protagonist   Game Elements   Handsome Male Lead   Hard-Working Protagonist   Magic   Mob Protagonist   Nobles   Otome Game   Politics   Power Struggle   Priests   Quirky Characters   Religions   Reverse Harem   Royalty   Saints   Schemes And Conspiracies   Secrets   Special Abilities   Transmigration   Transported into a Game World   Transported to Another World   Underestimated Protagonist   Unrequited Love   Villainess Noble Girls   Weak Protagonist   Wizards   ",
	"rating": "(4.0 / 5.0, 65 votes)",
	"author": "Charity   체르티   ",
	"year": "\n2020",
	"ranking": "#6970   #6280   #3710   #2698   #2800   ",
	"reviewcount": "4 Reviews sorted by",
	"description": "When I opened my eyes, I found my soul synced into the popular dating sim game, ‘Midnight’! And although I was clearly one of the female protagonists, I possessed the body of Evanessa Harin, the saint who is treated like a trivial extra. What’s worse is that I must pursue one of the five male love interests and see it through to a happy ending in order to complete the game.\n\nHaving attended the triple combo of an all-girls middle school, high school, and university wasn’t enough of a debuff, having unintentionally put up an iron defense, I’ve been in ‘forever alone’ mode for 25 years. On top of that, I’ve possessed the Saint seldom played due to her atrociously difficult route! This life is screwed up, and I’m sure of it.>"
}