{
	"url": "https://www.novelupdates.com/series/the-villains-all-fell-in-love-with-me-after-rebirth/",
	"title": "The Villains All Fell in Love with Me After Rebirth - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/02/The-Villains-.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Drama   Fantasy   Harem   Sci-fi   Yaoi   ",
	"tags": "Aristocracy   Cold Love Interests   Cruel Characters   Devoted Love Interests   Futuristic Setting   Handsome Male Lead   Male Yandere   Misunderstandings   Multiple POV   Multiple Reincarnated Individuals   Nobles   Persistent Love Interests   Possessive Characters   Royalty   Second Chance   Secrets   Straight Uke   Strong Love Interests   System Administrator   Transmigration   Transported to Another World   ",
	"rating": "(4.3 / 5.0, 258 votes)",
	"author": "Jimo Yao   即墨遥   ",
	"year": "\n2019",
	"ranking": "#2566   #2000   #1135   #6343   #722   ",
	"reviewcount": "51 Reviews sorted by",
	"description": "Ji Ling transmigrated into the world of a book and has become an 18-year-old aristocrat of the same name in the Interstellar Empire. In order to get another chance at life, he must play his role perfectly, love the Imperial Emperor without second thoughts, and act as an obstacle to the shou. He has to use his own sinister schemes to bring out the shou’s noble perfection.\n\nHe worked hard to play his character…\n\nTowards the main lead, Imperial Emperor, love without second thoughts and sacrifice his life for him.\n\nTowards villain number 1, Duke, repay evil with good and get his cooperation in dealing with the main shou.\n\nTowards villain number 2, Marshal, sacrifice himself to help both of them and get his cooperation in dealing with the main shou.\n\nTowards villain number 3, Speaker of the House, give heart and soul to help each other to get his cooperation in dealing with the main shou.\n\nIn order to deal with the main character, he used all available resources and gathered all available forces. Every time when the main shou was forced into a wall, he’d “fall short one step” and let himself be mercilessly slapped in the face. In the end, he was turned into a “victim of his own schemes”, becoming the scapegoat of the shou and dying to save the male lead.\n\nJust when he thought he could finally leave and enjoy a good life…\n\nThe system said: The world collapsed after you died. Now sending you back to the initial point when you first transmigrated. Please do the mission again. Friendly reminder ~ both male and female villains have been reborn, please work hard and continue your efforts. The plot must be brought back on track. I have high hopes for you!\n\nJi Ling had to do the mission one more time, just that …\n\nVillain Duke: How could anyone not love such a cute little thing, hiding his soft heart under a pretentious facade?\n\nVillain Marshal: He is not as arrogant and domineering as he looks. In fact, his heart is brighter and kinder than anyone else.\n\nVillain Speaker of the House: You are my faith, my everything. I am forever willing to stand by your feet and clear your obstacles.\n\nJi Ling: You all shouldn’t love me. I love His Highness. I will always only love him alone!\n\nMale Emperor: What a coincidence, I love you too.\n\nJi Ling: … I have a sentence ****, and I must say it now.>"
}