{
	"url": "https://www.novelupdates.com/series/%c2%bd-prince/",
	"title": "Half Prince - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2016/12/1_2-prince-novel_charming-prince-cover.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Comedy   Gender Bender   Romance   Sci-fi   ",
	"tags": "Adapted to Manhua   Artificial Intelligence   Clingy Lover   College/University   Female Protagonist   Female to Male   Futuristic Setting   Gamers   Handsome Male Lead   Love Interest Falls in Love First   Love Triangles   Magic Beasts   Misunderstandings   MMORPG   Playful Protagonist   Secret Identity   Slow Romance   Twins   Virtual Reality   ",
	"rating": "(4.0 / 5.0, 263 votes)",
	"author": "Yu Wo   御我   ",
	"year": "\n2004",
	"ranking": "#6970   #2693   #3828   #5949   #1903   ",
	"reviewcount": "25 Reviews sorted by",
	"description": "During one of our arguments, my younger brother taunted me, claiming that I only knew how to depend on guys to get me through MMOs. In a fit of anger, I was spurred on by his words and decided to defeat my brother without depending on anyone else. By some coincidence, a new game called “Second Life” was about to go on the market and thus I started from scratch as a player. What’s more, I was the first person ever to log onto the game. The beautiful GM told me that I could have one wish granted… <em>Humph</em>! <em>I. Want. To. Become. A. Guy!</em>\r\n\r\n<em>Shit, I accidentally became too super-ultra-incredibly handsome, now there’s a beautiful GM with designs on my virtue, waaaaah…!</em>\r\n\r\n<em>… OH MY GOD! A girl wants to make me her trophy husband!</em>\r\n\r\n<em>Heavens, what a hottie… Wait, what? He’s actually GAY and he’s hitting on me?! Go to hell! When I’m a girl you’re not interested, so why the hell do you want me now?</em>\r\n\r\nWith an incredibly hilarious main character, incredibly bizarre companions, and an incredible journey of growing up and self-discovery, how will things pan out? Even God is playing a guessing game…>"
}