{
	"url": "https://www.novelupdates.com/series/the-gap-between-you-and-me/",
	"title": "The Gap Between You and Me - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/12/사본_-그대와나사이의간격-일러스트표지.jpg",
	"noveltype": "(KR)",
	"genre": "Drama   Fantasy   Romance   Tragedy   ",
	"tags": "Aristocracy   Beautiful Female Lead   Character Growth   Cold Love Interests   Cruel Characters   European Ambience   Female Protagonist   Handsome Male Lead   Knights   Medieval   Misunderstandings   Nobles   Rich to Poor   Secret Crush   Servants   S*aves   Tomboyish Female Lead   Wishes   ",
	"rating": "(3.9 / 5.0, 42 votes)",
	"author": "Book Fragrance   Chaekyanggi   책향기   ",
	"year": "\n2020",
	"ranking": "#2384   #3527   #7150   #8805   #5198   ",
	"reviewcount": "3 Reviews sorted by",
	"description": "Harrieta, the eldest daughter of a Viscount from the countryside, has a crush on Edwin, the heir to the most influential and wealthiest family in the kingdom.\r\n\r\nShe knew it was a futile dream, so she didn't say a word to him.\r\n\r\nAnd then the news of his engagement came suddenly. \r\n\r\nWhen Harrieta, who had been suffering from a broken heart, finally began to recover, she heard,\r\n\r\n'Learn their faces. From now on, these slaves will live with us together here.'\r\n\r\nEdwin had come as a slave to Harrieta's house.\r\n\r\n* * *\r\n\r\n“The more the restriction, the more the oppression will be. But Miss Harrieta... I'd be glad to accept it, if it were by you. \r\n\r\n'Wha… what?'\r\n\r\nSuddenly talking about restriction and oppression. Herrieta couldn't understand Edwin's strange request and asked him what he meant with a puzzled look. But instead of answering her question, Edwin silently pulled her hand close to him.\r\n\r\n“'I, Edwin, recognize you as my only lord and purpose of my existence....”\r\n\r\nEdwin bowed his head and kissed carefully on the back of her hand. His breath that brushed her hand, was hot.\r\n\r\n'...So please do not hesitate to wield me, as I am your faithful sword and your faithful servant.'\r\n\r\nIt was part of the Knight's pledge, the Pledge of Allegiance, that the knighted person would recite to his future lord.\r\n\r\nThe noble and high Edwin, with whom she couldn't even make eye contact once, was now at her feet.>"
}