{
	"url": "https://www.novelupdates.com/series/turned-out-i-am-a-scheming-little-cannon-fodder/",
	"title": "Turned out I am a Scheming Little Cannon Fodder - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/11/Turned-out-I-am-a-Scheming-Little-Cannon-Fodder.jpg",
	"noveltype": "(CN)",
	"genre": "Drama   Mecha   Mystery   Romance   Slice of Life   Yaoi   ",
	"tags": "Aggressive Characters   Arranged Marriage   Confinement   Cowardly Protagonist   Dense Protagonist   Futuristic Setting   Handsome Male Lead   Misunderstandings   Mpreg   Reincarnation   Second Chance   System Administrator   Timid Protagonist   Weak Protagonist   ",
	"rating": "(3.2 / 5.0, 30 votes)",
	"author": "Cha Chacha   茶查查   ",
	"year": "\n2020",
	"ranking": "#6970   #4680   #7853   #8978   #6443   ",
	"reviewcount": "6 Reviews sorted by",
	"description": "At the age of eighteen, Shen Rou was sent to the flourishing Emperor Star from the Colossal Star by his family. \n\nWhen he looked up and saw the young man who had been engaged to him since he was a child, he was stunned for a moment.\n\nWhen Shen Ruo plucked up the courage to confess to Chu Xiao, he accidentally fell and knocked his head on the stairs.\n\nShen Ruo, who was s*upid in the eyes of others, was extremely sad because it turned out that he was just a character in a book.\n\nThe old Duke of Chu’s verbal marriage contract was nothing important in the eyes of the Chu family. It was written in the book that he was finally broken off from the engagement, but he was not reconciled to return to the impoverished Colossal Star. After racking his brains hard, he fooled around with other aristocrats and was finally kept by them to remain on the Emperor Star.\n\nIn the end, because of offending Chu Xiao’s nephew, the protagonist in that book, he was sent to a more remote galaxy by Chu Xiao. In the end, there was no news of him, and there was a high probability that he was dead.\n\nShen Ruo didn’t dare to have any other thoughts. He wanted to go back home. Colossal Star was a little poorer, but as long as he worked hard, he would at least not go hungry.  \n\nBut Shen Ruo, who had packed up his luggage, was taken back by that violent man.\n\nAfter that, Chu Xiao stopped pretending in front of Shen Ruo.>"
}