{
	"url": "https://www.novelupdates.com/series/im-back-in-the-first-grade-of-elementary-school-so-im-going-to-live-well/",
	"title": "I’m Back in the First Grade of Elementary School, so I’m Going to Live Well - Novel Updates",
	"image": "https://www.novelupdates.com/img/noimagefound.jpg",
	"noveltype": "(JP)",
	"genre": "Comedy   Romance   School Life   Slice of Life   ",
	"tags": "Child Protagonist   Dense Protagonist   Hard-Working Protagonist   Indecisive Protagonist   Inferiority Complex   Love Interest Falls in Love First   Male Protagonist   Multiple POV   Past Plays a Big Role   Popular Love Interests   R-15   Second Chance   Yandere   ",
	"rating": "(3.7 / 5.0, 63 votes)",
	"author": "Okamoto Takahiro   オカモト タカヒロ   ",
	"year": "\n2021",
	"ranking": "#2836   #2000   #3774   #2198   #6193   ",
	"reviewcount": "6 Reviews sorted by",
	"description": "Itosaki Sho, a twenty-eight-year-old freelancer, has no money to spare. He lives in a 1K apartment, works part-time every day without a break, and leads a lonely life as a single man.\r\n\r\nThere are no dreams or hopes in his life, he just works every day to earn money for tomorrow's living expenses.\r\n\r\nThe reason why he ended up living like this was all in his past.\r\n\r\nHe threw away his studies and friendships and continued to work hard and pursue his dreams.\r\n\r\nSho was betrayed by his efforts and was unable to fulfill his dream, and so he spent his life in a tasteless manner.\r\n\r\n－－－－－－－－－－－－－－－－－－－－－－\r\n\r\nOne day in the morning, he was leading such a life.\r\n\r\nHe never had a normal morning.\r\n\r\nWhen he woke up, he found himself in a world 22 years ago.\r\n\r\nAnd Sho was back in the first grade.\r\n　\r\nSho has the opportunity to start his life over.\r\n\r\nNot wanting to make the same mistake twice, he decides to live his second life in a steady manner, without dreaming.\r\n\r\nStudy, exercise, friends, future, and love.\r\n\r\nThis is a story of daily life, of growing up while being tormented by various events.\r\n\r\nThis is his second life. What kind of student life will he lead?>"
}