{
	"url": "https://www.novelupdates.com/series/pink-conspiracy/",
	"title": "Pink Conspiracy - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/09/e1fe9925bc315c60e52e9e1187b1cb1348547791.jpg",
	"noveltype": "(CN)",
	"genre": "Harem   Historical   Martial Arts   Mystery   Romance   ",
	"tags": "Ancient Times   Aristocracy   Arranged Marriage   Beautiful Female Lead   Devoted Love Interests   Doting Love Interests   Family   Female Protagonist   Friendship   Handsome Male Lead   Hiding True Abilities   Hiding True Identity   Medical Knowledge   Politics   Royalty   Schemes And Conspiracies   Underestimated Protagonist   ",
	"rating": "(3.7 / 5.0, 12 votes)",
	"author": "Xi Zi Qing   西子情   ",
	"year": "\n2018",
	"ranking": "#6970   #2000   #10576   #12115   #9290   ",
	"reviewcount": "1 Review sorted by",
	"description": "Singing while riding a horse, young and handsome. When her eyes laid their first glance at him, she knew that in this lifetime, this youth would not walk out of her heart.\r\n\r\nShe’s the young lady of the General’s Manor. When the enemy country invades, her father was called upon in desperation and hurries to the battlefield. She secretly followed her father to battle. When her father and brothers were injured, she struck back with a series of tactics and won over the enemy’s army.\r\n\r\nThe enemy had retreated, the empire’s land was protected, the Emperor was very happy, and heavily rewarded the General’s Manor.\r\n\r\nWhile she was returning to the Imperial City, she overhears that the Emperor and Empress Dowager want to select a man from the Imperial City’s Manors to marry Lady Su of the General’s Manor.\r\n\r\nBefore her, she has 3 elder brothers, but unfortunately no sisters.\r\n\r\nFrom the gossips, in the Imperial City there are two man, who are the top candidates for marrying her.\r\n\r\nOne is from the imperial family, royalty, always idle and only knows how to eat, sing, drink, and have fun.  A prodigal who’s been raised crooked with no one to control him.\r\n\r\nOne is from the Guo-zhang (Emperor's Father in Law) Manor, whose talent is spread throughout the Imperial City, his name known throughout the kingdom. He is the Xiao Guo-jiu (Emperor's Little Brother In Law) who has all the ladies rushing towards him like ducks.>"
}