{
	"url": "https://www.novelupdates.com/series/silver-tree/",
	"title": "Silver Tree - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/06/Silver-Tree.jpg",
	"noveltype": "N/A",
	"genre": "Fantasy   Historical   Psychological   Romance   Tragedy   ",
	"tags": "Character Growth   European Ambience   Fated Lovers   Female Protagonist   First Love   Love Interest Falls in Love First   Love Triangles   Medieval   Unrequited Love   ",
	"rating": "(3.6 / 5.0, 7 votes)",
	"author": "Yoon SoRi   윤소리   ",
	"year": "\n2022",
	"ranking": "#6970   #6272   #13112   #12294   #12500   ",
	"reviewcount": "No Reviews",
	"description": "During the reign of Philip IV of the Capet dynasty of France, \n\nAcre was in the midst of a war between the Sultan and the Knights Templar to protect the Holy Land.\n\nThe day that Leah’s family from the smithy also decided to leave by boat to avoid the threat of war,\n\nTo return the sword entrusted to her by the commander of the Knights Templar in place of her father, who had to take care of her mother, who was about to give birth, Leah had to go out into the middle of the war.\n\nHowever, with the sword firmly on her back, she trembled and witnessed the death of the commander at the place she arrived. \nAt the moment of danger, she meets Balta, the beautiful knight she had dreamed of since childhood.\n\nBut it was not the time for her to fall into such sentiments. The master was lost, and the atmosphere of the Knights Templar was strange.\n\n“It is dangerous to go alone. I will take you.”\n\n“Thank you very much, Balta. How should I repay this favor…?”\n\nWhat Leah, who returned to the workshop with Balta, witnessed was a gruesome murder scene. Only four-year-old Rachelle was alive, and the shocking news from her younger sister… ‘Everyone who has seen it has no choice but to keep their mouths shut! Isn’t it a mission for God first?’\n\nThat? Was it because of the sword that the leader entrusted to her? The Knights Templar… they killed her parents for that sword?\n\n“Can I bury the two?”\n\nLeah’s blood cooled quickly.\n\nHe was taking himself to the workshop, and there he was recovering her parents’ bodies. Because Balta was also a Knights Templar.\n\nThe great truth about the Gods and the conspiracies surrounding the castle relics of the Knights Templar.\n\nThat was the day it started.>"
}