{
	"url": "https://www.novelupdates.com/series/the-divine-physicians-overbearing-wife/",
	"title": "The Divine Physician’s Overbearing Wife - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/08/The-Divine-Physicians-Overbearing-Wife_1629367588.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Comedy   Fantasy   Historical   Josei   Martial Arts   Romance   Xuanhuan   ",
	"tags": "Ancient China   Appearance Changes   Arrogant Characters   Beast Companions   Beautiful Female Lead   Black Belly   Clever Protagonist   Cold Love Interests   Confident Protagonist   Cultivation   Cunning Protagonist   Cute Children   Determined Protagonist   Devoted Love Interests   Doting Parents   Familial Love   Family Conflict   Famous Protagonist   Fantasy Creatures   Fantasy World   Fast Cultivation   Fat Protagonist   Fat to Fit   Fearless Protagonist   Female Protagonist   Genius Protagonist   Handsome Male Lead   Hidden Abilities   Love Interest Falls in Love First   Loyal Subordinates   Magic Beasts   Misunderstandings   Mythical Beasts   Narcissistic Protagonist   Personality Changes   Pets   Power Couple   Revenge   Royalty   Shameless Protagonist   Siblings Not Related by Blood   Slow Romance   Strong Love Interests   Transmigration   Weak to Strong   ",
	"rating": "(2.9 / 5.0, 16 votes)",
	"author": "Xiao Qi Ye   萧七爷   ",
	"year": "\nN/A",
	"ranking": "#2000   #2000   #8999   #9691   #10382   ",
	"reviewcount": "5 Reviews sorted by",
	"description": "Feng Ruqing was a spoiled princess with a hideous countenance in Liu Yun Kingdom. She used to ride roughshod over anyone who stood in her way, backed by her father the emperor who loved her with all his heart.\r\n\r\nNot only did she force the chancellor's son to marry her by breaking the existing loving couple up, but her mother-in-law had also passed out from rage because of her. In the end, she took her own life after the heartbreak and humiliation of being dumped.\r\n\r\nWhen she opened her eyes again, she was no longer the bratty princess who was a good-for-nothing.\r\n\r\n* * *\r\n\r\nRumor has it that spirit beasts have become servants in princess’ manor and the princess is devouring precious spirit herb dishes every day.\r\n\r\nRumor has it that the chancellor’s son who pleaded for reconciliation after divorcing the princess was thrown out of the princess’s manor.\r\n\r\nRumor has it that some good-looking young masters went to the princess’s manor in hope of being her servants were nearly killed by the state preceptor.\r\n\r\nRumor has it that the charming state preceptor was looking for the princess eagerly as he wanted to hold her responsible for sleeping with him.>"
}