{
	"url": "https://www.novelupdates.com/series/poisonous-peasant-concubine/",
	"title": "Poisonous Peasant ‘Concubine’ - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/08/poisonconcubine2.jpg",
	"noveltype": "(CN)",
	"genre": "Adult   Adventure   Drama   Romance   Slice of Life   Supernatural   Yaoi   ",
	"tags": "Ancient China   Assassins   Childcare   Cruel Characters   Cute Children   Devoted Love Interests   Familial Love   Farming   Futanari   Handsome Male Lead   Hard-Working Protagonist   Love Interest Falls in Love First   Marriage   Medical Knowledge   Merchants   Modern Knowledge   Mpreg   Overpowered Protagonist   Poisons   Poor to Rich   Power Couple   Previous Life Talent   R*pe Victim Becomes Lover   Reincarnation   Revenge   Royalty   R*pe   Schemes And Conspiracies   Smart Couple   Social Outcasts   Strong Love Interests   Strong to Stronger   Time Skip   Transmigration   Twins   ",
	"rating": "(4.0 / 5.0, 115 votes)",
	"author": "Yan Ruo You Ya   颜若优雅   ",
	"year": "\n2017",
	"ranking": "#4265   #3428   #2685   #6338   #2052   ",
	"reviewcount": "33 Reviews sorted by",
	"description": "Ling Jingxuan, a once world-renowned doctor and killer, who saved lives with one hand and killed with the other, was feared by both the government and the underworld gangs solely by his name. During an accident, he had transmigrated to become a man who had nothing but the bare walls in his house and two children who looked like ‘buns’. ‘Why does life always go through such ups and downs? Could this life be more miserable?’, thought him while holding his forehead helplessly.\n\nYan Shengrui, the only prince with a general title in the Qing Dynasty, suddenly changed his sexual orientation in an accident when carrying on a mission. A tough man turned into a wife-con. The royal clansmen all felt much regretful. But no one dared to straighten him, since his concubine was an expert both in medical skills and poison.\n\n“What? Thirty copper coins? Why don’t you just go robbing?”\n\nOne day, Ling Jingxuan took the two ‘buns’ to the market for necessities purchase. Hearing the price, the five-year-old little bun blushed instantly with his small hands dragging the worn-out money bag. Ling Jingxuan felt too deep for tears. ‘Son, we earn money to spend! Don’t tell me you wanna save the money for your offspring.’\n\nThe last of the last, they bought the cheapest goods with the worst quality among all the selection with the two taels of silver Ling Jingxuan had earned. Looking at the two little buns’ filled with laughter, Ling Jingxuan vowed secretly that one day he would raise them into super stuffed meat buns, and the dandy rich second generation!>"
}