{
	"url": "https://www.novelupdates.com/series/this-three-year-old-is-a-villainess/",
	"title": "This Three Year Old Is a Villainess - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/09/This-Three-Year-Old-Is-a-Villainess.jpg",
	"noveltype": "(KR)",
	"genre": "Drama   Fantasy   Romance   ",
	"tags": "Aristocracy   Character Growth   Child Protagonist   European Ambience   Family   Fantasy World   Female Protagonist   Nobles   Reincarnated in Another World   Reincarnation   Siblings   Villainess Noble Girls   World Travel   ",
	"rating": "(4.2 / 5.0, 56 votes)",
	"author": "리샤   ",
	"year": "\n2021",
	"ranking": "#5262   #1169   #5002   #7589   #4207   ",
	"reviewcount": "6 Reviews sorted by",
	"description": "‘There’s no such thing as possessing a character in a possession novel!’\n\nI possessed the original female lead, that is, the villainess who torments the real female lead of the possession novel called [I Possessed The Villain’s Granddaughter]!\n\nWhat did you say? It’s a villainess role that greatly suffers after doing all kinds of bad things to the main character?!\n\nBefore I knew it, the genre of my life became a tragedy!\n\nI can’t live like this!\n\n‘Please save me!’\n\nHowever, before the female lead could even appear, there were already all sorts of events happening in front of me.\n\n“You’re the dirty-blood, right? They said you were acting cute in order to get something to eat. Just like a beggar.”\n\n“….”\n\n‘You’re all dead.’\n\nErylotte, a three-year-old who possessed the villainess of a tragedy novel with the highest difficulty.\n\nI lived my life diligently, using the original plot to my advantage as I tried to find my own way of life. But—\n\n‘Huuh?’\n\nWhy was my Grandfather, the Villainous Grand Duke, so kind to me?\n\nAnd, why did my Father suddenly appear even though he was hated by Grandfather and had always been away?\n\nAlso, why are my older brothers acting so annoying?\n\nMoreover.\n\n‘What is this–’\n\n[Erylotte, so cute you can destroy the earthㅠㅠㅠ]\n[Ahhh ㅠㅠ I’m sorry that I pretended I didn’t know you were possessed before and cursed youㅠㅠ Turns out there was this kind of circumstanceㅠㅠ]\n[Tragedy, acknowledgedㅠㅠ Isn’t this family situation almost like Apocalypse level?\n\n             ㄴYeah, really. Keke]\n[So, the valuable info was buried here… The cookies are poisonous, right?]\n\nI stared at the window that floated in front of me like a hologram.\n\n‘This looks like Coconut Page’s comment section.’\n\nHow the hell did it become like this!?>"
}