{
	"url": "https://www.novelupdates.com/series/my-children-are-fierce-and-adorable/",
	"title": "My Children are Fierce and Adorable - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/12/My-Children-are-Fierce-and-Adorable.jpg",
	"noveltype": "(CN)",
	"genre": "Drama   Fantasy   Historical   Josei   Martial Arts   Romance   Supernatural   Xuanhuan   ",
	"tags": "Ancient Times   Arranged Marriage   Beautiful Female Lead   Childcare   Cooking   Cute Children   Doting Parents   Familial Love   Family   Family Business   Farming   Female Protagonist   Godly Powers   Handsome Male Lead   Marriage   Poor Protagonist   Poor to Rich   Pregnancy   Strong Love Interests   Transmigration   ",
	"rating": "(3.2 / 5.0, 9 votes)",
	"author": "Weng Liuli   翁琉璃   ",
	"year": "\n2021",
	"ranking": "#1326   #2000   #10844   #11739   #11554   ",
	"reviewcount": "3 Reviews sorted by",
	"description": "The second Ye Lulu transmigrates, she gives birth to three children on the spot.\r\n\r\nShe imagines that she's the only transmigrator here and has to be careful. Who knew—\r\n\r\nThe first baby: Cold and stern, he's a young little adult who acts as a judge! He steps forward to draw a bolt of lightning from the heavens to punish scumbags.\r\n\r\nThe second baby: Agile, lively, and extremely smart. Every time he moves his mouth, he can accurately predict the future!\r\n\r\nThe third baby: One with an even colder personality, with a single wave of his finger, he can hook out your soul and play with it!\r\n\r\nYe Lulu never had a boyfriend in the modern world. Yet, who would have expected that the moment she changed into a different identity, she would have children, a husband, and in-laws — basically, the whole package? Initially, she says, 'The three babies are so cute. They're my biological children. I can have them! As for my husband… I'll get a refund.'\r\n\r\nUnexpectedly, Ye Lulu gradually realizes that her husband is very handsome! He seems very mysterious and charming! She seems to have developed feelings for him. How wonderful!\r\n\r\nHowever, Ye Lulu holds onto her little protective mask tightly and constantly warns herself to be conservative, as people in the ancient times are comparatively not as open-minded.\r\n\r\nUnexpectedly, that husband of hers is not himself either. He was a Yin God from the divine throne in the heavens where there were no restrictions, and thus is even more casual. One day, her handsome and god-like husband presses her against the wall and lifts his hand to hold her chin. He says to her in a husky voice, 'I think I like you…'\r\n\r\nHe lowers his head and kisses her deeply!\r\n\r\nYe Lulu: '???'\r\n\r\nSomething is wrong here! Aren't you guys from the ancient past? Why are you so unrestrained?>"
}