{
	"url": "https://www.novelupdates.com/series/a-true-bitch-never-looks-back/",
	"title": "A True B*tch Never Looks Back - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/01/A-True-Bitch-Never-Looks-Back.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Fantasy   Romance   ",
	"tags": "Acting   Beautiful Female Lead   Clever Protagonist   Comedic Undertone   Devoted Love Interests   Female Protagonist   Handsome Male Lead   Manipulative Characters   Misunderstandings   Modern Day   Multiple Reincarnated Individuals   Past Plays a Big Role   Second Chance   Shameless Protagonist   System Administrator   Tragic Past   Transmigration   Wealthy Characters   ",
	"rating": "(3.3 / 5.0, 11 votes)",
	"author": "凉穗   ",
	"year": "\n2021",
	"ranking": "#2000   #2000   #10684   #9322   #11522   ",
	"reviewcount": "2 Reviews sorted by",
	"description": "Chi Chuchu woke up with a start and found herself transmigrated as the beautiful but crazy, constant trouble-seeking ‘green tea’ (read ‘b*tch’) female supporting character in the novel she had been reading.\n\nThe original green tea b* had such a successful habit of two-timing her boyfriends that she could have formed her own soccer team.\n\nShe was sitting in a cafe, across the table from two outstandingly handsome young men. However at this moment, under her beautiful and exquisitely made-up face, she hid a heart that wanted to bitterly cry.\n\nThe handsome youth with the coffee-brown hair, his face covered with fashionable sunglasses and a mask was the enormously popular celebrity idol, Yan An.\n\nHe rapped his fingers on the table, looked at his girlfriend, Chi Chuchu, and with an unhappy expression, pointed to the side and asked, \n\n“So, this guy is also your boyfriend?”\n\nThe person that Yan An pointed at was Ling Yiyan, the older brother of the heroine of the original book and the male heir of the Ling family.\n\nLing Yiyan’s alluring eyes, looked at his girlfriend, Chi Chuchu, with a cold smile and his thin lips parted lightly, \n\n“What do you say, Chuchu?”\n\nChi Chuchu, who had just transmigrated into this body, had stepped straight into a top-level Shura Field (a desperate situation that she needs to fight her way out of or die) was speechless:\n\n   “…”  \n\nWho will save me?\n\nChi Chuchu focused…… Suddenly, a few tears fell on the girl’s delicate face, like raindrops on a pear blossom. Pretending to wipe away her tears, Chi Chuchu said softly,\n\n“You guys don’t know but in fact, I have a twin sister, her name is Chi Wanwan…”\n\nYan An: “…”   \n\nLing Yiyan: “…”>"
}