{
	"url": "https://www.novelupdates.com/series/how-could-i-lose-to-him/",
	"title": "How Could I Lose to Him - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/05/How-Could-I-Lose-to-Him.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Romance   School Life   Shounen Ai   Sports   ",
	"tags": "Androgynous Characters   Child Abuse   Childhood Friends   Childhood Love   Cold Protagonist   Coming of Age   Complex Family Relationships   Confident Protagonist   Delinquents   Dense Protagonist   Doting Love Interests   Enemies Become Lovers   Family Conflict   First Love   Jealousy   Love Interest Falls in Love First   Modern Day   Possessive Characters   Power Couple   Protagonist Strong from the Start   Slow Romance   Strong Love Interests   Tragic Past   ",
	"rating": "(4.2 / 5.0, 34 votes)",
	"author": "Mo Xi Ke   墨西柯   ",
	"year": "\n2020",
	"ranking": "#6970   #2000   #6906   #7851   #5246   ",
	"reviewcount": "6 Reviews sorted by",
	"description": "The two private high schools have merged. The big bosses/fish of both schools find one another displeasing to the eye, and engage in both open and hidden conflict.\n\nSui Houyu looked at his counterpart and curled his lips disdainfully: He puts on such airs but can’t behave like a person.\n\nHou Mo stared back and sneered: Quite the Helen of Troy isn’t he – pretty enough to start wars over, and has quite the temper. Forget about being the most handsome guy in the school, you can be the school belle.\n\nSui Houyu had a manic mood disorder and severe insomnia but found that as long as he was close to Hou Mo, he could fall asleep. From then on, Hou Mo had an additional little grumpy monster by his side.\n\nAfter winning a doubles tennis match, the partners who then would arrange to duel/fight against one another on the rooftop, could only be Sui Houyu and Hou Mo. After their teammates found out about the matter, they were filled with anxiety.\n\nAfter some time, Sui Houyu returned with his lips were slightly swollen, and the corners of his mouth bruised, causing everyone to be furious with Hou Mo on his behalf.\n\nWhen Hou Mo returned to the class, he had tooth marks on his throat and had lost two buttons on the top of his shirt. He quickly explained to Sui Houyu: “I really didn’t smile at any girls while we were playing. That’s just how my face looks.”\n\nEveryone can disperse now…\n\nInterviewer: Please use four words to describe what you think about him?\n\nHou Mo: I like him so much that I can’t stop touching him/ put him down.\nSui Houyu: F* it.\n\nReporter: What sort of hobbies do you have?\nHou Mo: Groping fish.¹\n\nSui Hou Yu: Beating up monkeys.²\n\nNotes :\n[1] Refers to lazing on the job, but the ‘yu’ for fish is a homonym for Sui Hou Yu’s ‘yu’\n[2] Monkey Hou is a pun  on Hou Mo’s name>"
}