{
	"url": "https://www.novelupdates.com/series/aim-for-the-deepest-part-of-the-different-world-labyrinth-ln/",
	"title": "Aim for the Deepest Part of the Different World Labyrinth (LN) - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2016/03/image002.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Fantasy   Harem   Psychological   Seinen   Tragedy   ",
	"tags": "Adapted to Manga   Beautiful Female Lead   Betrayal   Brainwashing   Calm Protagonist   Caring Protagonist   Cheats   Demons   Dungeons   Elemental Magic   Emotionally Weak Protagonist   Fast Learner   Game Elements   Level System   Loli   Male Protagonist   Mind Control   Monster Girls   Nobles   Past Plays a Big Role   Romantic Subplot   S*aves   Strong Love Interests   Sword And Magic   Time Loop   Transplanted Memories   Transported to Another World   Weak to Strong   Yandere   Younger Sisters   ",
	"rating": "(3.7 / 5.0, 224 votes)",
	"author": "Warinai Tarisa   割内＠タリサ   ",
	"year": "\n2014",
	"ranking": "#5262   #876   #1481   #9890   #883   ",
	"reviewcount": "17 Reviews sorted by",
	"description": "An ordinary kid by the name of Aikawa Kanami winds up in a fantasy world operated by RPG video game rules—but this isn’t good news. He awakes in the bowels of a gargantuan death trap called the Dungeon. Narrowly escaping thanks to his grit, cunning, and newfound arsenal of magic spells and skills, he wants nothing more than to get back home to Earth and the invalid sister who needs him. His only lead? It’s said that whoever makes it to the hundredth and final level can have any wish granted. In his desperation, Kanami cooks up the most efficient means of clearing the Dungeon and lies his way into a partnership of expediency with an aspiring swordfighter who’s rubbish with the blade but unbelievably skilled at magic. Kanami’s cool determination, however, is soon put to the test when he and his new comrade are faced with a surprise boss fight. How far will he go in order to emerge victorious?>"
}