{
	"url": "https://www.novelupdates.com/series/political-marriage-with-a-friendly-enemy/",
	"title": "Political Marriage With a Friendly Enemy - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/04/Political-marriage-with-a-friendly-enemy.jpeg",
	"noveltype": "(KR)",
	"genre": "Fantasy   Romance   ",
	"tags": "Aristocracy   Arranged Marriage   Beautiful Female Lead   Calm Protagonist   Child Protagonist   Clever Protagonist   Couple Growth   Curses   Devoted Love Interests   Elves   Empires   Enemies Become Lovers   European Ambience   Female Protagonist   Goddesses   Handsome Male Lead   Honest Protagonist   Kind Love Interests   Love Interest Falls in Love First   Magic   Marriage   Misunderstandings   Multiple Reincarnated Individuals   Nobles   Obsessive Love   Rebellion   Reincarnation   Royalty   Second Chance   S*aves   Special Abilities   Strong Love Interests   Time Travel   Wars   ",
	"rating": "(4.2 / 5.0, 119 votes)",
	"author": "seullopeu   슬로프   ",
	"year": "\n2021",
	"ranking": "#883   #1869   #2545   #1970   #1943   ",
	"reviewcount": "19 Reviews",
	"description": "The alliance is broken. The price of this betrayal must be paid with blood.” \r\n \r\nOn the day of the wedding, the bride was assassinated and killed. \r\n \r\nThe war triggered by my death has destroyed my home country. \r\n \r\n“Forest, please… … .” \r\n \r\nWith my earnest prayer, I wanted God to turn everything back.\r\n \r\nWhen I opened my eyes again, I was back to my childhood. \r\n \r\n*** \r\n \r\nTo protect the motherland, once again I entered a political marriage with the first Emperor of the empire. \r\n \r\nI planned to stay quietly without being noticed by my husband…\r\n \r\n“I was waiting for you.” \r\n \r\nKwanach Radon, a man who was a slave and then revolutionized and became emperor. \r\n \r\nMy husband, who I thought would be harsh and savage, is unexpectedly friendly only to me.\r\n \r\nNo, he is very kind, and that is the problem.\r\n \r\n“You don’t have to lift a finger. All you have to do is sit back and relax. Don’t think of going anywhere.”\r\n \r\nOverprotective or confined, I don’t know if I’m married.\r\n \r\nMy husband’s feelings are ambiguous whether it is passionate or obsessive. \r\n \r\nWill it be okay like this?\r\n >"
}