{
	"url": "https://www.novelupdates.com/series/accidental-love/",
	"title": "Accidental Love - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/03/Accidental-Love.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Josei   Mature   Romance   ",
	"tags": "Adapted to Drama CD   Beautiful Female Lead   Betrayal   Black Belly   Cohabitation   Cold Love Interests   Female Protagonist   Glasses-wearing Love Interests   Handsome Male Lead   Hard-Working Protagonist   Love Interest Falls in Love First   Modern Day   Older Love Interests   Reporters   Selfish Protagonist   Shameless Protagonist   Wealthy Characters   ",
	"rating": "(4.2 / 5.0, 157 votes)",
	"author": "Qiao Yao   翘摇   ",
	"year": "\n2015",
	"ranking": "#4080   #1123   #2823   #1044   #3324   ",
	"reviewcount": "42 Reviews sorted by",
	"description": "Zheng Shuyi’s ex-boyfriend cheated on her, and the other women’s uncle drove an eye-catching Rolls-Royce Phantom, with an arrogant straight numerical license plate number.\n\nA few days after they broke up, Zheng Shuyi saw the unforgettable Rolls-Royce Phantom outside of the State Banquet Hotel.\n\nThinking of the scumbag and the white lotus flying away from her, she felt distressed.\n\nWant to save 20 years of hard work? Don’t even think about it!\n\nDo you still regard me as a relative? Well, sure. I’ll just be your aunt!\n\nYou’ll be forced to treat me with respect even when you feel so full of yourself.\n\nAt that moment, with self-fulfilling confidence, Zheng Shuyi tapped on the back seat window of the Rolls-Royce Phantom with a gentle smile on her face.\n\nThe car window slowly rolled down, and the young man looked over with his charming eyes behind his glasses.\n\nZheng Shuyi was quite shocked by the appearance. She thought to herself, the white lotus doesn’t look that good, but her uncle sure is handsome.\n\nA few months later, Zheng Shuyi took the man’s hand and sat affectionately in the back seat of the Rolls-Royce. When she saw the scum and the white lotus, she hooked her fingers arrogantly to tell them to come closer.\n\n“Shouldn’t you at least greet your elder?”\n\nThe white lotus’ face was pale. She moved over slowly and called out to the driver, “Hi, uncle.”\n\nZheng Shuyi: “……?”>"
}