{
	"url": "https://www.novelupdates.com/series/star-crossed-lovers-the-ex-convict-and-the-white-rabbit/",
	"title": "Star-Crossed Lovers: The Ex-Convict and the White Rabbit - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/07/starcrossedlover3.jpg",
	"noveltype": "(CN)",
	"genre": "Drama   Josei   Romance   Slice of Life   Tragedy   ",
	"tags": "Beautiful Female Lead   Black Belly   Broken Engagement   Caring Protagonist   Cute Story   Doting Love Interests   Gangs   Handsome Male Lead   Heartwarming   Love Interest Falls in Love First   Mob Protagonist   Modern Day   Prison   ",
	"rating": "(3.8 / 5.0, 11 votes)",
	"author": "Xie Zong   蟹总   ",
	"year": "\n2016",
	"ranking": "#2000   #2000   #11070   #5149   #11176   ",
	"reviewcount": "No Reviews",
	"description": "They first met at Yueya Correctional Facility. He was a criminal who was imprisoned on behalf of someone else. He behaved frivolously, an unbridled look in his eyes. At first glance, he didn’t seem to be a good person.\r\n\r\nShe and he belonged in two different worlds. One light, one dark. Destined to collide.\r\n\r\nThe next time they met, the sky was overcast. It was raining and foggy. At the intersection, the world outside the car windows was chaotic and blurry.\r\n\r\nShe appeared suddenly, a ray of poignant purity.\r\n\r\nIt was then he knew, he had long been waiting for this uncertain reunion.\r\n\r\nAfter words, without batting an eyelid, he quietly advanced. Using the crudest, most overbearing and straightforward maneuver, he entered her life.\r\n\r\nShe approached him little by little, and stepped closer and closer to the truth.\r\n\r\nHe said, “One day when you find out the things I did, give me a chance. Don’t leave, ever.”\r\n\r\nHe said, “If you can survive, I’ll put up offerings to the gods and prostrate before Buddha, I’ll abstain from meat and alcohol, recite scriptures and kowtow my gratitude in front of that Old Man. If you die, I won’t continue living alone either, I’ll follow you to the afterlife.”\r\n\r\nHis embrace was a warm enclosure, sheltering her from the wind and rain lest she be cold and helpless.\r\n\r\nTo call this love would barely scratch the surface.\r\n\r\n— As luck would have it, during times when you were cold, I was able to give you warmth. —>"
}