{
	"url": "https://www.novelupdates.com/series/the-vicious-villain-suffers-in-the-heart/",
	"title": "The Vicious Villain Suffers in the Heart - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/03/The-Vicious-Villain-Suffers-in-the-Heart.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Romance   School Life   Shounen Ai   ",
	"tags": "Calm Protagonist   Cold Love Interests   Confident Protagonist   Cute Protagonist   Friendship   Handsome Male Lead   Hard-Working Protagonist   Popular Love Interests   Second Chance   Slow Romance   Stoic Characters   System Administrator   Transmigration   Wealthy Characters   ",
	"rating": "(4.2 / 5.0, 58 votes)",
	"author": "曳萝   ",
	"year": "\n2020",
	"ranking": "#100   #240   #4557   #675   #4658   ",
	"reviewcount": "10 Reviews sorted by",
	"description": "After his accidental death, Jiang Juan transmigrated as a vicious villain in a novel. The villain was always bullying the male protagonist, which resulted in his miserable end.\r\n\r\nAfter passing through, Jiang Juan did not intend to torment anyone like the original owner. After gaining a second chance at life, he decided to never provoke the male protagonist and safely live the rest of his life.\r\n\r\nBut who knew, that his life was tied to the fate of the male protagonist, because of which he can feel all the pain that the protagonist suffers.\r\n\r\nIf the protagonist is in pain, he will also feel it, if the protagonist is hungry, no matter how much he eats, he will still feel dizzy from hunger as his stomach keeps on growling, and if the protagonist is dead…\r\n\r\nJiang Juan didn’t dare to think about it.\r\n\r\nJust at this time, a his lackey with short eyes came to him to ask for credit, “Brother Juan, we have surrounded that kid Xie Jingxian, and are ready to teach him a lesson, see if he dares…”\r\n\r\nJiang Juan was furious: “Everyone stop. Don’t hurt him! If you fight him, you will end up finding it difficult to eat or even walk around.”\r\n\r\nNext, in front of everyone’s wide eyes, the lonely protagonist was coaxed to Jiang’s house by Jiang Juan.\r\n\r\nJiang Juan held the protagonist’s hand and gently asked, “Axian, are you thirsty? Are you hungry? Are you tired? If you feel unhappy, I’ll ask Arang to come over and serve you as a sandbag. How would you like to vent your anger?”\r\n\r\nXie Jingxian was alert . He looked at Jiang Juan and said, “What’s your purpose?”\r\n\r\nJiang Yan sighed, “What purpose can I have. I only hope that you have a smooth life, one with no illness or disaster.” That way, I can also safely grow old.\r\n\r\nXie Jingxian didn’t believe it at first, but later, he said to Jiang Juan: “I understand your intention.”\r\n\r\nJiang Juan was greatly moved: “You finally understand.”\r\n\r\nXie Jingxian nodded, “I accept it.”\r\n\r\n“Wait, what do you accept?”\r\n\r\nXie Jingxian, “Accept your love.”\r\n\r\nJiang Juan: … Brother, did you misunderstand something? I didn’t mean that! >"
}