{
	"url": "https://www.novelupdates.com/series/my-wife-is-my-life/",
	"title": "My Wife is My Life! - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/08/20190508004500.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Drama   Fantasy   Romance   Slice of Life   ",
	"tags": "Acting   Beautiful Female Lead   Black Belly   Businessmen   Celebrities   Cold Love Interests   Cunning Protagonist   Early Romance   Female Protagonist   Forced into a Relationship   Forced Marriage   Handsome Male Lead   Modern Day   Older Love Interests   Power Couple   Showbiz   Stockholm Syndrome   Strong Love Interests   System Administrator   Transmigration   Unconditional Love   Wealthy Characters   ",
	"rating": "(4.1 / 5.0, 192 votes)",
	"author": "公子闻筝   ",
	"year": "\n2019",
	"ranking": "#1508   #1209   #639   #2045   #767   ",
	"reviewcount": "45 Reviews sorted by",
	"description": "Ji Qingqing was at the end of her rope after transmigrating into a novel. When she was on the brink of wretched poverty, she received a system. The system told her; Lu Lixing came from a family that was rolling in money, but he was coming to the end of his allotted lifespan. If she married him, she would gain his enormous inheritance.\n\nLu Lixing was seriously ill. Just as he was about to die, he gained a system. The system told him: Ji Qingqing was young and beautiful. She was rich in vitality. If he married her, he could continue living.\n\nJi Qingqing happily came to Lu Lixing’s sickbed.\n\nAnd then, Lu Lixing woke up.\n\n***\n\nLu Lixing’s friends discovered that after Lu Lixing woke up, not only did this person that had always kept his distance from women gotten married, he spent every day being super clingy towards his wife.\n\nYoung Lu, can you be a little less embarrassing and act your age? Will you die if you take one step away from your wife?\n\nLu Lixing clutched his chest. His little heart had almost stopped beating because Ji Qingqing had left him for half an hour. He weakly waved his hand. He couldn’t be separated from her, not for the rest of his life. She was his life.>"
}