{
	"url": "https://www.novelupdates.com/series/my-familys-idols-vest-fell-again/",
	"title": "My Family’s Idol’s Vest Fell Again - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/08/MFIVFA.jpg",
	"noveltype": "(CN)",
	"genre": "Adventure   Comedy   Drama   Romance   Yaoi   ",
	"tags": "Artists   Celebrities   Clever Protagonist   Genius Protagonist   Hackers   Handsome Male Lead   Hiding True Abilities   Hiding True Identity   Medical Knowledge   Multiple Identities   Music   Older Love Interests   Previous Life Talent   Protagonist Strong from the Start   Revenge   Schemes And Conspiracies   Showbiz   Singers   Smart Couple   Underestimated Protagonist   Wealthy Characters   ",
	"rating": "(3.9 / 5.0, 73 votes)",
	"author": "默言沐   ",
	"year": "\n2019",
	"ranking": "#1632   #922   #3185   #2326   #3205   ",
	"reviewcount": "18 Reviews sorted by",
	"description": "After completing several transmigration missions perfectly, Shi Fei returned to his world with enough points and a bunch of skills he learned during the missions.\n\nWhen he returned, his goal was to eat, drink, sleep and win every day, and when he was bored, he would draw, design, write a book, become a hacker or cure someone who had a terminal illness.\n\nWhen the interest comes, he would go to a talent contest and get a ‘Best New Performer’ award or something in the entertainment industry.\n\nIt seemed like the vests [disguises/covers] were getting more and more careless, and he was very satisfied with this life.\n\nUntil one day, Shi Fei accidentally signed out his pen name when he was signing autographs for his fans.\n\nFans:….\n\nMedia:….\n\nReporter: “Latest news, it turns out that the mysterious painter Mr. J, who once sold for a billion dollars, is the popular youngster Shi Fei.”\n\nMedia: “The headline, the design industry’s rising star Ai Wei designer is actually the popular youngster Shi Fei.”\n\nNetizens: “Surprise, when a bastard stalked Shi Fei, he accidentally found out that he was actually Mr. Fei, the world’s best doctor.”\n\nFan: “Honey, how many more vests [covers] do you have, I think even if you tell me now that you are the richest man in the world, I won’t be too surprised.”\n\nShi Fei: “I’m not the world’s richest man, but the world’s richest man is my boyfriend.”>"
}