{
	"url": "https://www.novelupdates.com/series/interstellar-chef-raising-a-baby/",
	"title": "Interstellar Chef Raising a Baby - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/06/Interstellar-Chef-Raising-a-Baby.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Romance   School Life   Sci-fi   Slice of Life   ",
	"tags": "Beast Companions   Beasts   Caring Protagonist   Celebrities   Chefs   Childcare   Cooking   Cute Children   Debts   Dense Protagonist   Female Protagonist   Futuristic Setting   Handsome Male Lead   Love Interest Falls in Love First   Marriage   Military   Misunderstandings   Nationalism   Outer Space   Pets   Poor to Rich   Pregnancy   System Administrator   Transmigration   Ugly to Beautiful   Weak to Strong   ",
	"rating": "(3.8 / 5.0, 89 votes)",
	"author": "Salted Lobster   盐焗大龙虾   ",
	"year": "\n2018",
	"ranking": "#1668   #2286   #1788   #1184   #3411   ",
	"reviewcount": "22 Reviews",
	"description": "Liu Weiwei transmigrated to the interstellar period and found herself as the lowest ranking student in an Interstellar High School.\r\n\r\nThe poor performance of the original owner was ridiculed by the whole school, and the accidental pregnancy, even the father of the child was not known.\r\n\r\nThen Liu Weiwei realized that there was also a food system with her.\r\n\r\n[Get the recipe Mapo Tofu.]\r\n[Get the recipe of sauerkraut fish.]\r\n[Get the recipe Xiao long bao.]\r\n\r\nSoon, the whole interstellar was shook, people swarmed towards her with their tears flowing from their mouths.\r\n\r\nMarshal: The snail noodles are good. Come to work in the cafeteria of our military area, you will have five insurances and one housing fund.\r\n\r\nScientist: Fried chicken is the best, give me one, don't force me to kneel down and beg you!\r\n\r\nVillain: I want to eat too... Who am I? Where am I? What am I doing?\r\n\r\nMale protagonist (rare low-key boasting tone): My wife is not good at cooking, you'd better not come to my house for dinner.>"
}