{
	"url": "https://www.novelupdates.com/series/i-quit-the-going-home-club-for-a-girl-with-a-venomous-tongue/",
	"title": "I Quit the Going-Home Club for a Girl with a Venomous Tongue - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/03/321807000406.jpg",
	"noveltype": "(JP)",
	"genre": "Comedy   Drama   Psychological   Romance   School Life   ",
	"tags": "Amnesia   Beautiful Female Lead   Cold Love Interests   Coma   Cute Story   Friendship   Male Protagonist   Modern Day   Mysterious Past   Quirky Characters   Slow Romance   ",
	"rating": "(4.5 / 5.0, 135 votes)",
	"author": "Aterui Mizuno   水埜 アテルイ   ",
	"year": "\n2017",
	"ranking": "#226   #348   #1936   #293   #2279   ",
	"reviewcount": "20 Reviews",
	"description": "Sakaki Sui, a second year high school student who self-proclaims himself as a professional member of the going-home club, holds his afterschool days that he can freely use for anything as something of utmost importance. With no need for an entry form, or a withdrawal form, it is definitely a pure form of club activities, the going-home club. While having the greatest pride as a member, he was given a mission by a beautiful teacher during the fall of his second year.\r\n\r\n“The problem child, Hiwa Arina, cure her venomous tongue.”\r\n\r\nThe Hiwa Arina, who was was only scored full points in appearance, who trampled over the confessions and courtship of many guys. That day, he was asked to cure the girl who was given the nickname of “The Venomous Tongued Rose.” For him, as a member of the world’s best club, the act of staying after school was a contradiction. However, he couldn’t refuse a request from his beautiful teacher, and is now forced to spend his after school time at school.\r\n\r\nThe beautiful young girl that used her venomous tongue for seemingly violent acts. \r\n\r\nThe going-home club member that can only speak in jokes. \r\n\r\nThe crazy school life of two people filled with the chaos of abuse and jokes. But, he has yet to find out about the secret that she was hiding…>"
}