{
	"url": "https://www.novelupdates.com/series/deposed-empress-general/",
	"title": "Deposed Empress General - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/01/Deposed-Empress-General.jpg",
	"noveltype": "(CN)",
	"genre": "Drama   Historical   Psychological   Romance   Shoujo   Tragedy   ",
	"tags": "Abusive Characters   Age Progression   Ancient China   Archery   Aristocracy   Army   Army Building   Assassins   Betrayal   Bodyguards   Character Growth   Charismatic Protagonist   Child Abuse   Childhood Friends   Clever Protagonist   Corruption   Dark   Death   Death of Loved Ones   Depictions of Cruelty   Different Social Status   Distrustful Protagonist   Doctors   Empires   Family Conflict   Female Protagonist   First-time Interc**rse   Generals   Gore   Handsome Male Lead   Hard-Working Protagonist   Harsh Training   Herbalist   Imperial Harem   Insects   Jealousy   Loyal Subordinates   Manipulative Characters   Medical Knowledge   Mercenaries   Nobles   Orphans   Past Trauma   Poisons   Politics   Pragmatic Protagonist   Protagonist Falls in Love First   Revenge   Royalty   R*pe   Schemes And Conspiracies   Secret Organizations   Secrets   Servants   Social Outcasts   Soldiers   Spies   Stockholm Syndrome   Strategic Battles   Strategist   Survival   Torture   Tragic Past   Wars   Weak to Strong   ",
	"rating": "(4.1 / 5.0, 96 votes)",
	"author": "一度君华   ",
	"year": "\n2016",
	"ranking": "#6970   #3813   #3402   #942   #3873   ",
	"reviewcount": "29 Reviews sorted by",
	"description": "You are the ruler, I am a subject, you want loyalty, I'll give you loyalty. You are the ruler, I am the subject, you want my sacrifice, I will sacrifice for you. This lifetime, we'll only be ruler and subject...... cannot become the one who accompanies you to experience everything.\r\n\r\nA deposed empress, a failure of a substitute. Charging into battle, he was the emperor, and she, his general. But within the intimacy of their military tent, he was her husband, and she, his wife.\r\n\r\nBut everything was star-crossed. For the one he loved the most, he would push her into hell again and again.>"
}