{
	"url": "https://www.novelupdates.com/series/under-the-power/",
	"title": "Under the Power - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/06/under-the-power.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Drama   Historical   Martial Arts   Romance   ",
	"tags": "Adapted to Drama   Ancient China   Apathetic Protagonist   Arrogant Characters   Bickering Couple   Business Management   Businessmen   Clever Protagonist   Cold Protagonist   Court Official   Enemies Become Lovers   Family   Family Business   Female Protagonist   Male Protagonist   Military   Mystery Solving   Politics   Schemes And Conspiracies   Tomboyish Female Lead   War Records   Wars   ",
	"rating": "(4.4 / 5.0, 39 votes)",
	"author": "Lan Se Shi   蓝色狮   ",
	"year": "\nN/A",
	"ranking": "#3923   #3351   #7281   #8108   #6706   ",
	"reviewcount": "4 Reviews sorted by",
	"description": "In the final years of the reign of Jiajing Emperor during the Ming Dynasty, Lu Yi of the Jingyiwei (male imperial secret officers) is commissioned to investigate the disappearance of funds that have been set aside for river repairs in Yangzhou. He is assisted by Yuan Jinxia of the Liushanmen. The two accidentally become involved in a conspiracy.\r\n\r\nThe talented female constable Yuan Jinxia gets into a disagreement with the hot-tempered Jinyiwei Lu Yi over a case that they are both involved in. Jinxia thought that she’d never encounter Lu Yi again in this lifetime, yet fate has its way of bringing two people back together. Government funds have been stolen and Jinxia receives orders to assist Lu Yi in his investigation.\r\n\r\nThey are unable to get along at first, but learn to work together through the hardships. Eventually, they develop feelings for each other to become lovers. However, things go awry when the truth about the past comes to light. Jinxia is the orphan of the Xia Yan case from many years ago and she bears the burdens of the bloodshed that destroyed her family.>"
}