{
	"url": "https://www.novelupdates.com/series/master-grim-reaper-makes-his-debut-in-center-position/",
	"title": "Master Grim Reaper Makes His Debut in Center Position - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/05/20200428212912.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Horror   Mature   Romance   Slice of Life   Supernatural   Yaoi   ",
	"tags": "Calm Protagonist   Celebrities   Co-Workers   Death   Dense Protagonist   Fated Lovers   Ghosts   God Protagonist   Handsome Male Lead   Hard-Working Protagonist   Hiding True Identity   Kind Love Interests   Love Interest Falls in Love First   Manly Gay Couple   Mature Protagonist   Misunderstandings   Modern Day   Monsters   Multiple Realms   Overpowered Protagonist   Power Couple   Protagonist Strong from the Start   Showbiz   Slow Romance   Teamwork   Younger Love Interests   ",
	"rating": "(4.4 / 5.0, 154 votes)",
	"author": "今斐   ",
	"year": "\nN/A",
	"ranking": "#6970   #3770   #1593   #1514   #1300   ",
	"reviewcount": "27 Reviews sorted by",
	"description": "As an outstanding figure in the grim reaper industry, there were no souls under the heavens that Lu Xu could not collect.\n\nOne day, he was given an undercover mission to investigate the mystery of how Film Emperor Ji Xiunian managed to escape death so many times. Seeing that the Film Emperor was going to be a mentor on an idol survival show, Lu Xu had a flash of inspiration and signed up as a contestant.\n\nHe originally planned on taking this person away after completing his investigation. However, he accidentally ended up debuting in center position.\n\nAt the age of five, Ji Xiunian was prophesied to remain lonely his entire life. The people around him were either dead or grievously hurt.\n\nHe expected to be alone his entire life and never imagined there would be an exception—not only did his luck take a turn after meeting Lu Xu, the demons and ghosts by his side had dispersed.\n\nJi Xiunian had never dated in the ten years since he debuted. The only scandal he had was regarding Lu Xu.\n\nFans thought this was just a tactic to boost a newbie’s popularity. They never imagined that the cold Film Emperor himself would come out to clarify—it’s not a scandal, he’s my destiny.\n\n*Center position = the one who gets the most lines, center dance positions, and screen time in an idol group>"
}