{
	"url": "https://www.novelupdates.com/series/the-demon-king-of-the-frontier-life-reincarnated-to-become-the-strongest-mage-the-former-demon-king-who-grows-up-while-being-loved-wants-to-know-humans-ln/",
	"title": "The Demon King of the Frontier Life, Reincarnated to Become the Strongest Mage ~The Former Demon King Who Grows Up While Being Loved, Wants to Know Humans~ (LN) - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/07/The-Demon-King-of-the-Frontier-Life.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Fantasy   Harem   Romance   School Life   Shounen   ",
	"tags": "Adapted to Manga   Adventurers   Beautiful Female Lead   Cheats   Elemental Magic   Fantasy Creatures   Fantasy World   Genies   Genius Protagonist   Guilds   Handsome Male Lead   Hard-Working Protagonist   Hiding True Abilities   Hiding True Identity   Humanoid Protagonist   Immortals   Kind Love Interests   Love Interest Falls in Love First   Magic   Magic Beasts   Magic Formations   Male Protagonist   Multiple Reincarnated Individuals   Overpowered Protagonist   Past Plays a Big Role   Polygamy   R-15   Reincarnation   Strong to Stronger   Sword And Magic   Sword Wielder   Timid Protagonist   Wizards   Younger Sisters   ",
	"rating": "(3.7 / 5.0, 52 votes)",
	"author": "Sengetsu Sakaki   千月さかき   ",
	"year": "\n2020",
	"ranking": "#1021   #2076   #3084   #1601   #3432   ",
	"reviewcount": "6 Reviews",
	"description": "In a certain frontier, there lived a mage known as ‘The Lone Demon King’.\n\nHe was just a creature that never grew old, but he was loved by the villagers as something like a Guardian Deity.\n\nHowever, he was destroyed by a magic organization that regarded his existence as dangerous.\n\n200 years later, he was reincarnated as the second son of a noble family and had acquired the strongest magic power.\n\n“…This time, I’ll pretend to be a human skillfully”\n\nHowever, being a human lover, he didn’t particularly thought of revenge, but decided to master the pretense of being human in this life.\n\nIn his previous life, he was the Guardian Deity of a region, and in this life, he is a local noble, but he doesn’t know common sense. He doesn’t even know how to take it easy.\n\nAs the second son of a noble, he was loved by his family and friends, and while he was revered as a master of magic by the Magic Guild, he rose to become the ‘Immortal Mage’ behind the scenes.>"
}