{
	"url": "https://www.novelupdates.com/series/the-villain-has-blackened-again/",
	"title": "The Villain Has Blackened Again - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/09/villainblackened3c.jpg",
	"noveltype": "(CN)",
	"genre": "Adventure   Comedy   Fantasy   Mature   Romance   Supernatural   Tragedy   ",
	"tags": "Age Progression   Animal Characteristics   Appearance Changes   Beasts   Beautiful Female Lead   Bestiality   Bloodlines   Calm Protagonist   Caring Protagonist   Charming Protagonist   Childcare   Clever Protagonist   Cold Love Interests   Confident Protagonist   Confinement   Cruel Characters   Depictions of Cruelty   Devoted Love Interests   Doting Love Interests   Episodic   Fated Lovers   Female Protagonist   Female to Male   Handsome Male Lead   Human-Nonhuman Relationship   Interdimensional Travel   Love Interest Falls in Love First   Magic Beasts   Male Yandere   Multiple Realms   Mythical Beasts   Obsessive Love   Older Love Interests   Pets   Possessive Characters   Pregnancy   Royalty   Seduction   Strong Love Interests   System Administrator   Transmigration   Unconditional Love   Werebeasts   World Hopping   ",
	"rating": "(4.3 / 5.0, 243 votes)",
	"author": "裸奔的馒头   ",
	"year": "\nN/A",
	"ranking": "#6970   #6264   #1277   #7725   #1262   ",
	"reviewcount": "68 Reviews sorted by",
	"description": "Nan Xun encountered a mythical beast that could take her to different worlds. She helped the mythical beast collect merit points. After collecting enough, she can go back and change the outcome of her death.\r\n\r\nBut now, now she regrets, regrets till her insides are turning green. Your mother, those merit points are collected from the scum villain with a blackening value of 100 and an evil value of 100 ah! She only wanted to purify the souls of those scummy bosses. Fu** she didn't want them to fall in love with her ah ah ah!\r\n\r\nPervert number 1 eats people! Pervert number 2 is an evil ghost! Pervert number 3....\r\n\r\nAfter Nan Xun realized they were all the same person, she closed her eyes and pretended to be dead.\r\n\r\nThe evil, charming, crazy Boss-sama gave her an evil smile: 'Baby, weren't you going to purify my soul? Come here.'\r\n\r\nNan Xun: 'The evil we bring on ourselves are the hardest to bear, I really want to die, ah, what to do!'>"
}