{
	"url": "https://www.novelupdates.com/series/suspended-life-game/",
	"title": "Suspended Life Game - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/02/e270d5dcdb9d0b66.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Horror   Mystery   Psychological   Supernatural   Yaoi   ",
	"tags": "Amnesia   Calm Protagonist   Clever Protagonist   Cunning Protagonist   Devoted Love Interests   Early Romance   Game Elements   Heartwarming   Modern Day   Mysterious Past   Near-Death Experience   Past Plays a Big Role   Seme Protagonist   Strategist   Survival Game   Transported into a Game World   Unlimited Flow   ",
	"rating": "(4.1 / 5.0, 39 votes)",
	"author": "布偶猫谢菡   ",
	"year": "\nN/A",
	"ranking": "#2000   #2000   #5948   #8982   #4896   ",
	"reviewcount": "5 Reviews sorted by",
	"description": "The second round of the game will now begin, with this round adopting the Werewolf Game White Wolf King’s version of the game rules!\n\nPlayer No. 5, Shen Mu, your identity today is the “guard”!\n\nOnce the sky darkens, please close your eyes…\n\nGuard, please open your eyes, who is the player that you wish to guard today?\n\nShen Mu: Of course it’s my little cutie No. 10!\n\nSystem warning! You cannot choose the same player to guard for two consecutive nights!\n\nWhite Wolf King: …blast out this No. 5 affectionate love dog!\n\nThe third year amnesiac uni-student, Shen Mu, was drawn into a surreal game by an unknown force——the Suspended Life Game. Only the winner could return to the real world, and their original life, while the loser will be erased for eternity!\n\nIn the first round of the preliminary game, Shen Mu (indifferently) discovered that he was the only one of the 12 players who had amnesia (crit hitx1), not only did he draw the most troublesome killer role(crit hitx2), but he was also assigned on a team with a mentally confused foolish (little sweetie) teammate and a little girl who was still in elementary school (crit hitx3).\n\nYet after the preliminary game, how would the subsequent real “official game” be different, what type of crisis would it conceal?\n\nSince the past is completely blank, life and death was uncertain for the future, then he must enjoy his current life and battle on!>"
}