{
	"url": "https://www.novelupdates.com/series/the-entire-interstellar-is-watching-what-i-eat/",
	"title": "The Entire Interstellar is Watching What I Eat - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/07/The-Entire-Interstellar-is-Watching-What-I-Eat.jpg",
	"noveltype": "(CN)",
	"genre": "Adventure   Romance   Sci-fi   Yaoi   ",
	"tags": "Cooking   Criminals   Futuristic Setting   Survival   Survival Game   System Administrator   Transmigration   ",
	"rating": "(4.4 / 5.0, 16 votes)",
	"author": "Jiang Kong   江空   ",
	"year": "\n2022",
	"ranking": "#3017   #3173   #8994   #7043   #7655   ",
	"reviewcount": "No Reviews",
	"description": "“Open Globe Survival” is the most popular variety show in the Star Sea Alliance, which is different from other variety shows. This variety show does not have any stars, and all the guests in it are prisoners who used to be in Star Prison.\r\n\r\nThey are dropped on an unknown planet and hunt each other down, and the winner will receive the opportunity to survive. In this era of killer entertainment, “Open Globe Survival” has gained the attention of the entire Star Sea Alliance as they bet on the team that will push the show to the top.\r\n\r\nJi He accidentally transmigrated to this planet and joined “Open Globe Survival” as a newcomer.\r\n\r\n【My God, he actually dares to eat that icky gross-looking thing?!】\r\n\r\n【It looks like he was able to make Hengji beast taste delicious, I want to buy Hengji beast too!】\r\n\r\n【What is he doing?! This rind can unexpectedly be opened like that?!】\r\n\r\n【Save me QAQ if I don’t watch Ji He eat for a day, I don’t have the desire to eat anymore】\r\n\r\n【I really want to try that thing Ji He made called fish soup, but it didn’t taste good at all when I made it myself QAQ】\r\n\r\nJi He’s series of operations stunned everyone watching the variety show and led a new trend across the Star Sea Alliance. Meanwhile, Ji He, who was trapped on an unknown planet, didn’t know anything about it.\r\n\r\nJi He was just a little distressed. Wasn’t the little black cat he picked up too tall? Obviously they eat the same thing, right?>"
}