{
	"url": "https://www.novelupdates.com/series/tran-sexual-online/",
	"title": "Tran S*xual Online - Novel Updates",
	"image": "https://www.novelupdates.com/img/noimagefound.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Comedy   Fantasy   Gender Bender   Romance   Sci-fi   Slice of Life   ",
	"tags": "Androgynous Characters   Anti-Magic   Carefree Protagonist   Cooking   Cross-dressing   Elemental Magic   Elves   Familiars   Female Protagonist   Female to Male   Gamers   Interconnected Storylines   Lack of Common Sense   Male to Female   MMORPG   Modern Day   Multiple POV   Multiple Protagonists   Sword And Magic   Trap   Virtual Reality   ",
	"rating": "(2.8 / 5.0, 59 votes)",
	"author": "an℟anju   ",
	"year": "\n2014",
	"ranking": "#2000   #2000   #8725   #7242   #7897   ",
	"reviewcount": "No Reviews",
	"description": "Welcome to the world of 《Trans Sexual Online》.\n\nThis is a virtual space (Virtual reality area).\n\nYou can live how you wish here.\n\nHowever, there is one condition.\n\nYour gender is reversed in this world.\n\nMen as women.\n\nWomen as men.\n\nHaven’t you ever wished you could\n\nbecome a different gender from the one you are right now?\n\nThat becomes true in this world.\n\nThe time flows differently in the world of《Trans Sexual Online》 than in the real world.\n\nOne day in the real world is equal to 1 year in this one. (tln: not quite accel world)\n\nFor those current generation people whose lives are so busy they cannot enjoy a normal VRMMO this virtual space (Virtual reality area) was created――.\n\nThat is this 《Trans Sexual Online》.\n\nIn this world you can live without rules (laws) however you wish.\n\nYou can spend your time managing a ranch.\n\nThoroughly study cooking.\n\nDive into the dungeons looking for treasures, knocking down monsters with your companions.\n\nSmith weapons and train to become the fiercest warrior.\n\nThe tale only depends on the number of players.\n\nThe degree of freedom on this VRMMO is virtually limitless. (tln: pun intended)\n\nNow then, please enjoy 《Trans Sexual Online》 to your heart’s content.\n\n2114.5 (Probably May 2114)\n\nFrom everyone at the Development Management Department for《Trans Sexual Online》>"
}