{
	"url": "https://www.novelupdates.com/series/please-dont-come-to-the-villainess-stationery-store/",
	"title": "Please Don’t Come To The Villainess’ Stationery Store! - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/03/Please-Dont-Come-To-The-Villainess-Stationery-Store.jpg",
	"noveltype": "(KR)",
	"genre": "Fantasy   Romance   ",
	"tags": "Adapted to Manhwa   Alchemy   Aristocracy   Broken Engagement   Business Management   Carefree Protagonist   Contracts   Curses   Cute Children   Demons   Determined Protagonist   European Ambience   Female Protagonist   Handsome Male Lead   Love Interest Falls in Love First   Magic   Nobles   Quirky Characters   Reverse Harem   Royalty   Schemes And Conspiracies   Store Owner   Villainess Noble Girls   ",
	"rating": "(3.9 / 5.0, 196 votes)",
	"author": "여로은   ",
	"year": "\n2020",
	"ranking": "#6970   #3650   #1917   #2349   #1365   ",
	"reviewcount": "32 Reviews",
	"description": "“A useless thing like you has no value in our family. Take this money and leave immediately!”\n\n“Yes! Goodbye!”\n\nShe became the incompetent villainess who commits wrongdoings in order to earn the love of her fiance, the male lead.\n\nHer reputation was already at rock bottom and the main characters, who can’t live without each other, are having an affair.\n\n“Getting kicked out and receiving money is good enough!”\n\nSo after she was kicked out, she set up a stationery store in front of a school. She reminisces of snacks, beer candy, and even bubbles! Just you wait, kids!\n\nBut… somehow her young customers are a little weird?\n\n“I’ll find you a handsome and modest man, and not someone who has an affair like my brother!”\n\n“Ha, then what about my brother, the crown prince?”\n\n“…the tower master is the best.”\n\nThe great magic swordsman, the next crown prince, the villainous tower master, and finally, the hidden villain.\n\nThe stationery store, which she thought would be peaceful, left her with no rest.\n\nHelp me! I just wanted to live a normal life!>"
}