{
	"url": "https://www.novelupdates.com/series/be-indulged/",
	"title": "Be Indulged - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/01/Be-Indulged.jpg",
	"noveltype": "(KR)",
	"genre": "Adult   Mature   Romance   Smut   ",
	"tags": "Abusive Characters   Age Progression   Antihero Protagonist   Appearance Different from Actual Age   Aristocracy   Beautiful Female Lead   Broken Engagement   Caring Protagonist   Childhood Love   Cohabitation   Complex Family Relationships   Cruel Characters   Death of Loved Ones   Depictions of Cruelty   Depression   Dreams   Drugs   Engagement   European Ambience   Fantasy World   Female Protagonist   First Love   First-time Interc**rse   Forced Marriage   Handsome Male Lead   Hiding True Identity   Jealousy   Love Interest Falls in Love First   Male Yandere   Misunderstandings   Nobles   Nudity   Obsessive Love   Orphans   Past Plays a Big Role   Past Trauma   Politics   R-18   Royalty   R*pe   Sadistic Characters   Schemes And Conspiracies   Secret Identity   Short Story   Siblings   Strong Love Interests   Time Skip   Tragic Past   Younger Love Interests   ",
	"rating": "(3.6 / 5.0, 68 votes)",
	"author": "Euphonium   유포늄   ",
	"year": "\n2019",
	"ranking": "#6970   #6160   #5448   #5633   #4244   ",
	"reviewcount": "5 Reviews sorted by",
	"description": "Amelia, the ‘dirty lady’, who has become the disgrace of her family because of the stigma of killing her fiance.\n\nWhen she was invited as an Empress Candidate, she knew that she wouldn’t become the Empress. She was only forced to go to the capital by her uncle to find a man to entrust her future with.\n\nAnd while the Emperor did want Amelia to be the Empress…\n\n…It seemed like he already knew her.\n\nA strange, lewd sound echoed through the room. He said looking closely at her face,\n\n“And I advise you, don’t do anything useless.”\n\nAs she gave him a puzzled look, he grinned and pointed down with his eyes. She saw his manhood poking her thigh.\n\n“It’s up again.”\n\nContrary to his languid expression, his manhood stood ramrod straight again, as if he wanted to take her at that very moment.>"
}