{
	"url": "https://www.novelupdates.com/series/black-bellied-belle-demon-lord-bite-the-bait-please/",
	"title": "Black Bellied Belle: Demon Lord, Bite the Bait Please - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2018/10/Novel-Illustration.jpeg",
	"noveltype": "(CN)",
	"genre": "Comedy   Fantasy   Martial Arts   Romance   Shoujo   Supernatural   Xuanhuan   ",
	"tags": "Alchemy   Beast Companions   Beautiful Female Lead   Black Belly   Calm Protagonist   Carefree Protagonist   Clumsy Love Interests   Cultivation   Devoted Love Interests   Doctors   Doting Love Interests   Eidetic Memory   Female Protagonist   Genius Protagonist   Handsome Male Lead   Love Triangles   Magical Space   Multiple Realms   Mysterious Family Background   Mysterious Past   Older Love Interests   Persistent Love Interests   Pets   Pill Concocting   Poisons   Previous Life Talent   Sentient Objects   Spirits   Strong Love Interests   Strong to Stronger   Transmigration   Unique Cultivation Technique   Unique Weapon User   Unique Weapons   Weak to Strong   ",
	"rating": "(3.7 / 5.0, 130 votes)",
	"author": "木子以栖   ",
	"year": "\nN/A",
	"ranking": "#2000   #2000   #643   #3215   #1842   ",
	"reviewcount": "23 Reviews sorted by",
	"description": "The first time they met they had battled fiercely, just for a mere bunch of herbs. She needed it to save people, and he wanted to use it to save his own life.\r\n\r\n'Let go of it, or you will die.' The man's violet eyes were cold and sinister as he said in a low voice.\r\n\r\nShe held on tightly to the base of the herb and pulled its roots right out of the ground, before she turned her eyes back with a crafty smile. 'It's mine now. Snatch it from me if you can.'\r\n\r\nWhen they met several years later they were no longer on opposing sides in hostility. In order to repay the debt for having stolen the herb back then, she went on to miraculously cure his body's condition, relieving him of the inhumane torment that wrecked at his body day and night. He was amazed by the godly skills in Medicine she possessed and his heart went on to fall irrecoverably head over heels in love.>"
}