{
	"url": "https://www.novelupdates.com/series/retired-villainess-transmigrates-into-a-cannon-fodder/",
	"title": "Retired Villainess Transmigrates into a Cannon Fodder - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/04/Retired-Villainess-Transmigrates-into-a-Cannon-Fodder.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Drama   Romance   Xuanhuan   ",
	"tags": "Acting   Arrogant Characters   Artists   Beautiful Female Lead   Broken Engagement   Business Management   Calm Protagonist   Celebrities   Clever Protagonist   Confident Protagonist   Cultivation   Cunning Protagonist   Doting Parents   Episodic   Famous Protagonist   Female Protagonist   Handsome Male Lead   Hard-Working Protagonist   Interdimensional Travel   Love Interest Falls in Love First   Mob Protagonist   Modern Day   Modern Knowledge   Multiple Realms   Persistent Love Interests   Previous Life Talent   Protagonist Strong from the Start   Showbiz   Strong to Stronger   Transmigration   Transported to Another World   World Hopping   ",
	"rating": "(3.8 / 5.0, 138 votes)",
	"author": "Beautiful Progeny   Lan Gui   兰桂   ",
	"year": "\n2019",
	"ranking": "#200   #196   #867   #245   #1718   ",
	"reviewcount": "45 Reviews sorted by",
	"description": "What should she do if she transmigrates into a cannon fodder? The first thing she will do will be to happily repay all the debt owed to the original body. She will enjoy living in the present rather than worry about the future since this is her second chance at life. \n\nMax-leveled bosses suddenly make a comeback at the last minute!\n\n【My fiancé falls in love with the housekeeper’s daughter? What about me? Well, I naturally have my own small wolfdog coax me until I’m happy!】\n\n【So what if the abandoned wife of a wealthy man is ridiculed by the whole internet? How shallow! I came from a rich and powerful family too!】\n\n【An idol fan has accidentally taken in the wrong idol. It’s fine, she will just raise and nurture the puppy dog to her taste.】\n\n*Puppy Dog – A guy who is young, handsome, clingy, possessive, slender, and lean but has muscles.>"
}