{
	"url": "https://www.novelupdates.com/series/the-pheromones-say-we-have-no-chance/",
	"title": "The Pheromones Say We Have No Chance - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/05/The-Pheromones-Say-We-Have-No-Chance.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Romance   School Life   Shounen Ai   Yaoi   ",
	"tags": "Adapted to Drama CD   Adapted to Manhua   Bickering Couple   Childhood Friends   Childish Protagonist   College/University   Coming of Age   Cute Story   Devoted Love Interests   Doting Parents   Enemies Become Lovers   Familial Love   First-time Interc**rse   Handsome Male Lead   Lazy Protagonist   Love Interest Falls in Love First   Mismatched Couple   Modern Day   Omegaverse   Playful Protagonist   Popular Love Interests   Slow Romance   Smart Couple   Wealthy Characters   ",
	"rating": "(4.5 / 5.0, 90 votes)",
	"author": "Mao Qiu Qiu   毛球球   ",
	"year": "\n2020",
	"ranking": "#553   #895   #4712   #4189   #3016   ",
	"reviewcount": "18 Reviews sorted by",
	"description": "Luo Zhiyu and Xiao Yan, both presenting in the middle of a gang fight, are carried to the hospital one after the other. One becomes an omega, and one becomes an alpha. \n\nProbably because the two were in the middle of an intense brawl at the time of presenting, their pheromone compatibility is an historically unprecedented  0%.\n\nOther than sometimes fighting and getting on bad terms every time they meet, these two people put together are definitely safe — to the point that when there are not enough hotel rooms on a school trip, teachers put them in the same room. \n\nTeachers: Anyone has the potential to date in high school, but these two definitely have no chance! \n\nThe principal catches an alpha and an omega walking on the side path in the evening, supposedly dating — \n\nStudents: There is no way, those two are definitely innocent! \n\nEveryone, including Luo Zhiyu himself, thinks that there is no way between them. \n\nAnd then one day, Luo Zhiyu gets permanently marked by Xiao Yan. \n\nLuo Zhiyu: ? No, the pheromones say we are not compatible, we must believe in science. \n\nXiao Yan pulls out the new compatibility report, dropping it in front of Luo Zhiyu: Enough nonsense, go steal your hukou identification so we can get married. \n\nAs Luo Zhiyu attends his high school’s first year military training, under the scorching sun, second-year Xiao Yan sits in front of their squad drinking iced water and eating watermelon. \n\nLuo Zhiyu picks up a stick and swings it at Xiao Yan for two whole blocks. \n\nAs Xiao Yan attends his university’s first year military training, under the scorching sun, high school third-year Luo Zhiyu sits in front of their squad drinking iced water and eating watermelon. \n\nXiao Yan brings the person into his arms, kissing him against a wall. >"
}