{
	"url": "https://www.novelupdates.com/series/difficult-to-control/",
	"title": "Difficult To Control - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/09/Difficult-to-control.jpg",
	"noveltype": "(CN)",
	"genre": "Yaoi   ",
	"tags": "Adultery   Enemies Become Lovers   Family Conflict   Modern Day   ",
	"rating": "(3.1 / 5.0, 8 votes)",
	"author": "Zheng Jiu Sha   郑九煞   ",
	"year": "\n2022",
	"ranking": "#1491   #1721   #12989   #9891   #12562   ",
	"reviewcount": "No Reviews",
	"description": "Xu Qi was jealous of Liao Jinxue.\n\nHe knew that the pair of shoes on Liao Jinxue’s feet would require his salary of three months. Every diamond on the watch on his wrist was genuine, the elegant cypress fragrance on the body exudes the smell of gold, not the shabby appearance that was there ten years ago.\n\nXu Qi hated Liao Jinxue.\n\nHe saw Liao Jinxue put his arms around his wife’s waist, the woman who has always been reluctant to show a smiling face, looking shy, the ring-wearing left hand caressed and flirted with Liao Jinxue’s chest, and finally leaned on his shoulder meekly.\n\nThirty-year-old Xu Qi has ordinary looks, a meagre salary job, and a precarious marriage. However, he also blamed all the fault on the young man who seduced his wife – peeping, stalking and cursing Liao Jinxue to wake up, ugly and impotent.\n\nBut it backfired and God made a sarcastic joke on him.\n\nAfter waking up with a hangover, there was a dazzling light, and there, beside him was a man with the fragrance of clear cypress wood. His handsome eyebrows and eyes coincide with every photo taken by him, like an absurd dream.\n\nAs he tried to flee hastily, Liao Jinxue pulled him back to his side, his lips were on the back of his neck, Xu Qi’s arms were tightly bound and his voice was cold, like unmelted snow.\n\n“satisfied?”\n\nXu Qi was jealous of Liao Jinxue.\n\nHe wished that Liao Jinxue would lose this beautiful face, his ability to seduce people, and his lavish spending. He wants Liao Jinxue to be an ugly and disgusting man, who can’t take anything away from him.\n\nCold, Sven scum gong x inferiority complex straight shou.>"
}