{
	"url": "https://www.novelupdates.com/series/old-wang-doesnt-want-to-be-tragic/",
	"title": "Old Wang Doesn’t Want to be Tragic - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/05/Old-Wang-Doesnt-Want-to-be-Tragic.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Mature   Romance   Yaoi   ",
	"tags": "Adopted Children   Businessmen   Calm Protagonist   Caring Protagonist   Childcare   Clingy Lover   Devoted Love Interests   Familial Love   Handsome Male Lead   Hard-Working Protagonist   Love at First Sight   Multiple Reincarnated Individuals   Possessive Characters   Slow Romance   Wealthy Characters   Younger Love Interests   ",
	"rating": "(3.7 / 5.0, 31 votes)",
	"author": "Taoli Shengge   桃李笙歌   ",
	"year": "\n2022",
	"ranking": "#6970   #2168   #9049   #7585   #9091   ",
	"reviewcount": "4 Reviews sorted by",
	"description": "Only after Wang Zhao Mou’s death did he find out that he was just a supporting male character in a Mary Su book. \n\nWang’s group, which he had worked hard for more than twenty years, went bankrupt overnight. Only because of the one sentence that the male protagonist said, “It’s getting cold. It’s time to let the Wang Group go bankrupt”.\n\nOutrageous!!!\n\nWhen Wang Zhao Mou woke up again, he found that he had returned to twenty years ago. He was half-drunk and was in a depressing mood. When he came out of the bar, he saw a young man holding a knife standing on the road.\n\nWhile he was drunk, a strong desire to survive suddenly broke out. Wang Zhao Mou didn’t care about others and directly went to hug the teenager’s long legs, and cried out, “Boss! No…Acquisition…”\n\nAfter sobering up, Wang Zhao Mou found out that the handsome teenager whose thighs he wrongly held was wearing an apron and holding a big knife to diligently open the durian.\n\nThe young man was clearly homeless and had yet to recognize his ancestors and inherit the family business! \n\nAt this moment, the young President Leng was being carried by his father behind his back, wiping tears pitifully and reaching out to him for help. \n\nLooking at President Leng’s father’s red ears and dodging eyes, Wang Zhao Mou showed a perfect smile. Meanwhile, looking at the tearful child, he was happily thinking, “Boy…You also have today!”>"
}