{
	"url": "https://www.novelupdates.com/series/youkoso-jitsuryoku-shijou-shugi-no-kyoushitsu-e/",
	"title": "Youkoso Jitsuryoku Shijou Shugi no Kyoushitsu e - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2017/02/cover00219.jpeg",
	"noveltype": "(JP)",
	"genre": "Drama   Psychological   School Life   Shounen   Slice of Life   ",
	"tags": "Academy   Adapted to Anime   Adapted to Manga   Anti-social Protagonist   Antihero Protagonist   Apathetic Protagonist   Arrogant Characters   Award-winning Work   Awkward Protagonist   Beautiful Female Lead   Blackmail   Calm Protagonist   Cautious Protagonist   Character Growth   Clever Protagonist   Cold Protagonist   Cruel Characters   Cunning Protagonist   Different Social Status   Distrustful Protagonist   Fearless Protagonist   Genius Protagonist   Handsome Male Lead   Hiding True Abilities   Hiding True Identity   Love Interest Falls in Love First   Male Protagonist   Manipulative Characters   Mature Protagonist   Modern Day   Multiple POV   Mysterious Past   Overpowered Protagonist   Past Plays a Big Role   Philosophical   Proactive Protagonist   Protagonist Strong from the Start   Romantic Subplot   Ruthless Protagonist   Schemes And Conspiracies   Secretive Protagonist   Slow Romance   Stoic Characters   Strategic Battles   Strategist   Strength-based Social Hierarchy   Teamwork   Tragic Past   Underestimated Protagonist   Unreliable Narrator   ",
	"rating": "(4.5 / 5.0, 532 votes)",
	"author": "Kinugasa Shougo   衣笠彰梧   ",
	"year": "\n2015",
	"ranking": "#479   #579   #715   #676   #261   ",
	"reviewcount": "60 Reviews sorted by",
	"description": "Kōdo Ikusei Senior High School, a leading prestigious school with state-of-the-art facilities where nearly 100% of students go on to university or find employment. The students there have the freedom to wear any hairstyle and bring any personal effects they desire. Kōdo Ikusei is a paradise-like school, but the truth is that only the most superior of students receive favorable treatment.\n\nThe protagonist Kiyotaka Ayanokōji is a student of D-class, which is where the school dumps its “inferior” students in order to ridicule them. For a certain reason, Kiyotaka was careless on his entrance examination, and was put in D-class. After meeting Suzune Horikita and Kikyō Kushida, two other students in his class, Kiyotaka’s situation begins to change.>"
}