{
	"url": "https://www.novelupdates.com/series/im-really-not-a-skilled-flirt/",
	"title": "I’m Really Not a Skilled Flirt - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/07/Im-Really-Not-a-Skilled-Flirt.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Drama   Romance   Shounen Ai   ",
	"tags": "Acting   Arrogant Characters   Award-winning Work   Carefree Protagonist   Celebrities   Cold Love Interests   Doting Love Interests   Doting Parents   Enemies Become Allies   Family   Family Business   Friendship   Handsome Male Lead   Hard-Working Protagonist   Modern Day   Previous Life Talent   Showbiz   Slow Romance   Stoic Characters   Strong Love Interests   Transmigration   Wealthy Characters   ",
	"rating": "(3.7 / 5.0, 19 votes)",
	"author": "第五熙   ",
	"year": "\n2021",
	"ranking": "#2000   #2000   #10345   #7856   #9289   ",
	"reviewcount": "3 Reviews sorted by",
	"description": "Shao Fei had transmigrated into a dog-blood novel, where he became the flirtatious vicious villain who had hooked up with men left and right. \n\nThis male villain not only hooked up with the protagonist gong Huo JunTing, but had also hooked up with the protagonist shou’s other suitors all throughout. His only goal was to prevent the protagonist shou from obtaining happiness. \n\nLater on, the protagonist gong had immediately punished him, resulting with the male villain having a miserable end.  \n\nIn order to get rid of the original plot development and incurring the tragic end of the original owner, Shao Fei had resolutely chose to take the abstinent route.\n\nBut unexpectedly, each and every one of the protagonist shou’s suitors had suddenly began to hit on him in reverse. \n\nEven Huo JunTing had developed an interest in him and would often tease him. \n\nTo this, he could only solemnly say, “I’m really not good at that, I don’t make appointments, I really don’t.” \n\nHuo JunTing couldn’t help but force to take him home and warned him in his ear in a low voice, “Whether you’re good at it or not, you’ll have to try it to know.”>"
}