{
	"url": "https://www.novelupdates.com/series/amnesiac-tyrants-white-moonlight/",
	"title": "Amnesiac Tyrant’s White Moonlight - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/09/Amnesiac-Tyrants-White-Moonlight.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Fantasy   Romance   Slice of Life   ",
	"tags": "Amnesia   Ancient China   Ancient Times   Cold Love Interests   Early Romance   Female Protagonist   Handsome Male Lead   Marriage   System Administrator   Transmigration   ",
	"rating": "(4.5 / 5.0, 6 votes)",
	"author": "一念夕雾   ",
	"year": "\n2020",
	"ranking": "#663   #956   #11512   #6260   #11814   ",
	"reviewcount": "2 Reviews sorted by",
	"description": "Yun Pianpian transmigrated it into a novel and became a little palace maid on the background board.\n\n The system want her to become the tyrant’s white moonlight. This tyrant Xiao Changyuan has a sinister temperament, violent, cruel, and cold. After the unification of the mountains and rivers, the people’s grievances boiled and he excecuted everyone.\n\nThe two fell off a cliff for some reason, Xiao Changyuan was bleeding and lost his memory. “…Woman, who are you?”\n\nIn the original novel, Xiao Changyuan and the little palace maid both lost their memory. The two became brothers and sisters. They lived in Jiangjia Village for three years and their relationship was like stagnant water. \n\nYun Pian Pian decided to add a fire to the stagnant water.\n\nBoil and dry it and let the fire ignite.\n\nYun Pianpian bit her rosy cherry lips, her apricot eyes were misty as she said tenderly, “Husband, I’m your wife, don’t you remember me?” The young emperor’s handsome and cold face thin lips pursed. . his thick black eyes stared at her for a long time and finally called her in a hoarse voice. “…Wife.”\n\nYun Pianpian directed the tyrant to plough the fields, farm, cook, and wash clothes and he lived happily ever after. Until one rainy night, the East Window incident happened, Yun Pian Pian’s face turned pale: “I’m sorry, I lied to you, I’m not your wife…” Xiao Changyuan bit her red lips and rubbed her ears, his eyes darkened and his voice hoarse.\n\n“Wife, if you want to deceive, deceive me until the end…” unfortunately, he love the way she lies and deceives people. “Your lies in my heart, are very sweet.” Xiao Changyuan’s heart was barren and cold and turned into a ruin but Yun Pian Pian danced gracefully above this ruin. She makes him fascinated and haunted. “She made the abyss boil and ignite his love.”>"
}