{
	"url": "https://www.novelupdates.com/series/the-magus-era/",
	"title": "The Magus Era - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2016/06/bigger-cover.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Drama   Harem   Mature   Supernatural   Xuanhuan   ",
	"tags": "Age Progression   Ancient Times   Beast Companions   Beautiful Female Lead   Bloodlines   Buddhism   Child Protagonist   Clever Protagonist   Cultivation   Dao Comprehension   Daoism   Dragons   Fast Cultivation   Friendship   Gods   Handsome Male Lead   Hard-Working Protagonist   Human-Nonhuman Relationship   Jack of All Trades   Late Romance   Lucky Protagonist   Magic   Male Protagonist   Master-Disciple Relationship   Mythology   Phoenixes   Polygamy   Previous Life Talent   Reincarnated in Another World   Romantic Subplot   Ruthless Protagonist   Soul Power   Spear Wielder   Spirit Advisor   Strong to Stronger   Tribal Society   Unique Cultivation Technique   Wars   ",
	"rating": "(3.4 / 5.0, 544 votes)",
	"author": "Blood Red   Xue Hong   血红   ",
	"year": "\n2015",
	"ranking": "#6970   #2000   #223   #2182   #592   ",
	"reviewcount": "70 Reviews sorted by",
	"description": "Long ago, there were people who stood upon the earth with their heads held high. They never bowed to anyone because of their indomitable spirit. They were capable of controlling wind and lightning, and conquering dragons and serpents. They seemed strong enough to split the earth and shatter the stars with their fists. They traveled throughout the land and called themselves Magi. Eventually, one of them would become a Supreme Magus! These men are the ancestors of human beings. Their blood is what we all share today.\n\nQing Long is the former strongest man in the world. He traveled through space and time and was reborn as Ji Hao in the Fire Crow Clan of the Southern Wasteland. It’s a complicated world. Forces from both inside and outside of the clan want this young and talented boy to die. Under great pressure, Ji Hao makes a deal with a mysterious man, who resides in his spiritual space, never showing his real face. He gains two drops of blood from a dragon and phoenix. Afterwards, Ji Hao becomes increasingly more powerful.>"
}