{
	"url": "https://www.novelupdates.com/series/return-of-the-unrivaled-spear-knight/",
	"title": "Return of The Unrivaled Spear Knight - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/11/Return-of-The-Unrivaled-Spear-Knight.jpg",
	"noveltype": "(KR)",
	"genre": "Action   Adventure   Drama   Fantasy   Harem   Martial Arts   School Life   ",
	"tags": "Academy   Accelerated Growth   Adapted to Manhwa   Aristocracy   Betrayal   Charismatic Protagonist   Clever Protagonist   Cold Protagonist   Complex Family Relationships   Demons   Dragons   Elves   Empires   European Ambience   Fantasy World   Gods   Handsome Male Lead   Kingdom Building   Kingdoms   Knights   Loyal Subordinates   Magic   Male Protagonist   Mature Protagonist   Multiple POV   Multiple Realms   Mysterious Past   Nobles   Past Plays a Big Role   Polygamy   Previous Life Talent   Protagonist Strong from the Start   Reincarnation   Revenge   Royalty   Schemes And Conspiracies   Second Chance   Seven Deadly Sins   Spear Wielder   Strength-based Social Hierarchy   Strong Love Interests   Strong to Stronger   Sudden Strength Gain   Sword And Magic   Time Skip   ",
	"rating": "(3.6 / 5.0, 46 votes)",
	"author": "조선생님   ",
	"year": "\n2019",
	"ranking": "#1983   #2063   #3032   #1730   #5576   ",
	"reviewcount": "6 Reviews sorted by",
	"description": "Unrivaled Spear Knight.\r\n\r\nThe stereotype that knights must use swords is broken by the brightest star of a duke’s family. The hero that brought an end to the empire’s civil war. The name of that person is Joshua Sanders.\r\n\r\nDespite his reputation of being called the empire’s unrivaled spear, he was bleeding dark red blood. Not just anyone but by the hand of his own emperor, Kaiser… “Kaiser! Don’t think it will end like this!!” Moments before death, incurred by magic circle, the spear that spent its years together with him, ‘Lugia’, started to emit an enormous amount of energy…\r\n\r\nThis familiar place, it can’t be… the stable that I used to live in when I was young?\r\n\r\nMy body became young?! Lugia, what the hell are you?\r\n\r\nJoshua returned to his younger self. His ultimate revenge starts here!>"
}