{
	"url": "https://www.novelupdates.com/series/the-legend-of-futian/",
	"title": "The Legend of Futian - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2018/05/The-Legend-of-Futian-.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Comedy   Drama   Fantasy   Harem   Martial Arts   Romance   Xuanhuan   ",
	"tags": "Academy   Arrogant Characters   Astrologers   Beast Companions   Beasts   Beautiful Female Lead   Betrayal   Brotherhood   Charismatic Protagonist   Charming Protagonist   Clever Protagonist   Confident Protagonist   Cultivation   Death of Loved Ones   Destiny   Devoted Love Interests   Dragons   Early Romance   Eye Powers   Fast Cultivation   Friendship   Genius Protagonist   Handsome Male Lead   Hidden Abilities   Hiding True Abilities   Hot-blooded Protagonist   Inscriptions   Long Separations   Magic   Maids   Male Protagonist   Marriage   Master-Disciple Relationship   Monster Tamer   Multiple Realms   Music   Mysterious Family Background   Mysterious Past   Past Plays a Big Role   Phoenixes   Polygamy   Royalty   Ruthless Protagonist   Secret Identity   Shameless Protagonist   Sharp-tongued Characters   Spatial Manipulation   Spear Wielder   Strong Love Interests   Sword And Magic   Sword Wielder   Time Skip   Weak to Strong   ",
	"rating": "(3.6 / 5.0, 155 votes)",
	"author": "Jing Wu Hen   净无痕   ",
	"year": "\n2018",
	"ranking": "#5262   #4785   #1981   #8532   #4427   ",
	"reviewcount": "36 Reviews sorted by",
	"description": "In a time when the Divine Prefectures of the East Sea were in great disarray, Emperor Ye Qing and Donghuang the Great appeared to save the day. Under their rule, the prefectures united and all nations as well as their kings have been controlled. However, the legend of these two great heroes becomes altered when Emperor Ye Qing's name is wiped from the history books after his sudden death. All statues and images of him were destroyed and his name a taboo. Only the legend of Donghuang the Great shall live on. \r\n\r\nFifteen years later, a young man by the name of Ye Futian begins his journey in search for his true identity. The legend of Futian was going to be one for the history books.>"
}