{
	"url": "https://www.novelupdates.com/series/to-my-sweet-villain/",
	"title": "To My Sweet Villain - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/08/To-My-Sweet-Villain.jpeg",
	"noveltype": "(KR)",
	"genre": "Fantasy   Horror   Romance   Smut   ",
	"tags": "Adopted Protagonist   Age Progression   Black Belly   Contracts   European Ambience   Female Protagonist   Handsome Male Lead   Healers   Male Yandere   Marriage of Convenience   Monsters   Nobles   Possessive Characters   Royalty   Sister Complex   ",
	"rating": "(4.2 / 5.0, 18 votes)",
	"author": "Jin Soye   진소예   ",
	"year": "\n2022",
	"ranking": "#2642   #1543   #10784   #7990   #8590   ",
	"reviewcount": "No Reviews",
	"description": "Dahlia Von Klose who possesses two powers at the same time and the Fifth Returner [5th time regressor] Jurgen Axel Edelred.\n\nIn order to survive one more day, the two desperately needed each other.\n\nKissing Dahlia’s white legs up to her knees, he felt a distinct satisfaction.\n\nEven if it’s a new presence in her world, yes. There is nothing different from the others. With a remorseful expression she’ll push him away saying don’t do this. She’ll hide the joy of having a higher status person with a dignified, proud face kneel before her, promising that he will grant anything she wants.\n\nGrasping her heel, he swept up her soft calf and grabbed the back of her knee. Then he looked up at her as she trembled like her frightened bird.\n\nHa!\n\nHowever, the moment Dahlia’s eyes met his, a chilling sensation of pleasure ran through Jurgen’s back.\n\nCovering her mouth, Dahlia was holding back a burst of laughter, like someone who had seen a gruesome comedy. With her sight full of the kneeling man at her feet, she showed an unhidden scorn.\n\nUnconsciously his grip grew stronger on Dahlia’s leg. Then she flinched and bent forward towards Jurgen. She still hadn’t erased a feeling similar to contempt in her eyes.\n\n“What are you up to? Sir Edeled.”\n\nIt was a voice sweet as poison.\n\nSmiling, Jurgen let her legs go, then got up on his knees. Following the dark red eyes that became cold in an instant, Dahlia’s held his stare.\n\nThe mask of the noble Jurgen Axel Edelred had cracked. The man’s eyes looked down obliquely and then grew long in a smile as he swept back his flowing bangs.\n\n“Ah… . Did I get caught?”>"
}