{
	"url": "https://www.novelupdates.com/series/jiang-chao-ge-and-the-spirit-weapon/",
	"title": "Jiang Chao Ge and the Spirit Weapon - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2018/11/IMG_8143.jpg",
	"noveltype": "(CN)",
	"genre": "Adventure   Comedy   Drama   Mystery   Romance   Supernatural   Xianxia   Yaoi   ",
	"tags": "Adapted to Manhua   Beast Companions   Beasts   Clever Protagonist   Cunning Protagonist   Handsome Male Lead   Human-Nonhuman Relationship   Love Interest Falls in Love First   Shameless Protagonist   Strong Love Interests   Transported to Another World   ",
	"rating": "(4.3 / 5.0, 108 votes)",
	"author": "Shui Qian Cheng   水千丞   ",
	"year": "\n2014",
	"ranking": "#2000   #2000   #3849   #10657   #2527   ",
	"reviewcount": "13 Reviews sorted by",
	"description": "Jiang Chao Ge, people called him “money hungry Jiang”. Went from a street hooligan to a newly appointed city official. The difficulties he experienced along the way he hid deep inside himself and did not say a word about it. He only wants be blinding in the eyes of everyone from now on.\n\nWho would’ve thought that before he even had the chance to enjoy the wealth and reputation, he inexplicably passed into a different world. Moreover to his bad luck, the first thing he was faced with was being chased down to be killed. He just casually took a worn out rusted old sword to defend himself, why are these country bumpkins who’ve never seen the world chasing him so relentlessly?\n\nIn order to get himself a body guard, he tried to summon the ‘animal spirit’ in the sword. In the end, he summoned a devilish brat who rolled his eyes upon seeing someone, who only called him a good for nothing, who bit him whenever he got close. Where was the powerful, first class spirit weapon he was promised?!\n\nNo money, no power, no people, life constantly at risk. He couldn’t see the path ahead, nor could he face the fierce tiger behind. Jiang Chao Ge was beaten back into the abyss with one hit. In this unfamiliar world full of thorns, there is only one reason that allowed him to persevere and that is: to go back.\n\nHence, he was forced to embark on a desperate and risky journey with this devilish brat who he loathed mutually.>"
}