{
	"url": "https://www.novelupdates.com/series/unrequited-love/",
	"title": "Unrequited Love - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/06/unrequited_love2.jpg",
	"noveltype": "(CN)",
	"genre": "Romance   School Life   Slice of Life   ",
	"tags": "Adapted to Drama   Adapted to Movie   College/University   Female Protagonist   Handsome Male Lead   Misunderstandings   Popular Love Interests   Protagonist Falls in Love First   Stubborn Protagonist   Unrequited Love   ",
	"rating": "(4.0 / 5.0, 40 votes)",
	"author": "Ba Yue Chang An   八月长安   ",
	"year": "\n2018",
	"ranking": "#4080   #2000   #7928   #11742   #7190   ",
	"reviewcount": "3 Reviews sorted by",
	"description": "“Luo Zhi loves Sheng Huai Nan, but nobody knows about it.”\r\n\r\nHave you ever loved a person, loved him so deeply to the point that your love was engraved in your bones, and yet, nobody knew about it?\r\n\r\nAs a result of a chance meeting that occurred when they were young, in the eleven years during which she grew up, Luo Zhi’s life always had indistinct impressions of Sheng Huai Nan.\r\n\r\nHis subsequent reappearance was so dazzling and so blinding, that from then on, Luo Zhi’s diary transformed into a one-act play – a one-act play that belonged solely to him.\r\n\r\nLuo Zhi’s love was so humble, so careful, and yet, so proud. Her internal demons grew at such an alarming rate, there was no way she could easily and cleanly retract her love for him.\r\n\r\nHe was just there – in Luo Zhi’s heart, in front of Luo Zhi’s eyes. As long as she took a single step forward, she would be able to break the distance that had built up between them within the past ten years. However, the furthest distance in the world is not the distance between us when I stand in front of you, loving you despite you having no idea that I love you. Rather, it is when I love you, and yet I am unable to touch you.\r\n\r\nIn the noisy and busy city of Beijing, P University stood there with its spacious grounds, and yet it was like the faraway Zhen Hua High School in the North – leaving Luo Zhi with absolutely no place to hide.>"
}