{
	"url": "https://www.novelupdates.com/series/transmigrated-into-a-big-shots-cannon-fodder-little-pampered-wife/",
	"title": "Transmigrated into A Big Shot’s Cannon Fodder Little Pampered Wife - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/06/Transmigrated-into-A-Big-Shots-Cannon-Fodder-Little-Pampered-Wife.png",
	"noveltype": "(CN)",
	"genre": "Comedy   Drama   Fantasy   Romance   Yaoi   ",
	"tags": "Acting   Alternate World   Arranged Marriage   Business Management   Businessmen   Character Growth   Childcare   Complex Family Relationships   Doting Love Interests   Doting Older Siblings   Doting Parents   Enemies Become Allies   Hard-Working Protagonist   Love at First Sight   Love Interest Falls in Love First   Marriage   Misunderstandings   Modern Day   Modern Knowledge   Mpreg   Multiple Reincarnated Individuals   Mysterious Family Background   Older Love Interests   Orphans   Proactive Protagonist   Programmer   Reincarnation   Schemes And Conspiracies   Shy Characters   Siblings   Slow Romance   Smart Couple   Straight Uke   System Administrator   Teachers   Tragic Past   Transmigration   Transplanted Memories   Wealthy Characters   ",
	"rating": "(4.4 / 5.0, 84 votes)",
	"author": "Childe Seeking Joy   公子寻欢   ",
	"year": "\n2020",
	"ranking": "#976   #3380   #4691   #6339   #3470   ",
	"reviewcount": "18 Reviews sorted by",
	"description": "Shen Ran woke up in a daze.\n\nHe transmigrated into a vicious male partner who put a green hat on the first rate, rich and powerful person in the book, bullied others, ruined his family and finally died in a miscarriage.\n\nShen Ran said that he only wanted to be a salted fish,  lived with rich family, drift along, eat and wait for dead, ‘but the system didn’t follow my wishes’.\n\n“Dear, you can get the ability of ‘mental perception eyes’ by completing tasks, and you can catch all outstanding talents in one go oh!”\n\n“Dear, work harder, you will get the buff of ‘Little Investment Expert’ after the task is completed oh!”\n\n“Dear….. ”\n\n“Dear one, the reward this time is ‘the understanding of love’! ‘From now on, I will never worry about my husband misunderstanding me!'”\n\nWait, what the hell is the last one?\n\nMin Xingchuan, who has always been indifferent, arrogant and cold, woke up to find that his marriage partner always come with a barrage of bullet screen on top of his head.\n\n“When will my husband get divorced?”\n\n“f*ck, this man’s male dog’s waist is amazing!”\n\n“Tsk tsk, plastic husband is so good-looking, I think…”\n\nMin Xingchuan finally couldn’t bear it, and stepped forward to hug him: “Oh? What do you want just be direct, is it fun to YY all the time?”\n\nOpen live broadcast websites, Taobao websites, video websites, take-out platforms, live broadcast commodity… Experiencing the joy of being on the pinnacle of life.\n\nMinXingchuan: “Does Madam know wrong already?”\n\nSubordinate: “Chief Min… Madam is already the richest man in the world!”\n\nShen Ran: I am not a pioneer in the industry, I am just a porter of cultural technology…>"
}