{
	"url": "https://www.novelupdates.com/series/when-the-green-tea-female-side-character-wants-to-humiliate-the-male-lead/",
	"title": "When the Green Tea Female Side Character Wants to Humiliate the Male Lead - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/09/When-the-Green-Tea-Female-Side-Character-Wants-to-Humiliate-the-Male-Lead.jpeg",
	"noveltype": "(CN)",
	"genre": "Adult   Comedy   Drama   Romance   ",
	"tags": "Beautiful Female Lead   Late Romance   System Administrator   Transmigration   ",
	"rating": "(3.1 / 5.0, 16 votes)",
	"author": "Tang Guo Fen Fen   糖果粉粉   ",
	"year": "\n2020",
	"ranking": "#2000   #2000   #10548   #10271   #10403   ",
	"reviewcount": "3 Reviews sorted by",
	"description": "Ruan Chacha very unluckily transmigrated to be an evil green tea side character that meets a tragic ending. \r\n\r\nThe original character used all different methods of being a green tea* to the female lead and even schemed to harm her but each and every time, the male lead saved her. \r\n\r\nIn the end, the male lead ended this conniving green tea side character. \r\n\r\nWhen a cold mechanical green tea system bound Ruan Chacha: “Your mission is to be a white lotus* using ten phrases, and then you’ll get green tea points based on their reaction.” \r\n\r\nRuan Chacha, who had her head lowered and was picking at her fingernails earnestly, raised her head and thought, “Oh.” \r\n\r\nWasn’t it just being a white lotus? Easy.\r\n\r\nThe green tea system was satisfied and nodded. It thought, she was a bit dumb but she was obedient. \r\n\r\nThat’s until it saw Ruan Chacha being a white lotus time and time again, and watched as her green tea score shot up … \r\n\r\nThe green tea system was dumbfounded, “Who the hell told you to seduce the male lead!!” \r\n\r\nRuan Chacha was confused after being scolded, “What? What’s wrong?” \r\n\r\nShe was actually getting really good at humiliating the male lead. \r\n\r\nThe green tea system finally shut up, “... Nothing’s wrong.” \r\n\r\nIt started to wonder how it could leave this weird and bizarre host … \r\n\r\nThe important important thing: this is a feel good novel!!! Hope everyone is happy reading it, hopefully it will make you laugh. \r\n\r\nNote: \r\nGreen tea = green tea b*ch, someone who looks really innocent and sweet but is actually manipulative and conniving\r\n\r\nWhite lotus = similar to green tea, someone who looks pure and delicate but actually is completely different, sinister and calculating>"
}