{
	"url": "https://www.novelupdates.com/series/my-second-life-as-a-secretary/",
	"title": "My Second Life As A Secretary - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/07/My-Second-Life-As-A-Secretary.png",
	"noveltype": "(CN)",
	"genre": "Comedy   Fantasy   Mature   Psychological   Romance   ",
	"tags": "Beautiful Female Lead   Business Management   Businessmen   Female Protagonist   Handsome Male Lead   Hard-Working Protagonist   Heartwarming   Love Interest Falls in Love First   Mature Protagonist   Modern Day   Pragmatic Protagonist   Slow Romance   Strong Love Interests   Transmigration   Tsundere   Wealthy Characters   ",
	"rating": "(4.0 / 5.0, 25 votes)",
	"author": "Mai Hua Er Guniang   ",
	"year": "\n2021",
	"ranking": "#1691   #1783   #7586   #2983   #8697   ",
	"reviewcount": "4 Reviews sorted by",
	"description": "He Zening had always felt that novels depicting the life of a Company President were good for passing time, but insulting to the IQ. Still, having read countless novels of this genre, never did she imagine that someday she would transmigrate into one of them. To make matters worse, the plots were so similar that she could not remember which novel it was. She was left with no choice but to assume the role of a secretary to the President.\r\n\r\nThe secretaries in novels ran errands for the President, assisted him in pursuing women, helped him keep the flames of love burning, and even took the blame for him if necessary. But a real-life secretary? They were blamed by those in power, sometimes hurt and reprimanded wrongly.\r\n\r\nIf it were not for the excellent pay and necessity, she would have already bolted out of the door. And like all curious bystanders, He Zening wanted to see the plot happen before her eyes; the President meeting the protagonist! A villain standing between the love of the leads! The side characters!\r\n\r\nThis is the second life of a level-headed, diligent secretary working hard to achieve a carefree life, whilst being dragged into the plot.>"
}