{
	"url": "https://www.novelupdates.com/series/my-husband-hates-me-but-he-lost-his-memories/",
	"title": "My Husband Hates Me, But He Lost His Memories - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/09/My-Husband-Hates-Me-But-He-Lost-His-Memories_1632981514.jpg",
	"noveltype": "(KR)",
	"genre": "Drama   Fantasy   Romance   ",
	"tags": "Abusive Characters   Adopted Protagonist   Amnesia   Aristocracy   Arranged Marriage   Arrogant Characters   Beautiful Female Lead   Complex Family Relationships   Depression   Devoted Love Interests   Divorce   Doting Love Interests   Elemental Magic   Emotionally Weak Protagonist   Enemies Become Lovers   European Ambience   Family Conflict   Female Protagonist   Forced Marriage   Handsome Male Lead   Hated Protagonist   Misunderstandings   Nobles   Past Trauma   Possessive Characters   Royalty   ",
	"rating": "(3.4 / 5.0, 70 votes)",
	"author": "Sisse   시세   ",
	"year": "\n2021",
	"ranking": "#946   #496   #4088   #1473   #4618   ",
	"reviewcount": "7 Reviews sorted by",
	"description": "My husband entered an arranged marriage with me against his will. And he hates me.\n\nI just lived every single day as though I was dead, waiting for the day that we’d get divorced…\n\n“The Duke… seems to have lost his memory.”\n\n“What…?”\n\nThen, one day, he suddenly lost his memories. To be more exact, only memories of me had been wiped clean from his mind.\n\nAnd it seems like this amnesiac husband of mine somehow fell in love with me…\n\n“My dear… I’m really, really happy that you’re my wife.”\n\nWho is this… this puppy-like man…?\n\nIsn’t he the same man who bares his teeth at me every time he sees me?\n\n“Once you remember everything, you’re going to regret it all. You’re being so nice to me like this…”\n\n“No, I won’t. Not even a little bit.”\n\nHaa. Seriously… He talks to me so sweetly now, but this will definitely turn into a shameful past that he’d come to regret later on.  \n\nAfter he recovers his memories, I know for sure that my husband will finally push ahead with the divorce.\n\nI should prepare for it in advance.>"
}