{
	"url": "https://www.novelupdates.com/series/yuri-bl-and-ts-a-transforming-heroine/",
	"title": "Yuri, BL and TS~ A Transforming Heroine~ - Novel Updates",
	"image": "https://www.novelupdates.com/img/noimagefound.jpg",
	"noveltype": "(JP)",
	"genre": "Comedy   Fantasy   Gender Bender   School Life   Slice of Life   Yuri   ",
	"tags": "Demi-Humans   Magical Girls   Male to Female   Modern Day   Shounen-Ai Subplot   Spirits   ",
	"rating": "(3.0 / 5.0, 10 votes)",
	"author": "古葉七   ",
	"year": "\n2022",
	"ranking": "#5262   #2000   #11232   #6965   #12121   ",
	"reviewcount": "No Reviews",
	"description": "Inari Hinata was an ordinary high-school boy. He was visiting his father’s family during the summer holidays where, by chance, he met the fox spirit, Kon.\n\nKon was looking for someone to fight against the Impurity, which arises from people’s negative emotions, and Hinata was one of the few people who could fight against it. He wanted to help Kon, but to fight against the Impurity, he needed to become a fox miko.\n\nA priestess… Yes, he had to become a woman.\n\nIt would have normally been an impossible proposition. However, Hinata has always had a wish he wanted to fulfill, and the proposal to become a woman was a godsend to reach that wish, so he readily agreed. Hinata’s wish was to be with his childhood friend and best friend, Ooyama Magami, for the rest of his life.\n\nEven though two men couldn’t be together, it wouldn’t be if he became a woman. With this thought in mind, Hinata makes an unimaginable summer holiday debut as a gender bender.\n\nSpending summer holidays as fox miko, she fought the Impurity daily as the Fox. Always by her side in battle was the Wolf, a wolf miko. Although she didn’t talk much, she had built up trust with her during their battles.\n\nDespite all these new encounters, the summer holidays eventually ended, and Hinata had to return to school. When she arrived at her classroom, nervous about her incredible summer holiday debut, she found an unfamiliar tall and beautiful woman there.\n\nShe was Magami, who had made her debut during the same time. \n\nJust as she was about to ask her what was going on, the Impurity appeared and Hinata headed off to battle. As usual, she cleansed the Impurity with the Wolf, who also rushed to the scene. However, the Wolf, who usually left without saying anything, suddenly asked her out of nowhere.\n\n“You are… Hinata, aren’t you?”\n\nYes… The Wolf’s true identity was Magami, who had become a woman for the same reason as Hinata. Thus, the two were reborn as women after their mutual goals clashed.\n\nThis is a romantic comedy disguised as a transformation heroine story, in which two beautiful girls who used to be men enjoy flirting with each other.>"
}