{
	"url": "https://www.novelupdates.com/series/the-devoted-second-male-lead-decided-to-favor-someone-else/",
	"title": "The Devoted Second Male Lead Decided to Favor Someone Else - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/12/The-Devoted-Second-Male-Lead-Decided-to-Favor-Someone-Else_1640749924.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Drama   Romance   Tragedy   Xianxia   Yaoi   ",
	"tags": "Affair   Cold Love Interests   Cunning Protagonist   Devoted Love Interests   Doting Love Interests   Evil Protagonist   Fantasy World   Handsome Male Lead   Love Interest Falls in Love First   Misunderstandings   Mob Protagonist   Multiple Realms   Multiple Transported Individuals   Omegaverse   R*pe Victim Becomes Lover   R*pe   Secret Relationship   Showbiz   Strong Love Interests   System Administrator   Transmigration   World Hopping   World Travel   ",
	"rating": "(3.7 / 5.0, 60 votes)",
	"author": "挽轻裳   ",
	"year": "\n2020",
	"ranking": "#1592   #1203   #3923   #1873   #3595   ",
	"reviewcount": "9 Reviews sorted by",
	"description": "Lu Shijin transmigrated into a strange world and was bound to a ‘Devoted Side Male Lead’ system. The system required him to wholeheartedly play the role of a side male lead, to selflessly dedicate himself to the main character and to advance the plot development. He would only be able to return to the real world when the audience’s enjoyment exceeds 100%.\n\nLu Shijin, who had accumulated enough pent-up frustration in real life, sneered. \n\nWhat real world? Isn’t it better to be a flirtatious bit*h who only lives for himself?\n\nSo, Lu Shijin—\n\n– Helped his villain uncle and the scum fight for family property in a dog-blood story.\n\n– Became both the villain and the white moonlight in an interstellar science fiction story.\n\n– Spent every day being gay with the idol in an inspirational idol drama story.\n\n– Caused the king of the mermaids to come ashore to pursue him in a science fiction fairy tale.\n\n– Became the ‘cannon fodder’ and counterattacked in a modern workplace story.\n\n– Stole the honoured consort from the emperor who already had an entire harem in a palace scheming story.\n\n– Created a two-way redemption for the devoted side male lead and school tyrant in a modern love story.\n\n– Was coveted as a furnace by the elder of the emotionless path in a cruel xianxia story.\n\n– Became a bride to give luck to a vegetative person in a modern business story.\n\n– Relied on papapa to save the world in a suspenseful adventure story.\n\n……\n\nLu Shijin threw away his holy saint halo and went straight to being OOC. He hadn’t expected that the audience would like his persona breaking that much.\n\nThe audience watched as the plot broke free like a wild horse and became all over the place, their smiles gradually becoming twisted: This plot is great! I love it! Our Jinjin is still young, so you have to discipline him properly!>"
}