{
	"url": "https://www.novelupdates.com/series/reverend-insanity/",
	"title": "Reverend Insanity - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2018/09/16f28ed8a155d1227eb810c88504dc97.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Fantasy   Mature   Mystery   Psychological   Xianxia   ",
	"tags": "Adapted to Manhua   Age Progression   Antihero Protagonist   Apathetic Protagonist   Appearance Changes   Appearance Different from Actual Age   Artifacts   Battle Competition   Betrayal   Blood Manipulation   Body Swap   Body Tempering   Bodyguards   Brainwashing   Character Growth   Charismatic Protagonist   Clever Protagonist   Clones   Cold Protagonist   Confident Protagonist   Crafting   Cultivation   Cunning Protagonist   Dao Comprehension   Dark   Depictions of Cruelty   Destiny   Distrustful Protagonist   Divination   Enemies Become Allies   Evil Protagonist   Family Conflict   Famous Protagonist   Gore   Hard-Working Protagonist   Hated Protagonist   Heavenly Tribulation   Hiding True Abilities   Hiding True Identity   Immortals   Inheritance   Interconnected Storylines   Loner Protagonist   Loyal Subordinates   Magic Beasts   Magical Space   Male Protagonist   Manipulative Characters   Mature Protagonist   Mercenaries   Merchants   Mind Control   Money Grubber   Multiple Identities   Multiple POV   Multiple Reincarnated Individuals   Multiple Timelines   Mutated Creatures   Mythical Beasts   Mythology   Orphans   Past Plays a Big Role   Pets   Politics   Pragmatic Protagonist   Previous Life Talent   Proactive Protagonist   Prophecies   Protagonist with Multiple Bodies   Reincarnated in Another World   Reverse R*pe   Ruthless Protagonist   Schemes And Conspiracies   Second Chance   Sect Development   Selfish Protagonist   Shameless Protagonist   Sibling Rivalry   Siblings   S*aves   Soul Power   Spatial Manipulation   Special Abilities   Strength-based Social Hierarchy   Strong to Stronger   Time Loop   Time Manipulation   Time Skip   Time Travel   Torture   Tribal Society   Trickster   Twins   Underestimated Protagonist   Unique Cultivation Technique   Wars   World Travel   Younger Brothers   ",
	"rating": "(4.3 / 5.0, 1347 votes)",
	"author": "Gu Zhen Ren   蛊真人   ",
	"year": "\n2012",
	"ranking": "#524   #1686   #240   #1246   #180   ",
	"reviewcount": "299 Reviews sorted by",
	"description": "Humans are the spirit of all living beings, Gu* are the essence of heaven and earth.\n\nWith his three views* unrighteous, a demon is reborn.\n\nFormer days are but an old dream, an identical name is made anew.\n\nThe story of a time traveler who keeps on being reborn.\n\nA unique world that nurtures, refines, and uses Gu.\n\nSpring Autumn Cicada, Moonlight Gu, Liquor Worm, Great Qi Golden Light Worm, Slender Black Hair Gu, Hope Gu…\n\nAnd a great demon of the world that acts as his heart pleases!\n\nA story of a villain, Fang Yuan who was reborn 500 years into the past with the Spring Autumn Cicada he painstakingly refined. With his profound wisdom, battle and life experiences, he seeks to overcome his foes with skill and wit! Ruthless and amoral, he has no need to hold back as he pursues his ultimate goals. In a world of cruelty where one cultivates using Gu - magical creatures of the world - Fang Yuan must rise up above all with his own power.\n\nNote :\n\nGu are legendary venomous insects, often used in black magic practices. They can take on the form of several insects, usually snakes, crickets, worms, etc.\n\nThree views = one’s world view, values of worth and philosophy on life.>"
}