{
	"url": "https://www.novelupdates.com/series/a-different-world-romance-that-begins-with-a-reincarnation-%ef%bd%9ethe-excluded-summoned-wanders-the-world-in-search-of-their-reincarnated-childhood-friend%ef%bd%9e/",
	"title": "A Different World Romance That Begins With a Reincarnation! ～The Excluded Summoned Wanders the World in Search of Their Reincarnated Childhood Friend～ - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/07/A-different-world-romance-that-begins-with-a-reincarnation-The-excluded-summoned-wanders-the-world-in-search-of-their-reincarnated-childhood-friend.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Comedy   Drama   Fantasy   Harem   Martial Arts   Romance   ",
	"tags": "Adventurers   Childhood Friends   Demons   Depictions of Cruelty   Elves   Evil Gods   Fairies   Gods   Magic   Male Protagonist   Naive Protagonist   Near-Death Experience   Overpowered Protagonist   R-15   Strong to Stronger   Sword And Magic   Transported to Another World   Weak to Strong   ",
	"rating": "(4.1 / 5.0, 14 votes)",
	"author": "Mizubeno Kawasemi   水辺野かわせみ   ",
	"year": "\n2018",
	"ranking": "#2000   #2000   #7997   #4320   #7516   ",
	"reviewcount": "2 Reviews sorted by",
	"description": "One day, high school student Ryou Aomi loses his childhood friend and first love, Mia Morisaki, to illness, and is suddenly summoned by a hero and transferred to another world.\r\n\r\nA few weeks later. He begins to think that there is a possibility that Mia has been reincarnated in this world, but his life is taken away as a person who brings disaster.\r\n\r\nHowever, just before his soul is about to be extinguished, he activates his only gift, 'Ikiru Ryuten,' and is revived as the strongest being in the world.\r\n\r\n『If you are reborn in another world, please meet me again...... and love me again.........』\r\n\r\nAfter changing his name to Siryu and becoming an adventurer, Siryu sets off on a journey to another world where danger and adventure await him, in order to fulfill the promise he made to Mia.\r\n\r\nIs the girl he meets there the reincarnation of Mia?>"
}