{
	"url": "https://www.novelupdates.com/series/i-found-a-husband-when-i-picked-up-the-male-lead/",
	"title": "I Found a Husband When I Picked up the Male Lead - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/08/I-Found-a-Husband-When-I-Picked-up-the-Male-Lead.jpg",
	"noveltype": "(KR)",
	"genre": "Comedy   Fantasy   Romance   Shoujo   ",
	"tags": "Adapted to Manhwa   Aristocracy   Beautiful Female Lead   Childcare   Cute Children   Enemies Become Lovers   European Ambience   Female Protagonist   Handsome Male Lead   Love Interest Falls in Love First   Marriage   Marriage of Convenience   Nobles   Transmigration   ",
	"rating": "(4.2 / 5.0, 103 votes)",
	"author": "초암   ",
	"year": "\n2019",
	"ranking": "#5262   #1121   #2843   #2066   #1174   ",
	"reviewcount": "10 Reviews",
	"description": "Her family used all their money for her extravagance and luxuries and brought a crisis of bankruptcy.\n\nWhile trying to figure out how to pay off their debts, she found a leaflet from the duke looking for a lost child.\n\nThe reward is so much money that you can play and eat even after you pay off your debts!\n\nFollowing the memories of reading this book, right away, Lizelle picked up the boy who was caught in a tr*sh in a poor village.\n\nShe took the lost Lapel and went to the duke.\n\n“This is the child the Duke is looking for.”\n\nDuke Chester said, looking at me with a doubtful glance.\n\n“I need confirmation, so you should stay with my child in this house for the time being.”\n\nThe strange cohabitation of the three people started like that.\n\nHowever, Lapel keeps thinking of me as a mother and won’t let her leave.\n\n*\n\n“Let’s get married.”\n\nLizelle was startled by the unexpected words.\n\n“Are you insane? Did you drink?”\n\n“1 year. If you perform a contract marriage for one year, I will pay you 10 times the amount of the rewards you were given.”\n\n“Can I call you honey?”\n\nAnd the contract marriage and marital life began.\n\nBut why are my eyes constantly changing?\n\nWhy do you keep coming every night!\n>"
}