{
	"url": "https://www.novelupdates.com/series/pampered-into-being-the-empress/",
	"title": "Pampered Into Being The Empress - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/11/relying-on-pampering-to-become-empress.jpg",
	"noveltype": "(CN)",
	"genre": "Drama   Fantasy   Historical   Mature   Romance   ",
	"tags": "Ancient China   Beautiful Female Lead   Cautious Protagonist   Clever Protagonist   Cold Protagonist   Comedic Undertone   Couple Growth   Death   Devoted Love Interests   Disabilities   Doting Love Interests   Female Protagonist   First-time Interc**rse   Handsome Male Lead   Hiding True Abilities   Imperial Harem   Love Interest Falls in Love First   Loyal Subordinates   Male Protagonist   Master-Servant Relationship   Multiple POV   Past Plays a Big Role   Pregnancy   R*pe Victim Becomes Lover   Reincarnation   Revenge   Royalty   R*pe   Second Chance   S*xual Abuse   Tsundere   ",
	"rating": "(4.0 / 5.0, 77 votes)",
	"author": "Wu Fan   妩梵)   ",
	"year": "\nN/A",
	"ranking": "#4080   #2591   #3487   #3536   #3344   ",
	"reviewcount": "14 Reviews sorted by",
	"description": "The story between a super tsundere and ruthless emperor vs a soft and tender scheming beauty.\n\nRong Xi is the daughter of a convicted official. After entering the palace, she concealed her beautiful appearance and became the maidservant of the Fourth Prince.\n\nFourth Prince Mu Huai was born as fair as jade and as refreshing as the breeze in the moonlight, yet he is a cripple in a wheelchair, making him violent and withdrawn.\n\nAll the palace servants tremble in fear before him and none dare to serve him. Rong Xi, this person with a good temper and unyielding patience was pushed out instead.\n\nOne month later, the Fourth Prince allowed Rong Xi to sit on his lap, shocking everyone in the palace.\n\nSix months later, the Fourth Prince’s legs were healed, and he entered the Eastern Palace to become the Crown Prince, yet Rong Xi died.\n\nWhile Mu Huai did not reveal any sadness, his hair turned white overnight.\n\n*\n\nThe Emperor Mu Huai died early in his previous life and never married. Before he passed away, he made the deceased daughter of the Rong Family as Empress, and specially ordered his younger brother to bury her with him in the imperial mausoleum.\n\nAfter rebirth, Mu Huai returned to the day before Rong Xi died and was able to make up his past life’s regret, saving the person in his heart.>"
}