{
	"url": "https://www.novelupdates.com/series/i-became-a-fake-villain/",
	"title": "I Became a Fake Villain - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/11/I-Became-a-Fake-Villain.jpg",
	"noveltype": "(KR)",
	"genre": "Comedy   Fantasy   Josei   Romance   Smut   ",
	"tags": "Destiny   European Ambience   Female Protagonist   R-18   Seduction   Transmigration   Villainess Noble Girls   ",
	"rating": "(3.6 / 5.0, 25 votes)",
	"author": "Han Yun-seol   한윤설   ",
	"year": "\n2020",
	"ranking": "#2000   #2010   #9992   #8803   #6410   ",
	"reviewcount": "No Reviews",
	"description": "“Last night. You wonder why we're in the same bed and what happened. Feel free to ask.​”\r\n\r\nI'm going crazy.\r\n\r\nAs if being a substitute for the villain in this devastating novel wasn’t enough, I spent the night drunk with the sub male lead, who kills none other than the villain in the original.\r\n\r\n“Did we do it?”\r\n\r\n'What.'\r\n\r\nWhat do you think men and women do when undressing in bed at night?!\r\n\r\n“I think it would be better to ask your questions more straightforwardly. Be specific about what you are talking about.”\r\n\r\n***​\r\n\r\nI must have possessed an extra in the novel.\r\n\r\nBut, why is the villain's described face the same as mine?\r\n\r\nPerhaps that was why the villain offered me as her replacement.\r\n\r\n“You should become Serrine Latni in my stead.”\r\n\r\nNow that this has happened, I thought that I could avoid getting involved with the main characters and enjoy my life happily while earning money…\r\n\r\n“You are not Serrine.”\r\n\r\nMy true identity was discovered by the sub male lead who killed the villain in the original work.\r\n\r\nThat didn't seem to be enough, so we got drunk and spent the night together.\r\n\r\nBesides, I was secretly dating the male lead while at the same time childhood friends with the female protagonist?!\r\n\r\n‘I have no intention of participating in this novel!’\r\n​\r\nSo I decided to end this relationship.\r\n\r\nEveryone let me go! I'll be quiet and disappear!>"
}