{
	"url": "https://www.novelupdates.com/series/how-to-survive-as-a-villain-on-the-verge-of-death/",
	"title": "How To Survive As a Villain on the Verge of Death - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/11/How-To-Survive-As-a-Villain-on-the-Verge-of-Death.jpeg",
	"noveltype": "(KR)",
	"genre": "Fantasy   Romance   ",
	"tags": "Aristocracy   Beautiful Female Lead   Complex Family Relationships   Engagement   European Ambience   Female Protagonist   Forced Marriage   Handsome Male Lead   Love Interest Falls in Love First   Nobles   Obsessive Love   Power Couple   Pretend Lovers   Royalty   Special Abilities   Transmigration   Transported to Another World   Villainess Noble Girls   ",
	"rating": "(4.0 / 5.0, 48 votes)",
	"author": "어연선   ",
	"year": "\n2021",
	"ranking": "#4080   #3450   #4701   #2901   #4148   ",
	"reviewcount": "6 Reviews sorted by",
	"description": "In the original novel, I possess the body of Princess Eve, the villain who was inferior towards the female protagonist and commits evil deeds.\n\nAnd the time that she possessed Eve was 44 days before the assassination on her would take place.\n\nI can’t just die in vain like this.\n\nIn order to escape her predestined death, Eve makes a deal with her fiancé the Grand Duke.\n\n“Please help me. Then I will help you with the best of my abilities.”\n\n“Then try to predict what will happen to me tonight.”\n\nWith the foresight ability of the main body, she passed the test of the Grand Duke and signed a contract with him.\n\nShe had barely escaped the crisis and managed to save her life, but the crisis was constantly coming…\n\n“Have you forgotten that you are my wife?”\n\n“I haven’t forgotten.”\n\n“It’s okay to forget. Because I’ll always remind you over and over again.”\n\nThe fiancé who was a second male lead and the mastermind to all the killings in the empire became obsessed with me,\n\n“No matter what happens, I will protect the Princess.”\n\nThen why does the good male protagonist say that he will protect me?\n\nAnd how come this world is so different from the original?>"
}