{
	"url": "https://www.novelupdates.com/series/as-the-minor-gay-rival-in-het-novels/",
	"title": "As the Minor Gay Rival in Het Novels - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2018/01/63e3b083c2e0c2d09f9c2f1744c04cb3.jpg",
	"noveltype": "(CN)",
	"genre": "Drama   Fantasy   Romance   Yaoi   ",
	"tags": "Acting   Amnesia   Ancient China   Apocalypse   Black Belly   Clever Protagonist   Comedic Undertone   Cultivation   Death of Loved Ones   Devoted Love Interests   Doting Love Interests   Episodic   First-time Interc**rse   F*llatio   Handsome Male Lead   Love Interest Falls in Love First   Male Yandere   Mob Protagonist   Modern Day   Multiple Personalities   Multiple Transported Individuals   Omegaverse   Possessive Characters   Post-apocalyptic   Power Couple   R*pe   Ruthless Protagonist   Showbiz   Siblings Not Related by Blood   Slow Romance   Straight Uke   Strong Love Interests   System Administrator   Tragic Past   Transmigration   Tsundere   World Hopping   Zombies   ",
	"rating": "(3.9 / 5.0, 456 votes)",
	"author": "XiXiLi   夕夕里   ",
	"year": "\n2016-2017",
	"ranking": "#182   #142   #631   #348   #281   ",
	"reviewcount": "74 Reviews sorted by",
	"description": "There are always four kinds of people in the traditional Mary Sue world. The Male Lead, the Mary Sue female lead, the woman who never wanted to see the female protagonist live a good life, and the infatuated man willing to destroy heaven and earth to get the female lead.\n\nHowever, with the rapid expansion of the army of rotten women, there is also a growing type of character, and that is a man who is also infatuated with the male lead… This character is referred to as the gay guy.  They share the same infatuation as the second man, also has a tragic end and works together in hindering the male and female protagonist’s love.\n\nFan Yuan has walked in every time and space playing as the gay man. He had always enjoyed it, until one day, with superb acting, he made the male lead bent... o (╯-╰) o\n\nFan Yuan (affectionate confession): “I do not want to be your brother, in fact, I have always loved you.”\n\nSomeone (fondly looking back): “Me too.”\n\nFan Yuan (⊙_⊙): “…”\n\nYou’ve got the wrong line, bro!>"
}