{
	"url": "https://www.novelupdates.com/series/the-master-became-a-wealthy-madam/",
	"title": "The Master Became a Wealthy Madam - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/12/115146s.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Drama   Fantasy   Romance   ",
	"tags": "Arrogant Characters   Beautiful Female Lead   Charismatic Protagonist   Complex Family Relationships   Confident Protagonist   Family   Fanaticism   Female Protagonist   Love Interest Falls in Love First   Nationalism   Racism   Reverse Harem   Transmigration   Wealthy Characters   ",
	"rating": "(3.9 / 5.0, 68 votes)",
	"author": "故筝   ",
	"year": "\n2020",
	"ranking": "#3802   #6151   #4261   #7720   #4482   ",
	"reviewcount": "16 Reviews sorted by",
	"description": "Gu Xueyi was born into a family of generals and was the master of the Sheng family, the one person in charge of a family of 400. But when she woke up, she had transmigrated into a novel and was the ex-wife to be of the male lead and doomed to die early.\r\n\r\nLooking at the four siblings of her husband, Gu Xueyi frowned and thought: “Back in the day, the sons of the Sheng family were able to go to battle, to become generals, to conquer the Imperial court and become officials. All of them were useful men, so why are those bigshots in the modern day so useless?”\r\nWhether her husband wants a divorce or not, first she has to teach these idiots the right way!\r\n\r\nMonths later, the missing husband returned to the Yan family.\r\n\r\nYan Weijia, who had just received the Movie Emperor award: “The person I am the most grateful for is my sister-in-law and the person I love the most is also her.”\r\nYan Weshu, a famous celebrity that had just entered a prestigious university: “The person I am the most grateful for is my sister-in-law and the person I love the most is also her.”\r\nYan Wenhong, who just won a gold medal for his country: “The person I am the most grateful for is my sister-in-law…”\r\nYan Wenbo, holding his diploma: “The person I am the most grateful to is my sister-in-law…”\r\nEven the Yan’s former enemy said in a public interview: “The woman I admire the most is Ms. Gu Xueyi.”\r\n\r\nEveryone: ???\r\nYanchao: ??? Am I green??\r\n\r\nOnly then he found out that his unruly and hateful wife had become the dream woman that everyone wanted to marry and that they were all waiting for him to divorce.>"
}