{
	"url": "https://www.novelupdates.com/series/born-to-be-rebellious-quick-transmigration/",
	"title": "Born to Be Rebellious [Quick Transmigration] - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/09/Born-to-Be-Rebellious-Quick-Transmigration.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Fantasy   Mecha   Sci-fi   Shounen Ai   Yaoi   ",
	"tags": "Apocalypse   Clever Protagonist   Cold Protagonist   Confident Protagonist   Criminals   Cunning Protagonist   Dense Protagonist   Devoted Love Interests   Doting Love Interests   Fantasy Creatures   Fearless Protagonist   Genius Protagonist   Gods   Handsome Male Lead   Human-Nonhuman Relationship   Lazy Protagonist   Love at First Sight   Love Interest Falls in Love First   Omegaverse   Orphans   Overpowered Protagonist   Past Plays a Big Role   Past Trauma   Phobias   Possessive Characters   Power Couple   Protagonist Strong from the Start   Ruthless Protagonist   Shapeshifters   Slow Romance   Smart Couple   Strong Love Interests   Survival Game   Thriller   World Hopping   Zombies   ",
	"rating": "(4.5 / 5.0, 154 votes)",
	"author": "Sang Wo   Tang Ốc   桑沃   ",
	"year": "\n2020",
	"ranking": "#424   #1734   #2090   #921   #1619   ",
	"reviewcount": "31 Reviews",
	"description": "Ge Xiu is a nefarious star criminal. After being arrested, according to the Interstellar Supreme Law, he will face two choices: either serve a sentence of 1156 years in black prison or enter countless virtual worlds and become a miserable person who is tortured and abused all his life. How much he suffers is how much his sentence can be reduced. Ge Xiu chose the second one without hesitation.\n\nSo… The trial surveillance system stared dumbfounded at the Former•Interstellar Most•Wanted•Criminal•Currently•Weak•Poor Ge Xiu in the virtual world, punching the empire, kicking the Federation, overthrowing oppression and building a new world. Then he turned his head to the camera and cried: “I’ve had a miserable life, really.” \n\n“…” The surveillance system that was about to explode of anger: “Like hell I’d believe you!”>"
}