{
	"url": "https://www.novelupdates.com/series/i-also-want-to-spiritually-cultivate-with-shizun-today/",
	"title": "I Also Want To Spiritually Cultivate With Shizun Today - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/10/I-Also-Want-To-Spiritually-Cultivate-With-Shizun-Today.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Comedy   Romance   Supernatural   Xianxia   Yaoi   ",
	"tags": "Ancient Times   Cultivation   Dao Companion   Handsome Male Lead   Manly Gay Couple   Master-Disciple Relationship   Protagonist Strong from the Start   ",
	"rating": "(4.1 / 5.0, 39 votes)",
	"author": "Chi Ling   池翎   ",
	"year": "\n2020",
	"ranking": "#2642   #3244   #6898   #4753   #4948   ",
	"reviewcount": "4 Reviews sorted by",
	"description": "Qi Shu, the eldest senior martial brother of the Kunlun Jian Sect, was an exceptionally talented, charismatic and handsome person. He’s the dream lover of all male and female cultivators in the cultivation world.\r\n\r\nHe had a secret.\r\n\r\nHe’s secretly in love with his Shizun.\r\n\r\n——Gu Hanjiang, the head cultivator of the Kunlun Jian Sect, not only had a noble and benevolent temperament since young, he was also cold and strict, but he’s greatly fond of his own eldest disciple.\r\n\r\nQi Shu both valued his master and his teachings, so he hid his love for him for a long time.\r\n\r\nUntil one day, he learnt a secret.\r\n\r\nHis master was a rare human cauldron. To pass through tribulation and ascend, he must dual cultivate with someone, otherwise it’d rebound to him and he’ll qi deviate.\r\n\r\nWhen Qi Shu returned to the sect, he found that his master had really encountered a bottleneck in his cultivation and his cultivation was severely damaged.\r\n\r\nWhen he saw his master’s pale and sickly handsome face, Qi Shu felt sorry for him: Shizun, this disciple can help you.\r\n\r\nGu Hanjiang: …Really?\r\n\r\nQi Shu: This disciple does what he says!\r\n\r\nOnly later did Qi Shu become aware that in the first place, human cauldrons couldn’t only be the one in the bottom.\r\n\r\nThat’s not what it says in the book!!>"
}