{
	"url": "https://www.novelupdates.com/series/holding-you-into-my-arms/",
	"title": "Holding You Into My Arms - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/12/Holding-you-into-my-arms.jpg",
	"noveltype": "(CN)",
	"genre": "Josei   Romance   School Life   Slice of Life   ",
	"tags": "Beautiful Female Lead   Early Romance   Female Protagonist   Handsome Male Lead   Modern Day   ",
	"rating": "(4.3 / 5.0, 20 votes)",
	"author": "游喜   ",
	"year": "\n2020",
	"ranking": "#2000   #2000   #8856   #9320   #9366   ",
	"reviewcount": "3 Reviews sorted by",
	"description": "Shen Zhan, a talented young man of Huaqing University, has a face of an enchanting immortal and possessed countless of admirers.\n\nHe is indifferent and lazy, looking at everyone as if they aren’t worthy of his sight.\n\nAccording to his closest classmates, Shen Zhan, with an IQ of just less than two hundred, hates s*upid women the most.\n\nLin Jiayin from the dance department has a fair complexion and sweet looks.\n\nShe won the Taoli Cup Gold Award.\n\nShe was booked by the chief of the National Opera.\n\nShe is naturally dull and a little s*upid, and she often makes people doubt life.\n\nBoth of them were entitled as the CP in which makes the school proud, but will never get together.\n\nUntil one day, someone saw Shen Zhan taking Lin Jiayin’s hand and walked into Haagen-Dazs to buy a limited cherry blossom ice cream to feed her personally.\n\nTaking pictures as evidences.\n\nThe roommate of Lin Jiayin couldn’t help but ask: “I heard that Shen Zhan is your boyfriend?”\n\nLin Jiayin, who had just thrown Shen Zhan under the bus, denied it nervously: “No, don’t talk nonsense!”\n\nThe next second, Shen Zhan opened the classroom door and walked over infront of her: “Mom told you to go home for dinner tonight.”\n\n“…”\n\nRoommate, who Lin Jiayin was talking to: Mom? Are they married?!\n\n——-\n\nLin Jiayin rolled “da da da da da da da da”.\n\nShen Zhan smiled: “…I didn’t tell you to roll into my arms.”\n\nLin Jiayin hugged his waist, raised her head and said aggrieved: “Who will love you after I roll.”\n\nAlthough sometimes she is s*upid and she seems to have no brain, I have to admit that I love her. ——Shen Zhan>"
}