{
	"url": "https://www.novelupdates.com/series/madams-identities-shocks-the-entire-city-again/",
	"title": "Madam’s Identities Shocks the Entire City Again - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/03/Madams-Identities-Shocks-the-Entire-City-Again.jpg",
	"noveltype": "(CN)",
	"genre": "Drama   Romance   School Life   ",
	"tags": "Beautiful Female Lead   Celebrities   Cold Protagonist   Female Protagonist   Genius Protagonist   Hackers   Handsome Male Lead   Hiding True Identity   Medical Knowledge   Modern Day   Secretive Protagonist   ",
	"rating": "(3.0 / 5.0, 15 votes)",
	"author": "Brother Ling   ",
	"year": "\nN/A",
	"ranking": "#2000   #2000   #8393   #13805   #9837   ",
	"reviewcount": "8 Reviews sorted by",
	"description": "Qiao Nian lived in the Qiao family’s house for 18 years before her biological parents found her. Suddenly, all the wealthy families in the city knew that the Qiao family had a fake daughter! \r\n\r\nA true daughter of an affluent family would be talented, gentle, and kind. \r\n\r\nA fake daughter would not be able to pick up any skills and accomplish nothing. \r\n\r\nEveryone wanted to see how miserable she would become when she went back to her ravine after being kicked out of a rich family! \r\n\r\nQiao Nian also thought that her biological parents were poor teachers from Luohe County. \r\n\r\nWho knew that her brother drove a Phaeton that was worth three hundred thousand yuan! \r\n\r\nHer biological father was also a professor who taught at Tsinghua University! \r\n\r\nThe big boss of the family of scums became a bootlicker and bowed in front of her grandpa… \r\n\r\nQiao Nian was dumbfounded. \r\n\r\nErm… this wasn’t the same as saying yes! \r\n\r\nAfter being freed from the family of scums, Qiao Nian was able to be herself. \r\n\r\nShe was the top student in the college entrance examination, a live broadcast star and the heir of an invaluable cultural heritage… Her identities were revealed and when she started to appear on the hot searches in the city, the family of scums turned green. \r\n\r\nThe anti-fans mocked: What’s the point of trying to fake an image? Aren’t you just sticking to my brother everyday? \r\n\r\nQiao Nian responded: I’m sorry but I already have a match. \r\n\r\nTop Brother: @Qiao Nian. Let me introduce her to everyone. This is my sister. \r\n\r\nWealthy Grandpa: My dear granddaughter, why are you working so hard? If you want a bicycle, grandpa will buy it for you! \r\n\r\nThe rich and powerful in Beijing spread a rumor that Master Wang was hiding a wife in his luxurious house. No matter how much people tried to persuade him, he never took her out to meet anyone. If he were asked, he would say the same sentence. “My wife is from the countryside and she is shy.” \r\n\r\nThat was until one day when someone saw the noble and cold Master Wang holding a girl’s slender waist while hiding in a corner of a wall and muttering with red eyes. “Baby, when will you give me a title?” \r\n\r\n[Fake daughter who is from a truly wealthy family] + [Two big bosses]>"
}