{
	"url": "https://www.novelupdates.com/series/wasnt-this-supposed-to-be-a-strategy-game/",
	"title": "Wasn’t This Supposed To Be a Strategy Game? - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/02/Wasnt-This-Supposed-To-Be-a-Strategy-Game.jpg",
	"noveltype": "(KR)",
	"genre": "Fantasy   Romance   ",
	"tags": "Aristocracy   Beautiful Female Lead   Empires   European Ambience   Female Protagonist   Handsome Male Lead   Knights   Love Interest Falls in Love First   Nobles   Obsessive Love   Priestesses   Priests   Reincarnated in a Game World   Strategist   ",
	"rating": "(3.4 / 5.0, 10 votes)",
	"author": "Yoon Jeomrye   윤점례   ",
	"year": "\n2021",
	"ranking": "#2000   #2000   #11201   #11908   #9828   ",
	"reviewcount": "No Reviews",
	"description": "I possessed a character in a notorious game with a 0% clear rate, 'The Last Kingmaker.'\r\n\r\nIn addition, the character I possessed is a hidden character, a low-level priestess!\r\n\r\nThere's only one way to escape.\r\n\r\nThat is to clear the game.\r\n\r\nTo do this, I must ensure that the 3rd prince, who is extremely likely to become a tyrant, ascends as an emperor and bring peace to the nation.\r\n\r\nIt's a terrible situation, but I have no choice but to accept the game with tears in my eyes...\r\n\r\n'Then, I will trust you from now on.'\r\n\r\nThe 3rd prince with a 90% chance of becoming a tyrant,\r\n\r\n'You'd better give up on that plan.'\r\n\r\nThe chancellor who was called a young genius and was known for his harsh words,\r\n\r\n'Priestess, did you use me?'\r\n\r\nThe cunning grand duke,\r\n\r\n'Strangely, I feel something special about the priestess.'\r\n\r\nThe holy knight who is good at spitting with a smiling face,\r\n\r\n'You promised me you'd come back.'\r\n\r\nEven the archmage who will eventually explode and destroy the empire said that to her.\r\n\r\nWhy do I feel like the characters who should lead the empire to peace are obsessed with me?\r\n\r\nI'm sorry, but wasn't this supposed to be a strategy game?\r\n>"
}