{
	"url": "https://www.novelupdates.com/series/the-invincible-big-shot-is-about-to-be-born/",
	"title": "The Invincible Big Shot Is About To Be Born - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/04/The-Invincible-Big-Shot-Is-About-To-Be-Born_1618904787.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Xianxia   ",
	"tags": "Alchemy   Arrogant Characters   Beast Companions   Calm Protagonist   Cultivation   Immortals   Male Protagonist   Misunderstandings   Multiple Realms   Overpowered Protagonist   Phoenixes   Protagonist Strong from the Start   Strength-based Social Hierarchy   Strong to Stronger   Underestimated Protagonist   Unique Cultivation Technique   ",
	"rating": "(3.3 / 5.0, 47 votes)",
	"author": "Shen Jian   神见   ",
	"year": "\n2020",
	"ranking": "#6970   #4775   #3248   #8665   #6897   ",
	"reviewcount": "9 Reviews sorted by",
	"description": "Lu Yiping was an ancient monk who witnessed the fall of countless powerful gods in the battle of the gods.\n\nSince then, he has been living in seclusion in the ancient forest, practicing day and night, and vowing that he will not come out when he is not strong enough to fight the Great Tribulation of Heaven and Earth.\n\nOne era after another has passed.\n\nA little snake next to him became the ancestor of the dragon clan.\n\nA little girl he adopted became an invincible empress.\n\nOne of the swordsmen he pointed out became a sword god who was famous forever.\n\nAn old tree he planted at will became the patron saint of the strongest kingdom in history.\n\nThe years have changed the vicissitudes of life, one after another strong rises, and generations of strong grow old and perish.\n\nLu Yiping has been practicing his longevity arts in the deep mountains. Occasionally, he played the guqin, practiced painting, practiced swordsmanship, and looked at the various magical skills and great insights left by the countless gods who perished that year.\n\nFinally, he had cultivated the Longevity Art to the last level, feeling that his strength could fight against the Great Tribulation of Heaven and Earth, and then he walked out of the Sacred Forest.>"
}