{
	"url": "https://www.novelupdates.com/series/i-became-the-villainesss-brother/",
	"title": "I Became the Villainess’s Brother - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/01/4fa5cuspixwjkutbkzghlx7u89hv_wt0_j6_sc_g6av.jpg",
	"noveltype": "(JP)",
	"genre": "Comedy   Fantasy   Romance   Shoujo   ",
	"tags": "Age Progression   Broken Engagement   Cheats   Fantasy World   Fat Protagonist   Fat to Fit   Magic   Male Protagonist   Nobles   Otome Game   Reincarnated in a Game World   Sister Complex   Villainess Noble Girls   ",
	"rating": "(3.9 / 5.0, 89 votes)",
	"author": "Shimozuki Rei   霜月零   ",
	"year": "\n2016",
	"ranking": "#2000   #4135   #3778   #3332   #1988   ",
	"reviewcount": "4 Reviews sorted by",
	"description": "Having wandered the borders of life and death because my younger sister lost control of her magic, I remembered that this world was the otome game 「Sparkle like a Jewel」. And I, Langlease Jackberry, am the villainess’ brother.\n\nI want to evade the destiny of destruction that I remembered. I’ll watch over my cute younger sister so that she’ll become an ordinary girl instead of a villainess, and at the very least avert her death if ruin so unluckily falls.\n\nThe BAD END routes for the villainess are split into three general types.\n\n1) Destruction Route\n\nAs a villainess, my sister brought about the Prince’s displeasure when incidents of her bullying the Heroine came to light.\n\nWith his impropriety exposed and his peerage revoked, Father was exiled out of the country.\n\n2) Suicide Route\n\nMy sister, who had truly loved the Prince, shocked that the Prince had announced the cancellation of their engagement at the party, committed suicide.\n\nIn this route, it is only my sister that dies, and my family and I are not condemned.\n\n3) Jewel Route\n\nThe END that could be said to be the centerpiece of the game. My sister, having displeased the Prince, was sentenced to be turned to a jewel with magic. She had been turned into a jewel the same color as her eyes. She was shattered to pieces in front of everyone. With pink jewels dancing in the midst, the still of the smiling Prince and Heroine was beautiful.\n\nHowever, it was my sister’s life that was smashed.\n\nI will absolutely never permit that kind of future for her.\n\nPresently, perhaps owing to her young age, her personality did not resemble in the slightest that of the template domineering, ill-tempered villainess in the game.\n\nShe was kind and with a deep compassion, to the point where she was loved completely by the servants. Naturally I also thought of her as someone precious.\n\nThough I want to avoid the BAD END completely, I’ll work so that I can avoid at the worst the second and third routes where my sister dies and provide a viable lifestyle even after ruin.\n\nTo continue living with my sister and my family.>"
}