{
	"url": "https://www.novelupdates.com/series/we-monsters-are-not-allowed-to-be-single/",
	"title": "We Monsters Are Not Allowed to Be Single - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/07/We-Monsters-Are-Not-Allowed-to-Be-Single.png",
	"noveltype": "(CN)",
	"genre": "Comedy   Fantasy   Mystery   Romance   Supernatural   Yaoi   ",
	"tags": "Cute Protagonist   Detectives   Handsome Male Lead   Hiding True Abilities   Hiding True Identity   Misunderstandings   Modern Day   Monster Society   Multiple POV   Mystery Solving   Mythology   Pretend Lovers   ",
	"rating": "(4.2 / 5.0, 71 votes)",
	"author": "Xiu Sheng   绣生   ",
	"year": "\n2020",
	"ranking": "#3314   #6197   #4388   #2942   #3732   ",
	"reviewcount": "6 Reviews sorted by",
	"description": "After the 108th Monster Population Census, the Monster Family Planning Office issued a new regulation: Given the rising single monster population, which poses a threat to the society and undermines the harmony between humans and monsters, Monster Family Planning Office decided that from this day onward it’s forbidden to be a single monster of marriageable age.\n\nAs a result, Ying Qiao and Tao Tie, two ancient monsters who had remained single ever since their creation, were forced to go on a blind date.\n\nTo discourage their date, they both decided to lie about what they truly were.\n\nYing Qiao: “I am an orphan snake monster with no house and car under my name. My monthly salary is three thousand yuan. Can’t afford social insurance.”\n\nTao Tie: “I have a temporary job and eight brothers living off my eighty yuan daily salary.”\n\nThey both agreed they were not a good fit for each other. But under pressure, they agreed to put on a show to set a good example for the benefit of the new regulation. They planned to be a fake couple.\n\nA foreign monster entered their nation illegally and committed many crimes. Jiang City Monster Bureau was put on high alert, and elite members were deployed to hunt for the suspect.\n\nAfter having his dragon scales polished, Ying Qiao spread his wings and joined the hunt.\n\nPutting his brother into his pocket, Tao Tie went out to join the hunt too.\n\nIn the sky above Jiang City, they had a chance encounter.\n\nCurling his tail to hide his expensive jade tail ring, Ying Qiao said.” I am on a business trip.”\n\nPutting his hand behind his back to hide his wristwatch worth a million, Tao Tie said.” What a coincidence, so am I.”\n\nKnowing that their lies were exposed, they stared at each other long and hard. They both said, “We will settle accounts after getting back.”>"
}