{
	"url": "https://www.novelupdates.com/series/i-built-a-territory-in-ancient-times/",
	"title": "I Built a Territory in Ancient Times - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/10/I-Built-a-Territory-in-Ancient-Times.jpeg",
	"noveltype": "(CN)",
	"genre": "Fantasy   Historical   Mature   Shounen Ai   Slice of Life   ",
	"tags": "Ancient Times   Animal Rearing   Brotherhood   Calm Protagonist   Clever Protagonist   Cold Love Interests   Dense Protagonist   Familial Love   Farming   Generals   Handsome Male Lead   Heartwarming   Kingdom Building   Love Interest Falls in Love First   Loyal Subordinates   Military   Modern Knowledge   Royalty   Slow Romance   Strong Love Interests   Transmigration   Wars   ",
	"rating": "(4.1 / 5.0, 39 votes)",
	"author": "木瓜乙   ",
	"year": "\n2020",
	"ranking": "#1653   #1260   #5285   #2111   #5159   ",
	"reviewcount": "6 Reviews sorted by",
	"description": "The youngest, silly fourteenth son of the Yan Emperor had reached the age where he should be given a separated territory now. He rejected the wealthy land, neighbouring the capital city, and instead chose the wildest land in the western region— Liangcheng. Everyone shook their heads and sighed. A fool is indeed a fool. If you go to Liangcheng, you will be killed by barbarians in less than three to five years.\n\nOne year later, the watermelon presented to the Emperor as the tribute from Liangcheng in the west was sweet and crispy. There was no one in the palace who did not love it.\n\nTwo years later, Liangcheng presented corn as a tribute to the Emperor. The yield was high, and the taste was good. No one in the country could resist liking it.\n\nThree years later, Liangcheng defeated the barbarians and presented their prisoners in front of the imperial court. The people of Yan were excited and their morale was greatly boosted.\n\nFour years later… Everyone said that the fourteenth prince Mingyu was a fool, while the little fatty Yu, who transmigrated with the golden finger, chuckled. Let’s see how you guys look at this fool build his own territory, then.>"
}