{
	"url": "https://www.novelupdates.com/series/reincarnated-after-200-years-the-six-elves-who-once-served-me-are-now-at-the-center-of-the-world/",
	"title": "Reincarnated After 200 Years, the Six Elves Who Once Served Me Are Now at the Center of the World - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/10/Reincarnated-after-years-the-six-elves-who-once-served-me-are-now-at-the-center-of-the-world.jpg",
	"noveltype": "(JP)",
	"genre": "Adventure   Comedy   Fantasy   Harem   Romance   Slice of Life   ",
	"tags": "Depictions of Cruelty   Elves   Fantasy World   Magic   Male Protagonist   Reincarnation   S*aves   ",
	"rating": "(3.7 / 5.0, 10 votes)",
	"author": "Hatanrou   破綻郎   ",
	"year": "\n2020",
	"ranking": "#2000   #2000   #9962   #4681   #9433   ",
	"reviewcount": "1 Review sorted by",
	"description": "There was elf slavery in the country where I was born and raised.\r\n\r\nTheir treatment is horrible. I want to change this thinking…\r\n\r\nFicelle was a young genius magician who made a fortune by developing a new recovery medicine. One day, he decided to buy some elf slaves by chance, but after interacting with them, he realised that something was wrong with his country’s society. He became determined to revolutionize it for the sake of the elves’ freedom.\r\n\r\nHowever, in the middle of his plans, he collapsed from overwork and, on his deathbed, realised he couldn’t change the world himself and cast an incomplete reincarnation magic, hoping to some day return and see the world changed by his six disciples.\r\n\r\nHe then woke up 200 years after his death, and at the heart of this new world were the six elves who served him long ago who have become great men and women and founded a new country. But even after 200 years, they still yearn for Ficelle.\r\n\r\nFrom here begins a slow life that transcends race and status, of Ficelle, who was reborn with no magical talent or sword skill in his second life, and the talented elves who have become the center of the world.>"
}