{
	"url": "https://www.novelupdates.com/series/my-sisters-are-strange/",
	"title": "My Sisters are Strange - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/08/My-Sisters-are-Strange.jpg",
	"noveltype": "(KR)",
	"genre": "Fantasy   Romance   ",
	"tags": "Aristocracy   Beautiful Female Lead   Cautious Protagonist   Complex Family Relationships   Cute Protagonist   Demons   Devoted Love Interests   Doting Older Siblings   Empires   Familial Love   Fantasy World   Female Protagonist   Hiding True Abilities   Misunderstandings   Nobles   Overprotective Siblings   Precognition   Siblings   ",
	"rating": "(3.6 / 5.0, 13 votes)",
	"author": "Suncy   썬씨   ",
	"year": "\n2021",
	"ranking": "#1604   #1685   #11498   #3138   #10304   ",
	"reviewcount": "No Reviews",
	"description": "For the sisters who are perfect from head to toe, the only blemish is me.\r\nSo I am used to a life of being ignored and humiliated by my sisters…\r\n\r\nOne day, my sisters became strange.\r\n\r\nRunning late at night in their pajamas, hugging me, crying, and trying to stay with me.\r\nWorrying about my health.\r\nWith bright smiles and worried gazes towards me, it’s so unfamiliar.\r\nThey are not the sisters I know.\r\n\r\n“From now on, only trust your big sisters. Let's live happily with big sisters forever.'\r\n\r\nThere's no way my sisters would say things like this to me...?\r\n...As expected, my sisters are strange!\r\n\r\n***\r\n\r\nIn the temple where I run away from my strange sisters, I meet a man who seems familiar even though it’s the first time we meet.\r\nHe is my first friend, a precious person, and a gentleman that I fall in love with.\r\nI hope my heart will connect with him.\r\nUntil the man has some of his parents’ mementos.\r\n\r\n'Daisy, unfortunately, I've never said we met for the first time.'\r\n\r\nHe looks at me who is confused and whispers in my ears.\r\n\r\n'You're afraid you won't remember. Don't worry too much.'\r\n\r\nA very sweet and calm voice.\r\n\r\n“I am confident in waiting.”\r\n\r\nAnd it’s a terribly kind, distant answer.>"
}