{
	"url": "https://www.novelupdates.com/series/i-became-cinderellas-vicious-stepsister/",
	"title": "I Became Cinderella’s Vicious Stepsister - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/07/unnamed-1.jpg",
	"noveltype": "(CN)",
	"genre": "Adventure   Comedy   Drama   Fantasy   Historical   Josei   Romance   School Life   Tragedy   ",
	"tags": "Beautiful Female Lead   Character Growth   Cunning Protagonist   Devoted Love Interests   Dishonest Protagonist   Evil Protagonist   Female Protagonist   God-human Relationship   Gods   Handsome Male Lead   Marriage   Nobles   R*pe   Schemes And Conspiracies   Slow Romance   Time Travel   Transmigration   Transported to Another World   Villainess Noble Girls   ",
	"rating": "(4.2 / 5.0, 57 votes)",
	"author": "白日上楼   ",
	"year": "\n2019",
	"ranking": "#2000   #2000   #5086   #10065   #4469   ",
	"reviewcount": "13 Reviews sorted by",
	"description": "Liu Yu woke up and discovered that she had transmigrated into the novel she read before she went to sleep.\n\nShe became the vicious stepsister of Cinderella, the protagonist. Early this morning, she had let her cat bite her sister’s Eurasian collared dove. At night, she had ordered someone to gouge out the eyes of a helpless young man. The young man turned out to be the reincarnation of the God of Light!\n\nHer future was bleak, her blood will be sucked dry, and then she will be hung. Liu Yu weighed her options:\n\n1. The Duke of Dark Night was already smitten by the beautiful and kind Cinderella.\n\n2. Prince Carlos has been searching all over the world for the owner of the crystal shoe. She should give up on him.\n\n3. Only the God of Light had yet to fall for her younger sister’s charms.\n\nLiu Yu looked at the young man who just had his eyes gouged out because of the original owner of the body. He had lost his memory and was currently in a dire strait. Liu Yu used a high-pitched voice and said, “My God! How could someone do something so vicious to you?”\n\nThe helpless young man: “Are you the one who saved me?”\n\n“Yes.”\n\n——————————\n\nYoung Gaia:\n\nWhen I fell in love with her, I truly thought she was the kindest, gentlest, and purest girl in the world.\n\nThe God of Light, Gaia:\n\nI have never seen a woman in this world that could be more vicious, more hypocritical, and more absurd than Bellia. She could tell me that she loves me while she dug my eyes out. I wanted to kill her but couldn’t do it in the end.\n\nThis is a love story that begins with deception, and then love, followed by the woman chasing the man, and then the man chasing after his wife.>"
}