{
	"url": "https://www.novelupdates.com/series/genius-maiden-transmigrates-the-empress-of-weapons/",
	"title": "Genius Maiden Transmigrates: The Empress of Weapons - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/06/genius.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Historical   Josei   Romance   ",
	"tags": "Ancient China   Beautiful Female Lead   Female Protagonist   Handsome Male Lead   Royalty   Transmigration   ",
	"rating": "(3.1 / 5.0, 9 votes)",
	"author": "度寒   ",
	"year": "\nN/A",
	"ranking": "#2000   #2000   #12045   #9499   #10530   ",
	"reviewcount": "No Reviews",
	"description": "The first time that she saw him, she was crouched down on the ground and drawing with charcoal. Her face was covered with charcoal as she blew him, a Wangye, away with an explosion. The next time, she demolished his residence, destroyed his bedroom, and was prepared to attack him, giving him a headache.\n\nShe takes his Chiyou Sword as her experimental subject and twists it with a few moves, making him want to spit out blood. She turns his name into fireworks that light up the night sky on New Year’s Eve so that he is able to ascend to the throne as a divine oracle.\n\nShe is disobedient. What’s so great about the Emperor? If I want to, he won’t be able to sit on his throne! She is strong and overbearing: “Xuanyuan Yao, you better love only me. If you dare to have three palaces, six courtyards, and seventy-two consorts, I will use explosives to send you to heaven!”\n\nShe speaks arrogantly and wildly: “If you dare to bully someone whom I want to protect, then you are looking for trouble!”\n\nIt’s unknown when the feelings started, but they become deeper and deeper.\n\nJust as their hearts became closer, her soul unexpectedly returns to modern times. His doting and love become a distant dream.\n\nAfter waking up, she cried and cried. His figure was inside and outside her dreams.\n\nIn order to forget her, he hands the country over to others and leads his troops in battle to seek death…>"
}