{
	"url": "https://www.novelupdates.com/series/can-i-brag-about-my-very-devoted-wife-to-you/",
	"title": "Can I Brag About My Very Devoted Wife to You? - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/02/Can-I-brag-about-my-very-devoted-wife-to-you.jpg",
	"noveltype": "(JP)",
	"genre": "Comedy   Romance   School Life   Slice of Life   ",
	"tags": "Adapted to Manga   Beautiful Female Lead   Cohabitation   Couple Growth   Cute Story   Dense Protagonist   Devoted Love Interests   Heartwarming   Inferiority Complex   Male Protagonist   Marriage   Modern Day   Past Trauma   Stalkers   ",
	"rating": "(3.9 / 5.0, 77 votes)",
	"author": "Ononata Manimani   斧名田マニマニ   ",
	"year": "\n2020",
	"ranking": "#1820   #2000   #4249   #2135   #4541   ",
	"reviewcount": "5 Reviews sorted by",
	"description": "“Shinyama Minato-kun...! Will you make me your bride, please?”\r\n\r\nHanae Riko, the most beautiful girl in the school, proposed to me, and before I knew any better, my newlywed life had already begun.\r\n\r\nMy wife was so cute as she always happily follows me around every day and doesn't want to leave my side even for a moment.\r\nShe always does all the cleaning, laundry, cooking, sewing, and other household chores like a pro, and her skills are flawless.\r\nIn addition, she was extremely devoted to me.\r\n\r\n“I've made a fortune in investments so that Minato-kun can play and live for the rest of his life. Use it as you like!”\r\n\r\nThis kind of overzealous service regularly occurred.\r\n\r\nAnd I couldn’t help but think it's adorable how she wagged her invisible tail so wildly whenever I gave her a single word of praise.\r\nYes, in front of me, Riko was like a small dog loving its owner too much.\r\n\r\nBut don't be conceited.\r\nThis was a contract marriage.\r\nRiko was not in love with me.\r\n\r\n- When I had finally asked her why she was still so devoted to me despite being under contract, she puffed out her cheeks and responded.\r\n\r\n'Minato-kun, you're too cautious about the proposal…”\r\n\r\nEh... so it’s fine for us to get married under contract...?\r\n\r\nThis was a love story that started with a marriage at day zero and was just a happy, one-sided love story.>"
}