{
	"url": "https://www.novelupdates.com/series/i-will-disappear-grand-duke/",
	"title": "I Will Disappear, Grand Duke - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/08/I-will-disappear-Grand-Duke.jpeg",
	"noveltype": "(KR)",
	"genre": "Drama   Fantasy   Romance   Shoujo   Tragedy   ",
	"tags": "Abusive Characters   Aristocracy   Beautiful Female Lead   Calm Protagonist   Cold Love Interests   Confinement   Depression   European Ambience   Female Protagonist   First Love   Forced Marriage   Handsome Male Lead   Hated Protagonist   Male Yandere   Marriage   Misunderstandings   Nobles   Obsessive Love   Possessive Characters   Priests   Protagonist Falls in Love First   Royalty   Schemes And Conspiracies   Stockholm Syndrome   Unrequited Love   ",
	"rating": "(3.8 / 5.0, 134 votes)",
	"author": "Grape Floor   포도마루   ",
	"year": "\n2021",
	"ranking": "#4080   #1787   #2484   #1764   #2248   ",
	"reviewcount": "43 Reviews sorted by",
	"description": "Fernan Caesar, the ruler of the North who came back from the war. \n\nThe man, who was perfect in everything, was the only good memory of Julia’s unhappy childhood. \n\nWhen she was told that he was going to be her husband, Julia believed in the existence of God for the first time.\n\nBut…\n\n“If there’s anything you want, feel free to do it. It doesn’t matter whether you remodel the castle, buy jewelry, or throw a party.” \n\n“…….” \n\n“But I don’t want to see you in the morning, so refrain from doing that.” \n\nThe gentleman of her memory was no more. \n\nThere was only a cold man standing there who did not have a trace of affection or warmth.\n\n“Your heart is of no use to me.” \n\nBut loving him to the end was Julia’s biggest mistake. \n\n****\n\nStanding at the edge of the cliff, Julia slowly carved her husband’s once-worldly face into her eyes. \n\nIf not now, she would never be able to escape it forever. She would come to love him again. \n\nShe didn’t want to be bound to him any longer.\n\n“Julia!” \n\nLooking at her desperate husband, Julia threw herself down the cliff.>"
}