{
	"url": "https://www.novelupdates.com/series/i-was-forced-by-the-saintess-to-marry-the-ugly-god/",
	"title": "I Was Forced by the Saintess to Marry the Ugly God - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/04/I-Was-Forced-by-the-Saintess-to-Marry-the-Ugly-God.jpg",
	"noveltype": "(JP)",
	"genre": "Fantasy   Romance   Shoujo   Supernatural   ",
	"tags": "Abandoned Children   Absent Parents   Abusive Characters   Appearance Changes   Arrogant Characters   Broken Engagement   Charismatic Protagonist   Doting Love Interests   Evil Gods   Fallen Nobility   Female Protagonist   Forced Marriage   God-human Relationship   Gods   Handsome Male Lead   Hard-Working Protagonist   Hated Protagonist   Heartwarming   Hot-blooded Protagonist   Human-Nonhuman Relationship   Introverted Protagonist   Jealousy   Kind Love Interests   Love Interest Falls in Love First   Manipulative Characters   Marriage   Mob Protagonist   Monsters   Multiple POV   Nobles   Older Love Interests   Possessive Characters   Proactive Protagonist   Saints   Schemes And Conspiracies   Secret Identity   Selfless Protagonist   Tomboyish Female Lead   Tsundere   Unlucky Protagonist   ",
	"rating": "(4.2 / 5.0, 52 votes)",
	"author": "村川咲（赤村咲）   ",
	"year": "\n2020",
	"ranking": "#5262   #6216   #2502   #7851   #4317   ",
	"reviewcount": "6 Reviews sorted by",
	"description": "~ The Kami-sama that everyone mocked was, in fact, the Supreme God with peerless beauty ~\n\n“I’m sorry, Eleanor. This doesn’t mean I have any ill will against you.”\n\nMy childhood friend — the Saintess Amalda, forced me to marry the so-called “Incompetent God”, who was a very ugly Kami-sama.\n\nAnd yet, Amalda herself agreed anew to marry the Supreme God, and was full of happiness.\n\nOn the other hand, my previous engagement got broken, and I was driven out to the corner of the shrine; I was in a difficult position as I had to accompany the ugly, incompetent god while living inconspicuously.\n\n… That’s how it was supposed to be, but this deity was not “incompetent” at all? Besides, I don’t know why, but the other deities seemed to revere this Kami-sama, though…? \n>"
}