{
	"url": "https://www.novelupdates.com/series/an-s-ranked-partys-burden-tamer-i-awoke-my-true-power-by-having-my-familiar-killed-the-exiled-tamer-is-actually-the-only-necromancer-in-the-world-unknowingly-becoming-the-strongest-while-e/",
	"title": "An S-ranked Party’s Burden Tamer, I Awoke My True Power by Having My Familiar Killed ~The Exiled Tamer is Actually the Only Necromancer in the World. Unknowingly Becoming the Strongest While Enjoying this Excess Power~ - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/04/An-Sranked-Partys-Burden-Tamer-I-Awoke-My-True-Power-by-Having-My-Familiar-Killed-The-Exiled-Tamer-is-Actually-the-Only-Necromancer-in-the-W.jpg",
	"noveltype": "(JP)",
	"genre": "Adventure   Fantasy   Romance   Shounen   ",
	"tags": "Ability Steal   Adapted to Manga   Adventurers   Betrayal   Dragons   Familiars   Friends Become Enemies   Ghosts   Guilds   Hidden Abilities   Male Protagonist   Monster Tamer   Necromancer   Skill Assimilation   Sword And Magic   Vampires   Weak to Strong   ",
	"rating": "(3.5 / 5.0, 63 votes)",
	"author": "Skyfarm   すかいふぁーむ   ",
	"year": "\n2020",
	"ranking": "#6970   #2000   #3752   #3393   #4478   ",
	"reviewcount": "8 Reviews sorted by",
	"description": "Recon, mapping, carrying baggage, cooking, keeping watch, taking blows… even while doing all these things, the tamer, Randall, is called a burden and useless by his party members.\r\n\r\nRandall belongs to an S-ranked party, the strongest and most well-known in the land.\r\n\r\nExcellent at both attacking and defending, while also guiding the party as its charismatic leader, the swordsman Feydeau.\r\n\r\nThe genius magician who graduated top of her class from the greatest magic academy in the country, Mayle.\r\n\r\nAlso known as the country’s shield, the former knight leader, Head Knight Loig.\r\n\r\nA famous head priest while also being the youngest saint of miracles, Quella.\r\n\r\nShowing extraordinary drive and teamwork while surpassing their original capabilities, they immediately became some of the most famous names in the country, expected as the stars of the guild to continue their heroic actions.\r\n\r\nOn the other hand, Randall was ridiculed as a burden who was only in the party because he was Feydeau’s childhood friend. The party’s dissatisfaction was all focused on Randall.\r\n\r\nBut the abnormal tamer named Randall is actually gaining influence around the world…?\r\n\r\nUnappreciated by his fellow party members, scapegoated by them and pushed away, the story of revenge as he becomes the strongest necromancer and unlocks his true power.>"
}