{
	"url": "https://www.novelupdates.com/series/rebirth-of-the-tyrants-pet-regent-prince-is-too-fierce/",
	"title": "Rebirth of the Tyrant’s Pet: Regent Prince is too Fierce - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2018/03/Rebirth-of-the-Tyrant.jpg",
	"noveltype": "(CN)",
	"genre": "Drama   Fantasy   Psychological   Romance   ",
	"tags": "Adapted to Manhua   Age Progression   Age Regression   Ancient China   Beautiful Female Lead   Carefree Protagonist   Charming Protagonist   Clever Protagonist   Empires   Female Protagonist   Handsome Male Lead   Love Interest Falls in Love First   Male Yandere   Modern Knowledge   Multiple POV   Obsessive Love   Possessive Characters   Power Struggle   Protagonist Strong from the Start   Reincarnation   Reverse Harem   Royalty   Sadistic Characters   Schemes And Conspiracies   Second Chance   Siblings Not Related by Blood   Smart Couple   Strategist   Strong to Stronger   Transmigration   ",
	"rating": "(4.0 / 5.0, 331 votes)",
	"author": "Fēng Yǔ Zìrán   Wind & Nature   风与自然   ",
	"year": "\n2017",
	"ranking": "#3314   #2756   #408   #1163   #555   ",
	"reviewcount": "72 Reviews sorted by",
	"description": "The servant looked at the grieving princess. 'Your Highness, the Regent Prince sent your scholar fiancé to the Western Butcher's daughter!' \n\nThe princess gritted her teeth, speaking to her servant that it matters not as she has other suitors in line. Many days later, much to her dismay, the servant ran in a hurry. 'Your Highness, the Regent Prince expressed his intention of becoming your suitor! All other men in line were sold to Gou Lan Red District!'\n\nThe princess was distressed. She said to her servant it matters not. She'll soon be married to Prince Fuma. Then the uneventful came. The servant once more ran to her, almost tripping in the process. 'Your Highness, Prince Fuma was imprisoned at home! Meanwhile, there's a red sedan chair waiting at your residence for your marriage! It was led by the Regent Prince!\n\nThe princess was stunned. For a day such as this to come, it seemed impossible. This nothing but a sad story of a female boss crossing back in time to hold the thick thighs of the big boss. But while raising him, she was eaten in the process.>"
}