{
	"url": "https://www.novelupdates.com/series/the-most-shining-little-chicken-in-the-wolf-palace/",
	"title": "The Most Shining Little Chicken in the Wolf Palace - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/08/The-Most-Shining-Little-Chicken-in-the-Wolf-Palace.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Fantasy   Romance   Slice of Life   Yaoi   ",
	"tags": "Animal Characteristics   Cute Protagonist   Cute Story   Dense Protagonist   Doting Love Interests   Family Conflict   Friendship   Hated Protagonist   Honest Protagonist   Love Interest Falls in Love First   Non-humanoid Protagonist   Shy Characters   Weak to Strong   ",
	"rating": "(4.4 / 5.0, 53 votes)",
	"author": "Zi Jin   紫矜   ",
	"year": "\n2019",
	"ranking": "#1481   #1506   #4725   #1592   #3821   ",
	"reviewcount": "5 Reviews sorted by",
	"description": "When the bird race wanted to flatter the king of the wolf race, he was thrown out directly by his parents. After that, he had been tossed like a toy by others from one place to another, numerous times. Finally, he ended up in front of the black wolf.\r\n\r\nThere was a rumor saying that the black wolf was the most ferocious existence in the wolf palace. And the black wolf’s favorite food was raw chicken!\r\n\r\nHe always excitedly gnawed the chicken, there was a possibility that blood could splatter everywhere!\r\n\r\nQiao Xi: I feel like I’m going to die.\r\n\r\nAnd when Qiao Xi fell in front of the black wolf—\r\n\r\nThe black wolf had sharp fangs, fierce eyes, and a terrifying aura. The black wolf opened his mouth and approached Qiao Xi…\r\n\r\n“Auwoo! Auwoo! Auwoo!”\r\n\r\nQiao Xi was frightened out of his wits and immediately fell onto the ground. He unmanageably changed into a human form. His body was shivering uncontrollably, thinking to himself that he was going to die.\r\n\r\nHowever, just when the black wolf saw Qiao Xi’s human form, he unexpectedly turned silent.\r\n\r\nAfter standing still for a while, he suddenly lifted his paw and touched Qiao Xi’s pretty little face, he stated calmly: “From today onward, you’re my little brother.”\r\n\r\nQiao Xi, whose eyes were filled with tears: “…?”\r\n…\r\n\r\nLater, the black wolf ascended the throne in the wolf race.\r\n\r\nSomeone saw the black wolf carrying a chicken in his arm, and couldn’t help but say with a smile, His Majesty, the Wolf King surprisingly carried a ration with him, which was really interesting.\r\n\r\nSuddenly, the Wolf King’s face darkened. He said calmly without any smile on his face: “This is my wife.”\r\n\r\nHe also ate this small one every day, but not as a ration, because this was his little treasure.>"
}