{
	"url": "https://www.novelupdates.com/series/let-the-villain-go/",
	"title": "Let the Villain Go - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/07/letthevillaingo3.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Romance   Sci-fi   Slice of Life   ",
	"tags": "Aliens   Apocalypse   Beautiful Female Lead   Caring Protagonist   Character Growth   Charming Protagonist   Cruel Characters   Demons   Determined Protagonist   Devoted Love Interests   Doting Love Interests   Female Protagonist   Friendship   Futuristic Setting   Handsome Male Lead   Hard-Working Protagonist   Helpful Protagonist   Honest Protagonist   Human-Nonhuman Relationship   Inferiority Complex   Loner Protagonist   Parallel Worlds   Past Trauma   Power Couple   Proactive Protagonist   Quiet Characters   Second Chance   Shy Characters   Special Abilities   Stoic Characters   Strong Love Interests   Strong to Stronger   Unconditional Love   ",
	"rating": "(4.6 / 5.0, 214 votes)",
	"author": "Gong Xinwen   龚心文   ",
	"year": "\n2019",
	"ranking": "#277   #1267   #1610   #1656   #1140   ",
	"reviewcount": "57 Reviews sorted by",
	"description": "Legend has it that Ye Peitian's blood has the miracle effect of saving the almost dead. The strong human beings swarmed like ants and insects under the banner of justice, just to achieve their ulterior purpose.\r\n\r\nUsing Yellow Sand to crush all the coveted people, Ye Peitian let his broken body soak in the pool of blood.\r\n\r\nA woman appeared on the edge of the battlefield and approached him quietly.\r\n\r\nYe Peitian lightly pulled the corner of his mouth with a little effort, drawing a sneer. Even a low-level saint dared to take the opportunity to take his blood and flesh.\r\n\r\nHe closed his eyes, however, the woman stooped down and put a warm coat on him.\r\n\r\nYe Peitian:? ? ?\r\n\r\nWhen Chu Qianxun was dying, she saw what happened in another parallel world.\r\n\r\nIn that world, the big demon that made the world fear him was not a demon, but smiled softly and shyly at her.\r\n\r\nFor that smile, she stepped on the bloody sea of ​​corpses and carefully approached the brutal bloodthirsty demon.\r\n\r\nBut she heard the person say: Go away. If you get closer to me, I will make you die badly.\r\n\r\nWhen she really turned around, the corner of her clothes was pulled.\r\n\r\nEven if the whole world spurns you, I will hold your hand.\r\n\r\nIf everyone is afraid of you, then let me love you.>"
}