{
	"url": "https://www.novelupdates.com/series/time-limited-hunt/",
	"title": "Time-Limited Hunt - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/06/TimeLimited-Hunt.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adult   Mature   Mystery   Psychological   Shounen Ai   ",
	"tags": "Adapted to Drama CD   Anti-social Protagonist   Calm Protagonist   Cannibalism   Clever Protagonist   Cold Protagonist   Complex Family Relationships   Crime   Cunning Protagonist   Dark   Death   Depictions of Cruelty   Detectives   Gore   Handsome Male Lead   Manipulative Characters   Military   Multiple POV   Multiple Protagonists   Murders   Mystery Solving   Older Love Interests   Police   Power Couple   Protagonist Strong from the Start   Psychopaths   R*pe   Sadistic Characters   Schemes And Conspiracies   Smart Couple   Social Outcasts   Strong Love Interests   Suicides   Survival   Thriller   Twisted Personality   Wars   ",
	"rating": "(4.4 / 5.0, 62 votes)",
	"author": "Tang Jiuqing   唐酒卿   ",
	"year": "\n2020",
	"ranking": "#2000   #2000   #5610   #7991   #3163   ",
	"reviewcount": "10 Reviews sorted by",
	"description": "Serial no. 01AE86. Full name: Shi Shanyan. Height: 189cm. Weight: 82kg. Passed the Black Panther test and joined the Special Forces in 2160. Expelled from the unit and detained at the Guangtong Prison in 2162. Described in the Special Forces’ mission appraisal as having poor self-control, lacking empathy, and possessing a strong tendency to dominate. Broke the rules repeatedly during missions. Danger level has been specially set as S-Rank.\n\nSerial no. 7-001. Full name: Yan Junxun. Height: 175cm. Weight: 62kg. Passed the Black Panther test and joined the Special Forces in 2163. Expelled from the unit in 2164. Described in the Special Forces’ mission appraisal as having poor overall capability with the inability to adapt to dangerous missions and a lack of destructive power.”\n\n“In accordance with the ’Mites’ agreement, both of you will work together on the serial murder cases at the Tingbo District”.\n\nShi Shanyan deleted the information and re-entered it.\n\n“Warning. Serial no. 7-001 is super—fierce.”>"
}