{
	"url": "https://www.novelupdates.com/series/man-man-qing-luo/",
	"title": "Man Man Qing Luo - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2015/08/qing.jpg",
	"noveltype": "(CN)",
	"genre": "Fantasy   Historical   Romance   Shoujo   ",
	"tags": "Adapted to Drama   Ancient China   Beautiful Female Lead   Cross-dressing   Female Protagonist   Handsome Male Lead   Love Interest Falls in Love First   Love Triangles   Politics   Transmigration   ",
	"rating": "(4.0 / 5.0, 101 votes)",
	"author": "桩桩   ",
	"year": "\n2011",
	"ranking": "#2000   #4116   #3538   #6881   #3089   ",
	"reviewcount": "12 Reviews sorted by",
	"description": "The story begins as our female lead wakes up in a strange room and an unfamiliar body. She realizes that she has travelled back in time and her twenty-two year old spirit is now trapped in the body of a six year old girl. This girl child is the third daughter of Ning Guo’s Prime Minister Li and his seventh wife. Her name is Li Qing Luo and because her mother was originally from an entertainment house, Prime Minister Li and his other six wives treated them badly.\r\n\r\nHer first day in that world, the whole family gathers to test the talent of the three daughters. Qing Lei, the eldest, is talented at playing the zither while Qing Fei’s calligraphy is incomparable. Everyone anticipates A'Luo’s failure as she had not exhibited any talent before, but that six year old child recites a famous Tang poem. The entire family is surprised that Qing Luo is able to write such a profound poem and her mother later tells her that Prime Minister Li is so harsh on his daughters because he needs to rely on them marrying well to secure his future. Qing Luo begins to study qin, qi, shu, hua (zither, chess, calligraphy, and painting) but hides her skill because she does not want to be sold in marriage to some prince or court official.\r\n\r\nSix years later, A'Luo is now twelve and leaves the estate for the first time to participate at a flower viewing banquet. This is a special banquet because the Five Most Eligible Bachlors of Feng Cheng will be in attendance (there’s actually a more elegant name for them). These young men are: Crown Prince Liu Jian, Fourth Prince Liu Fei, the young An Qing Wang Liu Jue, the son of Prime Minister Gu Gu Tian Xiang, and the top scorer of the Imperial Examinations Cheng Si Yue. A'Luo sneaks off and almost falls into a river, but is saved by a handsome young man. Because he glanced at her bare legs a moment too long, A'Luo calls him a pervert, tries to push him into the river and runs off. The young man only laughs and vows to find her again.>"
}