{
	"url": "https://www.novelupdates.com/series/what-to-do-with-a-pair-of-kittens/",
	"title": "What to Do with a Pair of Kittens - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/07/cat.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Romance   Yaoi   ",
	"tags": "Acting   Animal Characteristics   Charming Protagonist   Cute Protagonist   Dense Protagonist   Devoted Love Interests   Doting Love Interests   Enemies Become Lovers   Friendship   Handsome Male Lead   Hiding True Identity   Love Interest Falls in Love First   Misunderstandings   Models   Non-humanoid Protagonist   Popular Love Interests   Shameless Protagonist   Slow Romance   Straight Uke   Transformation Ability   Wealthy Characters   ",
	"rating": "(4.3 / 5.0, 19 votes)",
	"author": "Yan Ling   烟翎   ",
	"year": "\n2019",
	"ranking": "#2000   #6215   #7787   #9890   #4821   ",
	"reviewcount": "5 Reviews sorted by",
	"description": "One day, a post, “Your Beloved Fu Yuqian Is a Cat Killer,” suddenly appeared on the forum, and the followers clicked on it.\n\nIt turns out this is what it says: Every day Fu Yuqian kissed the cat’s mouth, kissed the cat’s claws, rang the bell, told the cat “I love you”, even slept with the cat!!! Fu Yuqian’s fans are suffocating. I’m willing to be this cat! \n\nSong Yu, who has been shaking for half a day, is desperate to sigh. The man who had not seen him for so long held him in his arms: “Give me another kiss.”\n\nSong Yu: “…”\n\nSong Yu is a top-line entertainment icon, with 50m fans, and the comprehensive entertainment company is set up in a row to select him.\n\nIt’s a winner.\n\nThe only thing wrong with it is the presence of Fu Yuqian. This guy was born to take advantage of him, he was taller than him, he had more endorsements than him, and even had 20,000 more fans than him! \n\nSoon after Song Yu had an accident, he woke up and found himself a cat raised by Fu Yuqian. \n\nHahaha, God help me, this young master must find all your flaws, and when you get back to the internet, all of them will be exposed! Song cat, who keeps an eye on people all the time, discovered that Fu Yuqian had no flaws, he was still the same with people in front of him, being nice to people and gentle to the cat, except for doing things that could not be described!\n\nAnd then, get out of here! I’m gonna be a cat again! \n\n“It’s too late…” The man grabbed his waist and brought him back into his arms.>"
}