{
	"url": "https://www.novelupdates.com/series/apotheosis-of-a-demon-a-monster-evolution-story/",
	"title": "Apotheosis of a Demon – A Monster Evolution Story - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/07/Apotheosis-of-a-Demon-A-Monster-Evolution-Story.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Drama   Fantasy   Supernatural   ",
	"tags": "Absent Parents   Adventurers   Alternate World   Animal Characteristics   Antihero Protagonist   Beautiful Female Lead   Cheats   Child Protagonist   Cute Protagonist   Demi-Humans   Demon Lord   Demons   Depictions of Cruelty   Discrimination   Elves   Evolution   Famous Protagonist   Female Protagonist   Game Elements   God Protagonist   Gods   Human Experimentation   Humanoid Protagonist   Level System   Living Alone   Magic   Mob Protagonist   Multiple POV   Orphans   R-15   Reincarnated as a Monster   Reincarnation   Returning from Another World   Ruthless Protagonist   Secret Identity   Secretive Protagonist   S*aves   Special Abilities   Survival   Sword And Magic   Tragic Past   Transported into a Game World   Virtual Reality   Weak to Strong   World Travel   World Tree   ",
	"rating": "(4.5 / 5.0, 683 votes)",
	"author": "Haru no Hi   Harunohi Biyori   春の日   春の日びより   ",
	"year": "\n2018",
	"ranking": "#1401   #1981   #535   #621   #498   ",
	"reviewcount": "91 Reviews",
	"description": "A back-to-basics(?) monster evolution novel.\r\n\r\nA new VRMMORPG, “World of Yggdrasia”, was recruiting beta testers from all over the world. Ten thousand testers began their journey of swords and sorcery in a new realm, one that was as large as Earth.\r\n\r\nAt the same time, a clandestine experiment was underway. Unbeknownst to the world at large, 100 secret alpha testers were given bodies of monsters and summoned to the same land.\r\n\r\nThe girl of white was one such tester. Despite the odds against her, she continued to evolve again and again. To rebel against the real world’s invasion, she would become a most terrible beast, the destroyer of worlds… the Bunny Girl!\r\n\r\n“…wait, what? Me?”\r\n\r\nOur protagonist would survive, unyielding, knowing no despair.>"
}