{
	"url": "https://www.novelupdates.com/series/copper-coins/",
	"title": "Copper Coins - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/09/Copper-Coins.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Fantasy   Mystery   Romance   Supernatural   Yaoi   ",
	"tags": "Adapted to Drama CD   Adapted to Manhua   Adventurers   Amnesia   Ancient China   Appearance Changes   Appearance Different from Actual Age   Bickering Couple   Buddhism   Clever Protagonist   Cold Love Interests   Comedic Undertone   Dark   Death   Death of Loved Ones   Disabilities   Dragons   Elemental Magic   Exorcism   Feng Shui   Ghosts   Handsome Male Lead   Heavenly Tribulation   Hidden Abilities   Hiding True Abilities   Hiding True Identity   Human-Nonhuman Relationship   Jiangshi   Kuudere   Legends   Magic   Magic Beasts   Magic Formations   Monsters   Murders   Mysterious Illness   Mysterious Past   Mystery Solving   Mythology   Near-Death Experience   Non-humanoid Protagonist   Playful Protagonist   Power Couple   Protagonist Strong from the Start   Revenge   Ruthless Protagonist   Sealed Power   Secrets   Shapeshifters   Sharp-tongued Characters   Slow Romance   Spirits   Strong Love Interests   Stubborn Protagonist   Tsundere   ",
	"rating": "(4.7 / 5.0, 393 votes)",
	"author": "Mu Su Li   木苏里   ",
	"year": "\n2016",
	"ranking": "#3567   #2812   #1705   #2359   #842   ",
	"reviewcount": "103 Reviews sorted by",
	"description": "It was the twenty-third year of Tianxi*. Rumours traversed the streets that the all-knowing Imperial Advisor suffered a great calamity and could not help but enter seclusion to focus on cultivation. However, the commoners secretly clapped their hands and rejoiced. In the winter of the same year, a young monk appeared in the Hui Zhou Fu’s Ningyang District. \n\n    The monk’s monastic title was Xuan Min, his memories all missing, yet was versed in the arts of Feng Shui Kan Yu**. On the very first day arriving in Ningyang, he did not hesitate to take care of a dangerous manor, picking up Xue Xian, who was hidden there, along the way.\n\n    Since then, Xue Xian – who had been all-powerful in the first half of his life – gained a new life pursuit: to get this baldy*** who had only a good outer appearance to take his last breath and “smile from his grave”.\n\n    Xue Xian: If you are unhappy, then I will be happy. If you die, I’ll laugh my ass off.\n\n    Xuan Min: …>"
}