{
	"url": "https://www.novelupdates.com/series/incurable-pain/",
	"title": "Incurable Pain - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/06/Incurable-Pain.jpg",
	"noveltype": "(CN)",
	"genre": "Drama   Psychological   Romance   School Life   ",
	"tags": "Absent Parents   Arrogant Characters   Beautiful Female Lead   Betrayal   Bullying   Character Growth   Cold Protagonist   Coming of Age   Couple Growth   Death of Loved Ones   Debts   Disabilities   Female Protagonist   First Love   Friends Become Enemies   Introverted Protagonist   Modern Day   Mute Character   Past Trauma   Playboys   Protagonist Falls in Love First   Second Chance   Tragic Past   ",
	"rating": "(3.8 / 5.0, 67 votes)",
	"author": "玉寺人   ",
	"year": "\n2020",
	"ranking": "#2000   #2000   #4016   #2153   #5328   ",
	"reviewcount": "14 Reviews sorted by",
	"description": "Bai Xunyin was inadvertently traumatized by stress during the year she graduated from Middle School. She became a “little mute” who couldn’t speak. In her first year of high school, she spent her days listening to the cynicism and discriminatory bullying of people around her until her second year of high school. Bai Xunyin met Yu Luoyin. He was clear, elegant, with straight eyebrows and star like eyes. He was the most handsome boy in school, and was the dream boyfriend of all girls in school. But for Bai Xunyin, Yu Luoyin was the first to protect her, smile at her, discuss topics with her, and the person who had lunch with her. The onset of her crush was turbulent and confusing in her teenage years.\n\nBai Xunyin’s diary during the second year of high school was filled with the name ‘Yu Luoyin’. Bai Xunyin did not extravagantly ask for Yu Luoyin to like her, but she didn’t expect that in the third year of high school, she would inadvertently see his “true personality” in the corner of a corridor. Under Yu Luoyin’s gentle, elegant and handsome appearance was a scumbag. He faced his two tr*shy friends, smiled and said-“The little mute started to like me. Our bet ends here, I’m bored of staying with her.” Bai Xunyin could not speak, but her eyes knew how to cry. Since then, she never looked directly at Yu Luoyin again.\n\nAfterwards Young Master Yu ridiculed her, mocked her, broke a table, apologized, and even hurt himself, he used various methods but it was still useless. He could only kneel in front of Bai Xunyin, his eyes red, and his voice hoarse, begging—”Yinyin, forgive me once. For the rest of my life, I will never dare to do this again.” *You are my unspeakable incurable pain. It hurts when I think of you, but it hurts even more when I can’t think of you.>"
}