{
	"url": "https://www.novelupdates.com/series/genius-doctor-black-belly-miss/",
	"title": "Genius Doctor: Black Belly Miss - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2018/01/Black_Belly_Miss.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Comedy   Fantasy   Gender Bender   Josei   Romance   Xuanhuan   ",
	"tags": "Academy   Adapted to Manhua   Apathetic Protagonist   Army   Beast Companions   Beautiful Female Lead   Black Belly   Broken Engagement   Calm Protagonist   Character Growth   Cold Protagonist   Cross-dressing   Cultivation   Cunning Protagonist   Dense Protagonist   Depictions of Cruelty   Devoted Love Interests   Doctors   Doting Love Interests   Eidetic Memory   Female Protagonist   Genius Protagonist   Gore   Handsome Male Lead   Hard-Working Protagonist   Herbalist   Hidden Abilities   Hiding True Identity   Kuudere   Love Interest Falls in Love First   Loyal Subordinates   Male Yandere   Marriage   Medical Knowledge   Multiple POV   Multiple Realms   Older Love Interests   Pill Concocting   Poisons   Politics   Proactive Protagonist   R*pe   Ruthless Protagonist   Schemes And Conspiracies   Sharp-tongued Characters   Slow Romance   Special Abilities   Spirits   Strong Love Interests   Transmigration   Trap   Underestimated Protagonist   Unique Cultivation Technique   Weak to Strong   Wealthy Characters   ",
	"rating": "(4.4 / 5.0, 1411 votes)",
	"author": "North Night   夜北   ",
	"year": "\n2015",
	"ranking": "#3017   #3388   #18   #481   #85   ",
	"reviewcount": "193 Reviews sorted by",
	"description": "She was a peerless genius in the 24th Century – all she needed was a silver needle and she could practically bring anyone back from the dead. \n\nAfter an explosion, she crossed over into a strange world; everyone calls her “Miss.” The previous “Miss” before had no contractual spirit, was weak and incompetent, and even the fiancé comes over with a new love and bullies her? \n\nNow that she has taken over, who dares to act so presumptuously around her? With needles in hand, the world is for her to own! Wherever she goes, miracles follow! However, she saved a pest. What was she thinking when she saved that man. His stunning demeanor and impeccable face is a huge contrast to his cruel actions. He tries all ways to win her over.>"
}