{
	"url": "https://www.novelupdates.com/series/business-tycoon-vs-drama-queen-star/",
	"title": "Business Tycoon vs. Drama Queen Star - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/02/Business-Tycoon-vs-Drama-Queen-Star.jpg",
	"noveltype": "(CN)",
	"genre": "Fantasy   ",
	"tags": "Female Protagonist   ",
	"rating": "(1.0 / 5.0, 1 votes)",
	"author": "Fallen Leaf Turned Loner   ",
	"year": "\nN/A",
	"ranking": "#2000   #2000   #13633   #13810   #13204   ",
	"reviewcount": "No Reviews",
	"description": "Luo Tiantian sacrifices herself to save Bai Yueguang, only to wake up in the novel her best friend had written as a prank. \r\n\r\nThe best friend of the original owner of this body has gotten plastic surgery to take her place, snatching everything she had. She has even been imprisoned for ten years! \r\n\r\nTo avoid a tragic end, Luo Tiantian clings on to the greatest boss in the novel. \r\n\r\nAfter she shoots to fame overnight, the internet is teeming with curses toward her, claiming how she had undergone plastic surgery, was one to put on airs, and was being kept as a mistress… \r\n\r\nShe doesn’t even have any time to respond before the female lead’s lackeys suddenly change their stances. \r\n\r\nHer eldest brother, a CEO: “She has the Luo Corporation backing her. Miss Luo doesn’t need a sugar daddy.” \r\n\r\nLuo Tiantian’s expression darkens. “Scram! Don’t provoke me!” \r\n\r\nHer second brother, a forensic pathologist: “As someone working in forensics, I can confirm that my younger sister is a natural beauty. She’s never had any plastic surgery done.” \r\n\r\nLuo Tiantian sneered. “Who are you?” \r\n\r\nThe movie star: “Tiantian, you’re my fiancée. How could you live with another man?” \r\n\r\nLuo Tiantian stares at that stupid face. “You?” \r\n\r\n- \r\n\r\nThe moment she returns home, Luo Tiantian tones down immediately. \r\n\r\nHer boss glances at Luo Tiantian with what seems like a smile. “An orphan?” \r\n\r\nLuo Tiantian nods innocently. “Yes, my entire family’s dead. I’m the only one left.” \r\n\r\nHer boss raises his eyebrow. “A fiancé?” \r\n\r\nLuo Tiantian quickly shakes her head. “No, no. That’s nothing more than a rumor. You’re the only one in my heart!” \r\n\r\n- \r\n\r\nFrom then on, the big boss undergoes a drastic change and becomes henpecked. He gazes at her affectionately. “Little friend, you’re toxic, but you’re my antidote.”>"
}