{
	"url": "https://www.novelupdates.com/series/pro-mom-fan-transmigrates-into-villainess/",
	"title": "Pro-Mom Fan Transmigrates into Villainess - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/01/ProMom-Fan-Transmigrates-into-Villainess.png",
	"noveltype": "(CN)",
	"genre": "Comedy   Fantasy   Romance   School Life   ",
	"tags": "Age Regression   Arrogant Characters   Beautiful Female Lead   Caring Protagonist   Clingy Lover   Cold Love Interests   Cute Protagonist   Devoted Love Interests   Doting Love Interests   Family Conflict   Female Protagonist   Handsome Male Lead   Heartwarming   Inferiority Complex   Love Interest Falls in Love First   Mob Protagonist   Multiple Transported Individuals   Mysterious Family Background   Nightmares   Past Trauma   Prostit**es   Secret Crush   Smart Couple   Tragic Past   Transmigration   Transplanted Memories   Wealthy Characters   ",
	"rating": "(4.1 / 5.0, 45 votes)",
	"author": "栖风念   ",
	"year": "\nN/A",
	"ranking": "#2463   #2000   #5652   #3461   #5635   ",
	"reviewcount": "9 Reviews sorted by",
	"description": "Qi Anan transmigrated into a super popular male abuse novel.\n\nIn the novel, the male lead Jiang Lu was a powerful and miserable beauty. Because of his birth, he suffered from all kinds of scorn, and his exquisite and beautiful appearance became a label of shame. During the dark years when he was rejected by thousands of people because of his disabled legs, only the female lead gave him a little care.\n\nFans of the novel agreed that sadomasochism came from the work of the female lead, but for the oddball mother fan Qi Anan, her son and daughter, she loved them all, and she strongly believed if there was someone to blame, it would be the poisonous and evil villainess!\n\nAnd Qi Anan transmigrated… and became the villainess in the novel.\n\nThe end of the villainess was terrible. When she was young, she couldn’t be loved by the male lead, and she retaliated against the male lead with paranoia, ruining the male lead’s life by herself. In the end, the male lead developed into a nouveau riche in the business world and paid back twice the humiliation he had suffered.\n\nAs a qualified mother CP fan, Qi Anan, of course, chose to tear people up: Baby cub! Mom won’t let you be abused here! Just concentrate on falling in love for me! Be a bit sweeter!\n\nShe relied on her status as the daughter of a wealthy family. “Mother” Qi Anan was quite competent, implementing the pampering route to the end, and raising the cubs gently and purely, super considerately, and definitely the best in the world!\n\nShe was looking forward to it, and her daughter finally appeared.\n\nQi Anan took the camera, secretly hid in the corner, and shipped her CP: It’s coming, it’s coming! Lock them up! Hurry up! Press her against the wall and kiss! Mom will record the most beautiful moment for you!\n\nHowever, Jiang Lu looked like a different person. He looked at the female lead indifferently, his eyes were dark, and his expression was gloomy: “I’ve told you, back off.” “Compared to her, you’re unworthy.”\n\nJiang Lu walked alone in the boundless darkness, never thinking that there would be a bright day in his life.\n\nOne day, various scenes of the tragic end of his beloved girl’s previous life appeared in his mind.\n\nHe found out with chills all over his body that the murderer who caused her tragic death… turned out to be himself?>"
}