{
	"url": "https://www.novelupdates.com/series/in-order-to-support-me-big-shots-kneels-down-before-me/",
	"title": "In Order to Support Me, Big Shots Kneels Down Before Me! - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/12/In-order-to-support-me-big-shots-kneels-down-before-me.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Josei   Romance   Slice of Life   ",
	"tags": "Adopted Protagonist   Beautiful Female Lead   Female Protagonist   Handsome Male Lead   Late Romance   Modern Day   Reincarnation   Transmigration   ",
	"rating": "(3.2 / 5.0, 12 votes)",
	"author": "凉皮就面包   ",
	"year": "\n2020",
	"ranking": "#2000   #2000   #9185   #10477   #8709   ",
	"reviewcount": "3 Reviews sorted by",
	"description": "Mu Yao has been living a miserable life by working hard and saving money as much as she can. Meanwhile, her blood-sucking auntie will always take her hard earned money by saying guilt inducing words to Mu Yao about her dead parents.\r\n\r\nThe foreman of her performance group owed her many of her wages, while, the brother next door, who she had a engagement deal with, hooked up with a Bai Fumei (White, rich and beautiful girl) and abandoned her.\r\n\r\nOne night, when Mu Yao went to the vegetable market in order to grab groceries at discounted price, three elegant and luxurious cars suddenly stopped right in front of her.\r\n\r\nThe three handsome guys, who looks like stars, walked towards Mu Yao together.\r\n\r\nEach of them took out a black card and said: “Sister! Come home with us!”\r\n\r\nMu Yao: “Wait a minute! Let me just grab some discounted eggs!”\r\n\r\nHer three brothers were reborn, so they knew about Mu Yao being their long-lost little sister.\r\n\r\nIn their last life, Mu Chunchun, the adopted daughter who was regarded by the family as their own child, has been trying hard to prevent Mu Yao being found by the Mu Family.\r\n\r\nNow that they were reborn, they are determined to give double the favor and wealth robbed by Mu Chunchun to Mu Yao!\r\n\r\nMultinational group bosses, entertainment celebrities, national treasure-level directors, young scientific research, stars..\r\n\r\nAlmost every big shot with a good looks are holding big gifts and begging Mu Yao to spend their money.\r\n\r\nBrothers:? ? ?>"
}