{
	"url": "https://www.novelupdates.com/series/lessons-on-raising-a-partner/",
	"title": "Lessons on Raising a Partner - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/07/LessonsRaisingPartner1.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Comedy   Fantasy   Mecha   Romance   Sci-fi   Supernatural   Yaoi   ",
	"tags": "Androids   Appearance Different from Actual Age   Cosmic Wars   Couple Growth   Cute Protagonist   Doting Love Interests   Dragons   Elemental Magic   Elves   Futuristic Setting   Insects   Non-humanoid Protagonist   Outer Space   Possessive Characters   Shameless Protagonist   Slow Romance   Transformation Ability   Transmigration   Weak to Strong   ",
	"rating": "(4.1 / 5.0, 233 votes)",
	"author": "Ācí Gūniáng   阿辞姑娘   ",
	"year": "\n2016",
	"ranking": "#5262   #1920   #1543   #698   #1337   ",
	"reviewcount": "47 Reviews sorted by",
	"description": "Residing within the dense forest in Nore are the beautiful elves of Elune Forest. After the young elves began to be hunted by the humans to become slaves, the Queen of Elune decided that young elves could not leave the forest until after their adult ceremony at fifty years old. When Hai’an’s ceremony finally arrived, he was excited to be able to finally travel away from his home and see everything the world had to offer. However, he got more than he bargained for.\r\n\r\nWhat was supposed to be a simple ceremony turned into Hai’an transmigating to the body of… a plant?!\r\n\r\nStuck as a small sapling called Shaking Grass, Hai’an was bought and given as a birthday gift to a retired Starfleet Marshal named Auguste.\r\n\r\nAfter retiring due to political conflict, Auguste spends his time trying to find more of his missing race, the ancient dragons. Unexpectedly receiving Hai’an, Auguste believes him to be nothing more than a rare, exotic plant. To his surprise, he finds that this little plant is intelligent and learns more and more every day.\r\n\r\nHow will this stoic, unfeeling dragon fall in love with the little transmigrated elf who lost his body?>"
}