{
	"url": "https://www.novelupdates.com/series/fanservice-paradox/",
	"title": "Fanservice Paradox - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/05/fanserviceparad2.jpg",
	"noveltype": "(CN)",
	"genre": "Adult   Romance   Slice of Life   Yaoi   ",
	"tags": "Adapted to Drama CD   Awkward Protagonist   Celebrities   Child Abuse   Cold Protagonist   Dancers   Devoted Love Interests   Doting Love Interests   Enemies Become Lovers   First Love   First-time Interc**rse   Handsome Male Lead   Hard-Working Protagonist   Heartwarming   Love Interest Falls in Love First   Manly Gay Couple   Misunderstandings   Modern Day   Music   Past Trauma   Philosophical   Possessive Characters   Showbiz   Singers   Slow Romance   Smart Couple   Teamwork   Younger Love Interests   ",
	"rating": "(4.5 / 5.0, 272 votes)",
	"author": "Zhìchǔ   稚楚   ",
	"year": "\n2020",
	"ranking": "#2318   #2044   #1659   #566   #1281   ",
	"reviewcount": "67 Reviews sorted by",
	"description": "Kaleido, a talented but unpopular boy band, shot to fame by chance because of a video shot at the airport. In the video, Pei Tingsong, the youngest and most gong member of the whole group, pinned Fang Juexia Gege against a wall as he gently patted his face with a ticket. Yet Fang Juexia just took the ticket away, biting it as he tidied up his clothes. A “bullying” incident within the group thus transformed into an intense flirting exchange, and the TingJue CP was born.\n\nNetizen: holy sh*t that’s so gong! Kabedon AND a bayonet fight! (internet slang for lovey dovey actions between men)\n\nAnd thus, the abandoned trump card burdened by rumours of having had sold his body and the legendary rich member with a strong backing were bound together. They had clearly never gotten along since their debut, yet they were now forced to embark on an endless path of selling their fake ship together.\n\nPei Tingsong was famous for being ‘real’ in the circle, and he had offended many people from his lyrics alone because they were overly ‘real’. But he stressed again and again that he and Fang Juexia were only providing fan service.\n\nCP fan: [Someone who has never been fake is selling a fake ship.] May the philosophy students please explain the paradox to this young student Pei here.\n\nYoung Pei: Fine, you guys win.\n\nJuexia: (seriously considers the logic) If B is true, then A is also true; but if A is true, then B should also be true…it really is a paradox.\n\nYoung Pei: Fang Juexia, you’re heartless.>"
}