{
	"url": "https://www.novelupdates.com/series/the-female-protagonist-of-the-abuse-article-has-a-system-mother/",
	"title": "The Female Protagonist of The Abuse Article Has a System Mother - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/10/The-Female-Protagonist-of-The-Abuse-Article-Has-a-System-Mother.jpg",
	"noveltype": "(CN)",
	"genre": "Fantasy   Romance   Slice of Life   ",
	"tags": "Child Protagonist   Childcare   Childhood Friends   Cute Children   Cute Protagonist   Doting Parents   Female Protagonist   Modern Day   Orphans   Single Parent   System Administrator   ",
	"rating": "(3.8 / 5.0, 9 votes)",
	"author": "木念之   ",
	"year": "\n2022",
	"ranking": "#2566   #451   #12132   #9891   #12073   ",
	"reviewcount": "No Reviews",
	"description": "Youyou is a mother’s precious daughter. The word she often talks about is: 'My mother said...' Therefore, many people laughed at her for not being weaned, but Xu Youyou didn’t care, she still went her own way, determined to be the best mother’s baby girl.\r\n\tIn high school, Xu Youyou was pressed by the domineering school grass against the wall to confess. Xu Youyou frowned and refused: “No, my mother said that the most important thing for students is to study! Otherwise, they will become the scum of society in the future!” Someone who has a single-digit score and hates studying:  “….”\r\nIn college, a rich and handsome president He wanted to use favorable conditions to help Xu Youyou, but got a contemptuous look from Xu Youyou: “My mother said, there is no such thing as getting something for nothing, if there is, there must be a conspiracy!” The president who wanted to find white moonlight substitute: “….”\r\n\t*5874 is a system whose mission is to change the miserable fate of the abused heroine Xu Youyou and make her happy. But, look at the little beany who is only three years old in front of her, and look at the terrible environment of the orphanage. The system decides to tell a lie “Youyou don’t be afraid, I’m your mother.”\r\n\tAfter fifteen years of conscientious teaching, the system fell into a deep sleep due to a lack of energy. When it woke up again and found Xu Youyou living in a beautiful villa with countless jewels and beautiful clothes. The system was heartbroken: “Baby, why are you still …” Xu Youyou is excited: 'Mom! You finally woke up! You were right! The best money in the world is money earned from loving a brainy man! System: “… Did I say that?”>"
}