{
	"url": "https://www.novelupdates.com/series/eden-of-the-villains/",
	"title": "Eden of The Villains - Novel Updates",
	"image": "https://www.novelupdates.com/img/noimagefound.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Mystery   Romance   Seinen   ",
	"tags": "Absent Parents   Adopted Protagonist   Amnesia   Antihero Protagonist   Apartment Life   Appearance Changes   Appearance Different from Actual Age   Assassins   Average-looking Protagonist   Beautiful Female Lead   Bookworm   Character Growth   Childhood Friends   Childhood Promise   Clever Protagonist   Cohabitation   Couple Growth   Crime   Criminals   Cruel Characters   Delinquents   Depictions of Cruelty   Detectives   Determined Protagonist   Drugs   Evil Organizations   Fast Learner   Gangs   Hard-Working Protagonist   Hated Protagonist   Jack of All Trades   Kidnappings   Male Protagonist   Modern Day   Murders   Mysterious Family Background   Mysterious Past   Mystery Solving   Near-Death Experience   Older Love Interests   Organized Crime   Past Plays a Big Role   Past Trauma   Polite Protagonist   R-15   Revenge   Romantic Subplot   Schemes And Conspiracies   Secret Identity   Secrets   Tragic Past   Unique Weapon User   Unique Weapons   Weak to Strong   ",
	"rating": "(3.8 / 5.0, 9 votes)",
	"author": "Akadama   あかだま   ",
	"year": "\n2019",
	"ranking": "#2000   #2000   #11855   #7856   #12172   ",
	"reviewcount": "No Reviews",
	"description": "Underground action story that takes place in Yokohama!\r\n\r\nWhy did a boy from a prestigious school, who has lived a simple life, turn himself into a villain?\r\n\r\nEigo Hayashiki, a boy with hyper memory syndrome (hyperthymesia), lives a lonely life, envied by those around him because of his special ability. After one particular incident, he is finally abandoned by his family and loses everything.\r\n\r\nThe boy is rescued by a mysterious woman, Secret, in Yokohama, and despite his confusion, he becomes familiar with the underworld of the port city.\r\n\r\nYakuza, Chinese Mafia, informant, hitman, and a hostess at the age of high schoolers are interwoven in the chaos of Yokohama’s underworld.\r\n\r\nThis is the story of a former honor student who comes into contact with Yokohama’s unique outlaws and solves various cases as a villain.>"
}