{
	"url": "https://www.novelupdates.com/series/godly-empress-doctor/",
	"title": "Godly Empress Doctor - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2018/02/ged.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Comedy   Fantasy   Josei   Martial Arts   Romance   Xuanhuan   ",
	"tags": "Adapted to Drama   Arranged Marriage   Arrogant Characters   Beast Companions   Beautiful Female Lead   Black Belly   Bloodlines   Calm Protagonist   Clever Protagonist   Cold Love Interests   Cold Protagonist   Complex Family Relationships   Cultivation   Cunning Protagonist   Devoted Love Interests   Doctors   Doting Love Interests   Fast Cultivation   Fast Learner   Female Protagonist   Genius Protagonist   Handsome Male Lead   Hard-Working Protagonist   Love Interest Falls in Love First   Magical Space   Master-Disciple Relationship   Medical Knowledge   Misunderstandings   Persistent Love Interests   Phoenixes   Pill Concocting   Poisons   Popular Love Interests   Reincarnated in Another World   Reincarnation   Revenge   Spirit Advisor   Strong Love Interests   Sword Wielder   Tsundere   Unlucky Protagonist   Weak to Strong   ",
	"rating": "(3.3 / 5.0, 129 votes)",
	"author": "Su Xiao Nuan   苏小暖   ",
	"year": "\n2017",
	"ranking": "#2000   #2000   #938   #7585   #2477   ",
	"reviewcount": "27 Reviews sorted by",
	"description": "She, a genius abandoned by her clan. He, a proud, pampered, two-faced imperial crown prince, a developing supreme ruler of the world. She, tricking him, disguised as a pig to eat a tiger, suppressing him, provoking him. Every time, after playing with him and stirring him up, she’d escape.\r\n\r\nNo man could put up with this! He could only hunt her, pamper and indulge her, lure her into falling in love with him, who would have thought, the one to first fall in love would turn out to be him----------\r\n\r\nA young man who stood above the world, a young lady who dominated the landscape, evenly matched opponents, evenly matched romantic game of chase and tag.\r\n>"
}