{
	"url": "https://www.novelupdates.com/series/about-your-pride-and-my-prejudice/",
	"title": "About Your Pride and My Prejudice - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/01/About-Your-Pride-and-My-Prejudice.jpg",
	"noveltype": "(KR)",
	"genre": "Drama   Fantasy   Mystery   Psychological   Romance   ",
	"tags": "Adopted Children   Aristocracy   Childhood Friends   Cute Protagonist   Devoted Love Interests   Emotionally Weak Protagonist   European Ambience   Female Protagonist   Handsome Male Lead   Introverted Protagonist   Jealousy   Kidnappings   Loneliness   Love at First Sight   Love Triangles   Male Yandere   Nobles   Obsessive Love   Previous Life Talent   Secret Crush   Secrets   Shy Characters   Stalkers   Thriller   Timid Protagonist   Transmigration   Unrequited Love   Yandere   ",
	"rating": "(3.5 / 5.0, 82 votes)",
	"author": "Woo Yoonhee   우윤희   ",
	"year": "\n2021",
	"ranking": "#2053   #2002   #3763   #2818   #4449   ",
	"reviewcount": "11 Reviews",
	"description": "“I don’t love you anymore.”\n\nIt had been 10 years since I became an extra in a classic romance novel. Having a very shy and quiet personality, I was suffering from a terrible unrequited love.\n\nAllan Leopold. He was the successor of the kingdom’s top businessman and the best lover candidate of all. The whole kingdom praised Allan’s beauty, and he didn’t even know I existed.\n\nNevertheless, I couldn’t dare to approach the dazzling man, so I just looked at him. Shining black hair, jewel-like eyes, and a great family were things he had, and things that were too far away from me.\n\nThat’s how I became an adult. One day, when I decided to pursue my dream instead of a feverish one-sided love, I fainted and woke up trapped in an unfamiliar basement of an old castle.\n\n“Don’t be angry, Melissa.”\n\n“…..”\n\n“Love me again.”\n\nIt didn’t take much time to realize that this was reality.\n\nAnd that I’ve been kidnapped. \n\nThat, too, by the man I had a crush on.>"
}