{
	"url": "https://www.novelupdates.com/series/second-life-ranker/",
	"title": "Second Life Ranker - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/04/Secondliferanker.png",
	"noveltype": "(KR)",
	"genre": "Action   Adventure   Fantasy   Mystery   Supernatural   Tragedy   ",
	"tags": "Ability Steal   Adapted to Manhwa   Alchemy   Alternate World   Anti-social Protagonist   Antihero Protagonist   Army   Army Building   Beast Companions   Beautiful Female Lead   Betrayal   Brotherhood   Calm Protagonist   Caring Protagonist   Character Growth   Charismatic Protagonist   Cheats   Clever Protagonist   Cold Protagonist   Cruel Characters   Cunning Protagonist   Death   Death of Loved Ones   Demons   Depictions of Cruelty   Determined Protagonist   Dragons   Dungeons   Eye Powers   Fearless Protagonist   Game Elements   God Protagonist   Goddesses   Godly Powers   Gods   Gore   Grinding   Handsome Male Lead   Hard-Working Protagonist   Harsh Training   Inheritance   Late Romance   Love Interest Falls in Love First   Loyal Subordinates   Lucky Protagonist   Male Protagonist   Master-Disciple Relationship   Master-Servant Relationship   Military   Modern Day   Monsters   Multiple POV   Mysterious Family Background   Mysterious Past   Mythical Beasts   Mythology   Necromancer   Overpowered Protagonist   Past Plays a Big Role   Phoenixes   Revenge   Romantic Subplot   Ruthless Protagonist   Schemes And Conspiracies   Seven Deadly Sins   Seven Virtues   Siblings   Special Abilities   Spirit Users   Spirits   Strength-based Social Hierarchy   Strong to Stronger   Survival Game   Sword And Magic   Time Manipulation   Time Skip   Time Travel   Unreliable Narrator   ",
	"rating": "(4.0 / 5.0, 730 votes)",
	"author": "Sadoyeon   사도연   ",
	"year": "\n2017",
	"ranking": "#708   #639   #67   #365   #77   ",
	"reviewcount": "126 Reviews sorted by",
	"description": "Yeon-woo had a twin brother who disappeared five years ago. One day, a pocket watch left by his brother returned to his possession. Inside, he found a hidden diary in which was recorded “By the time you hear this, I guess I will be already dead….”\n\nObelisk, the Tower of the Sun God, a world where several universes and dimensions intersect. In this world, his brother had fallen victim to betrayal while climbing up the tower. After learning the truth, Yeon-woo decided to climb the tower along with his brother’s diary.\n\n“From now on, I am Cha Jeong-woo.”>"
}