{
	"url": "https://www.novelupdates.com/series/broken-winged-angel/",
	"title": "Broken-Winged Angel - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/03/O.jpg",
	"noveltype": "(CN)",
	"genre": "Adult   Drama   Harem   Josei   Mature   Romance   Smut   ",
	"tags": "An*l   Abusive Characters   Blackmail   Caring Protagonist   College/University   Complex Family Relationships   Confinement   Cruel Characters   Dark   Depictions of Cruelty   Devoted Love Interests   Drugs   Family Conflict   Female Protagonist   First-time Interc**rse   F*llatio   Forced into a Relationship   Jealousy   Kidnappings   Love Interest Falls in Love First   Male Yandere   Manipulative Characters   Naive Protagonist   Nudity   Obsessive Love   Past Trauma   Persistent Love Interests   Personality Changes   Polyandry   Possessive Characters   Pregnancy   R*pe Victim Becomes Lover   Reverse Harem   R*pe   Sadistic Characters   S*xual Abuse   Stockholm Syndrome   Suicides   Threesome   Torture   Tragic Past   Twins   Twisted Personality   Wealthy Characters   Younger Love Interests   ",
	"rating": "(3.6 / 5.0, 307 votes)",
	"author": "Jiang Yu   江渔   ",
	"year": "\nN/A",
	"ranking": "#1710   #3741   #1943   #2744   #1833   ",
	"reviewcount": "60 Reviews sorted by",
	"description": "Shi Qing Xia is practically an angel.\n\nKind, sweet-hearted, and good at her studies, she was admitted to the top university in Taipei.\n\nHowever, the living expenses for the metropolitan city were far greater than she had ever imagined, so she started to work as a private tutor for wealthy families to make ends meet.\n\nOn her first day of work, she met Zhao Yi Bo and Zhao Yi Xuan, a pair of neglected 16-year-old genius twins whose prosperous and wealthy parents heartlessly abandoned in Taiwan. Shi Qing Xia found them to be gentle, compassionate, friendly, clever, mysterious, pitiful and attractive.\n\nBut appearances can be very deceiving…\n\nBecause behind those sweet smiles…\n\nDeeply twisted and cruel demons lurked, waiting to rip apart the wings of this angel, condemning her to an eternity of conflicted bittersweet suffering — a rollercoaster ride of a heart-wrenching, twisted, and tragic romance more extreme than what someone so innocent could possibly imagine.>"
}