{
	"url": "https://www.novelupdates.com/series/your-majesty-i-want-you/",
	"title": "Your Majesty, I Want You - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/02/fjskgls.jpg",
	"noveltype": "(KR)",
	"genre": "Adult   Drama   Fantasy   Psychological   Romance   Smut   Tragedy   ",
	"tags": "Abusive Characters   Arrogant Characters   BDSM   Beautiful Female Lead   Cautious Protagonist   Character Growth   Charming Protagonist   Clever Protagonist   C*nnilingus   Cold Love Interests   Couple Growth   Court Official   Cruel Characters   Dark   Death of Loved Ones   Depictions of Cruelty   European Ambience   Fallen Nobility   Female Protagonist   First-time Interc**rse   F*llatio   Handsome Male Lead   H*ndjob   Maids   Mature Protagonist   Misunderstandings   Persistent Love Interests   Politics   Popular Love Interests   Possession   Possessive Characters   Power Struggle   R-18   Royalty   R*pe   Sadistic Characters   S*xual Abuse   Strong Love Interests   Tragic Past   Wealthy Characters   ",
	"rating": "(3.5 / 5.0, 151 votes)",
	"author": "Tiyabe   티야베   ",
	"year": "\n2019",
	"ranking": "#3633   #3149   #2270   #6711   #1202   ",
	"reviewcount": "23 Reviews sorted by",
	"description": "The 17th Emperor of the Empire was a woman. Purely thanks to the Duke of Roark was she able to overtake the throne against her brothers.\n\n“Your Majesty, I’m ready to follow your will.”\n\nHe is the emperor’s loyal supporter; the noblemen bow their heads and wag their tails at his command.  Yet, despite his devotion, the emperor treats him coldly. Little does the public know, that behind closed doors, she belongs to him.\n\n*\n\nIn the dead of the night.\n\nThe door is wide open and the duke entered the emperor’s room without permission.\n\n“Get out,” he said to the servants, eyes locked on the emperor.\n\nShe looked at him and said, “I’m begging you, not tonight…”\n\nBefore him, her dignity was useless and authority whisked away. \n\n“Your Majesty, tonight you enchant me. I’m afraid I can’t hold it in any longer.” His eyes glided over her sweet body and he tore her clothing apart without hesitation. “Sorry, I’m afraid that it may be a rough night.”>"
}