{
	"url": "https://www.novelupdates.com/series/stray/",
	"title": "Stray - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/06/Stray.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Comedy   Drama   Fantasy   Psychological   Romance   Yaoi   ",
	"tags": "Adventurers   Appearance Different from Actual Age   Beastkin   Character Growth   Comedic Undertone   Dark   Death   Death of Loved Ones   Demon Lord   Demons   Devoted Love Interests   Evil Religions   Exorcism   Fantasy Creatures   Fantasy World   Gods   Handsome Male Lead   Hated Protagonist   Heroes   Hiding True Identity   Human-Nonhuman Relationship   Kingdoms   Knights   Late Romance   Long Separations   Love Interest Falls in Love First   Magic   Magic Formations   Manly Gay Couple   Mercenaries   Monsters   Murders   Mysterious Family Background   Mysterious Past   Mystery Solving   Near-Death Experience   Nobles   Overpowered Protagonist   Power Couple   Proactive Protagonist   Prophecies   Religions   Secrets   Slow Growth at Start   Slow Romance   Strong Love Interests   Unconditional Love   Unlucky Protagonist   Weak to Strong   ",
	"rating": "(4.5 / 5.0, 57 votes)",
	"author": "年终   ",
	"year": "\n2018",
	"ranking": "#2642   #2534   #5273   #2931   #4907   ",
	"reviewcount": "7 Reviews sorted by",
	"description": "Chaos had risen signifying that the next generation of the Demon King was about to be reborn.\n\nOn what seemed like another usual attacks from demons, Nemo Light was heading towards a shelter when he ran into Oliver Ramon, who was heading back to town to find his father, being chased by a demon. In the process of saving him, he inadvertently formed a contract with it.\n\nAs they return to town, they found it was ablaze and while trying to figure out why, they were wrongly accused of being demon worshippers and were hunted down by the church.\n\nWith no options left, they set about to become mercenaries to survive. Thus began the adventure of a gentle knight x an unwilling mage.>"
}