{
	"url": "https://www.novelupdates.com/series/after-being-turned-into-a-dog-i-conned-my-way-into-freeloading-at-my-rivals-place/",
	"title": "After Being Turned Into a Dog, I Conned My Way Into Freeloading at My Rival’s Place - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/07/20200104150816.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Drama   Romance   Shounen Ai   Slice of Life   Supernatural   ",
	"tags": "Acting   Celebrities   Cute Protagonist   Demons   Family   Fated Lovers   First Love   Love Interest Falls in Love First   Misunderstandings   Music   Non-humanoid Protagonist   Obsessive Love   Pets   Secret Crush   Shapeshifters   Singers   Transformation Ability   Wealthy Characters   ",
	"rating": "(4.4 / 5.0, 184 votes)",
	"author": "Zi Jin   紫矜   ",
	"year": "\n2020",
	"ranking": "#578   #2075   #2551   #1394   #2130   ",
	"reviewcount": "32 Reviews sorted by",
	"description": "When celebrity singer Ning Yan suddenly found himself turned into a white puppy, he ran into his rival Lin Rong, who just happened to pass by while Ning Yan was at a loss for what to do. Based on the idea that if he had to suffer then Lin Rong must suffer with him, Ning Yan tried all the tricks in the book until he successfully enticed Lin Rong into taking him home.\n\nJust as he was dreaming about conning the man out of food and house, the apartment door opened…to reveal a wall filled with his posters and a body pillow in his image on the bed.\n\nThe man hugged the body pillow, smiled at the puppy and said, “My beloved Yanyan is so pretty, right?”\n\nTo which Ning Yan could only respond by calling Lin Rong a pervert.\n\n…\n\nThe puppy Lin Rong picked up was a little dramatic. First, it bit down on his leg and refused to let go until Lin Rong took him home. That same night it pawed at the closed apartment door wanting to get out. A few good meals later, it flopped belly up in the dog bed and looked at him with thoughtful eyes.\n\nOne night several days later, Lin Rong came home drunk. He dreamt of the white puppy turning into his beloved Yanyan, lying on top of him in flustered surprise. He also dreamt of Ning Yan touching him everywhere when he realized how drunk Lin Rong was.\n\nThe next day, the white puppy was curled up peacefully in the dog bed. Lin Rong thought deeply for a second, went into his room, and found the security footage from the living room.\n\nHe squinted thoughtfully when he finished reviewing the footage...>"
}