{
	"url": "https://www.novelupdates.com/series/i-was-once-a-legend/",
	"title": "I Was Once a Legend - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/06/I-Was-Once-a-Legend.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Fantasy   Horror   Mystery   Romance   Shounen Ai   Supernatural   ",
	"tags": "Appearance Different from Actual Age   Beast Companions   Betrayal   Calm Protagonist   Character Growth   Childish Protagonist   Clingy Lover   Cold Protagonist   Confident Protagonist   Contracts   Death   Death of Loved Ones   Determined Protagonist   Devoted Love Interests   Doting Love Interests   Friendship   Game Elements   Handsome Male Lead   Insects   Jealousy   Legends   Love Interest Falls in Love First   Manly Gay Couple   Multiple POV   Mystery Solving   Mythical Beasts   Mythology   Near-Death Experience   Persistent Love Interests   Power Struggle   Proactive Protagonist   Protagonist Strong from the Start   Schemes And Conspiracies   Slow Romance   Smart Couple   Special Abilities   Straight Uke   Strong to Stronger   Survival Game   Teamwork   Thriller   Time Travel   Unlimited Flow   ",
	"rating": "(4.3 / 5.0, 183 votes)",
	"author": "Yan Ye Li   宴夜鲤   ",
	"year": "\n2020",
	"ranking": "#4080   #3618   #2287   #2438   #1639   ",
	"reviewcount": "31 Reviews sorted by",
	"description": "Eight years ago, Cui Zuojing passed the final level set by the “Queen” and became the first person to have ever escaped from the Pure White Realm. But his time was frozen forever at the moment he left—the day of his sixteenth birthday.\n\nEight years later, he snuck back to that nightmare world and became a “prisoner” for novice player Dong Zheng.\n\nThat day, the monsters of the Pure White Realm once again recalled the fear of being dominated by the devil.\n\nDong Zheng didn’t have any affections for this little devilish youth at first, but with the mutual support of life and death, he gradually realized—Not good. He seems to be… a big shot!\n\nRiding on endless trains, crossing time and space, the white-faced clown at the end of the railway smiled and handed out the invitation letter.\n\n“Welcome to the Pure White Realm! This is the nightmare of the world, a gambler’s paradise. As long as you have enough chips, any wishes can be satisfied. But if you leave before the end of the game, we’ll charge a certain loss-fee. For example, your life!”\n\n“Now then, please show your chips.”\n\nAnd, like eight years ago, Cui Zuojing didn’t hesitate to bet on his own feelings.>"
}