{
	"url": "https://www.novelupdates.com/series/sword-xia-of-the-shu-mountains/",
	"title": "Sword Xia of the Shu Mountains - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/02/Sword-Xia-of-the-Shu-Mountains.jpg",
	"noveltype": "(CN)",
	"genre": "Martial Arts   Wuxia   Xianxia   ",
	"tags": "Classic   Cultivation   Demons   Female Protagonist   Fox Spirits   Heavenly Tribulation   Immortals   Monsters   Multiple Protagonists   S*xual Cultivation Technique   Spirits   ",
	"rating": "(4.0 / 5.0, 8 votes)",
	"author": "Huanzhu Louzhu   还珠楼主   還珠樓主   ",
	"year": "\n1932-1948",
	"ranking": "#2000   #2000   #12769   #8665   #12687   ",
	"reviewcount": "No Reviews",
	"description": "Sword Xia of the Shu Mountains《蜀山劍俠傳》by Huanzhu Louzhu 還珠樓主 (lit. Master of Returning Pearl Loft) was published between 1932 and 1948 and is one of the most influential wuxia novels of all time. Many of the elements in this novel became standard tropes of the wuxia genre. It is also the forefather of the modern xianxia cultivation novel. Huanzhu’s cultivation system became the standard, fusing the Daoist quest for transcendence with the Buddhist reincarnation cycle and tribulation system, as well as the Confucian virtue of humaneness 仁 and the chivalrous xia 俠 archetype. At over 4.1 million Chinese characters, it is also one of the longest wuxia novels, though it remains unfinished due to the civil war in China. So the first cultivation novel was also eunuched—rather fitting.\r\n\r\nThe story follows multiple protagonists as they gradually gather together, fighting heretical sects and spirit elementals on their way to founding the Mount Emei Sect. Most outstanding among these protagonists is Li Yingqiong, who begins the novel as a girl with no martial arts abilities, and through the course of the novel cultivates to become a transcendent (aka immortal).\r\n\r\nIn this novel, plants, animals, and monsters can all become human and cultivate to transcendence, or lose their primordial spirit (aka nascent soul) and have to start all over, or be obliterated completely after failing their tribulation. Grotto-heavens and magic treasures abound, and we see the beginning of sects as major organizations in wuxia novels with important roles in the plot, such as Emei, Qingcheng, Mount Hua, Wudang, Mount Huang, Snowy Mountain, Kongtong, Kunlun, and Wutai, as well as the emergence of what would later become the archetypal eccentric beggar character. There are miraculous drugs, sword kinesis, and battles between mythical beasts, and heretic cultivators trying to cheat their way to a faster transcendence. In short, pretty much all of the elements one normally sees in the typical xianxia cultivation webnovel.>"
}