{
	"url": "https://www.novelupdates.com/series/im-pregnant-with-the-villains-child/",
	"title": "I’m Pregnant with the Villain’s Child - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/08/Im-pregnant-with-the-villains-child-cover.jpg",
	"noveltype": "(CN)",
	"genre": "Adult   Drama   Fantasy   Romance   ",
	"tags": "Abusive Characters   Arranged Marriage   Beautiful Female Lead   Blackmail   Childcare   Complex Family Relationships   Cruel Characters   Family Conflict   Female Protagonist   Forced into a Relationship   Forced Marriage   Love Interest Falls in Love First   Male Yandere   Manipulative Characters   Misunderstandings   Obsessive Love   Possessive Characters   Pregnancy   R*pe Victim Becomes Lover   R*pe   Sibling Rivalry   Stockholm Syndrome   Strong Love Interests   Transmigration   Twins   ",
	"rating": "(3.8 / 5.0, 485 votes)",
	"author": "公子闻筝   ",
	"year": "\n2018",
	"ranking": "#877   #311   #165   #413   #253   ",
	"reviewcount": "147 Reviews sorted by",
	"description": "The older sister flees from her wedding to be with her lover, and her younger sister is forced to take her place in marrying a very powerful man.\n\nAs luck would have it, she ends up transmigrating into the body of that younger sister.\n\nAlthough the man that she weds is very powerful, he’s the irredeemable final villain.\n\nAll villains are doomed to a bleak ending. And, as this villain’s wife, she’s afraid that her ending won’t be good either.\n\nFortunately, the older sister had gone back in time after having experienced a lifetime of suffering. This prodigal daughter returns to the turning point of her life. Pointing at her younger sister, she demands for her younger sister to hand over her husband.\n\nLooking at this beautifully crying older sister, Ye Zhen swiftly yields and says, “Older sister, don’t worry. I haven’t even done anything with brother-in-law!”\n\nTo her shock, she later discovers that she’s pregnant.\n\nWith tears in her eyes, her older sister says, “Didn’t you say that nothing happened between the two of you?”\n\nYe Zhen looks at the great villain that doggedly pursues her. She is utterly and totally doomed.\n\nThere’s a great villain lying next to her, and she’s pregnant with a mini villain. How’s she suppose to survive?!\n\nLater on, as Ye Zhen watches the great villain putting the baby down and changing the diaper, she sighs. “There’s nothing that can be done. I’ve already missed the golden opportunity to turn things around. How can I leave now?”>"
}