{
	"url": "https://www.novelupdates.com/series/dressed-as-the-deviants-boss-beloved/",
	"title": "Dressed As The Deviant’s Boss Beloved - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/06/Dressed-As-The-Deviants-Boss-Beloved.jpg",
	"noveltype": "(CN)",
	"genre": "Gender Bender   Josei   Romance   ",
	"tags": "Celebrities   Cross-dressing   Female Protagonist   Modern Day   Showbiz   Transmigration   ",
	"rating": "(2.9 / 5.0, 12 votes)",
	"author": "五条尾巴   ",
	"year": "\n2020",
	"ranking": "#2000   #2000   #8490   #12294   #9940   ",
	"reviewcount": "4 Reviews sorted by",
	"description": "“Mr. Bo, Mr. Bo… what would you do if I told you that I’m not actually a man, but a woman?” \r\n\r\n“What do you think?” \r\n\r\n“...Let’s have a proper conversation, please let go of the belt, shall we?”   \r\n\r\n******\r\nYe Xian transmigrated into a book about the entertainment industry, and became one of the members of a popular male group. The original soul disguised herself as a man and pestered the captain—male lead. Eventually, she died a tragic death in retaliation.  \r\n\r\nYe Xian: ?\r\n\r\nAs the most favored youngest daughter of the Ye Group, beautiful and androgynous, why would she seek death for a rotten man? \r\n\r\nSo, the netizens were surprised by Ye Xian’s sudden transformation into a handsome man, attracting thousands of girlfriend fans to follow him like crazy.  \r\n\r\nThe group noticed Ye Xian started focusing on his career, and his followers broke through to ten million in a matter of minutes, then he won awards.  \r\n\r\nThe original male lead saw Ye Xian ignore him, but buzzed around his brother…\r\n\r\n“Mr. Bo, this is the tea I asked someone to buy from Suzhou. Would you like to try it?” \r\n“Mr. Bo, this is the sweet and sour fish I cooked from my own hands, would you like to taste it?” \r\n\r\nBo Tingshen was the main character’s brother, the top boss who backed the main character in the original story with countless resources around him. Naturally, Ye Xian wanted to hang on to this boss, so she could step on the giant’s shoulders, but the way this giant looked at her was becoming weirder and weirder… \r\n\r\nBo Tingshen gazed at the “young man” who was keeping busy around him. His eyes turned dark and secretive, then he captured her into his arms.   \r\n\r\nYe Xian stuttered in fright, “Mr. Bo… Mr. Bo, what are you doing?” \r\n“I don’t want the food, I want you.” \r\n“But I’m a man!” \r\n“I like men.” \r\n“Hey, let me tell you, I’m lying. I’m actually a woman!” \r\n“I lied to you, too!” \r\n\r\nYe Xian wanted to sob, how could she get rid of the male lead easily, then, invite the male lead’s brother? \r\n>"
}