{
	"url": "https://www.novelupdates.com/series/i-can-read-minds-but-will-not-be-marked/",
	"title": "I Can Read Minds But Will Not Be Marked - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/03/I-Can-Read-Minds-But-Will-Not-Be-Marked.jpg",
	"noveltype": "(CN)",
	"genre": "Adult   Adventure   Fantasy   Mecha   Psychological   Romance   Shounen Ai   Yaoi   ",
	"tags": "Calm Protagonist   Cold Love Interests   Devoted Love Interests   Doting Love Interests   Engineer   Familial Love   Family   First Love   First-time Interc**rse   Futuristic Setting   Handsome Male Lead   Hiding True Abilities   Kuudere   Love Interest Falls in Love First   Lovers Reunited   Military   Older Love Interests   Omegaverse   Pets   Politics   Power Couple   Royalty   Schemes And Conspiracies   Soldiers   Strong Love Interests   Unconditional Love   ",
	"rating": "(4.3 / 5.0, 119 votes)",
	"author": "佐润   ",
	"year": "\n2020",
	"ranking": "#284   #755   #2965   #526   #2458   ",
	"reviewcount": "25 Reviews sorted by",
	"description": "Lin Han, the best Omega of the Empire, was the core mecha designer of the National Military Academy. In addition to his amazingly high concentration of pheromone and spiritual power, no one knows that he has also awakened a bizarre ability – mind reading.\n\nJust putting his hand on someone else’s hand, he could know what was in the other person’s mind.\n\nThe situation in the empire was changing and the storm was coming, and Lin Han, as the most outstanding mecha designer of the Military Research Institute, met with that high and mighty general of the empire. Lin Han had to take off his gloves and shook hands politely with this cold and icy male god of the empire.\n\n[So fragrant.]\n[I’m hard.]\n[Want to mark.]\nLin Han, “????”\n\nThe youth coldly lowered his face and drew back his hand expressionlessly, ‘Sorry for the intrusion.’\n\n“Let me imagine that among the stars, there is a star that is guiding my life through the unknowable darkness.” –Tagore>"
}