{
	"url": "https://www.novelupdates.com/series/copy-of-resentment/",
	"title": "Copy of Resentment - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/04/Copy-of-Resentment.png",
	"noveltype": "(CN)",
	"genre": "Adventure   Comedy   Fantasy   Mystery   School Life   Shounen Ai   Supernatural   Yaoi   ",
	"tags": "Ghosts   Reversible Couple   ",
	"rating": "(3.5 / 5.0, 14 votes)",
	"author": "More Than Thirteen   ",
	"year": "\nN/A",
	"ranking": "#1401   #2000   #11030   #10475   #10915   ",
	"reviewcount": "1 Review sorted by",
	"description": "Resentment arises from the souls of dead people, and everyone has it, so it’s not too unusual.\n\nBut those who have strong resentment after death and have not dissipated will lose the way to reincarnation. Wandering in the world day after day, waiting for that great savior who can resolve their resentment.\n\n“As I said, death is an important node that cannot be crossed.” Lu Shen’s expression was light. “So sorry, I can only penetrate into the resentment of the dead.”\n\nBehind each resentment copy, there is a different life.\n\nAccording to rumors, the gate of the No.4 Middle School  is facing the crematorium’s closed door, and the haunting rate and enrollment rate are the highest in the city.\n\nStudents from as far as 800 miles away were afraid of such a well-known magical institution, but with the arrival of an equally magical transfer student, a delicate balance had been upset—\n\nThe strange things that happen every night of the full moon, the strange and rigid school motto, the old cases left more than ten years ago… What is the source and truth behind all these supernatural events?\n\n“It doesn’t matter what it is,” said Bian Shengjian, frowning, “just tell me, what exactly are you?”\n\nLu Shen was silent for a while, then raised his head and stared at him: “First, I’m not a thing.”\n\n“Second,” Lu Shen said with a sudden smile and a very gentle tone: “If I said I was a ghost, would you believe it?”\n\nWell, in fact, this is a nonsense campus ghost story. The full text doesn’t play cards according to common sense~>"
}