{
	"url": "https://www.novelupdates.com/series/strike-back-proud-goddess/",
	"title": "Strike Back, Proud Goddess! - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/05/Strike-Back-Proud-Goddess.jpg",
	"noveltype": "(CN)",
	"genre": "Drama   Romance   Shoujo   ",
	"tags": "Beautiful Female Lead   Brotherhood   Complex Family Relationships   Devoted Love Interests   Doting Older Siblings   Doting Parents   Family   Family Conflict   Female Protagonist   First Love   Handsome Male Lead   Long Separations   Love Interest Falls in Love First   Lovers Reunited   Misunderstandings   Modern Day   Poor to Rich   Possession   Possessive Characters   Reincarnation   Sister Complex   Soldiers   System Administrator   Transmigration   Ugly to Beautiful   Unconditional Love   ",
	"rating": "(2.8 / 5.0, 69 votes)",
	"author": "Meng Luo Ting Die   ",
	"year": "\nN/A",
	"ranking": "#2000   #6245   #4791   #2751   #5919   ",
	"reviewcount": "16 Reviews sorted by",
	"description": "Xiao Rou, a girl growing up in a poor countryside family, finds that she's actually the daughter of a wealthy couple. Her mother had mistaken another girl for her back at the hospital. Thinking she would change from an ugly duckling to a noble swan and live happily ever after with her real family, reality strikes her in the face. \r\n\r\nThe other girl, Xiao Jinning, who had taken her family, her fiancé and everything else from her, uses every mean possible to frame her up, so when she returns to her biological parents, she finds her parents despising her while still doting on Xiao Jinning. Framed as a thief, she is expelled from the family and as soon as she walks out the door, she gets hit by a car and her spirit dies a miserable death thanks to Xiao Jinning. \r\n\r\nMeanwhile, Tang Xi, a real princess, the heiress of the powerful Empire Group, is murdered by her greedy relatives. When she opens her eyes again, she finds herself in another girl’s body. She has become Xiao Rou and has a magic system—008 in her body! With the help of 008, she begins her journey for revenge. She would avenge poor Xiao Rou, punish her murderers, become the most famous star, and… make up with her true love—Qiao Liang.>"
}