{
	"url": "https://www.novelupdates.com/series/quickly-recommend-me-a-vtuber-the-beautiful-girl-in-the-class-vtuber-throws-me-a-superchat/",
	"title": "Quickly Recommend me a Vtuber! ~The Beautiful Girl in the Class, Vtuber Throws Me a Superchat~ - Novel Updates",
	"image": "https://www.novelupdates.com/img/noimagefound.jpg",
	"noveltype": "(JP)",
	"genre": "Comedy   Gender Bender   Harem   Romance   School Life   Sci-fi   Slice of Life   ",
	"tags": "Appearance Changes   Chat Rooms   Futuristic Setting   Game Elements   Gamers   Hiding True Identity   Male Protagonist   Male to Female   Misunderstandings   Obsessive Love   Secret Crush   Secret Identity   Secretive Protagonist   Unrequited Love   Virtual Reality   Yandere   ",
	"rating": "(3.2 / 5.0, 51 votes)",
	"author": "孔明の罠   ",
	"year": "\n2020",
	"ranking": "#6970   #4766   #4530   #6710   #7595   ",
	"reviewcount": "2 Reviews sorted by",
	"description": "――Full dive VR technology has been completed and we can meet Vtuber.\n\nA high school boy, Kazuto who loves Vtuber suddenly decides to become a beautiful girl Vtuber himself.\n\nKazuto has started streaming as the beautiful girl Vtuber, Kanae with her own “super-cute female voice” and “game sense” as weapons.\n\nSince then, Kanae’s subscribers has grown steadily, but one day something unexpected happened.\n\nShe receives a super chat from Inori, the most popular Vtuber in the world. In addition, the maximum amount of 50,000 yen is used to write “Shall I give you more? I can give you as much as you want.”\n\nIn short, Inori was a big fan of Kanae.\n\nAfter that incident, their relationship as Vtubers deepened, and they finally came to be treated as “sisters” by their viewers.\n\nBy the way, the two are actually classmates.\n\nInori is actually the girl whose Kazuto confessed to and rejected him.\n\nIn other words, she is the girl who says “Eh, you like me?…I’m sorry.” and “Kanae-chan is cute!! I love you!!” in VR!\n\n―― Anyway, this is an extremely turbulent and super misunderstood love comedy where real life and VR intersect!>"
}