{
	"url": "https://www.novelupdates.com/series/reincarnated-as-an-elf-magic-swordsman-paving-a-path-to-his-peerless-harem/",
	"title": "Reincarnated as an Elf Magic Swordsman: Paving a Path to His Peerless Harem - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/11/Screenshot-38.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adult   Adventure   Fantasy   Harem   ",
	"tags": "Adventurers   Alternate World   Appearance Changes   Artifacts   Beautiful Female Lead   Charming Protagonist   Cheats   Demi-Humans   Demons   Divine Protection   Dragon Slayers   Dragons   Elemental Magic   Elves   Fantasy World   First-time Interc**rse   Game Elements   God-human Relationship   Goddesses   Handsome Male Lead   Harem-seeking Protagonist   Healers   Helpful Protagonist   Human-Nonhuman Relationship   Kind Love Interests   Love at First Sight   Love Interest Falls in Love First   Magic Formations   Male Protagonist   Nudity   Outdoor Interc**rse   Overpowered Protagonist   Polygamy   Priestesses   Protagonist Strong from the Start   R-18   Race Change   Reincarnated in Another World   Reincarnation   Saving the World   Special Abilities   Sudden Strength Gain   Sword And Magic   Sword Wielder   Threesome   Transported to Another World   Unique Weapon User   Unique Weapons   ",
	"rating": "(2.8 / 5.0, 48 votes)",
	"author": "Amakusa Shiro   天草白   ",
	"year": "\n2016",
	"ranking": "#5262   #3431   #3671   #4933   #3663   ",
	"reviewcount": "2 Reviews",
	"description": "Being the strongest when it comes to magic swords, being handsome and youthful, being peerless in bed, being the luckiest when it comes to women, and being from the race of the long-lived elves.\n\nLian is reincarnated into another world with these five cheat-like traits, gifted to him by the goddess of the otherworld after his death. Using these unparalleled skills, as well as his good looks and abilities, he completed various difficult quests as an adventurer, all while seducing the beautiful female adventurers he meets along the way. In time, this quickly made him rise to the highest ranks, and he was able to build the harem of his dreams.\n\nHowever, the path to greatness is always a rough one, much more in another world, where everyone is never safe. After a while, Lian finds out the existence of the powerful and tyrannical dark elf, Redoni, who possesses an ancient magic weapon and has used them to destroy many countries in his wake.\n\nAs the strongest magic swordsman, Lian vowed to defeat Redoni and restore the peace of this world. He gathered all his party consisting of beautiful women, whom all he has formed naughty bonds with, and together with the goddess’ powerful blessing, they began to challenge the dark elf to the biggest battle that they could ever imagine.\n\nWill Lian be able to destroy the enemy’s ancient magic weapon and save the world? Or will he fail and lose everything to his adversary? The path to an unparalleled harem of the elf magic swordsman awaits!>"
}