{
	"url": "https://www.novelupdates.com/series/bai-fumei-in-the-70s/",
	"title": "Bai Fumei in the ’70s - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/10/Bai-Fumei-in-the-s.jpg",
	"noveltype": "(CN)",
	"genre": "Drama   Josei   Romance   Slice of Life   ",
	"tags": "Animal Rearing   Beautiful Female Lead   Business Management   Calm Protagonist   Caring Protagonist   Confident Protagonist   Cooking   Devoted Love Interests   Doting Love Interests   Easy Going Life   Familial Love   Family   Female Protagonist   First-time Interc**rse   Handsome Male Lead   Hard-Working Protagonist   Heartwarming   Modern Day   Multiple Reincarnated Individuals   Poor to Rich   Pregnancy   Previous Life Talent   Proactive Protagonist   Protagonist Falls in Love First   Second Chance   Secret Relationship   Tragic Past   Twins   ",
	"rating": "(4.6 / 5.0, 422 votes)",
	"author": "Sù mèi píng shēng   素昧平生   ",
	"year": "\n2018",
	"ranking": "#711   #610   #1225   #383   #946   ",
	"reviewcount": "124 Reviews sorted by",
	"description": "The villager who was so poor that he couldn’t afford a bride price, did not learn to do anything, and was idle, actually got a beautiful and rich wife from the city!\n\nThe beautiful and rich Bai (white) Fu (rich) Mei (beautiful), Zhao Lanxiang was reborn, and the first thing she did when she woke up was to find her husband in a hurry.\n\nIn their last life, they met each other in their later years, he had suffered through the ups and downs in life, and she was scarred. They warmed and healed each other in their remaining years.\n\nIn this life, she decided to give this man a good beginning, help him avoid the hidden arrows, and walk onto the bright road!\n\nHowever… who could tell her why her steady, refined husband is actually such a cold, fierce, and thorny bully as a young man?\n\nThe rough man impatiently pressed the Bai Fumei into the cornfield, patted her tender face, and said fiercely: “You know, you can’t run away if you mess with me again.”>"
}