{
	"url": "https://www.novelupdates.com/series/master-of-science-and-technology/",
	"title": "Master of Science and Technology - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/05/MasterScienceTech3.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Comedy   Fantasy   Martial Arts   Sci-fi   Xuanhuan   ",
	"tags": "Alchemy   Artificial Intelligence   Clones   Cultivation   Dragons   Genetic Modifications   Heavenly Tribulation   Jack of All Trades   Magical Space   Male Protagonist   Modern Knowledge   Outer Space   Pill Based Cultivation   Pill Concocting   Poor to Rich   Sect Development   Technological Gap   Transmigration   Transported to Another World   Virtual Reality   Weak to Strong   World Travel   ",
	"rating": "(3.0 / 5.0, 27 votes)",
	"author": "Great Sleepwalker   大梦游家   ",
	"year": "\n2016",
	"ranking": "#2000   #2000   #6948   #8107   #8365   ",
	"reviewcount": "4 Reviews sorted by",
	"description": "The flicker and a lonely soul named Ye Zan came to the world that seeks immortality through civilization progress. He thought that he could enlighten everybody, but nowadays people are neglecting it.\r\n\r\nThe remnant soul even named itself “The lonely soul of Dao Zu’- but still could not find the body that was ready to incarnate it. “Well’ it thought, “ I still have technologies!”.\r\n\r\nDo I need to master anything? SO EASY! I could just surf it on the internet.\r\n\r\nDo I want to be a genius? SO EASY! I Just need to get some genes of genius.\r\n\r\nDo I want to go around the world? SO EASY! I just need to launch my own satellite!\r\n\r\nEverything is SO EASY here! -Alchemy, refining, magic symbols, different lifestyles- with the help of technology, they are SO EASY!\r\n\r\nTechnologies are not a panacea, but technologies can make life better, so Ye Zan decided to put down his roots in this weird place. Science and technology can strengthen the country, science and technology can also strengthen the spirit, Watch the journey of a lonely wandering soul under Ye Zan’s control and witness- what it takes to become a real master of science and technology.>"
}