{
	"url": "https://www.novelupdates.com/series/i-became-the-servant-who-received-the-crown-princes-obsession/",
	"title": "I Became The Servant Who Received The Crown Prince’s Obsession - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/03/I-Became-The-Crown-Princes-Obsessive-Servant.jpg",
	"noveltype": "(KR)",
	"genre": "Drama   Fantasy   Romance   ",
	"tags": "Aristocracy   Beautiful Female Lead   European Ambience   Female Protagonist   Handsome Male Lead   Nobles   Obsessive Love   Omegaverse   Possessive Characters   R-15   Royalty   Transmigration   ",
	"rating": "(3.7 / 5.0, 61 votes)",
	"author": "칼리앤   ",
	"year": "\n2022",
	"ranking": "#1683   #1393   #4540   #4382   #4130   ",
	"reviewcount": "5 Reviews sorted by",
	"description": "I was possessed by a 19-rated omegaverse BL adult novel.\n\nI’m not a bottom, not an omega, I’m just a woman. It means nothing but scraps.\n\nHowever, perhaps it was a joke of the original novel, but I suddenly took care of the crown prince. I’m a caregiver who looks like don’t even have a name for the position.\n\nI had so much work that I have never been home before.\n\n“Your highness, I’m going home now.”\n\n“You would encounter some difficulties on a night journey. Why don’t you just take a break here?”\n\n“…what?”\n\n“Let’s see. I’m a little sorry to make you sleep on the couch. I need to make room for Edith to rest.”\n\nI don’t need a place to rest.\n\nPlease let me go home!\n\n“Would you rather use my bed?”\n\n“No, sir.”\n\n“I’ll sleep on the couch. Take it easy.”\n\nIt’s a pitiful caregiver life where she have been pushed by His Highness The Crown Prince (a.k.a. rotten X) and forced to sleep in one room.\n\n* * *\n\n“How can this be the scent of Beta? I can’t believe it.”\n\nHe murmured close to Edith’s abdomen.\n\n“I am Beta.”\n\n“I’m not sure. Is that true?”\n\nEdith was neither sitting nor standing, she was being pressed by Clyde. When she wriggle, she lost her balance, pushed by her reckless action.\n\nJust before she collapsed, her fingers dug deep into his deep blue hair.\n\nIt was a reflective act, and she didn’t mean to provoke him. But Clyde was as shocked as if he had been stabbed by a sword.\n\nSuddenly, the Alpha’s body twitched for a moment.\n\nHe tilted his head back with animal movements and glared at her with sullen. There was a strange energy around him. It was an area that Edith couldn’t understand.\n\n“Is this a sign that you want to be eaten by me?”>"
}