{
	"url": "https://www.novelupdates.com/series/the-jealous-ceo-treats-me-hypocritically/",
	"title": "The Jealous CEO Treats Me Hypocritically - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/12/The-Jealous-CEO-Treats-Me-Hypocritically_1608609312.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Drama   Romance   Supernatural   Yuri   ",
	"tags": "Dense Protagonist   Female Protagonist   Hard-Working Protagonist   Modern Day   Money Grubber   Mystery Solving   Slow Romance   Transmigration   Tsundere   ",
	"rating": "(4.4 / 5.0, 35 votes)",
	"author": "Jiujiu Ya   久久呀   ",
	"year": "\n2020",
	"ranking": "#3133   #2548   #6076   #5744   #6918   ",
	"reviewcount": "6 Reviews sorted by",
	"description": "When Shu Yian woke up, she unexpectedly found herself transmigrated into a novel and gained the ability to read minds.\r\n\r\nThe system tells her: she is currently the fiancée of the female lead and must stay with the female lead at all times to prevent the other female rivals from climbing into the female lead’s bed. Only when the true protagonist, the true goddess of the novel, returns can Shu Yian successfully complete her mission and leave this world.\r\n\r\nShu Yian wholeheartedly focused on completing her mission. All women who approached Su Wen with unkind intentions were driven away by her.\r\n\r\nHowever….every time she managed to drive away a rival, she would hear Su Wen complain. Complain inside her heart that is.\r\n\r\n“Heh, does this jealous woman like me that much? Give up already, I will never fall for you! The only person that I feel goodwill towards is that one webcomic author who draws cartoons that soothes the heart. A pity she hasn’t shown her face yet.”\r\n\r\nShu Yian: “.....”\r\n\r\nShould I tell her the person she likes is actually just one of my many identities?\r\n\r\nAfter Shu Yian stopped chasing her, Su Wen, who had always hated Shu Yian in every possible way, suddenly felt empty inside. Then she learned about Shu Yian’s other identities.\r\n\r\nIn the wealthy and elite circle, she is the most respected fortune teller.\r\n\r\nOn the internet, she is a famous Yuri author that everyone loves and hates. She is famous for her novel, 《The Domineering President Insists on Loving Me》and other cliche, dog-blooded stories just like that one.\r\n\r\nAnd the artist known for drawing webcomics that soothes the heart….is also Shu Yian.\r\n\r\nSu Wen: “I, the domineering female President, wants to chase you. What are you gonna do about it?”>"
}