{
	"url": "https://www.novelupdates.com/series/doomsday-wonderland/",
	"title": "Doomsday Wonderland - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2017/04/Doomsday-Wonderland.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Horror   Mystery   Supernatural   ",
	"tags": "Adapted to Manhua   Apocalypse   Appearance Changes   Artifacts   Automatons   Confident Protagonist   Dystopia   Female Protagonist   Game Elements   Ghosts   Hidden Abilities   Level System   Modern Day   Monsters   Multiple Realms   Sentient Objects   Spatial Manipulation   Special Abilities   Survival Game   Thriller   Transported to Another World   Unique Weapon User   Weak to Strong   World Hopping   World Travel   ",
	"rating": "(4.1 / 5.0, 414 votes)",
	"author": "Beards And Tails   N. Heller   须尾俱全   ",
	"year": "\n2014",
	"ranking": "#6970   #2000   #1156   #10476   #1728   ",
	"reviewcount": "70 Reviews sorted by",
	"description": "“I think… my boyfriend is trying to kill me,” Lin Sanjiu muttered.\n\nAs she thought about that rich, handsome, and gentle boyfriend of hers, she could not help but tremble all over.\n\nAt the present, someone close to her had personally raised the curtains to an apocalyptic hell, and slowly, it was creeping up to her.\n\n—-\n\nWhat if earth devolved into a apocalyptic hellhole? What if you found out you not only have to survive just one apocalyptic event but have to struggle through multiple worlds with different end-world scenarios? And you get to meet more superpowered crazies than you can imagine!\n\nPresenting the worst nightmare that your weird doomsday prepper neighbour with a bunker full of canned beans could have, Doomsday Wonderland is a novel filled with subverted tropes, non-OP characters and a female friendly label which offends all politically correct fanatics.\n\nAs ‘lucky’ humans evolved to posthumans with the ability to adapt to the New World or mutate into disgusting duoluozhongs to survive, follow Lin Sanjiu as she struggles through multiple challenges to just live one more day… and make sense of this New World that will no longer be the same.>"
}