{
	"url": "https://www.novelupdates.com/series/sha-qing/",
	"title": "Sha Qing - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2018/02/Sha-Qing.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Mature   Mystery   Psychological   Yaoi   ",
	"tags": "Adapted to Drama CD   Antihero Protagonist   Character Growth   Charismatic Protagonist   Charming Protagonist   Crime   Criminals   Detectives   Enemies Become Allies   Enemies Become Lovers   Investigations   Manipulative Characters   Manly Gay Couple   Mismatched Couple   Multiple POV   Multiple Protagonists   Police   Power Couple   Revenge   Reversible Couple   Righteous Protagonist   Rivalry   Secret Identity   Serial Killers   Smart Couple   Thriller   Unreliable Narrator   ",
	"rating": "(4.5 / 5.0, 125 votes)",
	"author": "Wú Yì   无射   ",
	"year": "\n2018",
	"ranking": "#3017   #2723   #3808   #9891   #1768   ",
	"reviewcount": "17 Reviews sorted by",
	"description": "He uses desire to ensnare others, he uses blood as temptation, he uses his appearance as a disguise. Like a wolf, he hunts for prey in the shadows. He is among the FBI’s most wanted list of serial killers. He lives by his own law, the Lex Talionis. He does things his own way, independent and reckless. He gave himself his own name: Sha Qing\n\n————\n\nThe first time the two officially met:\n\n“The purpose of the prison is not to destroy people’s lives; it’s meant to replace the broken chains of law and morality, to bind the beast in their hearts again, until it is completely subdued,” said Leo.\n\n“Everyone has beasts in their hearts, agent, and so do you.” Sha Qing extended an index finger and pointed at Leo’s heart.\n\n“Yes, but unlike you, I will use those iron chains to lock it tightly in a cage.”\n\n“It’s not as easy as you think, Leo. Things are always changing, and often beyond your control …”\n\nWith his blood-stained lips, he suddenly kissed the stunned FBI agent.\n\nThe salty bloody taste spread in their mouth and the fiery contact was enough to burn the tips of their tongues.\n\nLeo’s eyes suddenly felt heavy, but his face did not show any irritation from being calculated upon. \n\n“Did you also count this?” He raised his wrist with effort, then closed his eyes.\n\nSha Qing looked down and saw that a pair of steel handcuffs had fastened his left wrist with the other’s right arm. \n\nHe lowered his head and kissed the sleeping man’s wet, dusty hair, and said in a soft voice: \n\n“Goodbye, brave young lion.” \n\nHe then dislocated his own hand to remove the shackles that bound them together. \n\nSha Qing stood up and walked away, until his figure disappeared into the darkness…>"
}