{
	"url": "https://www.novelupdates.com/series/online-dating-boyfriend-is-actually-an-alien/",
	"title": "Online Dating Boyfriend Is Actually An Alien - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/11/Online-Dating-Boyfriend-Is-Actually-An-Alien.png",
	"noveltype": "(CN)",
	"genre": "Fantasy   Mecha   Romance   School Life   Sci-fi   Shounen Ai   ",
	"tags": "Caring Protagonist   Character Growth   Childhood Friends   Cold Love Interests   Cute Protagonist   Death   Death of Loved Ones   Devoted Love Interests   Doctors   Doting Love Interests   Doting Older Siblings   Doting Parents   Familial Love   First Love   Futuristic Setting   Handsome Male Lead   Kind Love Interests   Lovers Reunited   Medical Knowledge   Modern Day   Naive Protagonist   Online Romance   Pharmacist   Royalty   Sickly Characters   Slow Romance   Strong Love Interests   Time Skip   Tragic Past   Unconditional Love   Weak to Strong   World Travel   ",
	"rating": "(4.4 / 5.0, 115 votes)",
	"author": "Zhi Tang   稚棠   ",
	"year": "\n2021",
	"ranking": "#3133   #3839   #3682   #2283   #3011   ",
	"reviewcount": "16 Reviews sorted by",
	"description": "My WeChat friend… he might not be human.\n\nJian Mei added a WeChat friend by accident. The other party didn’t follow any celebrities or surf the internet, living as if he were in ancient times. Jian Mei cherished this friendship, even if the other party was exceptionally cold and seemed… a little abnormal.\n\nJian Mei: “I had fried chicken and a hamburger today. What about you?”\n\nThe other party: “Nutrient solution.”\n\nJian Mei: “I usually like playing games and watching movies. What about you?”\n\nThe other party: “Assembling mechas and reading  memorials to the throne.”\n\nJian Mei: ?\n\nIn the 26th year of Xingyuan’s establishment, the universe entered an era of rapid development. Lu Xingwang, the third prince of the strongest planet, Stan Star, was weak and sickly. He was criticized by the outside world for his physique. He had a dark personality and never communicated with the outside world.\n\nOne day.\n\nLu Xingwang found that his communication terminal would inexplicably receive strange chat messages.\n\nAlthough boring, the strange sticker packs and wordy nonsense slowly became his only hope through his dark years.\n\nIn the 29th year of Xingyuan’s establishment.\n\nThe royal family was in turmoil, and the Third Prince Lu Xingwang was formally established as the crown prince.\n\nIt should have been the liveliest of time, but the only issue was that the person who had always reached out to him every day seemed to have lost contact. There was no news from him anymore.\n\nUntil a year later.\n\nHis Highness, the Crown Prince, unexpectedly saw a missing person report on the interstellar network: “Lu Dazhuang from an unknown planet, your friend Jian Mei is anxiously looking for you. If you see this message, please call us.”\n\nLu Xingwang: “……”\n>"
}