{
	"url": "https://www.novelupdates.com/series/isekai-maou-to-shoukan-shoujo-dorei-majutsu/",
	"title": "Isekai Maou to Shoukan Shoujo Dorei Majutsu - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2015/07/isekaimaou.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Comedy   Ecchi   Fantasy   Harem   Seinen   ",
	"tags": "Acting   Adapted to Anime   Adapted to Drama CD   Adapted to Manga   Adventurers   Alternate World   Animal Characteristics   Appearance Changes   Artifacts   Awkward Protagonist   Character Growth   Chuunibyou   Contracts   Demi-Humans   Demon Lord   Demons   Divination   Elemental Magic   Elves   Enemies Become Allies   Game Elements   Gods   Humanoid Protagonist   Knights   Loli   Magic   Maids   Male Protagonist   Marriage   Master-Servant Relationship   Misunderstandings   Naive Protagonist   Neet   Overpowered Protagonist   Pacifist Protagonist   Personality Changes   Polygamy   Priestesses   Protagonist Strong from the Start   R-15   Race Change   Romantic Subplot   S*aves   Slow Romance   Strong to Stronger   Summoned Hero   Sword And Magic   Transported into a Game World   Tsundere   Twisted Personality   Underestimated Protagonist   ",
	"rating": "(3.7 / 5.0, 541 votes)",
	"author": "Yukiya Murasaki   むらさきゆきや   ",
	"year": "\n2014\n",
	"ranking": "#5262   #6154   #425   #6879   #157   ",
	"reviewcount": "57 Reviews sorted by",
	"description": "In regards to the MMORPG Cross Reverie, Sakamoto Takuma boasted an overwhelming strength that was enough for him to be called the Demon King by the other players. One day, he gets summoned to another world with his appearance in the game. There, there are two people that insist “I am the real summon master.” Takuma gets slave-turning magic used for summoned beasts cast on him by the girls –\n\nHowever, the peculiar ability {Magic Reflection} was invoked! The ones that were turned to slaves were the girls!\n\nTakuma was bewildered. He’s the strongest magician but, he doesn’t have any social skills. Panicking, the first words that came out were the ones that he used inside the game role playing the Demon King!? “I’m amazing you say? Of course I am. I am Diablo……The one feared as the Demon King!”\n\nThis is the story the Demon King (acting) that would soon inspire the world and his other world adventure that he plunges through with his absolute strength, raise the curtain!>"
}