{
	"url": "https://www.novelupdates.com/series/rebirth-of-the-national-male-god/",
	"title": "Rebirth of the National Male God - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/05/RNMG.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Drama   Fantasy   Gender Bender   Psychological   Romance   School Life   ",
	"tags": "Androgynous Characters   Beautiful Female Lead   Clever Protagonist   Confident Protagonist   Cross-dressing   Devoted Love Interests   Doting Love Interests   Family Business   Family Conflict   Female Protagonist   Genius Protagonist   Half-human Protagonist   Handsome Male Lead   Hiding True Abilities   Hiding True Identity   Love Interest Falls in Love First   Modern Day   Older Love Interests   Power Couple   Reincarnation   Showbiz   Strong Love Interests   Strong to Stronger   Wealthy Characters   ",
	"rating": "(4.2 / 5.0, 25 votes)",
	"author": "Shuǐ Qiān Chè   水千澈   ",
	"year": "\n2017",
	"ranking": "#1698   #1958   #5980   #2618   #5089   ",
	"reviewcount": "6 Reviews sorted by",
	"description": "In her previous life, Si Huang was framed and controlled by her relatives. She was crowned as the movie emperor. However, she could only die without a burial ground.  \n\nUnexpectedly reborn, she once again returned to the starting point and obtained a unique inheritance. \n\nSi Huang touched her chin and thought: It is indeed fabulous to be reborn. She can settle all the old debts and take revenge on old enemies.  \n\nBack on the throne of the entertainment circle, she is now the first male god in the eyes of all women. \n\nWielding the power of darkness, she is the dark hand controlling everything behind the scenes. \n\nA word to decide the stock market, she is the mysterious little god of wealth in the eyes of all businessmen. \n\nA skilled punch to the enemy, she is a small overlord in the eyes of the army men. \n\nEn… what’s more, she is the apple of someone’s eyes. \n\nHowever, one day, when everyone comes to know that this person is a woman, the entire country boils! \n\nFacing a group who are rushing forth like wild bees unrestrainedly, a certain man sneers: the wife that this old man has been protecting for so long, who dares to snatch from him?  \n\n“Reporting to the boss, Li family’s young master asked Young Master Si out for a meal.”\n\n“Shut down his family’s hotel.”\n\n“Reporting to the boss, Young Master Si and Wang family’s little crown prince have fought.”\n\n“Tell the military doctor to take ‘special care’ of the patient”\n\n“Ah? But Young Master Si is alright!”\n\n“The ‘special care’ is for that one of Wang family.” \n\n“…”\n\nMany years later, the little bun pointed to the list of ‘Most Desired Men and Women’ chosen by the citizens. He looked at the man next to him with a tangled expression. \n\nA certain male put on a gentle fatherly face, “Little Treasure, what’s wrong?”  \n\nLittle bun twiddled his fingers for half a day and asked, “In the end, are you my father or my mother?”\n\nA certain male’s face instantly darkened. “Of course I’m your father!”  \n\nLittle bun earnestly said, “But they all say that dad is the male god and the male god is married to you!”\n\nA certain male: “…”>"
}