{
	"url": "https://www.novelupdates.com/series/arslan-senki/",
	"title": "Arslan Senki - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/09/Arslan-Senki.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Drama   Fantasy   Historical   Seinen   Tragedy   ",
	"tags": "Adapted to Anime   Adapted to Game   Adapted to Manga   Aristocracy   Assassins   Beast Companions   Betrayal   Calm Protagonist   Caring Protagonist   Character Growth   Classic   Conflicting Loyalties   Curses   Cute Protagonist   Divine Protection   Domestic Affairs   Evil Religions   Family Conflict   Handsome Male Lead   Hard-Working Protagonist   Identity Crisis   Kingdom Building   Kingdoms   Legends   Loyal Subordinates   Male Protagonist   Military   Mysterious Family Background   Nobles   Past Plays a Big Role   Politics   Priestesses   Revenge   Royalty   Schemes And Conspiracies   S*aves   Spear Wielder   Strategist   Survival   Sword And Magic   Sword Wielder   Teamwork   War Records   Wars   Weak to Strong   ",
	"rating": "(4.3 / 5.0, 51 votes)",
	"author": "Tanaka Yoshiki   ",
	"year": "\n1986\n",
	"ranking": "#2000   #2000   #7066   #11908   #4564   ",
	"reviewcount": "3 Reviews sorted by",
	"description": "After an unexpected and devastating loss at the Battle of Atropatene, the Crown Prince of Pars must gain new strength and make new allies to retake his lost kingdom. The 14-year-old Arslan has been sheltered for most of his life, but now must face the challenges of warfare, betrayal, politics and something even more sinister looming on the horizon.\n\nWith the help of a few loyal followers, Arslan quickly learns that nothing is ever as it seems on the surface. His own family history, the identity of the masked stranger trying to kill him, and the cause of increasingly strange supernatural events are all mysteries to be solved.\n\nSet in a fictional representation of ancient Persia, this classic story (from Japanese author Dr. Yoshiki Tanaka) combines political intrigue, military tactics, and fantasy.>"
}