{
	"url": "https://www.novelupdates.com/series/koibito-daiko-no-baito-o-hajimeta-ore-nazedarou-fukusu-no-bishojo-kara-shimei-irai-ga-haitte-kuruln/",
	"title": "Koibito Daikō no Baito o Hajimeta ore, Nazedarou… Fukusū no Bishōjo Kara Shimei Irai ga Haitte Kuru (LN) - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/10/Koibito-Daik-no-Baito-o-Hajimeta-ore-Nazedarou-Fukus-no-Bishjo-Kara-Shimei-Irai-ga-Haitte-Kuru-LN_1635474582.jpg",
	"noveltype": "(JP)",
	"genre": "Comedy   Drama   Romance   School Life   ",
	"tags": "Absent Parents   Appearance Changes   Beautiful Female Lead   Blind Dates   Brother Complex   Calm Protagonist   College/University   Handsome Male Lead   Hard-Working Protagonist   Love Interest Falls in Love First   Male Protagonist   Mature Protagonist   Part-Time Job   Pretend Lovers   Shy Characters   Siblings   Younger Love Interests   ",
	"rating": "(4.2 / 5.0, 59 votes)",
	"author": "Natsuno Minoru   Noushuku Kangen Budou-chan   夏乃実   濃縮還元ぶどうちゃん   ",
	"year": "\n2020",
	"ranking": "#5262   #2000   #5315   #7991   #4962   ",
	"reviewcount": "9 Reviews sorted by",
	"description": "This sense of distance――\n\nIt's sad and frustrating.\n\nRyoma Shiba, a University student who lacks money, searches for a part-time job with a high hourly wage. On the other hand, Himeno Kashiwagi is a girl who proclaims she has no interest in love but wants a boyfriend.\n\nAt the same time, they both hear about 'Lover agent' from their friends and immediately register, unexpectedly scheduling a date with each other.\n\nOn the day of their first meeting, they were both nervous, but despite that, they held hands and drank tapioca, passing the time as a couple would.\n\nIn the midst of this, Himeno's friend discovers them, and the situation gets awkward. When Himeno had trouble explaining, Ryoma lies, saying they were 'dating'.\n\nRyoma acts as a real boyfriend, making Himeno's heart pound...\n\nThis is a real love story that begins with a rental relationship.>"
}