{
	"url": "https://www.novelupdates.com/series/the-black-tech-monopoly-corporation/",
	"title": "The Black Tech Monopoly Corporation - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/12/The-Black-Tech-Monopoly-Corporation.jpg",
	"noveltype": "(CN)",
	"genre": "Fantasy   ",
	"tags": "Artificial Intelligence   Cold Protagonist   Easy Going Life   Evil Protagonist   Game Ranking System   Male Protagonist   Mutations   Parallel Worlds   Psychic Powers   Saving the World   Technological Gap   World Hopping   World Travel   ",
	"rating": "(3.3 / 5.0, 11 votes)",
	"author": "East Sea Boar Demon   ",
	"year": "\nN/A",
	"ranking": "#2000   #2000   #9563   #12295   #12775   ",
	"reviewcount": "5 Reviews sorted by",
	"description": "Where would the very limit of development achievable by a private enterprise be? \r\n\r\n \r\n\r\nBeing listed among the top 500 in the country? Being listed among the the top 500 in the world? Or, becoming a boss-level entity that transcends nations, ruling the world as de facto rulers, just like those companies listed below? \r\n\r\n \r\n\r\nThe Umbrella Corporation in ‘Resident Evil’, the Weyland-Yutani Corporation in ‘Alien’, the Concordance Extraction Corporation in ‘Dead Space’, Gentek in ‘Prototype’, Vault-Tec in ‘Fallout’, the Shinra Company in ‘Final Fantasy 7’… \r\n\r\n \r\n\r\nZhang Heng’s goal was to have his company listed among all those giants mentioned above, even eclipsing all of them in terms of size and achievements. \r\n\r\n \r\n\r\nRegular people might not be able to achieve such a goal, but what about a person who possess all of that ‘black tech’ developed by the aforementioned corporate entities? \r\n\r\n \r\n\r\nThe company named ‘Stellar Biotech Corporation’ is founded by one such person, a man who goes on a crusade of monopolizing all aspects of development of civilization—medicine, biology, physics, philosophy, you name it—at an unprecedented rate, eventually becoming a goliath that would transcend nations and monopolize every single aspect of human technological development!>"
}