{
	"url": "https://www.novelupdates.com/series/im-the-ex-girlfriend-of-a-soldier/",
	"title": "I’m The Ex-Girlfriend of a Soldier - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/08/exgirlofsolja1.jpg",
	"noveltype": "(KR)",
	"genre": "Comedy   Drama   Fantasy   Josei   Psychological   Romance   Shoujo   ",
	"tags": "Adapted to Manhwa   Beautiful Female Lead   Black Belly   Calm Protagonist   Clever Protagonist   Demon Lord   Demons   Determined Protagonist   Devoted Love Interests   Doting Love Interests   Fantasy Creatures   Fantasy World   Female Protagonist   Handsome Male Lead   Hard-Working Protagonist   Heroes   Human-Nonhuman Relationship   Love Interest Falls in Love First   Loyal Subordinates   Magic   Male Yandere   Marriage   Master-Servant Relationship   Multiple POV   Obsessive Love   Parody   Past Plays a Big Role   Persistent Love Interests   Possessive Characters   Reincarnated in Another World   Reincarnation   Royalty   Strong Love Interests   ",
	"rating": "(4.3 / 5.0, 116 votes)",
	"author": "송설림   ",
	"year": "\n2018",
	"ranking": "#2000   #2000   #3507   #798   #1421   ",
	"reviewcount": "6 Reviews sorted by",
	"description": "I’d been reincarnated as the heroine of a predictable third-rate harem novel. I decided to live as the heroine and enjoy my comfortable life with the hero… but what kind of romance is this?! Having a soldier for a boyfriend, there was a constant stream of women surrounding him... and all kinds of incidents occurred. So now I was trying my best to live a normal life. I broke up with my boyfriend and married a man I’d met during a blind date but… What? My husband is the demon king?\r\n\r\n“Ha, what do you have your guard up for? Are you scared that I’m going to do something to you? I can see that you’re scared.”\r\n\r\n“Why would I be scared?”\r\n\r\n“What?”\r\n\r\n“What would you be able to do to me? Don’t flatter yourself, I’m just uncomfortable.”\r\n\r\n“I want you to be mine, but that seems to be impossible.”\r\n\r\n…. No matter how much I think about this, everything seems to be wrong.>"
}