{
	"url": "https://www.novelupdates.com/series/the-white-haired-imperial-concubine/",
	"title": "The White-Haired Imperial Concubine - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/06/37bad69f14614cb178f49b1afb841c6e.jpg",
	"noveltype": "(CN)",
	"genre": "Drama   Historical   Mature   Romance   Shoujo   Tragedy   Xianxia   ",
	"tags": "Adapted to Drama   Arranged Marriage   Cold Love Interests   Cold Protagonist   Female Protagonist   First Love   First-time Interc**rse   Generals   Loneliness   Love Interest Falls in Love First   Love Triangles   Low-key Protagonist   Manipulative Characters   Revenge   Royalty   Second Chance   Secret Identity   Secrets   Time Travel   Transmigration   ",
	"rating": "(3.7 / 5.0, 66 votes)",
	"author": "Mo Yan Shang   莫言殇   ",
	"year": "\n2018",
	"ranking": "#4080   #3528   #5082   #6111   #5498   ",
	"reviewcount": "9 Reviews sorted by",
	"description": "Within the red tent, under the passionate eyes of the man on top, she was forced to make love and three thousand black strands turned to white.\r\n\r\nOutside the red tent, her husband laughed and drank with the beauties by his side as they watched…\r\n\r\nWhen the red was torn, pieces of it were carried away by the wind. As she stepped out with difficult steps, the silver hair danced in the wind. Exactly whose heart was the one that was hurt in the end?\r\n\r\n“How…how could it be you?” A voice filled with disbelief, he who always believed himself to be cold and unfeeling, fell into the pits of hell, filled with pain and regret for eternity.\r\n\r\nFor this imperial power, there are countless hidden plots. She hid her capabilities and bided her time, only desiring for a safe haven. In the end, her wish did not come true, and she fell into the hands of someone else as a chess piece.\r\n\r\nThe tale of a time-traveling woman who gets forced to the point of no return, turning her black hair into white. Should she bow to her fate and submit? Or should she fight back and glow brilliantly?>"
}