{
	"url": "https://www.novelupdates.com/series/teacher-caught-up-in-class-summoning-repairs-mechanical-girl-with-unorthodox-skills/",
	"title": "Teacher Caught up in Class Summoning, Repairs Mechanical Girl With Unorthodox Skills - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/10/Teacher-caught-up-in-class-summoning-repairs-mechanical-girl-with-unorthodox-skills.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Comedy   Fantasy   Shounen   ",
	"tags": "Adapted to Manga   Androids   Cheats   Demon Lord   Demons   Fantasy World   Heroes   Magic   Male Protagonist   Mature Protagonist   Multiple Transported Individuals   Royalty   Sword And Magic   Transported to Another World   ",
	"rating": "(2.7 / 5.0, 23 votes)",
	"author": "さとう   ",
	"year": "\n2018",
	"ranking": "#6970   #6382   #5931   #11313   #7532   ",
	"reviewcount": "2 Reviews sorted by",
	"description": "Aizawa Seiji, an ordinary teacher, finds himself transported to another world with his entire class.\n\nIn that other world, demon kings are running amok and “the power of young and brave warriors” is needed to subjugate them. However Seiji is 28 years old, so he cannot be considered as a “young and brave warrior” and he ends up becoming a burden for the class.\n\nEach of the students is given an ability called a “cheat,” but Seiji’s cheat is called “Repair,” which allows him to fix broken things and for some reason his power doesn’t work.\n\nSeiji and his students went to an ancient ruin to train by killing monsters, but in order to protect the student from the sudden attack of a minotaur, Seiji acts recklessly and is left behind alone.\n\nWhen Seiji confronts the minotaur prepared to die his cheat activates, and he repairs the “broken android maiden Brunnhilde” who suddenly appeared from the ancient ruins.\n\nBrunnhilde, who has defeated the Minotaur with her overwhelming power and calls Seiji her master, and when they escape from the ruins, they find themselves in an unknown land.\n\nSeiji takes Brunnhilde with him on an adventure through another world, in order to return to his students.\n\nThis is the story of a humble teacher and a mechanical girl who travel around fixing broken things.>"
}