{
	"url": "https://www.novelupdates.com/series/i-have-a-crush-i-want-to-talk-to-you/",
	"title": "I Have a Crush I Want to Talk to You - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/09/I-have-a-crush-I-want-to-talk-to-you.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Romance   School Life   ",
	"tags": "Adapted to Drama   Adapted to Drama CD   Beautiful Female Lead   Female Protagonist   Handsome Male Lead   Modern Day   ",
	"rating": "(4.0 / 5.0, 1 votes)",
	"author": "Flower Morning   Hua Qing Chen   花清晨   ",
	"year": "\n2018",
	"ranking": "#3133   #2000   #13736   #6884   #13171   ",
	"reviewcount": "No Reviews",
	"description": "Hey, let’s have a crush together.\n\nThe nervous student Xu Jingjing has a crush on the school grass Gao Zhan, and the academic tyrant Kang Jiawei nicknamed “Instant Noodles” has a crush on the goddess Xu Jingjing.\n\nIn order to get close to her favorite male god, Xu Jingjing separated Gao Zhan and Xu Jingjing, and formed a “secret love front alliance” with Kang Jiawei – she urged him to lose weight and inspired him to pursue Xu Jingjing;\n\nAnd Kang Jiawei helped her review her homework, which made her grades improve by leaps and bounds. The relationship between the two has undergone subtle changes in the process of helping each other, which seems to go beyond friendship…\n\nUntil the death of Kang’s father, Kang Jiawei left without saying goodbye to the United States, and this hazy relationship ended without a trace.\n\nAt the class reunion eight years later, “Instant Noodles” counterattacked gorgeously and turned into a tall, rich and handsome real estate developer. He decided to make up for the regrets eight years ago and made a belated confession——\n\nKang Jiawei: “I like you, Jingjing. Be my girlfriend.”\n\nXu Jingjing: “Why do you think that I will be your girlfriend in eight years? What if I have a boyfriend?”\n\nKang Jiawei: “It doesn’t matter, if you have a boyfriend, I will find a way to make him an ex.>"
}