{
	"url": "https://www.novelupdates.com/series/grocery-store-no-514/",
	"title": "Grocery Store No.514 - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/04/Grocery-Store-No.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Fantasy   Horror   Shounen Ai   Supernatural   ",
	"tags": "Blind Protagonist   Disabilities   Ghosts   Handsome Male Lead   Hard-Working Protagonist   Investigations   Loyal Subordinates   Manly Gay Couple   Misunderstandings   Modern Day   Multiple POV   Murders   Mystery Solving   Police   Protagonist Strong from the Start   Seeing Things Other Humans Can't   Seme Protagonist   Special Abilities   Store Owner   Underestimated Protagonist   ",
	"rating": "(4.2 / 5.0, 70 votes)",
	"author": "晴川泪相思   ",
	"year": "\n2020",
	"ranking": "#931   #1367   #4352   #1469   #3364   ",
	"reviewcount": "3 Reviews sorted by",
	"description": "Ling Huaan possessed peculiar eyes. He couldn’t see the living, but he has the ability to see ghosts. He runs a small supermarket with his profit obviously earned from the living people. But in fact, his massive income actually comes from finding out the cause of death of the wronged souls and helping them enter the cycle of reincarnation.\n\nThere is a saying that has been circulating in the Underworld:\n\nThe grocery store’s door is open. Ghosts must not come in if they have no money!\n\nJiang Chengyan is the captain of the criminal investigation team of Yuncheng Municipal Bureau.\n\nHe is busy everyday, and often works overtime. His dinner would mostly be instant noodles he had bought from the supermarket near the gate.\n\nBut every time he went out shopping, he would always sense the gloomy atmosphere surrounding the market. But he’s a firm atheist, so it‘s reasonable for him to go. (Actually, I think the supermarket owner is quite a good-looking fellow and has good disposition.)\n\nBy an incidental chance, Ling Huaan suddenly received a huge order. If he could do it, he will no longer have to worry about food and clothing in his lifetime. But it’s quite difficult, thus, Ling Hua’an naturally approached Jiang Chengyan.\n\nAfterwards, Jiang Chengyan who is a firm atheist, had his three views broken, and it was really sweet…>"
}