{
	"url": "https://www.novelupdates.com/series/lord-of-the-mysteries/",
	"title": "Lord of the Mysteries - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2018/11/Lord-of-the-Mysteries.jpeg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Comedy   Fantasy   Horror   Mature   Mystery   Psychological   Supernatural   Xuanhuan   ",
	"tags": "Ability Steal   Absent Parents   Acting   Adapted to Anime   Adapted to Drama CD   Adapted to Manhua   Alchemy   Alternate World   Ancient Times   Aristocracy   Artifacts   Assassins   Award-winning Work   Calm Protagonist   Caring Protagonist   Cautious Protagonist   Character Growth   Clever Protagonist   Comedic Undertone   Cooking   Cunning Protagonist   Curses   Dark   Death   Death of Loved Ones   Destiny   Detectives   Determined Protagonist   Dolls/Puppets   Dragons   Eidetic Memory   Elves   Evil Gods   Evil Organizations   Evil Religions   Eye Powers   Familial Love   Family   Fantasy Creatures   Fantasy World   Fast Learner   Firearms   Ghosts   God Protagonist   Goddesses   Godly Powers   Gods   Hard-Working Protagonist   Harsh Training   Hidden Abilities   Hiding True Abilities   Hiding True Identity   Hunters   Immortals   Industrialization   Kingdoms   Lost Civilizations   Lucky Protagonist   Magic   Male Protagonist   Manipulative Characters   Mature Protagonist   Mind Break   Mind Control   Misunderstandings   Money Grubber   Monsters   Multiple Identities   Multiple POV   Multiple Realms   Multiple Reincarnated Individuals   Murders   Mutated Creatures   Mysterious Past   Mystery Solving   Mythical Beasts   Mythology   Nightmares   Nobles   Parasites   Past Plays a Big Role   Pets   Philosophical   Pirates   Police   Polite Protagonist   Proactive Protagonist   Protagonist with Multiple Bodies   Puppeteers   Religions   Resurrection   Righteous Protagonist   Saints   Schemes And Conspiracies   Sealed Power   Secret Identity   Secret Organizations   Secrets   Sentient Objects   Shapeshifters   Skill Assimilation   Slow Growth at Start   Souls   Special Abilities   Spirits   Strategic Battles   Thriller   Time Skip   Transformation Ability   Transmigration   Transplanted Memories   Trickster   Unique Cultivation Technique   Vampires   Wars   Weak to Strong   Wealthy Characters   Werebeasts   Zombies   ",
	"rating": "(4.7 / 5.0, 1429 votes)",
	"author": "Cuttlefish That Loves Diving   爱潜水的乌贼   ",
	"year": "\n2018",
	"ranking": "#1171   #711   #668   #1485   #288   ",
	"reviewcount": "317 Reviews",
	"description": "With the rising tide of steam power and machinery, who can come close to being a Beyonder? Shrouded in the fog of history and darkness, who or what is the lurking evil that murmurs into our ears? \n\nWaking up to be faced with a string of mysteries, Zhou Mingrui finds himself reincarnated as Klein Moretti in an alternate Victorian era world where he sees a world filled with machinery, cannons, dreadnoughts, airships, difference machines, as well as Potions, Divination, Hexes, Tarot Cards, Sealed Artifacts… \n\nThe Light continues to shine but mystery has never gone far. Follow Klein as he finds himself entangled with the Churches of the world—both orthodox and unorthodox—while he slowly develops newfound powers thanks to the Beyonder potions. \n\nLike the corresponding tarot card, The Fool, which is numbered 0—a number of unlimited potential—this is the legend of “The Fool”.\n\nBook 1 in a series.>"
}