{
	"url": "https://www.novelupdates.com/series/transmigration-of-mian-reluctantly-becomes-his-man-wife/",
	"title": "Transmigration of Mian [Reluctantly] Becomes His Man [Wife] - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/09/Transmigration-of-Mian-Reluctantly-Becomes-His-Man-Wife.jpg",
	"noveltype": "(CN)",
	"genre": "Historical   Romance   Slice of Life   Supernatural   Yaoi   ",
	"tags": "Ancient China   Business Management   Calm Protagonist   Cautious Protagonist   Charismatic Protagonist   Childcare   Clever Protagonist   Cold Love Interests   Confident Protagonist   Cooking   Cultivation   Cunning Protagonist   Cute Children   Devoted Love Interests   Doting Love Interests   Familial Love   Family Conflict   Farming   Generals   Handsome Male Lead   Hard-Working Protagonist   Heartwarming   Love Interest Falls in Love First   Magical Space   Modern Knowledge   Older Love Interests   Pets   Poor to Rich   Power Couple   Quiet Characters   S*aves   Slow Romance   Smart Couple   Store Owner   Strong Love Interests   Time Skip   Transmigration   Twins   Weak to Strong   ",
	"rating": "(4.4 / 5.0, 359 votes)",
	"author": "怜惜凝眸   ",
	"year": "\n2017",
	"ranking": "#315   #948   #1033   #493   #927   ",
	"reviewcount": "101 Reviews sorted by",
	"description": "Qin Mian opened his eyes and found himself lying in a leaky thatched room. The problem was that he was still in his family’s villa beforehand! What's more, there was another man lying next to his leg in the quilt!\r\n\r\n'You, you, who are you?'\r\n\r\nThe man sat up quietly, his upper body exposed as looked at Qin Mian for a moment before he carried a worn out bowl with a cracked corner from the low table at the head of the bed. The man said in a muffled voice, 'Wife, drink water.'\r\n\r\nQin Mian’s eyes rolled backwards and he passed out.\r\n\r\n---\r\nTN:\r\nTitle explanation: 勉为其男 [miǎn wéi qí nán] have the same sound as 勉为其难 [miǎn wéi qí nán] which means to do something reluctantly. 勉 [miǎn] is also part of MC’s name: Qin Mian.  Also, 其[qí ] sounds the same as 妻 [qi] means wife. So, there are words plays. Basically, Qin Mian reluctantly becomes someone’s man [wife] after he transmigrated.>"
}