{
	"url": "https://www.novelupdates.com/series/everyday-the-demon-lord-is-escaping-his-marriage/",
	"title": "Everyday, the Demon Lord is Escaping His Marriage - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/05/Everyday-the-Demon-Lord-is-Escaping-His-Marriage.jpg",
	"noveltype": "(CN)",
	"genre": "Romance   Shounen Ai   Xianxia   ",
	"tags": "Ancient Times   Arranged Marriage   Charming Protagonist   Clever Protagonist   Cultivation   Death of Loved Ones   Demonic Cultivation Technique   Flashbacks   Friendship   Kidnappings   Long Separations   Misunderstandings   Multiple Reincarnated Individuals   Non-linear Storytelling   Past Plays a Big Role   Power Couple   Reincarnation   Second Chance   Strong Love Interests   Tragic Past   ",
	"rating": "(4.5 / 5.0, 110 votes)",
	"author": "Nine Treasures   玖宝   ",
	"year": "\n2020",
	"ranking": "#3710   #4673   #3914   #4748   #3074   ",
	"reviewcount": "10 Reviews sorted by",
	"description": "Everyone in the world knows that Demon Lord Hua Che was cruel and vicious. A single disagreement could cause him to slaughter someone’s entire family. \n\nWhat raised everyone’s hackles, even more, was how he had kidnapped the Immortal Lord Chu Binghuan, before shamelessly forcing him to become his Daoist companion!\n\nEveryone cursed him, calling him shameless and disgusting, but he completely disregarded them. Hua Che only gently and cautiously tried currying favour with his crush, his white moonlight.\n\nHowever, even until death, the only things he managed to obtain from Chu Binghuan were the words “shameless”, and “we’re irreconcilable enemies”—these kinds of hurtful phrases.\n\nLuckily, after being reborn, Hua Che finally understood: that stolen melons were not sweet. During such an excellent era, wasn’t strolling with a cat or teasing a dog also fun?\n\nFirst, he had to go to Chu Binghuan’s family to break their arranged marriage.\n\nHowever, the lofty Chu Binghuan, who was originally devoted to cultivating and always disdained his wooing, suddenly had a huge personality change. No matter where Hua Che went, he would follow, and it was impossible to lose him!\n\nHua Che borrowed a certain person’s words and said, “Shameless!”\n\nChu Binghuan: “You and I have long had an engagement, and we’ve even slept in the same bed. This is a matter of course.”\n\nHua Che continued borrowing someone’s words: “We are irreconcilable enemies who cannot live under the same sky!”\n\nChu Binghuan: “Then the two of us should travel beyond the sky, becoming the perfect immortal couple.”\n\nHua Che: “……”>"
}