{
	"url": "https://www.novelupdates.com/series/the-sage-summoned-to-another-world-the-cheat-items-of-the-unneeded-storage/",
	"title": "The Sage Summoned to Another World: The Cheat Items of the Unneeded Storage - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/09/shoukansaretakenja_v1.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Fantasy   Harem   Romance   ",
	"tags": "Adapted to Manga   Adventurers   Age Regression   Beast Companions   Beastkin   Clingy Lover   Cooking   Dense Protagonist   Dwarfs   Elves   Engagement   Familiars   Game Elements   Game Ranking System   Generals   Guilds   Heroes   Knights   Loli   Love Interest Falls in Love First   Magic   Magic Beasts   Male Protagonist   Multiple Transported Individuals   Naive Protagonist   Nobles   Overpowered Protagonist   Polygamy   R-15   Royalty   Soldiers   Spirits   Strong to Stronger   Summoned Hero   Sword And Magic   Transported into a Game World   Wars   ",
	"rating": "(3.6 / 5.0, 67 votes)",
	"author": "Yashu   夜州   ",
	"year": "\n2017",
	"ranking": "#3710   #2945   #1423   #1987   #2257   ",
	"reviewcount": "12 Reviews sorted by",
	"description": "Kisaragi Touya (35 years old) was playing the usual MMO after work when he was suddenly summoned as his in-game character. However, the character Touya was summoned as, was his Priest side-character that only served for item storage. The princess and summoner was disappointed and began another summoning ceremony. This time, she got a valiant young man with the title of Hero. The unneeded Touya was meant to be sent back to his original world, but he appeared in an unfamiliar place instead. “Don’t tell me the Repatriation Spell didn’t send me back to my world…”. Nonetheless, he manages to access the items in his storage and use them for a living. Using his cheat items, Touya tries to change his job into that of his main character, a Berserker, but he is stuck as a Sage for the time being. Summoned as the strongest magic job, the Berserker wannabe adventures in another world!>"
}