{
	"url": "https://www.novelupdates.com/series/hunting-for-a-delicious-wife-before/",
	"title": "Hunting for a Delicious Wife (Before) - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2016/02/26114.jpg",
	"noveltype": "(CN)",
	"genre": "Josei   Mature   Romance   Slice of Life   ",
	"tags": "Beautiful Female Lead   Clever Protagonist   Cunning Protagonist   Forced into a Relationship   Handsome Male Lead   Male Protagonist   Male Yandere   Manipulative Characters   Modern Day   Past Trauma   Possessive Characters   Protagonist Falls in Love First   R*pe   Wealthy Characters   ",
	"rating": "(3.4 / 5.0, 94 votes)",
	"author": "莫颜   ",
	"year": "\nN/A",
	"ranking": "#3923   #6152   #5486   #4313   #3343   ",
	"reviewcount": "12 Reviews sorted by",
	"description": "Every male or female that entered the bar, all hoped to become the center of attention. However, Tang Xin Lian was the opposite. Undoubtedly receding to sit in a corner alone, dressed suitably but not sexily, yet she still managed to attract the gaze of Zhong Zhen Dong. Let’s not talk about the fact that she only ordered a glass of milk at the bar, she had a pair of clear and innocent big eyes that brought about mischief in others!\r\n\r\nAgainst expectations, this little white rabbit had the courage to walk over with milk in hand, and opened her mouth in hopes of hiring him as her fake husband. Furthermore, it included food and housing, but not sleeping together. The only condition was to help her fend off a “bad peach!” (a bad relationship)\r\n\r\n~Tsk tsk tsk~ (Sound of clicking one’s tongue). How can one survive without knowing the viciousness (dangers) of mankind? Just let him, this big, feral wolf, personally teach the dangers of playing with fire.\r\n\r\nShe said she wasn’t interested in men? It doesn’t matter, it’s okay as long as he’s interested in her!\r\n\r\nShe said she doesn’t want to marry? He doesn’t care about a person’s status, he’s satisfied to be able to love her everyday!\r\n\r\nHer son is from a previous marriage? Even if she had 100 sons, it wouldn’t matter! Furthermore, this 8-year old little rascal was very useful; can tease, can play with, can act as a hostage.\r\n\r\nShe was completely in the palm of his hand. He watched the little white rabbit still not obediently submitting and returning under the wolf’s claws quietly as his dessert!>"
}