{
	"url": "https://www.novelupdates.com/series/the-queen-villainess-eavesdrops-on-my-heart-and-wont-let-me-slack-off/",
	"title": "The Queen Villainess Eavesdrops on My Heart and Won’t Let Me Slack Off - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/03/The-Queen-Villainess-Eavesdrops-on-My-Heart-and-Wont-Let-Me-Slack-Off.png",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Comedy   Harem   Romance   Slice of Life   Supernatural   Xuanhuan   ",
	"tags": "Beautiful Female Lead   Cheats   Cultivation   Empires   Evil Gods   Fantasy Creatures   Fantasy World   Fast Cultivation   First-time Interc**rse   Hiding True Identity   Lazy Protagonist   Male Protagonist   Misunderstandings   Multiple POV   Parody   Strong Love Interests   System Administrator   Transmigration   Transported into a Game World   Weak to Strong   ",
	"rating": "(3.4 / 5.0, 53 votes)",
	"author": "泡面加蛋   ",
	"year": "\n2021",
	"ranking": "#524   #1722   #3228   #954   #5778   ",
	"reviewcount": "9 Reviews sorted by",
	"description": "The first time Roger woke up, he transmigrated into an RPG Eastern Fantasy masterpiece called “Eternal Night”. He became the brother of the right minister under the ultimate villain “Eternal Night Queen”.\n\nHe arrived with an Acedia system, which gave him countless rewards as long as he loafed around and lived as a waste.\n\nUnexpectedly, the Queen of Eternal Night didn't live up to his expectations. Relying on her superb talent to eavesdrop on his heart:\n\n“The Green Vines Empire has been around for thousands of generations, and Her Majesty the Empress is naturally the eternal master of the continent!”\n\n[Quit dreaming, you’re scorned by the gods that joined forces to target you! In ten years, your people will be gone!]\n\n“I’m nothing but an amateur! I completely have no idea how to make those chaotic people of the seventeen countries return to the empire!”\n\n[Your literacy rate is too low! Don’t you know the words “Let the two wheels of all carriages be equally spaced, use the same words when writing letters or articles, teach by law, and set up officials in charge of education in all localities?”]\n\n“The left minister, Lord Margaret, is a world leader. I dare not impose any assumptions..”\n\n[She’s an undercover agent who wishes for you all to die sooner]\n\nThree days later, the left minister Margaret was fired and the Queen of Eternal Night issued an edict:\n\n“For his credit in protecting the country, Roger will be promoted to be the left minister.”\n\n“Thank you, Your Majesty…”\n\n[Don’t mess with me, I just want to loaf around!]\nLooking at Roger, full of reluctance but forced to agree, the Queen of Eternal Night revealed a smile of satisfaction.\n\nTsundere… is the most interesting!>"
}