{
	"url": "https://www.novelupdates.com/series/my-childhood-friends-are-trying-to-kill-me/",
	"title": "My Childhood Friends Are Trying To Kill Me - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/02/My-Childhood-Friends-Are-Trying-To-Kill-Me.jpg",
	"noveltype": "(KR)",
	"genre": "Comedy   Fantasy   Harem   Josei   Romance   ",
	"tags": "Age Progression   Alchemy   Amnesia   Beautiful Female Lead   Caring Protagonist   Child Abuse   Childhood Friends   Complex Family Relationships   Cross-dressing   Curses   Dragons   Empires   European Ambience   Female Protagonist   Game Elements   Handsome Male Lead   Love Interest Falls in Love First   Magic   Male Yandere   Manipulative Characters   Misunderstandings   Nobles   Obsessive Love   Popular Love Interests   Possessive Characters   Reincarnated in Another World   Reincarnation   Religions   Reverse Harem   Royalty   Strong Love Interests   Sword And Magic   System Administrator   Tsundere   ",
	"rating": "(3.8 / 5.0, 200 votes)",
	"author": "양과람   ",
	"year": "\n2021",
	"ranking": "#3314   #1924   #1832   #3196   #1543   ",
	"reviewcount": "52 Reviews sorted by",
	"description": "She was not only reincarnated into someone who died in an absurd fashion, but she also took the crown prince’s place and went to the secret neutral territory, where male members of the five imperial families gathered. As a result, her childhood friends know her as a boy.\n\n“Goodbye, guys.” she cried in front of her friends who she would never meet again. That was because officially, she (the prince) was going to die soon!\n\nIt was fun spending time with them, but she will never see them again. She hopes everyone lives happily!\n\n***\n\nAfter many years, her childhood friends turned heroes who defeated the wild dragon visited her.\n\n“…Was it you? The one who killed my friend?”\n\n“After killing the previous crown prince, the murderer is said to be living comfortably as a princess, right?”\n\n“I will torture you, so much so you’ll wish for death.” \n\n“Answer me. Why did you kill him?”\n\nOf course, they didn’t recognize her at all. No, that’s not the problem… The problem is that her childhood friends are trying to kill her. Wait a second, guys!>"
}