{
	"url": "https://www.novelupdates.com/series/the-national-girl-is-three-and-a-half-years-old/",
	"title": "The National Girl is Three and a Half Years Old - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/07/The-National-Girl-is-Three-and-a-Half-Years-Old.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Fantasy   Shoujo   Slice of Life   ",
	"tags": "Child Protagonist   Cute Protagonist   Female Protagonist   Modern Day   Showbiz   Spirits   Transmigration   ",
	"rating": "(3.9 / 5.0, 24 votes)",
	"author": "Yun Zhi   云稚   ",
	"year": "\n2020",
	"ranking": "#5262   #6301   #7384   #9322   #8261   ",
	"reviewcount": "8 Reviews sorted by",
	"description": "Gu Suisui, who was a marshmallow essence, is a squeamish bag that loves to cry and loves beauty. Until one day, she transmigrated into a book about entertainment rebirth novel and became the female protagonist’s foil. When she was a child, she earned enough tears from the audience by playing the little princess of a fallen kingdom, and became a national girl in one fell swoop. But when she grew up, the female villain started smoking, had too many NGs on set and black materials until she gradually lost the aura of a child star.\n\nThe female protagonist who debuted at the same time sang all the way, relying on the golden finger of her past life memory, investing in popular internet drama, starring in the film of a famous director as the fallen female lead, became queen film consecutively, and joining hands with the male lead president to reach the pinnacle of life.\n\nHowever, at this time, Gu Suisui who had crossed over, is only three and a half years old this year. She was just selected by the director to play the role of the little princess who made her popular for a while…\n\n=\n\nIn order to improve his national popularity and image, Ke Jingyang’s agent gave him a reality show- “Travel With Baby”, and his partner is a little girl who is not even as tall as his legs.\n\nKe Jingyang: (nothing to live for.jpg) Thank you. I just want to be calm and peaceful by myself.\n\nHalf a month later—-\n\n“Suisui, this fruit is sweet, you eat this.”\n\n“Suisui, let’s take a picture together.”\n\n“Suisui…”\n\nKe Jingyang, who originally hated children was stamped as a national daddy, showing off his goddaughter daily: “My daughter is the cutest in the world~”>"
}