{
	"url": "https://www.novelupdates.com/series/marshals-cannon-fodder-spousetransmigration/",
	"title": "Marshal’s Cannon Fodder Spouse [Transmigration] - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/08/MCFS.jpg",
	"noveltype": "(CN)",
	"genre": "Mecha   Romance   Sci-fi   Shounen Ai   ",
	"tags": "Apathetic Protagonist   Arranged Marriage   Calm Protagonist   Childcare   Cold Protagonist   Empires   Famous Protagonist   Forced Marriage   Futuristic Setting   Genius Protagonist   Handsome Male Lead   Hard-Working Protagonist   Hiding True Identity   Kuudere   Love Interest Falls in Love First   Military   Mysterious Past   Past Trauma   Power Couple   Secret Identity   Secretive Protagonist   Slow Romance   Strong Love Interests   Transmigration   ",
	"rating": "(4.2 / 5.0, 142 votes)",
	"author": "弃脂焚椒   ",
	"year": "\n2019",
	"ranking": "#1570   #696   #1684   #1526   #1371   ",
	"reviewcount": "30 Reviews sorted by",
	"description": "When you transmigrate as a marshal’s spouse, don’t be happy too soon.\n\nThe reason is that you’re probably an undercover agent who’s noble and cold on the surface, but steals information and plays deadly tricks behind the scenes; a villain who pretends to be a sickly white lotus flower, but actually has a heart as black as the bottom of a pot; and an unlucky bastard who was finally executed by the marshal himself on a live broadcast across the stars.\n\nPopular name: Cannon Fodder.\n\nUnfortunately, Duan Hengye just became such a cannon fodder.\n\nDuan Hengye decided - divorce! Get divorced early! There is no limit to the sea of pain.\n\nThe temperament and appearance of the white lotus, the identity background of the chief of the Imperial Academy of Sciences, and the force value hidden in the disguise was as high as an explosive watch. He could win if he played!\n\nHowever, the marshal did not want to leave, but pulled him more and more tightly.\n\nThe system prompt:\n\nYour divorce application has been rejected.>"
}