{
	"url": "https://www.novelupdates.com/series/the-cannon-fodder-and-villains-happy-ending/",
	"title": "The Cannon Fodder and Villain’s Happy Ending - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/09/The-Cannon-Fodder-and-Villains-Happy-Ending.jpg",
	"noveltype": "(CN)",
	"genre": "Drama   Fantasy   Romance   ",
	"tags": "Abandoned Children   Absent Parents   Abusive Characters   Adopted Children   Ancient China   Calm Protagonist   Clever Protagonist   Complex Family Relationships   Family Conflict   Female Protagonist   Handsome Male Lead   Lazy Protagonist   Love Interest Falls in Love First   Manipulative Characters   Past Plays a Big Role   Power Couple   Pregnancy   Reincarnation   Revenge   Royalty   Second Chance   Secrets   Sister Complex   Slow Romance   Smart Couple   Tragic Past   Transmigration   Younger Sisters   ",
	"rating": "(4.1 / 5.0, 159 votes)",
	"author": "Lintian   临天   ",
	"year": "\n2020",
	"ranking": "#119   #190   #672   #148   #1004   ",
	"reviewcount": "41 Reviews sorted by",
	"description": "Qin Jiu transmigrated into a switched-at-birth novel.\n\nShe became the first daughter of a marquis’ household. She was swapped out maliciously at a young age and raised in the countryside.\n\nThe fake young mistress female lead was a rebirthed girl. The pearl of the capital, and the future wife of the second prince.\n\nIn the original novel, Qin Jiu had been jealous of the female lead and kept going against her, trying in vain to frame her. Unaware of her lacking capabilities, she even tried to steal the male lead from her. Eventually, everyone turned their backs against Qin Jiu and she was killed by an arrow to the heart.\n\nAfter reviewing the plot, Qin Jiu tore up the script–She doesn’t want to be this villainess cannon fodder! Then in the next moment, she jumped into the arms of Regent Gu Zezhi.\n\nQin Jiu, “Sob sob sob…golden thighs!”\n\nGu Zezhi, “I’ll let you hug them.” The regent of the dynasty had a fierce reputation of great power and heartless killings. Many people hated him, feared him, and wanted him dead. Then, one day, someone saw the infamously fierce regent holding a little girl in his arms with a pampering expression. Gu Zezhi kissed her hair and spoke in a gentle voice. “You can get rid of anyone you want. I’m here.”>"
}