{
	"url": "https://www.novelupdates.com/series/i-ran-away-after-i-was-forced-into-a-love-polygon/",
	"title": "I Ran Away after I was Forced into a Love Polygon - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/08/20200819203218.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Drama   Romance   Shounen Ai   Slice of Life   Supernatural   ",
	"tags": "Amnesia   Apocalypse   Calm Protagonist   Caring Protagonist   Dense Protagonist   Handsome Male Lead   Humanoid Protagonist   Jealousy   Lack of Common Sense   Love Interest Falls in Love First   Love Rivals   Love Triangles   Male Yandere   Manly Gay Couple   Misunderstandings   Modern Day   Modern Knowledge   Multiple Protagonists   Multiple Transported Individuals   Possessive Characters   Protagonist Strong from the Start   Seme Protagonist   Special Abilities   System Administrator   Transported to Another World   Tsundere   Unrequited Love   World Hopping   Yandere   ",
	"rating": "(4.2 / 5.0, 210 votes)",
	"author": "一人路过   ",
	"year": "\n2019",
	"ranking": "#3017   #3322   #1744   #2627   #1922   ",
	"reviewcount": "69 Reviews sorted by",
	"description": "Du You transmigrated into a novel and finds himself turned into a bossy CEO character.\n\nHe thought he would be able to have the time of his life from then on, but he is informed that this is merely one of the worlds in a QT novel.\n\nAnd he is a bossy CEO character who has already fallen for the Bottom.\n\nNow, it’s time for the final scene already –\n\nThe Bottom is going to detach from the world by faking his death, so he would end up devastated and become a mere shell of his former self.\n\nDu You: What are we even waiting for? it’s showtime!\n\nHe imagines he will be able to enjoy a CEO’s vivid and vibrant life once the Bottom leaves the world for good.\n\nSince the sole responsibility of the CEOs in these novels is to ‘sentence arbitrary companies to bankruptcies.’\n\nYet, apparently, the plotline isn’t over yet.\n\nAs a freshly secured love interest, he must follow the Bottom’s path.\n\nAlongside the Tops of other worlds, they will form a Love Polygon.\n\nIn the end, the Bottom will discover that all the Tops are actually a split part of the same person, the protagonist Top.\n\nThen all the split parts will join together, and then have a happy ending with the Bottom.\n\nDu You: … F*ck this shit.\n\nBye bye, he’s going to run away.>"
}