{
	"url": "https://www.novelupdates.com/series/flower-master-in-the-city/",
	"title": "Flower Master in the City - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/03/e1fe9925bc315c605a8f7f6181b1cb1349547721.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Comedy   Harem   Martial Arts   Mature   Romance   Seinen   ",
	"tags": "Abandoned Children   Adapted to Manhua   Assassins   Average-looking Protagonist   Beautiful Female Lead   Celebrities   Confident Protagonist   Cultivation   Doctors   Enemies Become Allies   Enemies Become Lovers   Famous Protagonist   Fast Cultivation   Genius Protagonist   Harem-seeking Protagonist   Immortals   Lucky Protagonist   Male Protagonist   Modern Day   Narcissistic Protagonist   Netori   Organized Crime   Overpowered Protagonist   Perverted Protagonist   Polygamy   Pregnancy   Protagonist Strong from the Start   R*pe Victim Becomes Lover   Reverse R*pe   R*pe   Ruthless Protagonist   Secret Identity   Secret Organizations   S*xual Cultivation Technique   Shameless Protagonist   Strong to Stronger   Terrorists   Threesome   Unique Cultivation Technique   ",
	"rating": "(3.3 / 5.0, 66 votes)",
	"author": "Heart Is Wandering   心在流浪   ",
	"year": "\n2010",
	"ranking": "#2000   #2000   #4529   #4641   #6314   ",
	"reviewcount": "8 Reviews sorted by",
	"description": "This is a story about a legend, a legend of one that should never be forgotten.\n\nSummer, first time down the mountains in 16 years, after being raised by his 3 masters and Fairy sister.\n\n'Why won't you follow the Rules of society?'\n\n[The rules are the tool made by the strong, so I follow my own rules.]\n\n'Why won't you just use your brain instead of your brawn?'\n\n[Idiot! Have you ever seen anyone use their brain, to get back at an ant that bites them!? No, they just casually step on it.]\n\n'Everyone says I'm a first-class beauty!'\n\n[Ugly, You're not even qualified to be my maid. Only a 'Summer certified beauty' is worthy enough!]\n\n'I may be your enemy, but I've heard you don't beat the sick.'\n\n[Oh, don’t worry, even if you’re on your last breath and I feel it’s beneath me to slap shot you dead. I’ll just fix you up and then beat you!]\n\n'Just who the hell are you?'\n\n[You don't know who I am!? Then listen carefully]\n\n“I am Summer in the spring, the autumn, and the winter, I am the world’s first above the heavens!”\n\nFollow me, Summer Day as I step by step become formally known as the world’s first master, the world’s first doctor, the world’s richest man…… a lot of other world's number one, but most importantly, The worlds happiest man.>"
}