{
	"url": "https://www.novelupdates.com/series/hunting-for-a-delicious-wife-after/",
	"title": "Hunting for a Delicious Wife (After) - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2016/03/Hunting-for-a-Delicious-Wife-After.jpg",
	"noveltype": "(CN)",
	"genre": "Adult   Horror   Josei   Mature   Psychological   ",
	"tags": "Childcare   Cunning Protagonist   Forced into a Relationship   Handsome Male Lead   Male Protagonist   Male Yandere   Manipulative Characters   Modern Day   Obsessive Love   Possessive Characters   Ruthless Protagonist   Stalkers   Wealthy Characters   ",
	"rating": "(3.7 / 5.0, 84 votes)",
	"author": "莫颜   ",
	"year": "\nN/A",
	"ranking": "#2000   #6308   #4560   #7856   #3718   ",
	"reviewcount": "8 Reviews sorted by",
	"description": "Tang Xin Lian had never met a good man in her life. In order to stay away from rotten peach blossom flowers (bad relationships) and to take care of her son so that they’ll have a peaceful life, she indulged in the notion of employing a fake husband!\n\nEven if she considered all men unreliable, the candidate she chose was gay, so it should’ve been safe right?\n\nLittle did she know – –\n\nFirst of all, who said that a man who drank at a gay bar is gay?\n\nSecondly, regarding her “new roommate” Zhong Zhen Dong’s outward appearance, which was cultured and refined, he was also modest and courteous. However in actuality, this man was without a doubt very cunning. If you easily believed him, you wouldn’t even know how you would die one day!\n\nThe naïve, innocent, little white rabbit wasn’t aware of it. She was just happy the flies around her were finally driven away.\n\nThat was until the big wolf entered her inner chambers and proceeded to go to the next level. He tried to control her desire, her body, and her heart. Even her son who always stuck to her, traitorously shouted ‘father’ with genuine admiration.\n\nShe then realized Mr. Nice Guy actually originally harbored evil intentions towards her. It was simply a tiger disguising itself as a pig to eat its prey!\n\nBeing tied to this handsome man was definitely a calamity, not a blessing. Right now, it wasn’t considered too late. She could still escape without a trace, with her son. She’d erase the past 100 days, and exchange it for a happy, stable life…>"
}