{
	"url": "https://www.novelupdates.com/series/the-nine-godheads/",
	"title": "The Nine Godheads - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2016/06/3615059_21_73-N.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Comedy   Harem   Martial Arts   Xuanhuan   ",
	"tags": "Alchemy   Arranged Marriage   Artifact Crafting   Artifacts   Beasts   Body Tempering   Childhood Friends   Clever Protagonist   Cultivation   Doctors   Domestic Affairs   Genius Protagonist   Heavenly Tribulation   Jack of All Trades   Kingdoms   Magic Formations   Male Protagonist   Nobles   Pill Concocting   Politics   Reincarnated in Another World   Royalty   Sect Development   Spirit Advisor   Strength-based Social Hierarchy   Underestimated Protagonist   Unique Cultivation Technique   Weak to Strong   ",
	"rating": "(4.4 / 5.0, 230 votes)",
	"author": "Chen Ji Tang Hong Dou   辰机唐红豆   ",
	"year": "\n2015",
	"ranking": "#2000   #2000   #1577   #2963   #2075   ",
	"reviewcount": "13 Reviews sorted by",
	"description": "It’s a trend to take your grandfather along with you when passing through to another world, but we have kind of been cheated—have you ever experienced buy one get eight free?\r\n\r\nHong Xiaobao: “This opponent is a bit formidable. All you old-timers, hurry up and save me please! If you don’t appear, then this prince is going to get angry!”\r\n\r\nDemon Emperor Meng Xianji: “Mockers, kill! Those who defy me, kill! Strong people, eat! Valuable treasures and materials, eat! Good equipment, steal!”\r\n\r\nWine God Xiao Sanshao: “Why must you be so brutal? If there’s something wrong, can we not just all sit down and have a nice chat? I’ll teach you how to taste wine, youngster!”\r\n\r\nMedicine Immortal Tian Can: “You guys chat first. My condition today isn’t very good, so I’ll go rest first…. If you want to concoct some medicine, tell me after I wake up….”\r\n\r\nGodly Craftsman Xi Hong: “Didn’t I just upgrade your equipment yesterday? What are you afraid of? Attack, youngster! Isn’t that right, Chen Nan?”\r\n\r\nFormation Spirit Chen Nan: “En…. How about you go ask Mao Yue.”\r\n\r\nBeast Emperor Mao Yue: “Today’s sunshine is too bright. I’m recalling that cat of mine who died because of menstrual pain….”\r\n\r\nHong Xiaobao: “Can you guys not be so misleading?”>"
}