{
	"url": "https://www.novelupdates.com/series/86/",
	"title": "86 - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2017/09/86__000.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Drama   Mecha   Mystery   Sci-fi   Seinen   Supernatural   Tragedy   ",
	"tags": "Adapted to Anime   Adapted to Manga   Amnesia   Aristocracy   Artificial Intelligence   Award-winning Work   Beautiful Female Lead   Calm Protagonist   Character Growth   Charismatic Protagonist   Childhood Friends   Clever Protagonist   Cold Protagonist   Confident Protagonist   Death   Death of Loved Ones   Dense Protagonist   Depictions of Cruelty   Discrimination   Dystopia   Firearms   Generals   Handsome Male Lead   Military   Multiple Protagonists   Murders   Near-Death Experience   Nobles   Orphans   Past Plays a Big Role   Past Trauma   Protagonist Strong from the Start   Psychic Powers   R-15   Racism   Royalty   Ruthless Protagonist   Schemes And Conspiracies   Scientists   Soldiers   Special Abilities   Strategic Battles   Strategist   Time Skip   War Records   Wars   ",
	"rating": "(4.6 / 5.0, 179 votes)",
	"author": "Asato Asato   安里 アサト   ",
	"year": "\n2017",
	"ranking": "#2917   #1731   #3303   #9891   #1364   ",
	"reviewcount": "21 Reviews sorted by",
	"description": "A War Without Casualties.\n\nThe Republic of San Magnolia has long been under attack from the neighbouring Giadian Empire’s army of unmanned drones known as the Legion. After years of painstaking research, the Republic finally developed autonomous drones of their own, turning the one-sided struggle into a war without casualties-or at least, that’s what the government claims.\n\nIn truth, there is no such thing as a bloodless war. Beyond the fortified walls protecting the eighty-five Republic territories lies the “nonexistent” Eighty-Sixth Sector. The young men and women of this forsaken land are branded the Eighty-Six and, stripped of their humanity, pilot the “unmanned” weapons into battle…\n\nShinn is the leader of a squadron of eighty-sixers. Lena is a “handler” who commands the detachment from the remote rear with the help of special communication technology.\n\nThe farewell story of the severe and sad struggle of these two begins!>"
}