{
	"url": "https://www.novelupdates.com/series/guardian-bu-hui-xia-qi/",
	"title": "Guardian (Bu Hui Xia Qi) - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/12/guardian1buhui.jpg",
	"noveltype": "(CN)",
	"genre": "Romance   School Life   Shounen Ai   Slice of Life   ",
	"tags": "Familial Love   Family Conflict   Late Romance   Love Interest Falls in Love First   Modern Day   Multiple POV   Older Love Interests   Popular Love Interests   Reincarnation   Revenge   Schemes And Conspiracies   Second Chance   Shota   Showbiz   Siblings   Siblings Not Related by Blood   Slow Romance   Weak to Strong   Wealthy Characters   Younger Brothers   ",
	"rating": "(4.0 / 5.0, 156 votes)",
	"author": "Can’t Play Chess   不会下棋   ",
	"year": "\n2015",
	"ranking": "#2773   #888   #2240   #923   #2293   ",
	"reviewcount": "42 Reviews sorted by",
	"description": "Identity background: Fifteen years old, biological mother died, father unknown, holding a large legacy, poor performance in entrance examination, please choose a guardian.\n\nCandidate one: birth mother’s brother, not close, but eloquent, very gentle, reliable and sincere.\n\nCandidate two: The eldest son of the father who has never been seen. His occupation is unknown. His age is unknown. Nothing is known.\n\nIn the last life, Yu Shulin chose his uncle, his mother’s funeral was all done by him, and he promised to take good care of him.\n\nThe selection is completed, and the result is being read …\n\nAfter the choice was made, open the [pit you pit you pit you till you die] ending, please accept.\n\nYu Shulin, who was counted by his uncle’s family for his inheritance, was eventually released from prison, but immediately got killed …\n\n@ # ￥% & * …… Restore the file.\n\nIdentity background: Fifteen years old, biological mother died, father unknown, holding a large legacy, poor performance in entrance examination, please choose a guardian\n\nCandidate one: birth mother’s brother, not close, but eloquent, very gentle, reliable and sincere.\n\nCandidate two: The eldest son of the father who has never been seen. His occupation is unknown. His age is unknown. Nothing is known.\n\nAfter the rebirth, Yu Shulin, whose negative energy exploded, said to hell and chose option 2!\n\nThe selection is completed, and the result is being read …\n\nAfter reading the results, open the ending of [Just want to love you with the overbearing film emperor], please accept.\n\nYu Shulin, who was captive and was boiled like a frog in warm water: (╯ ‵ □ ′) ╯︵┻─┻WTF!>"
}