{
	"url": "https://www.novelupdates.com/series/im-just-a-human-but-i-was-raised-by-the-four-heavenly-kings-of-the-demon-kings-army-the-demon-kings-daughter-loved-me-and-bestow-me-the-authority-to-rule-over-all-attributes/",
	"title": "I’m Just a Human but I Was Raised by the Four Heavenly Kings of the Demon King’s Army. The Demon King’s Daughter Loved Me and Bestow Me the Authority to Rule Over All Attributes - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/09/thg.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Comedy   Fantasy   Martial Arts   Romance   School Life   ",
	"tags": "Abandoned Children   Academy   Adapted to Manga   Adopted Protagonist   Beastkin   Beautiful Female Lead   Bodyguards   Demon Lord   Demons   Dense Protagonist   Dragon Slayers   Dragons   Elves   Human-Nonhuman Relationship   Inheritance   Kind Love Interests   Male Protagonist   Nobles   Royalty   Schemes And Conspiracies   Special Abilities   Strong Love Interests   Strong to Stronger   Underestimated Protagonist   ",
	"rating": "(3.6 / 5.0, 28 votes)",
	"author": "Hidari Ryuu   左リュウ   ",
	"year": "\n2019",
	"ranking": "#2000   #2000   #6630   #7858   #5722   ",
	"reviewcount": "No Reviews",
	"description": "The main character, Leon, was abandoned to the world of demons right after he was born because of his lack of magical power. However, his fate changes completely when the Four Heavenly Kings of the Demon King’s Army picks him up. The Four Heavenly Kings, the strongest and most powerful figures in the world, had trained him personally and took good care of him. As time passed, the boy became a magnificent soldier of the Demon King’s army with the power to “rule” every kind of magic. Leon has been given a new mission to protect Alicia, who will enroll in a magic academy on the island called “Paradise Island.”\r\n\r\n”As one of the members of the Demon King’s army, I will fulfill my duties with honour!”\r\n\r\nFor the sake of his benefactors, the Four Heavenly Kings, who he holds in high esteem, he tackles the mission head on.\r\n\r\n“More importantly, Leon is so cute and I can’t help myself.”\r\n\r\n“Wait a minute, girls. Leon is mine. I’m not going to hand him over to you.'\r\n\r\nIgnoring Leon, the four heavenly kings and the daughter of the Demon King, Alicia, are madly showing their affection for him.\r\n\r\n“Let’s go together to the academy, Leon.”\r\n\r\n“Absolutely, Your Highness!”\r\n\r\n“And let’s do our best, Leon.”\r\n\r\n“Certainly, Your Highness!”\r\n\r\n“If this mission is a success, let’s get married.”\r\n\r\n“Absolute……Wait what?>"
}