{
	"url": "https://www.novelupdates.com/series/sharing-the-dorm-with-the-enemy-from-previous-life/",
	"title": "Sharing the Dorm with the Enemy from Previous Life - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/03/Sharing-the-Dorm-with-the-Enemy-from-Previous-Life.jpg",
	"noveltype": "N/A",
	"genre": "Comedy   Drama   Fantasy   Romance   School Life   Yaoi   ",
	"tags": "Cute Story   Death   Devoted Love Interests   Enemies Become Lovers   First Love   Friendship   Handsome Male Lead   Heartwarming   Love Interest Falls in Love First   Male Protagonist   Modern Day   Persistent Love Interests   Possessive Characters   Rivalry   Roommates   Slow Romance   Strong Love Interests   Transmigration   Transported to Another World   ",
	"rating": "(4.1 / 5.0, 17 votes)",
	"author": "闪灵   ",
	"year": "\n2020",
	"ranking": "#1750   #1290   #8512   #2563   #7424   ",
	"reviewcount": "2 Reviews sorted by",
	"description": "[Ancient period]\nThe young master of the Demonic Sect, Ruan Qingmu, was a vicious and merciless man with blood-stained hands. In his previous life, he was ambushed and killed, and his corpse was left in the wilderness; it was very miserable.\n\nThe only thing Ruan Qingmu didn’t expect was that his archenemy, the young hero, Qin Yuan would be the one who engaged in bloody battles like a madman and helped kill his foes for him.\n\nAs soon as he opened his eyes, Ruan Qingmu was transmigrated to a lush green school. In front of him was a table full of mathematics, physics, and chemistry books. The top student of the school just happened to walk by with a cold expression when Ruan Qingmu looked out the window.\n\nHis looks manifested his splendid prospects, with sharp eyebrows and phoenix eyes. Yet, the look in his eyes was the same as in their previous life, as if someone owed him their life.\n\nA few days later, a rumor sprang up everywhere:\n\nThe remedial class’ Ruan Qingmu had gone mad. He openly grabbed and tore the school uniform of the school grass, Qin Yuan!\n\nRuan Qingmu: I owe him quite a bit from my previous life. I only wanted to check to see if he was the same person from my previous life…\n\nQin Yuan: Did you owe me that much? Then how about directly settling the debt at once?\n\nRuan Qingmu: Hold on, you… you…you really don’t remember me? I had saved you once, even helped you to suck out poison!\n\nQin Yuan: (with an expressionless face) Don’t remember anymore. How about you demonstrate it once again?\n\nIn our dream of a previous life, you and I were young and unbridled, living a luxurious, free, and unrestrained life.\n\nIn this present life, the years have been calm and easy, and there is no need to fight in the Jianghu.\n\n[Proud and cold top student gong x troublemaker and two-faced shou]>"
}