{
	"url": "https://www.novelupdates.com/series/rebirth-of-a-cannon-fodder-from-a-novel/",
	"title": "Rebirth of a Cannon Fodder from a Novel - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/08/74435s.jpg",
	"noveltype": "(CN)",
	"genre": "Drama   Romance   School Life   Shounen Ai   ",
	"tags": "Abusive Characters   Child Abuse   Clever Protagonist   College/University   Cunning Protagonist   Devoted Love Interests   Doting Love Interests   Family Conflict   Hackers   Handsome Male Lead   Hated Protagonist   Hiding True Abilities   Love Interest Falls in Love First   Lovers Reunited   Modern Day   Multiple Reincarnated Individuals   Older Love Interests   Pets   Programmer   Reincarnation   Revenge   Second Chance   Slow Romance   Smart Couple   Tragic Past   Unconditional Love   Wealthy Characters   ",
	"rating": "(4.1 / 5.0, 515 votes)",
	"author": "Yin Er   饮尔   ",
	"year": "\n2019",
	"ranking": "#852   #2282   #808   #370   #790   ",
	"reviewcount": "185 Reviews sorted by",
	"description": "As the only girl born in the four generations of the Mo family – a prestigious and powerful family in Hua Xia – Mo Liu Gui has been adored since the day she was born. She is gorgeous, naive and intelligent. Behind her is the noble Mo family and by her side are countless excellent pursuers. Whether in career or relationships, she’s the heaven born life winner.\n\nIt’s a pity that Mo Di is not Mo Liu Gui but a tragic contrast of what one would call life winner.\n\nHe has been disliked by everyone in the Mo family since the day he was born. When he left the incubator, the whole family was competing for his sister but left him in the hospital corridor overnight. He never took a sip of his mother’s milk because it was just enough to feed one child. He has not been held by his father once because his father was extremely disgusted with the culprit who robbed his darling of nutrition in their mother’s womb. \n\nHis five brothers never looked him in the eye. When he was six years old, they even ganged up to beat him till he had a fractured right leg which almost left him permanently disabled, all because he scored first place in his grade while his sister scored third, making Mo Liu Gui sad to the point of crying.\n\nCountless scolding, neglect, double standard treatment, and even abuse in the name of education have been habitually done to Mo Di. Finally one day, the Mo Di who has been soft and obedient for eighteen years turned black.\n\nHe was no longer a soft and sensible man but had become gloomy and aggressive. He ran away from home, started his own company and made new friends. Everything is booming but when his company was about to go public, he was found by the Mo family. During a struggle with Mo Liu Gui who was asking him to come home, she fell and almost had a miscarriage. This incited everyone’s anger and they forced him into a mental hospital.\n\nIn the end, he died on his 25th birthday…\n Afterwards, he was reborn.>"
}