{
	"url": "https://www.novelupdates.com/series/until-the-real-one-shows-up/",
	"title": "Until The Real One Shows Up - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/11/Until-The-Real-One-Shows-Up.jpg",
	"noveltype": "(KR)",
	"genre": "Drama   Fantasy   Romance   ",
	"tags": "Aristocracy   Empires   European Ambience   Female Protagonist   Handsome Male Lead   Hated Protagonist   Marriage   Nobles   Personality Changes   Prophecies   Protagonist Falls in Love First   Religions   Royalty   Transmigration   Transported to Another World   Villainess Noble Girls   ",
	"rating": "(4.0 / 5.0, 71 votes)",
	"author": "킴펄   ",
	"year": "\n2021",
	"ranking": "#99   #110   #3119   #201   #3673   ",
	"reviewcount": "12 Reviews",
	"description": "She dared to cross over to become the main character from being an extra in the novel. She believed that the power of love could change any fate. However, everyone died and realized that it was a perfect mistake.\n\n“If I ever go back, I will never love you.”\n\nPerhaps the earnest wish worked, she returned back a year before the original work began. The problem is that this body that she possessed in the original, is the worst villain in the world!\n\n“If I go on like this, the female lead will appear and my neck will be cut off.”\n\nShe decided to never follow the plot after her rebirth while keeping her distance from The Male Lead.\n\n“I must write the greatness of Her Highness the Empress as a pamphlet and spread it throughout the Empire!”\n\n“You did a great job! The Empress must be a saint!”\n\n“I would gladly give this one life for the sake of the Empress!”\n\nDid I work too hard? Everyone seems to like me very much. And besides…\n\n“What are you doing here…”\n\n“Is it strange for a husband to find himself in his wife’s bedroom?”\n\nThe attitude of the man who hated her terribly also became quite strange somehow…?\n\nFinally, the news that the heroine had appeared. Now it was time for the extras to disappear just as they were in the original. She stamped the divorce papers without any regrets and took them to her husband…\n\n“…Divorce?”\n\n“You will dethrone me and the new Empress… Wait, what are you doing?”\n\nBefore she could finish speaking, he tore the divorce papers to shreds. He responded to her with a calm face.\n\n“I won’t.”\n\n“Are you going to go against the blessing?”\n\n“That’s out of question.”\n\n“I beg your pardon?’”\n\nI was dumbfounded, and he came close to me.\n\nWith a dangerous face, he said as if growling in the narrow hunger for a kiss.\n\n“You promised to stay by my side until the day I die.”\n\n“…”\n\n“Your promise comes first. I will never let you go.”\n\nThe original was about to change once again.>"
}