{
	"url": "https://www.novelupdates.com/series/the-scum-shous-survival-guide/",
	"title": "The Scum Shou’s Survival Guide - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2018/11/scumsho1.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Drama   Mature   Psychological   Romance   Tragedy   Yaoi   ",
	"tags": "Abusive Characters   Acting   Aliens   Ancient China   Betrayal   Black Belly   Blackmail   Carefree Protagonist   Confinement   Cunning Protagonist   Death   Episodic   Handsome Male Lead   Kidnappings   Lazy Protagonist   Limited Lifespan   Love Interest Falls in Love First   Male Yandere   Manipulative Characters   Misunderstandings   Modern Day   Multiple POV   Past Plays a Big Role   Past Trauma   Personality Changes   Possessive Characters   Post-apocalyptic   Resurrection   R*pe   S*x S*aves   S*xual Abuse   Shameless Protagonist   Sickly Characters   Strong Love Interests   System Administrator   Torture   Tragic Past   Transmigration   Twisted Personality   World Hopping   Zombies   ",
	"rating": "(4.3 / 5.0, 308 votes)",
	"author": "Jimo Yao   Tức Mặc Dao   即墨遥   ",
	"year": "\n2017",
	"ranking": "#4265   #4133   #786   #4569   #612   ",
	"reviewcount": "72 Reviews sorted by",
	"description": "In the spirit of humanitarian aid, to help his ex-boyfriends walk out from the shadow of heartbreak as soon as possible, every time before Ye Ming leaves a world after filling up the favorability value, he initiates a (heart) amicable (less) breakup with his boyfriend.\n\nHowever, just when he finally saved up enough experience points after transmigrating to the nth world, he was notified by his system that all of his ex-boyfriends had blackened! The accumulated blackening value had exceeded the world’s critical levels, leading to the failure of all of his capture missions… he had to go back to those worlds and eliminate the blackening values for his missions to be considered complete!\n\nYe Ming: This is an outcome I didn’t predict.\n\nSystem: I warned you early on that if you did this, you wouldn’t have a good end.\n\nThe ex-boyfriends all laughing coldly: He he. That despicable, shameless scum who ran away after deceiving me is finally back. This time, you have nowhere to run!\n\nYe Ming: …\n\nSystem: The death you sought yourself, even if you kneel, you have to see it to the end.\n\nYe Ming: Luckily, I have a special whitewashing technique ^_^>"
}