{
	"url": "https://www.novelupdates.com/series/beauty-of-thebes/",
	"title": "Beauty of Thebes - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/03/thebes.jpg",
	"noveltype": "(KR)",
	"genre": "Adult   Drama   Fantasy   Harem   Josei   Romance   Smut   ",
	"tags": "Abusive Characters   Aggressive Characters   Amnesia   Appearance Changes   Aristocracy   Arrogant Characters   Beast Companions   Beasts   Betrayal   Bodyguards   Calm Protagonist   Character Growth   Complex Family Relationships   Curses   Cute Protagonist   Depictions of Cruelty   Determined Protagonist   Devoted Love Interests   Doting Love Interests   Early Romance   Elemental Magic   Empires   Familial Love   Family   Family Conflict   Famous Parents   Fantasy Creatures   Female Protagonist   First-time Interc**rse   God-human Relationship   Goddesses   Godly Powers   Gods   Handsome Male Lead   Immortals   Jealousy   Kind Love Interests   Kingdoms   Leadership   Love Interest Falls in Love First   Love Rivals   Loyal Subordinates   Magic   Marriage   Mature Protagonist   Misunderstandings   Monsters   Mythology   Older Love Interests   Persistent Love Interests   Politics   Popular Love Interests   Possessive Characters   Prophecies   R-18   Reverse Harem   Royalty   Siblings   Spirits   Strength-based Social Hierarchy   Strong Love Interests   Survival   Sword And Magic   Sword Wielder   Tragic Past   Unconditional Love   Wars   Wealthy Characters   ",
	"rating": "(3.8 / 5.0, 135 votes)",
	"author": "CLOEL   ",
	"year": "\n2019",
	"ranking": "#2000   #2000   #2356   #8371   #1792   ",
	"reviewcount": "8 Reviews sorted by",
	"description": "Eutostea, Thebe’s third princess.\r\n\r\nAt night, a man appeared through her window and whispered in a honeyed voice, “I came to be your one-night lover. After tonight, you will not remember me, nor will we meet again.”\r\n\r\nWho was he? Apollo, the god of prophecy. As a human being, who could resist a god?\r\n\r\n“Princess of Thebes…” The man leaned against the window frame in pitch-black darkness with only the moonlight framing his stature.\r\n\r\nAnd despite what he said, Apollo came to visit her again.\r\n\r\n“Tomorrow, everyone throughout Greece will know that you are my woman.”\r\n\r\nHow long will their secret meeting last?\r\n\r\nAphelius, King of Thebes, blazing with shame flew to the Temple of Greece to confirm the identity of the suspicious man who went in and out of the third princess’ room. The three princesses were united as one to confirm the appearance of the man claiming to be the self-proclaimed god, Apollo.\r\n\r\nWhile Eutostea hesitated for a moment, the hot candle melted and dripped on the shoulder of a god.\r\n\r\n“You really don’t recognize me?”\r\n\r\n“How do I know its you?”\r\n\r\nApollo grabbed her chin and brought his lips close to hers.\r\n\r\n“Behold and open your heart, Princess of Thebes. Here lies the face you longed to see.”\r\n\r\nHe growled.>"
}