{
	"url": "https://www.novelupdates.com/series/cannon-fodder-fake-master-was-stunned-after-being-reborn/",
	"title": "Cannon Fodder Fake Master Was Stunned After Being Reborn - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/03/Cannon-Fodder-Fake-Master-Was-Stunned-After-Being-Reborn.png",
	"noveltype": "(CN)",
	"genre": "Comedy   Drama   Fantasy   Romance   Slice of Life   Supernatural   Yaoi   ",
	"tags": "Abandoned Children   Acting   Arrogant Characters   Artists   Cautious Protagonist   Dense Protagonist   Doting Love Interests   Doting Older Siblings   Doting Parents   Family   Handsome Male Lead   Inferiority Complex   Multiple Reincarnated Individuals   Older Love Interests   Past Plays a Big Role   Popular Love Interests   Protagonist Falls in Love First   Reincarnation   Second Chance   Showbiz   Strong Love Interests   Tragic Past   ",
	"rating": "(4.1 / 5.0, 97 votes)",
	"author": "Zhi Tang   稚棠   ",
	"year": "\n2021",
	"ranking": "#2463   #2366   #3729   #2743   #3523   ",
	"reviewcount": "20 Reviews sorted by",
	"description": "It was only after Jian Xingsui’s death that he realized that he was the cannon fodder in a book with a dog-blooded plot. He was a dumb and s*upid fake young master in it.\n\n​In the book, he was reluctant to return to his poor ”biological” parents. He was greedy of the Jian Family’s wealth and also wanted to suppress the protagonist shou of the book, the real young master. With the tricks that he had personally thought out of his pig-headed brain, he finally succeeded in making everyone in the family annoy the hell out of him:\n\nHis former CEO elder brother: “I don’t have a younger brother like you.”\n\nHis former star second brother: “Never mention to anyone in the entertainment industry that I used to be your brother!!!”\n\nHis former father: “Get out, I’m so disappointed in you.”\n\n​​After that, he was kicked out of the house and had a terrible ending.\n\nAfter the rebirth, just when it was the day when the protagonist shou came up to his door, instead of waiting for his family to talk to him, he took the initiative: “You guys won’t have to say anything, I am willing to leave the house!”>"
}