{
	"url": "https://www.novelupdates.com/series/a-neat-and-pretty-girl-at-the-transfer-destination-was-a-childhood-friend-who-used-to-think-that-she-was-a-boy-and-played-with-her/",
	"title": "The Neat and Pretty Girl at My New School Is a Childhood Friend of Mine Who I Thought Was a Boy (WN) - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/11/The-Neat-and-Pretty-Girl-at-My-New-School-Is-a-Childhood-Friend-of-Mine-Who-I-Thought-Was-a-Boy-WN.jpg",
	"noveltype": "(JP)",
	"genre": "Comedy   Drama   Romance   School Life   Slice of Life   ",
	"tags": "Adapted to Manga   Beautiful Female Lead   Childhood Friends   Childhood Promise   Handsome Male Lead   Love Triangles   Male Protagonist   Misunderstandings   Popular Love Interests   Tomboyish Female Lead   Younger Sisters   ",
	"rating": "(4.0 / 5.0, 73 votes)",
	"author": "Hibariyu   雲雀湯   ",
	"year": "\n2020",
	"ranking": "#2836   #3685   #3218   #3145   #3578   ",
	"reviewcount": "9 Reviews sorted by",
	"description": "I met my childhood friend again, and she had become a beautiful and innocent girl.\n\n'It’s been a while, Hayato.'\n'Haruki, is it?'\n\nIn the past, I used to play in the mud with my childhood friend in the countryside, and when I saw him again, there was no trace of the bratty young man I thought he was back then. Only in front of Hayato, she threw away the coat she was wearing and reacted in the same crass way she did back then. The distance between you and me has not changed.\n\n'Take off your socks and sit on the ground... I can see it you know.'\n'Do you want to see it?'\n'I don't want to see it!'\n'Then why don't you just stop looking? Unless... huuh~?'\n'Sh*t, that's not how it works!'\n'Fuhihi~.'\n\nI was so frustrated at being treated like that that I tried treating her like a girl and got a surprising response...\n\nThe countryside and the city.\nA boy and a girl.\nA mind and body that has changed.\nBut the same feelings and promises.\n\nFurthermore, the best friend of the younger sister whom they left in the countryside, the girl who is a member of the gardening club who grows vegetables, and the reunion and encounter with them. And then―\n\nThis is a story about a childhood friend and how they gradually make up for the distance and time they've been apart, starting one summer.>"
}