{
	"url": "https://www.novelupdates.com/series/i-quit-being-the-devoted-supporting-male-character/",
	"title": "I Quit Being The Devoted Supporting Male Character - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/09/I-Quit-Being-The-Devoted-Supporting-Male-Character.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Mature   Mystery   Xuanhuan   ",
	"tags": "Abusive Characters   Ancient China   Businessmen   Calm Protagonist   Character Growth   Cold Protagonist   Cultivation   Ghosts   Handsome Male Lead   Male Protagonist   Manipulative Characters   Modern Day   Multiple Reincarnated Individuals   Mysterious Past   Nationalism   Stalkers   System Administrator   Transmigration   World Hopping   World Travel   ",
	"rating": "(3.9 / 5.0, 12 votes)",
	"author": "蓦拾壹   ",
	"year": "\n2021",
	"ranking": "#403   #414   #7083   #483   #10636   ",
	"reviewcount": "5 Reviews sorted by",
	"description": "It was well known that in every novel, there would always be a supporting male character like this:\n\nThey were either crazy about the female lead or willing to work.\n\nEven if they gave themselves a green hat, they were ready to.\n\nThe female lead was misunderstood by the male lead, so he came to explain.\n\nThe female lead had career problems, so he came to help.\n\nIn the end, he only got a sentence from the female lead: “I just think of you as a brother.”\n\nHe could be used against the male lead. In the end, the male and female leads ruined him as the strong prevailed over the weak.\n\nAfter Gu Jingyu became one of those miserable supporting male characters in the novel…\n\nThe heroine of the domineering novel said: “I just think of you as a brother.”\n\nGu Jingyu: “Thank you. My mom only gave birth to me.”\n\nThe heroine from the modern-day time-travel novel: “This is a vegetarian snack that I have carefully developed for you. I think you’ll like it.”\n\nLooking at the spicy veggie meat stick in the heroine’s hand, Gu Jingyu fell into silence. Did he look like a fool?\n\nThe useless protagonist in the immortal cultivation novel said: “For thirty years, people east of the river prosper, then for another thirty years those on the west prosper: life is full of ups and downs. Don’t bully the poor youth! You wait, I will definitely come back to take revenge.”\n\nGu Jingyu directly imprisoned the protagonist until he ascended.>"
}