{
	"url": "https://www.novelupdates.com/series/kuro-no-maou/",
	"title": "Kuro no Maou - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2015/06/KuronoMaou-.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Fantasy   Harem   Martial Arts   Mature   Psychological   Shounen   Supernatural   Tragedy   ",
	"tags": "Adapted to Manga   Anti-Magic   Battle Academy   Battle Competition   Beautiful Female Lead   Brainwashing   Character Growth   Clingy Lover   Corruption   Cruel Characters   Curses   Death   Demon Lord   Demons   Dense Protagonist   Depictions of Cruelty   Devoted Love Interests   Divine Protection   Elemental Magic   Evil Gods   Evil Organizations   Evil Religions   Fairies   Firearms   First-time Interc**rse   Goddesses   Gods   Gore   Human Experimentation   Jealousy   Loli   Love Interest Falls in Love First   Love Rivals   Magic Beasts   Male Protagonist   Medieval   Mind Break   Mind Control   Misunderstandings   Multiple POV   Multiple Transported Individuals   Murders   Near-Death Experience   Necromancer   Nobles   Obsessive Love   Older Love Interests   Polite Protagonist   Polygamy   Romantic Subplot   Royalty   Ruthless Protagonist   Seven Deadly Sins   Strategic Battles   Strength-based Social Hierarchy   Strong Love Interests   Strong to Stronger   Sudden Strength Gain   Sword And Magic   Torture   Transported to Another World   Unique Weapon User   Vampires   Wars   Weak to Strong   Werebeasts   Yandere   ",
	"rating": "(3.6 / 5.0, 656 votes)",
	"author": "Hishi Kage Dairi   ",
	"year": "\n2011\n",
	"ranking": "#1598   #542   #310   #1854   #150   ",
	"reviewcount": "82 Reviews sorted by",
	"description": "Kurono Maou is a high school student who is sensitive of his sharp eyes and bad expression. No girlfriend but gifted with friends in his own way, he had been living a peaceful life. \n\nBut one day, without any reason, Kurono was attacked by a mysterious headache while in the literature clubroom and fainted. When he finally awoke…Swords & magic, filled with monsters, an orthodox different world summoning.>"
}