{
	"url": "https://www.novelupdates.com/series/let-me-be-reborn/",
	"title": "Let Me Be Reborn - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/06/EXuBmP_VcAEkSzE.jpg",
	"noveltype": "(KR)",
	"genre": "Adult   Comedy   Ecchi   Harem   School Life   Seinen   Supernatural   ",
	"tags": "Adultery   Affair   Age Progression   Appearance Changes   Arrogant Characters   BDSM   Beautiful Female Lead   Betrayal   Carefree Protagonist   Caring Protagonist   Character Growth   Charming Protagonist   Cheats   Clever Protagonist   C*nnilingus   College/University   Confident Protagonist   Devoted Love Interests   Early Romance   First Love   First-time Interc**rse   F*llatio   Handsome Male Lead   Hard-Working Protagonist   H*ndjob   Kind Love Interests   Love Interest Falls in Love First   Male Protagonist   Masochistic Characters   M*sturbation   Modern Day   Netori   Nudity   Older Love Interests   Part-Time Job   Past Plays a Big Role   Polygamy   Popular Love Interests   Quiet Characters   R-18   Sadistic Characters   Shy Characters   Siblings   Tragic Past   Ugly to Beautiful   Wealthy Characters   ",
	"rating": "(3.4 / 5.0, 67 votes)",
	"author": "Raging Pillar Of Fire   성난불기둥   ",
	"year": "\n2017",
	"ranking": "#6970   #2000   #5998   #9146   #5580   ",
	"reviewcount": "3 Reviews sorted by",
	"description": "Lee Jung Woo was the epitome of a successful man able to provide for his family in the modern-day world. However, his ongoing relationship with his wife had always been a rocky wave, never smooth sailing due to his less-than-average looks, small stature, and tiny manhood almost the size of his finger.\r\n\r\nAfter learning his loving wife’s love affair, a tragic death befell him and he appeared in the face of God. Finally able to let out all the sufferings and injustices he faced throughout his life, God allowed him the chance to reincarnate. Jung Woo was given the number three-hundred. Using those stats, Jung Woo distributed the stats to his height, intelligence, and manhood before reincarnating in the body of the young Lee Do Hoon.\r\n\r\nJung Woo, who now lives the life of a college student, Do Hoon, is given a gift from God that only he can use. He, now the main character of the show, will use it to meet myriads of women and achieve his unfulfilled dream.>"
}