{
	"url": "https://www.novelupdates.com/series/the-villains-host-is-a-boss/",
	"title": "The Villain’s Host is a Boss - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/02/The-Villains-Host-is-a-Boss.jpeg",
	"noveltype": "(CN)",
	"genre": "Adventure   Fantasy   Josei   Martial Arts   Mecha   Romance   Supernatural   ",
	"tags": "Abandoned Children   Acting   Adopted Children   Amnesia   Ancient China   Ancient Times   Apocalypse   Beastkin   Clingy Lover   Cold Love Interests   Cold Protagonist   Couple Growth   Cute Children   Cute Story   Devoted Love Interests   Doting Love Interests   Doting Parents   Dragons   e-Sports   Early Romance   Engagement   Eunuch   Familial Love   Family   Family Business   Famous Parents   Fantasy World   Fated Lovers   Fearless Protagonist   Female Protagonist   First Love   First-time Interc**rse   God Protagonist   Goddesses   Godly Powers   Gods   Handsome Male Lead   Hard-Working Protagonist   Jealousy   Love at First Sight   Love Interest Falls in Love First   Magic   Magic Beasts   Matriarchy   Mature Protagonist   Mpreg   Multiple Realms   Multiple Reincarnated Individuals   Obsessive Love   Office Romance   Older Love Interests   Online Romance   Orcs   Popular Love Interests   Possessive Characters   Power Couple   Protagonist Strong from the Start   Revenge   Romantic Subplot   Royalty   Sealed Power   Showbiz   Smart Couple   Soul Power   Souls   Strategist   Strong Love Interests   Strong to Stronger   Stubborn Protagonist   System Administrator   Tragic Past   Unconditional Love   Unique Weapons   Virtual Reality   Wealthy Characters   World Hopping   Younger Love Interests   ",
	"rating": "(3.2 / 5.0, 14 votes)",
	"author": "Yun Lingxi   云灵兮   ",
	"year": "\n2021",
	"ranking": "#2000   #6215   #8856   #10064   #10156   ",
	"reviewcount": "7 Reviews sorted by",
	"description": "In order to regain her Tao Heart, Yun Xi travels through the three thousand worlds. In every world, there is a tragic cannon fodder that needs her to counterattack.\n\nSystem: Host, this is a modern world, and your identity is a tragic daughter whose family was destroyed by her boyfriend!\n\nYun Xi: …\n\nSo, the miserable daughter becomes a domineering female president!\n\nSystem: Host, this is an ancient world, and you are an unlucky princess who was betrayed by her husband.\n\nYun Xi: …\n\nSo, the unfortunate princess the resolute becomes Queen of the country!\n\nSystem: Host, this an apocalyptic world, and your identity is the poor cannon fodder whose crystal nucleus was dug out by the heroine!\n\nYun Xi: …\n\nSo, the poor cannon fodder becomes the queen who unified the world after the apocalypse with a little white face next to her. Hey, isn’t this little white face a little familiar?\n\nSystem: For other system’s hosts, they will be spoiled by the big bosses in every world, but my host has to be big boss in every world, who only spoils her little white face…>"
}