{
	"url": "https://www.novelupdates.com/series/the-paranoid-emperors-black-moonlight-shizun/",
	"title": "The Paranoid Emperor’s Black Moonlight Shizun - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/06/jjwxc2_blackmoonlightshizun.jpg",
	"noveltype": "(CN)",
	"genre": "Adventure   Drama   Historical   Mystery   Romance   Tragedy   Xianxia   Yaoi   ",
	"tags": "Ancient China   Arrogant Characters   Betrayal   Bloodlines   Caring Protagonist   Cooking   Cultivation   Demons   Dense Protagonist   Determined Protagonist   Devoted Love Interests   Hiding True Identity   Love Interest Falls in Love First   Male Yandere   Master-Disciple Relationship   Misunderstandings   Mystery Solving   Past Plays a Big Role   Possessive Characters   Reincarnation   Royalty   R*pe   Schemes And Conspiracies   Secret Identity   Time Skip   Transformation Ability   Yandere   Younger Love Interests   ",
	"rating": "(4.1 / 5.0, 107 votes)",
	"author": "Chen Sensen   陈森森   ",
	"year": "\n2019",
	"ranking": "#4080   #2606   #3488   #10477   #1981   ",
	"reviewcount": "14 Reviews sorted by",
	"description": "It’s said that the human world’s emperor is muddle-headed, so I decided to go to the mortal world and teach the bullied prince and support him onto the throne, to bring peace to the land.\r\n\r\nThe process was difficult, but I succeeded.\r\n\r\n10 years later, when the young emperor was enthroned, black clouds covered the sky and tribulation lightning rumbled.\r\n\r\nI stood outside the throne room and distantly gave him one last look.\r\n\r\nHe didn’t know what was happening outside and smiled at me, his pitch-black eyes were filled with a thousand words.\r\n\r\nThen, I turned around and ascended.\r\n\r\nI didn’t even give him a proper goodbye.\r\n\r\nWhen I opened my eyes, it wasn’t the Heavens.\r\n\r\nI blankly lay on the carpet of the imperial study room, and the eunuch beside me was submissively introducing, “Your Majesty, this is the remarkable beauty Prince Jin is giving as a tribute.”\r\n\r\nFrom above came a familiar yet cold voice, “Prince Jin has spared no effort. Pity, that what We hate the most in this life is other people looking like… that person.”>"
}