{
	"url": "https://www.novelupdates.com/series/the-undetectable-strongest-job-rule-breaker/",
	"title": "The Undetectable Strongest Job: Rule Breaker - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/10/Rulebreaker_v1d.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Fantasy   Harem   Mature   Romance   Shounen   ",
	"tags": "Accelerated Growth   Adapted to Manga   Adventurers   Assassins   Beautiful Female Lead   Calm Protagonist   Cheats   Clever Protagonist   Couple Growth   Cunning Protagonist   Demi-Humans   Devoted Love Interests   Early Romance   Fantasy World   First-time Interc**rse   Game Elements   Guilds   Kidnappings   Kingdoms   Level System   Male Protagonist   Monsters   Multiple POV   Multiple Reincarnated Individuals   Nobles   Overpowered Protagonist   Polygamy   Pragmatic Protagonist   Proactive Protagonist   R-15   Reincarnated in Another World   Reincarnation   Royalty   Schemes And Conspiracies   Soul Power   Special Abilities   Strong Love Interests   Strong to Stronger   Sword And Magic   Transmigration   Transported to Another World   Weak to Strong   ",
	"rating": "(3.7 / 5.0, 477 votes)",
	"author": "Yasuaki Mikami   三上康明   ",
	"year": "\n2017",
	"ranking": "#60   #463   #80   #189   #207   ",
	"reviewcount": "97 Reviews sorted by",
	"description": "By some ill fortune, Hikaru died in a traffic accident. He was in heaven standing in line, waiting to be judged, when he took an unexpected request to transfer his soul to a person in another world. He received an ability called Soul Board which he could use to allocate points to Skills to make himself more powerful.\n\nBut there was a catch…\n\n「I want you to take revenge on someone for me  within an hour. If you don’t, I’ll destroy your soul.」\n\nTo pull off the task assigned to him, he poured all his available points to the Stealth skill tree.\n\nThis is a story of a boy who specialized in Stealth. With his skill trees as weapons, he would demonstrate his unrivaled strength in another world.>"
}