{
	"url": "https://www.novelupdates.com/series/stuttering-big-bosss-white-moonlight/",
	"title": "Stuttering Big Boss’s White Moonlight - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/01/Stuttering-Big-Bosss-White-Moonlight.jpg",
	"noveltype": "(CN)",
	"genre": "Fantasy   Romance   School Life   Slice of Life   ",
	"tags": "Beautiful Female Lead   Character Growth   Clingy Lover   Determined Protagonist   Devoted Love Interests   Doting Love Interests   Female Protagonist   Glasses-wearing Love Interests   Handsome Male Lead   Heartwarming   Inferiority Complex   Love Interest Falls in Love First   Modern Day   Obsessive Love   Poor to Rich   Proactive Protagonist   Reincarnation   Second Chance   Shy Characters   Weak to Strong   Wealthy Characters   ",
	"rating": "(4.6 / 5.0, 115 votes)",
	"author": "南陵一别   ",
	"year": "\n2020",
	"ranking": "#1401   #1588   #3453   #975   #2461   ",
	"reviewcount": "31 Reviews sorted by",
	"description": "Cheng Chu always thought that she and Gu Miao would be married only in name. It was a business marriage that looked like a perfect match. Until a car accident happened and Gu Miao protected her firmly. At the last moment of his life, Cheng Chu heard him confess his feelings.\n\nAfter waking up again, Cheng Chu returned to the high school era. She discovered that the autistic and stuttering boy in the class turned out to be her newlywed husband, the big businessman in the future.\n\nShe wants to compensate him well.\n\n* In high school, Cheng Chu was the dream of many boys. Gu Miao stayed hidden in the darkness, knowing that he was unworthy of her, but the delusion in his heart still grew like weeds.\n\nHe thought it was a bitter and hopeless crush after all. Until that afternoon, when the bright sunshine flooded the classroom, the girl stood at his desk and asked with a smile: “Will you sit at the same table with me?” *\n\n** ” Mr. Gu Miao, would you like to marry Ms. Cheng Chu? Love her and be loyal to her, no matter if she is poor, sick, or disabled, until death.” the pastor asked on the stage.\n\nBut the bridegroom did not answer for a long time.\n\nIn the hotel, the clothes are fragrant and the shadows are gathered, and the dazzling crystal lights reflect the dazzling light.\n\nThe most prestigious person in the whole city, Mr. Gu, who was usually indifferent and decisive, his eyes reddened, and it took a long time for him to say “I- I- I do.” **>"
}