{
	"url": "https://www.novelupdates.com/series/the-crown-prince-im-raising-has-turned-evil/",
	"title": "The Crown Prince I’m Raising Has Turned Evil - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/12/The-Crown-Prince-Im-Raising-Has-Turned-Evil.jpg",
	"noveltype": "(CN)",
	"genre": "Fantasy   Gender Bender   Historical   Romance   ",
	"tags": "Beautiful Female Lead   Charming Protagonist   Childhood Friends   Clever Protagonist   Couple Growth   Cross-dressing   Determined Protagonist   Empires   Female Protagonist   Handsome Male Lead   Love Interest Falls in Love First   Persistent Love Interests   Politics   Possessive Characters   Power Couple   Protagonist Strong from the Start   Reincarnation   Revenge   Royalty   Smart Couple   Strong to Stronger   Tomboyish Female Lead   Transmigration   Transported to Another World   Unconditional Love   Wars   ",
	"rating": "(4.3 / 5.0, 60 votes)",
	"author": "Fēng Yǔ Zìrán   Wind & Nature   风与自然   ",
	"year": "\nN/A",
	"ranking": "#1874   #1862   #4027   #2845   #3402   ",
	"reviewcount": "13 Reviews sorted by",
	"description": "In pursuit of repaying her favor to the Empress, Xie Lin Lang traveled thousands of miles to the side of the decrowned Crown Prince in hopes of teaching and raising him to become a brilliant and intelligent emperor.\n\nHowever, she didn’t expect that her first mission after arriving would be to prevent him from becoming evilized!\n\nSeeing the Crown Prince about to poison the water source to kill the family of his enemies, Xie Lin Lang cried, “Don’t do it, your highness! Revenge done precisely is the trend nowadays! How about I teach you a set of unbeatable martial arts instead?”\n\nSeeing the Crown Prince with his army ready for a coup d’etat any second, Xie Lin Lang cried, “Don’t do it, your highness! I have the money and the food. How about we go the peaceful political route?”\n\nDays after days of trepidation, she didn’t think that the Crown Prince became evilized anyway! Not to mention stealing her bride, he even trapped her into a corner.>"
}