{
	"url": "https://www.novelupdates.com/series/mark-me/",
	"title": "Mark Me - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/09/Mark-Me.png",
	"noveltype": "(CN)",
	"genre": "Romance   School Life   Shounen Ai   ",
	"tags": "Arrogant Characters   Bickering Couple   Black Belly   Complex Family Relationships   Enemies Become Lovers   Handsome Male Lead   Mismatched Couple   Misunderstandings   Omegaverse   Popular Love Interests   Shameless Protagonist   Sleeping   ",
	"rating": "(4.2 / 5.0, 39 votes)",
	"author": "Paz   ",
	"year": "\n2019",
	"ranking": "#2000   #2000   #9204   #11075   #7380   ",
	"reviewcount": "1 Review sorted by",
	"description": "There’s a well-known Alpha in No. 2 Middle School who should not be messed around.\n\nSleeping inside the school and fighting outside the school. Jiang Huai has been ranked first on the list of “Which student do you want to kill the most?” by his teachers for many years and was the first on the poll of “Which Alpha in the school do you think is the most difficult to provoke?” recognized by the students of No. 2 Middle School.\n\nIt was said that Jiang Huai also forced the Omega he liked. The other person was nearly marked and was forced to transfer to another school.\n\nHowever, such a well-known Alpha with bad behavior had an accident in the toilet. The other person saw him holding a syringe and pushing the Omega’s special pheromone inhibitor into his vein.\n\nJiang Huai has always been dissatisfied with the student named Bo Jian. Who has a rich family background, good looks, and smart. He ranked first on the list of “The Most Attractive Alpha” voted by the students of No. 2 Middle School and “The Alpha that the Whole School Wants to Socialize the Most”.\n\nBo Jian, this kind of attractive young man. Jiang Huai thought he could flip him over with one hand.\n\nUntil that day, in the men’s restroom. He was caught by Bo Jian when he was injecting his pheromone inhibitor.\n\nHe landed a punch on Bo Jian’s face and Bo Jian twisted his arms behind his back, his breath against his nape: “… Oh, you’re an Omega?”\n\nDuring summer physical education class, before the next lesson.\n\nBo Jian was blocked by Jiang Huai. “I don’t want to use inhibitors. Do me a favor, and bite me.”\n\nBo Jian chuckled: “Why?”\n\nJiang Huai sniffed the cold smell of mint leaves like a snowy night in the air.\n\n“You deliberately seduce me with pheromones.”>"
}