{
	"url": "https://www.novelupdates.com/series/eighties-housekeeper-little-wife/",
	"title": "Eighties Housekeeper Little Wife - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/01/Eighties-Housekeeper-Little-Wife.jpg",
	"noveltype": "(CN)",
	"genre": "Fantasy   Romance   ",
	"tags": "Beautiful Female Lead   Business Management   Childcare   Complex Family Relationships   Cooking   Disabilities   Familial Love   Female Protagonist   Handsome Male Lead   Multiple Reincarnated Individuals   Overpowered Protagonist   Poor to Rich   Transmigration   ",
	"rating": "(3.6 / 5.0, 13 votes)",
	"author": "一杯甜茶   ",
	"year": "\nN/A",
	"ranking": "#2000   #6247   #9601   #9324   #9627   ",
	"reviewcount": "4 Reviews sorted by",
	"description": "Yuanyuan is the last life steward system in the future world. After 5023, all mankind has entered the era of mechanization. Unfortunately, she will be destroyed. After being destroyed, Yuanyuan discovered that she had actually traveled to the 1980s when supplies were scarce. She became the second cannon fodder who abused her nephew and niece. She was finally cleaned up by her husband who was an officer. She was abducted and trafficked to her death in the mountains. \n\nShen Huai has a handsome face and extraordinary aura. As soon as Yuanyuan approaches him, she has a steady stream of energy supply, filling her with energy. There is such a good energy in front of her. She can’t get a divorce when she says nothing. She sees a man’s body compare with each other day by day. A good day, but the look in her eyes is getting more and more wrong. (TN: part of me feels it meant to say ‘his’ eyes as in the ML but I can’t be sure so I’m leaving it)\n\nI heard that Shen Huai brought back a daughter-in-law from a rural town. Everyone thought that the girl from a small place had never seen the world, and she must be ugly in a big city, but she didn’t understand etiquette. I didn’t expect this girl to stun everyone with her fluent English. The state banquet chefs clapped their hands for good dishes. The Shen family thought that this was already very good. They didn’t know that the girl could cut, cultivate, animal husbandry, pharmacy, acupuncture, brewing, craftsman, the whole decathlon. While everyone was envious, jealous and hated, they all sighed that Head Shen really picked up the treasure. Everyone in the army heard that Shen Huai was often in a daze because he missed his little wife at home, and his comrades all wanted to know how beautiful his wife was, so that the cold and abstinent head could not think about it. On the day Chen Yuan entered the military hospital, she was said to have caused a sensation because of her high appearance, which led to an increase in the registration rate. One-sentence introduction: Relying on food to conquer the cold husband’s intention: work hard to make progress every day.>"
}