{
	"url": "https://www.novelupdates.com/series/in-a-world-where-women-are-strong-it-is-strange-that-i-a-man-is-the-strongest-in-the-world/",
	"title": "In a World Where Women Are Strong, It Is Strange That I, a Man, Is the Strongest in the World - Novel Updates",
	"image": "https://www.novelupdates.com/img/noimagefound.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Comedy   Ecchi   Fantasy   Harem   Martial Arts   Romance   ",
	"tags": "Male Protagonist   Overpowered Protagonist   Polygamy   Protagonist Strong from the Start   Strong to Stronger   ",
	"rating": "(2.1 / 5.0, 15 votes)",
	"author": "Shiryu   ",
	"year": "\n2020",
	"ranking": "#2000   #2000   #10492   #4389   #10827   ",
	"reviewcount": "1 Review sorted by",
	"description": "Tensei-It is the title of the strongest in the world.\r\n\r\nOne day, the sacred Legina came down to the city in search of a successor.\r\n\r\nWhat he found there was … a world where women were supposed to be strong, but a boy about ten years old was messing around with ten women.\r\n\r\n“It’s this guy …!”\r\n\r\nLegina decided to raise the boy, Kamil\r\n\r\nKamil is full of swordsmanship talent and grows at an amazing speed even in the heavens.\r\n\r\nThe predecessor Tensei appears there and sees Kamil’s talent.\r\n\r\n“He has a talent for magic.”\r\n\r\n“Huh? A talent for swords?”\r\n\r\n“… Eh?”\r\n\r\nKamil had not only a talent for swords, but also a talent for magic.\r\n\r\nImmediately he learns that he is talented not only in swords and magic, but also in the fighting spirit of hitting with his bare hands .\r\n\r\nKamil who has mastered all three, even though each one will lead to heaven.\r\n\r\nAfter only five years of training, he became strongest , and in three years he became the strongest heavenly god in history.\r\n\r\n“Isn’t Tensei a profession? I’ve never heard of the strongest in the world?”\r\n\r\nKamil came to Tensei without being told that Tensei was the strongest in the world.\r\n\r\nAfter that, various incidents came to Kamil of Tensei.\r\n\r\n“I’ve worked hard, so I want to live a little more slowly …” –This\r\n\r\nis the story of a man who unknowingly became the strongest in a world where women are strong.>"
}