{
	"url": "https://www.novelupdates.com/series/madness-of-the-heart/",
	"title": "Madness of the Heart - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/02/Madness-of-the-Heart_1613550639.jpg",
	"noveltype": "(CN)",
	"genre": "Adult   Mature   Mystery   Shounen Ai   ",
	"tags": "Adapted to Manhua   Boss-Subordinate Relationship   Charismatic Protagonist   Childhood Friends   Clever Protagonist   Clingy Lover   Crime   Detectives   Doting Love Interests   Doting Older Siblings   Handsome Male Lead   Investigations   Long-distance Relationship   Manly Gay Couple   Modern Day   Murders   Mystery Solving   Older Love Interests   Police   Power Couple   Protagonist Falls in Love First   Secret Relationship   Smart Couple   Strong Love Interests   Unconditional Love   ",
	"rating": "(4.6 / 5.0, 86 votes)",
	"author": "初禾   ",
	"year": "\n2019",
	"ranking": "#2000   #2000   #4720   #1697   #3470   ",
	"reviewcount": "10 Reviews sorted by",
	"description": "Upon completing a year-long training program with a special operations team at the Ministry of Public Security, Ming Shu returns to Dongye City to discover that he has a new boss.\n\nMany people said to him, “Ming-ge, the new boss is such an enigma. Don’t let him harass you.”\n\nTo which Ming Shu replied, “…that guy has been harassing me for years. You guys just don’t know it.”\n\nEver since Ming Shu returned to the bustling metropolis of Dongye City, strange murders have been cropping up one after another. An unemployed man suddenly goes berserk in a cafe. A mysterious incident occurs at a long-abandoned playground in the middle of the night. Underneath the body of a man who met a tragic end, a second corpse is discovered to be buried.\n\nCaptain of the Serious Crimes Division, Ming Shu, and Deputy Director of the Criminal Investigation Bureau, Xiao Yu’an, join forces to investigate and solve all these bizarre cases and more.\n\nNote: The main plot is a criminal investigation drama. Part of the same series as ‘Poisoned Heart’.>"
}