{
	"url": "https://www.novelupdates.com/series/break-world-online-the-abhorred-and-denounced-vampire-becomes-a-famous-live-streamer/",
	"title": "Break World Online ~ The Abhorred and Denounced Vampire Becomes a Famous Live Streamer - Novel Updates",
	"image": "https://www.novelupdates.com/img/noimagefound.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Fantasy   Shoujo Ai   ",
	"tags": "Antihero Protagonist   Artificial Intelligence   Calm Protagonist   Demons   Depictions of Cruelty   Evolution   Famous Protagonist   Fantasy World   Female Protagonist   Gamers   Level System   MMORPG   Modern Day   Ruthless Protagonist   Sword And Magic   Vampires   Virtual Reality   ",
	"rating": "(4.0 / 5.0, 50 votes)",
	"author": "ハッピー   ",
	"year": "\n2021",
	"ranking": "#546   #1282   #2396   #925   #4883   ",
	"reviewcount": "4 Reviews sorted by",
	"description": "The self-proclaimed average high school girl Tozawa Rio, invited by her friend, Onodera Eriko who is also a live streamer decides to play 『Break World Online』, a VRMMO title that boasts various novelties and royalties that was about to reach its third anniversary as the live streamer,【RIO】.\r\n\r\nDespite not having any intentions to go pro as a live streamer and had decided to continue her amateurish career, her ambition as a player is to be the top among all players in the virtual world unlike her mediocre self in the real world.\r\n\r\nHowever, Eriko's viewers that arrived to check out the stream by her recommendation were shocked. \r\n\r\nThe reason being, not just choosing the 《Vampire》 race that has harsh conditions, hard to use, and moreover antagonized by humans, NPC residents in the starting town were killed without hesitation and turned into kins on the first stream.\r\n\r\nInsistent for the G (genocide) route and roleplaying as a villain, no matter how one may look at it, it is not a play style that can be derived from an average high school girl's thoughts.\r\n\r\nSucking blood to become stronger, crushing the dystopia of the hypocritical bunch. \r\n\r\nAt some point, former players that were forced to retire in frustration due to the game's state gathered one after another around RIO as her viewers.>"
}