{
	"url": "https://www.novelupdates.com/series/life-of-a-reincarnated-celebrity-a-young-otaku-idol-who-had-a-bad-life-jumps-into-the-entertainment-industry-for-the-second-time-in-order-to-save-the-life-of-his-idolized-girl-who-died-mysteriousl/",
	"title": "Life of a Reincarnated Celebrity: A Young Otaku Idol, Who Had a Bad Life, Jumps Into the Entertainment Industry for the Second Time in Order To Save the Life of His Idolized Girl, Who Died Mysteriously. - Novel Updates",
	"image": "https://www.novelupdates.com/img/noimagefound.jpg",
	"noveltype": "(JP)",
	"genre": "Comedy   Romance   School Life   ",
	"tags": "Acting   Celebrities   Handsome Male Lead   Hard-Working Protagonist   Low-key Protagonist   Male Protagonist   Modern Day   Second Chance   Showbiz   Siblings Not Related by Blood   ",
	"rating": "(3.0 / 5.0, 8 votes)",
	"author": "Haaana Denka   ハーーナ殿下   ",
	"year": "\n2021",
	"ranking": "#2000   #2000   #10171   #9319   #11260   ",
	"reviewcount": "2 Reviews sorted by",
	"description": "Raita, a young man who has led a negligent life, loses his right leg and his entire family in an unfortunate car accident when he is a high school student and falls into the depths of life. He is saved by a beautiful and wise girl he meets on the internet. Raita made cheering her on his life and was able to reintegrate into society until he became a working man.\n\n　But before she can make her major debut, she dies mysteriously. Raita, too, is devastated and dies young from the after-effects of the accident.\n\n　But was it God’s whim?　The next thing he knew, he was reincarnated as a schoolboy and given the chance to start his life all over again. This time, he doesn’t want to regret it! In order to save the life of the girl he loves, he decides to use all the knowledge and experience of his previous life to become an entertainer himself.\n\n　This is the story of a young man who loves idols more than anything else, and through his unyielding efforts, he grows into a non-standard, handsome entertainer. Against enormous difficulties, he overcomes them with his indomitable spirit, energy and previous life knowledge cheats to transform the history of the entertainment industry. This is the story of a beautiful girl model, actress and idol who is recognized by many people and becomes very active. What?　Can I play this?　Yes, I can. I’m quite good at that kind of thing.>"
}