{
	"url": "https://www.novelupdates.com/series/witch-hand-craft/",
	"title": "Witch Hand Craft - Novel Updates",
	"image": "https://www.novelupdates.com/img/noimagefound.jpg",
	"noveltype": "(JP)",
	"genre": "Fantasy   Shoujo   ",
	"tags": "Broken Engagement   Crafting   Fantasy World   Female Protagonist   Magic   Nobles   Underestimated Protagonist   Witches   ",
	"rating": "(4.7 / 5.0, 6 votes)",
	"author": "Fuji Shinta   富士伸太   ",
	"year": "\n2020",
	"ranking": "#1473   #2000   #10350   #8980   #10819   ",
	"reviewcount": "1 Review sorted by",
	"description": "Jill, the first princess of the Dylan Magic Kingdom, was born the daughter of Bazarde, the queen and most powerful witch and was expected to succeed her.\r\n\r\nBut Jill has no talent, she can only use weak magic such as 【Water Creation】 and 【Dry】.\r\nHer control is good, but the power is inferior to a child and her other special skills are sewing and cooking. \r\nIn the end, the king abandoned and banished her from the castle. \r\nHer engagement was broken, she lost her status and in desperation, Jill tried to throw herself into the estate given to her in mercy. \r\n\r\nHowever, inside the estate, she discovers a strange foreign book. \r\nIt was a hobbyist magazine such as, \r\n『Make Your Own Clothes　from One Piece to a Dress』\r\n『Dyeing at Home』\r\n『Easy Leather Craft』\r\n『Let’s Become a Handmade Artist!』\r\n\r\nThe more she reads the book, the more Jill is struck by the catchphrase, \r\n『Wear your own clothes and live your own life, not for anyone else』\r\n「If I apply my magic, I can make all the wonderful clothes in this book\r\n...or rather, I want to make one! It would be ridiculous to die now!」\r\nForgetting about her despair, Jill began to make clothes and accessories utilizing the book’s knowledge, magical plants and flowers found in the garden that can bear any plant. \r\nThen some strange people showed up, including a merchant who took an interest in Jill, a craftsman who sympathized with Jill’s aspirations, and a prince who was supposed to have broken off the engagement...?\r\n\r\nMeanwhile, the signs of rebellion began to appear in the kingdom that had driven Jill out. >"
}