{
	"url": "https://www.novelupdates.com/series/conversations-between-two-childhood-friends-that-seem-like-theyre-dating-but-arent-actually-dating-but-they-totally-look-like-theyre-dating/",
	"title": "Conversations Between Two Childhood Friends That Seem Like They’re Dating but Aren’t Actually Dating but They Totally Look Like They’re Dating - Novel Updates",
	"image": "https://www.novelupdates.com/img/noimagefound.jpg",
	"noveltype": "(JP)",
	"genre": "Comedy   Romance   School Life   ",
	"tags": "Beautiful Female Lead   Childhood Friends   Female Protagonist   Heartwarming   Male Protagonist   Multiple POV   Popular Love Interests   ",
	"rating": "(4.4 / 5.0, 57 votes)",
	"author": "Nyouro Kesseki   尿路結石   ",
	"year": "\n2021",
	"ranking": "#2000   #6369   #3757   #5246   #5181   ",
	"reviewcount": "4 Reviews sorted by",
	"description": "Toriyabe Ouka: Second year in high school, male. Average looks. Somewhat popular.\n\nHananoki Asuka: Second year in high school, female. Stunning looks. Super popular. Makes dirty jokes if it's to Ouka\n\nThe two are next-door neighbours who have been friends since kindergarten.\n\n“Hey, Ouka.”\n\n“Yeah, Asuka?”\n\n“Someone confessed to me today.”\n\n“For real? Who?”\n\n“Noda from the soccer club. The captain.”\n\n“What kind of confession? Was he like, ‘sorry, I was actually the one who hid your shoes’?”\n\n“How did you come up with that? It was a confession of love. He said he liked me.”\n\n“Well if he likes you, wasn’t he just confessing the goodwill he feels towards you, not his love?”\n\n“Stop nitpicking. I want to know what you think. Should I go out with him?”\n\n“Do you like him?”\n\n“Not really, and plus I’ve never even dated a guy before.”\n\n“Then you shouldn’t. I heard he has a bad reputation too.”\n\n“What did you hear about him?”\n\n“… That he’s good looking.”\n\n“And that’s a bad thing?\n\n“Also I heard he’s good at soccer.”\n\n“Now you’re just praising him.”\n\n“…”\n\n“So you don’t want me to date him?”\n\n“… I don’t mind.”\n\n“Okay, then I won’t date him.”\n\n“… No, I just—”\n\n“Boohoo, I wonder when you’ll be able to live without your dear childhood friend.”\n\n“… And I wonder when you’ll stop coming to my room after school.”\n\n“But we both know you’d be lonely without me.”\n\n“Says you.”\n\n… This is a novel made up of flirty conversations between two childhood friends who insist they’re not dating when they’re clearly dating.>"
}