{
	"url": "https://www.novelupdates.com/series/death-progress-bar/",
	"title": "Death Progress Bar - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/01/4b2c98f5gy1fsrb1yq2ipj205k07sjs6.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Drama   Mature   Mystery   Psychological   Romance   Slice of Life   Supernatural   Yaoi   ",
	"tags": "Appearance Changes   Betrayal   Boss-Subordinate Relationship   Brother Complex   Brotherhood   Caring Protagonist   Cheats   Comedic Undertone   Complex Family Relationships   Couple Growth   Dense Protagonist   Determined Protagonist   Devoted Love Interests   Disabilities   Doting Love Interests   Dreams   Fat to Fit   Handsome Male Lead   Hard-Working Protagonist   Heartwarming   Honest Protagonist   Identity Crisis   Investigations   Kidnappings   Love Interest Falls in Love First   Loyal Subordinates   Lucky Protagonist   Manly Gay Couple   Misunderstandings   Modern Day   Mystery Solving   Organized Crime   Power Couple   Pragmatic Protagonist   Schemes And Conspiracies   Shameless Protagonist   Siblings   Sickly Characters   Smart Couple   System Administrator   Tragic Past   Transmigration   Unreliable Narrator   Weak to Strong   ",
	"rating": "(4.6 / 5.0, 658 votes)",
	"author": "Can’t Play Chess   不会下棋   ",
	"year": "\n2018",
	"ranking": "#3133   #3096   #508   #2413   #186   ",
	"reviewcount": "128 Reviews sorted by",
	"description": "Shi Jin once read a book. It was supposed to be about satisfying the desire for vengeance.\n\nThe main character, also named Shi Jin, was the sixth son of his harem-novel-protagonist-like father. All was well, while his father was alive at least, but after his death, Shi Jin’s five elder half-brothers tormented him, eventually leading to his death. The protagonist was reborn, determined to take revenge, and… the novel was discontinued.\n\nThat day, Shi Jin almost spat blood and dropped the book into a shredder. The next day, he died in a car accident. Somehow, when he came to, he had transmigrated into a teenager, a youth also called Shi Jin.\n\nThere was only one problem. His father had just died. His older brothers were about to torment him…\n\nShi Jin: Let’s eliminate my brothers’ hatred, my goal is to keep my life!>"
}