{
	"url": "https://www.novelupdates.com/series/picked-up-by-the-protagonist-of-a-tormentedmc-novel/",
	"title": "Picked up by the Protagonist of a Tormented! MC Novel - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2017/11/edfffe039da332cd6c961e8a4ff03949.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Fantasy   Martial Arts   Romance   Yaoi   ",
	"tags": "Academy   Age Progression   Age Regression   Betrayal   Calm Protagonist   Child Protagonist   Childcare   Cold Love Interests   Cross-dressing   Death of Loved Ones   Devoted Love Interests   Guardian Relationship   Kingdoms   Late Romance   Male Yandere   Mature Protagonist   Older Love Interests   Possessive Characters   Precognition   Priestesses   Protagonist Falls in Love First   Slow Romance   Stoic Characters   Strong Love Interests   Time Skip   Transmigration   Weak to Strong   ",
	"rating": "(4.3 / 5.0, 558 votes)",
	"author": "藏姝   ",
	"year": "\n2016",
	"ranking": "#2686   #2879   #695   #1642   #346   ",
	"reviewcount": "113 Reviews sorted by",
	"description": "A suffering MC novel—the main character must be forced to suffer, be oppressed until they’re hovering between life and death, dying and living here and there. They can have a golden finger, but before getting it they must pay the price. They can also have beautiful women, but all are snake and scorpion beauties, able to look at but not eat.\n\n“Curse” is just that type of suffering MC novel. The main character Xi Wei, after being forced to experience numerous sufferings, had, at last, become the most powerful, at the same time linking together with the world’s qi and fate. After he was oppressed too miserably, he committed suicide and buried the entire world with him.\n\nZeno transmigrated, in the end arriving at “Curse of shit motherfucker”.\n\nZeno was adopted by the MC, finally becoming the number one person/wife.\n\nZeno: Help, I don’t want to be destined to be raised by this perverse person!\n\nAll living things (wipe away tears): You must rescue this world, ah.\n\nXi Wei: Come over here.>"
}