{
	"url": "https://www.novelupdates.com/series/damn-reincarnation/",
	"title": "Damn Reincarnation - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/01/Damn-Reincarnation.jpg",
	"noveltype": "(KR)",
	"genre": "Action   Adventure   Fantasy   Harem   Mystery   Psychological   Tragedy   ",
	"tags": "Adapted to Manhwa   Aristocracy   Beautiful Female Lead   Bloodlines   Charismatic Protagonist   Cold Protagonist   Demon Lord   Demons   Dense Protagonist   Determined Protagonist   Dragons   Elemental Magic   Elves   Eye Powers   Family Conflict   Fantasy World   Fast Learner   Former Hero   Friendship   Genius Protagonist   Gods   Handsome Male Lead   Hard-Working Protagonist   Heroes   Hot-blooded Protagonist   Legends   Male Protagonist   Mysterious Past   Nobles   Polygamy   Possessive Characters   Previous Life Talent   Protagonist Strong from the Start   Reincarnation   Religions   Romantic Subplot   Ruthless Protagonist   Saints   Strong Love Interests   Strong to Stronger   Sword And Magic   Time Skip   Tragic Past   Tsundere   Unique Weapons   World Tree   Yandere   ",
	"rating": "(4.1 / 5.0, 154 votes)",
	"author": "Mogma   목마   ",
	"year": "\n2020",
	"ranking": "#177   #21   #837   #30   #1535   ",
	"reviewcount": "24 Reviews sorted by",
	"description": "Hamel, a warrior who traveled with his colleagues to exterminate the devil. Yet, he died just before the battle with the devil started.\n\n“Yes.”\n\nWhat the hell?\n\nHe was reborn as the descendant of his fellow warrior, Vermouth.\n\nThe descendant from the bloodline of the great Vermouth, Hamel. No, he was now Eugene Lionhart.\n\n“It was already enough me having the delusion that I was a genius in my past life. But… this… It’s… It’s incomparable.’\n\nFrom a dying body to a new body, he has the achievement that he did not have in his previous life.\n\nAnd, a reincarnation of an unknown origin, the reality of living together with the demons.\n\nFacing a new world where everything is questionable.\n\nThe journey of the unfinished previous life begins with Eugene’s body.>"
}