{
	"url": "https://www.novelupdates.com/series/eldest-miss-divine-calculation/",
	"title": "Eldest Miss Divine Calculation - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/01/Eldest-Miss-Divine-Calculation.jpg",
	"noveltype": "(CN)",
	"genre": "Gender Bender   Historical   Romance   Shoujo   Xianxia   ",
	"tags": "Beautiful Female Lead   Betrayal   Cultivation   Devoted Love Interests   Early Romance   Fantasy World   Female Protagonist   Handsome Male Lead   Heaven   Mythical Beasts   Revenge   ",
	"rating": "(4.0 / 5.0, 3 votes)",
	"author": "Daylight   白天   ",
	"year": "\n2018",
	"ranking": "#2000   #2000   #12358   #9320   #11812   ",
	"reviewcount": "1 Review sorted by",
	"description": "When the Mu family’s First Dandy returns from Nirvana, the realm will change color, and the whole world will be rewritten.\n\nAll the treasures of heaven and earth, as well as the sacred weapons, are in her hands. She will be able to avenge all her grudges and repay all her favors! She can walk horizontally or vertically. Her posture was arbitrary!\n\nReborn and armed with a sacred weapon, she is known to the world as the number one divine fortune-teller!\n\nThe world calls him the No. 1 divine fortune-teller. But when he encounters that person, he cannot control his own heart.\n\n“You have calculated the heavens and the earth, but have you ever calculated my heart for you?” A smile emerged on his handsome face, and he looked like a God that had been banished from Heaven.\n\nThe Mu family’s dandy eldest young master returned from rebirth to produce clouds with one turn of the hand and rain with another.\n\nWhen she stood at the summit, the crowd realized that this was not a dandy eldest young master, but this was clearly a breathtakingly beautiful young lady!\n\nHow many of the young elites were beating one’s chest and stamping one’s feet, losing the best chance to win the favor of a beautiful woman.\n\nThat man, however, smiled wickedly and dotingly kissed her on the forehead: “Thank you very much for having eyes but failing to see otherwise how could I have a beautiful woman in my arms?”>"
}