{
	"url": "https://www.novelupdates.com/series/proud-farm-girl-with-a-space/",
	"title": "Proud Farm Girl With A Space - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/07/proud-farm-cover.jpg",
	"noveltype": "(CN)",
	"genre": "Fantasy   Romance   Slice of Life   ",
	"tags": "Age Regression   Ancient China   Beautiful Female Lead   Business Management   Calm Protagonist   Cheats   Clever Protagonist   Complex Family Relationships   Cooking   Farming   Female Protagonist   Handsome Male Lead   Hard-Working Protagonist   Magical Space   Modern Knowledge   Money Grubber   Older Love Interests   Pets   Poor Protagonist   Poor to Rich   Psychic Powers   Slow Romance   Transmigration   ",
	"rating": "(3.5 / 5.0, 48 votes)",
	"author": "Tian ju xiao long bao   甜橘小笼包   ",
	"year": "\n2020",
	"ranking": "#2425   #2000   #1321   #7589   #3410   ",
	"reviewcount": "14 Reviews sorted by",
	"description": "After transmigrating, Su Tang became a poor village girl who was not loved by her own father and was abused by her stepmother. After only a few days she was sent as a sacrifice to the River God. Faced with the threat of an imminent second death, Su Tang clenched her fists. Anyway, since she had survived, there was no reason to let herself die again.\n\nSu Tang rolled up her sleeves and, space in hand, she was ready to face the world. She separated from the family, took her younger brother to be adopted somewhere else, did business, bought a manor, and tried to make money every day… Not only did the days become more and more beautiful, but the person also became more and more beautiful. As for getting married, what’s that? Can she eat it? Su Tang’s life motto: I’m fated to face adversity alone so I’ll only love money all my life!\n\nHowever, one day a proud young man appeared outside her door saying: You may not believe it, but my nickname is Money*.\n\nSu Tang: Outside. Squatting. Horse Stance. Go. Now!\n\nA certain proud young man: It’s true, I will now ask my brother, the emperor, to change my name.\n\nSu Tang: …\n\n(tl note: the actual nickname is ‘小钱钱’ which means money in the context and is the same words Su Tang used in the previous line)>"
}