{
	"url": "https://www.novelupdates.com/series/i-transmigrated-into-the-villainess-of-a-historical-reverse-harem-game/",
	"title": "I Transmigrated into the Villainess of a Historical Reverse-Harem Game - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/12/I-Transmigrated-into-the-Villainess-of-a-Historical-ReverseHarem-Game.jpg",
	"noveltype": "(KR)",
	"genre": "Fantasy   Harem   Romance   Shoujo   Supernatural   ",
	"tags": "Abusive Characters   Adopted Protagonist   Aristocracy   Arranged Marriage   Beautiful Female Lead   Child Abuse   Clever Protagonist   Cold Love Interests   Comedic Undertone   Contracts   Doting Love Interests   Family Conflict   Female Protagonist   Game Elements   Handsome Male Lead   Hard-Working Protagonist   Hated Protagonist   Mob Protagonist   Nobles   Obsessive Love   Possessive Characters   Reverse Harem   Transmigration   Transported into a Game World   Unrequited Love   Villainess Noble Girls   Weak to Strong   Wealthy Characters   ",
	"rating": "(3.7 / 5.0, 28 votes)",
	"author": "박록주   ",
	"year": "\n2020",
	"ranking": "#6970   #2000   #7046   #5949   #4625   ",
	"reviewcount": "No Reviews",
	"description": "I transmigrated into the body of the foster daughter who would die instead of the female protagonist; at that, she would die miserably after being wrongfully accused as a gumiho.\r\n\r\nIn order to escape the game, she decided to die as quickly and painlessly as possible. So she lived quietly...\r\n\r\n'Do you think you'd be able to find a house to marry as a war orphan? No one would want to marry someone as lowly as you.'\r\n\r\nThe young master of the Prime Minister's Household who looked at me like a bug just to save his younger sibling.\r\n\r\n'You appear to be the youngest daughter of his Excellency. I will take responsibility for you.'\r\n\r\nThe prince who should be marrying the real young lady of the house.\r\n\r\n'Is it true that you ate the liver of a cow? That's not something a person like you should be eating! Please promise me that you would not do something like that ever again.'\r\n\r\nEven the neighboring country's aristocrat started to follow me about.\r\n\r\nShe was living as silently as a mouse, who's dead as a doornail, so she could see the ending, but everything keeps getting twisted.\r\nEven the Prime Minister's real young lady has started to act weirdly...\r\n\r\n'Yeonhee, I like you so much. Because I don't think you'll ever betray me.'\r\n\r\nNo, I tell you, I just want to live quietly and die?!>"
}