{
	"url": "https://www.novelupdates.com/series/the-strongest-prophet-who-had-trained-100-heroes-is-admired-by-his-apprentices-around-the-world-even-as-an-adventurer/",
	"title": "The Strongest Prophet Who Had Trained 100 Heroes is Admired By His Apprentices Around The World Even As An Adventurer - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/07/eg1qbsygkwi3c8na46h27f1db9r6_tx2_n0_xc_4cwp.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Comedy   Fantasy   Slice of Life   ",
	"tags": "Adapted to Manga   Adventurers   Fantasy World   Heroes   Magic   Male Protagonist   Precognition   Protagonist Strong from the Start   Sword Wielder   Teachers   ",
	"rating": "(3.4 / 5.0, 38 votes)",
	"author": "Amaui Shiroichi   あまうい白一   ",
	"year": "\n2018",
	"ranking": "#6970   #2000   #3297   #6713   #4082   ",
	"reviewcount": "2 Reviews sorted by",
	"description": "—The master of the strongest heroes is even stronger, but now he travels secretly to his apprentices—\r\n\r\nEisen is a man who raised 100 heroes and saved the world by ending the war with an evil god. He had recovered from the wounds inflicted on his body in the「Other World」in exchange for protecting the heroes. During the times he has been recuperating, the heroes he had saved became successful due to his tutelage and developed the 「Human World」 as leaders of various countries. As a result, each of the hundred heroes reported to their Eisen-sensei whom they admired saying—\r\n\r\n“Please, come visit our countries.”\r\n\r\nReading all of these, Eisen one day decided—\r\n\r\n“I’m going on a journey around the world and see these places that my apprentices recommended me. It looks fun.”\r\n\r\n“It sure sounds fun, Eisen-sensei. So, have you sent your apprentices a letter about this?”\r\n\r\n“Nope, everybody’s in a tough position. I’ll just quietly visit and greet them so I won’t be a bother.”\r\n\r\nThus, Eisen the master of heroes, secretly set out on a journey to visit each of his apprentices and to sightsee different countries.>"
}