{
	"url": "https://www.novelupdates.com/series/mulan-has-no-elder-brother/",
	"title": "Mulan Has No Elder Brother - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2018/12/mulan.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Fantasy   Historical   Josei   Martial Arts   ",
	"tags": "Adapted to Drama   Adapted to Manhua   Ancient China   Buddhism   Cross-dressing   Daoism   Familial Love   Female Protagonist   Friendship   Military   Modern Knowledge   Protagonist Strong from the Start   Slow Romance   Transmigration   ",
	"rating": "(4.4 / 5.0, 65 votes)",
	"author": "Qi Dao Jun   祈祷君   ",
	"year": "\n2016",
	"ranking": "#6970   #6200   #4602   #6964   #4404   ",
	"reviewcount": "10 Reviews sorted by",
	"description": "Having transmigrated from being a twenty-eight years old female forensic doctor, into a Hua Mulan that had taken off her armor and now returned home, He Mulan expressed there was quite a lot of pressure.\n\nAnd completely unlike the ending of the story, there weren’t any fresh flowers and there weren’t any applause. The already thirty years old Hua Mulan, who returned home after removing her armor, was already a monster in the rumors around the countryside.\n\nShe was a mix of Xianbei and Han Chinese, her height was tall, her appearance not at all beautiful, her temperament was cold, her strength without a comparison. She had even killed before, wielded a saber before, and had the reputation of eating at the same table, living under the same roof as men for twelve years. She had long been prepared for a lifetime of loneliness.\n\nThe line she used to refuse the emissary from Rouran, as well as the requests of her relatives: “My menses never came before”, had further become the original sin of her failure at being a woman.\n\nThe He Mulan who’d been defrauded by the villagers until she wanted to vomit blood, resolutely stated:\n\nIf she could do it again, she’d definitely conceal her identity, accept the position in the bureaucracy, get a promotion, raise her salary and reach the pinnacle of her life.\n\nIn any case, she wouldn’t stand for this extreme suffering!>"
}