{
	"url": "https://www.novelupdates.com/series/the-owner-of-the-summer-villa/",
	"title": "The Owner of the Summer Villa - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/02/The-owner-of-the-summer-villa.jpg",
	"noveltype": "(KR)",
	"genre": "Adult   Fantasy   Josei   Mature   Mystery   Romance   Slice of Life   Smut   ",
	"tags": "Aristocracy   European Ambience   Female Protagonist   Handsome Male Lead   Love at First Sight   Love Interest Falls in Love First   Nobles   Writers   ",
	"rating": "(3.2 / 5.0, 6 votes)",
	"author": "유폴히   ",
	"year": "\n2018",
	"ranking": "#2000   #2000   #12955   #9891   #8814   ",
	"reviewcount": "No Reviews",
	"description": "Charlotte Blyth, a girl who dreamed of becoming a heroine in a romance novel. With her beautiful first love in her heart, she chooses to marry a great nobleman. Her life, which seemed to be happy, envied by many people, falls into hell one day.\n\n‘My husband is dead. The body disappeared. Now, everyone doubts me.’\n\nCharlotte Point of view:\n\nBorn as the fourth daughter of a fallen baron, she was chosen by Count Bell, the head of the highest family of the Esseln Empire for her outstanding beauty.\n\nContrary to the expectation that she would enjoy a rosy marriage, like the heroines of the romance novels she had been reading all the time, her marriage began to crack from day one.\n\nAs if it was an escape from such a marriage, she immersed herself in writing romance novels, and as a result, she succeeded in all her three published works.\n\nThe day when fate pushed her back, thinking of a new future, she faces a living room stained with blood.\n\nLooking exactly the same as the plot written in her novel she wrote.\n\nFrederick Point of view: Six years ago, he met her as a19 years old boy at a summer cottage in the countryside.\n\nHe also fell in love with her at first sight and sent a letter to her every night.\n\nThe two’s sincerity was conveyed to each other, and they thought that they were each other’s special person, but suddenly she married another man and left the village like that.\n\nSix years later, standing in front of her, she has become a witch who killed her husband,\n\nShe hides her boyish smile behind her sullen and deep eyes, and he appears to be the only person who can save her.>"
}