{
	"url": "https://www.novelupdates.com/series/im-the-only-stabilizer-for-the-yandere-male-lead-in-the-bl-novel/",
	"title": "I‘m the Only Stabilizer for the Yandere Male Lead in the BL Novel - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/07/Im-the-Only-Stabilizer-for-the-Yandere-Male-Lead-in-the-BL-Novel.jpg",
	"noveltype": "(KR)",
	"genre": "Fantasy   Mature   Psychological   Romance   ",
	"tags": "European Ambience   Female Protagonist   Handsome Male Lead   Hiding True Identity   Human Experimentation   Love Interest Falls in Love First   Male Yandere   Obsessive Love   Possessive Characters   R-15   Transmigration   ",
	"rating": "(3.8 / 5.0, 36 votes)",
	"author": "백일홍   ",
	"year": "\n2022",
	"ranking": "#2566   #1370   #7732   #3566   #6791   ",
	"reviewcount": "2 Reviews sorted by",
	"description": "“I—I like you!”\r\n\r\nPossessed as the weakling in a waste BL novel.\r\n\r\nThe only guide and stabilizer in this story.\r\n\r\nIt was a matter of my immediate survival—\r\n\r\nThis place is full of obsessive, deranged maniacs and yandere psychos who were raised as experimental subjects and lack emotions!\r\n\r\nAt this rate, one guy will destroy the lab and we are all going to perish forever!\r\n\r\nLet’s do whatever it takes to survive for now—\r\n\r\n“… What?”\r\n\r\n“I like you!”\r\n\r\nHe looked at me with a subtle expression.\r\n\r\n“I’m a man.”\r\n\r\nRight, I am a man right now… !\r\n\r\nBecause I’m terrified—\r\n\r\nLet’s try harder!\r\n\r\n“I like you more because you’re a man! I mean it!”\r\n\r\nNow I have to be your ray of light,\r\n\r\nFeed you well,\r\n\r\nI’ll nurse and treat you,\r\n\r\nBe with you when you’re sad or in pain.\r\n\r\nThanks to my tearful efforts\r\n\r\nThe madman destroyed the lab, but he didn’t kill for fun!\r\n\r\nI managed to get out of there and now say goodbye to him so that we can live our own lives.\r\n\r\nThen.\r\n\r\n“I—I like you.”\r\n\r\n“Uh?”\r\n\r\n“I like you.”\r\n\r\n“Huh?!”\r\n\r\n“I like that you are a man.”\r\n\r\n“… But I am a woman?”\r\n\r\nIt was the first time I saw his eyes glow like that.\r\n\r\nA vivid obsessive madness on the verge of going utterly insane.>"
}