{
	"url": "https://www.novelupdates.com/series/forcefully-doting-on-you/",
	"title": "Forcefully Doting On You - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/07/forcefully.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Martial Arts   Romance   Yaoi   ",
	"tags": "Acting   Ancient Times   Artists   Black Belly   Celebrities   Charismatic Protagonist   Charming Protagonist   Cute Protagonist   Dense Protagonist   Devoted Love Interests   Handsome Male Lead   Hard-Working Protagonist   Human-Nonhuman Relationship   Love Interest Falls in Love First   Lucky Protagonist   Masochistic Characters   Mob Protagonist   Modern Day   Modern Knowledge   Multiple Realms   Omegaverse   Possessive Characters   Showbiz   Stalkers   Strong Love Interests   System Administrator   Transmigration   Transported to Another World   World Hopping   ",
	"rating": "(3.7 / 5.0, 115 votes)",
	"author": "铃鹿   ",
	"year": "\n2019",
	"ranking": "#2773   #1869   #2214   #4123   #2214   ",
	"reviewcount": "28 Reviews sorted by",
	"description": "Mu Cai was a novice transmigrator who traveled around different worlds. He played the role of cannon fodder in each world.\n\nAs we all know, cannon fodders get slapped in the face, abused, and ridiculed by the protagonists.\n\nMu Cai worked conscientiously and made all the preparations he needed thanks to his seniors’ advice. However, he never expected that the plot of each world would spin out of control!\n\nWhen he faced the bad-tempered celebrity:\n\nMu Cai was a bastard that mooched off his brother to get closer to the celebrity he loved. He confidently said, “I love you. Is it wrong to love someone…”\n\nThe bad-tempered celebrity, “No, there’s nothing wrong with loving someone. Please marry me!”\n\nMu Cai, who was prepared beforehand to be beaten black and blue by the celebrity, “???”\n\nWhen he faced the straight alpha:\n\nMu Cai pretended to cry, “Although I am not an omega that can carry a cannon on my shoulder like other omegas, I still want to accompany you to the battlefield…”\n\nThe straight alpha that disliked seeing people cry and complain, “Baby, it’s not that I don’t want you to come along, it’s just that this is too dangerous. I don’t want you to get hurt, so be obedient and stay home.”\n\nMu Cai, who was prepared to be reprimanded for crying and complaining, “???”\n\nWhen he faced the Heavenly Master, who dedicated his life to killing every demon alive:\n\nMu Cai, as a beautiful and charming spirit that had lived for a millennium, sneered and said, “You abandoned me a thousand years ago, and now you have found your true love after a thousand years. I won’t let the two of you live a happy life!”\n\nThe heartless Heavenly Master, “I don’t want to spend the rest of my life with him, I only want you.”\n\nMu Cai, who was prepared to be captured and killed by the Heavenly Master’s spell, “???”\n\nWhen he faced the protagonist, who was an innocent college student:\n\nMu Cai, as the protagonist’s boss, righteously said, “As my plaything, you have to understand…”\n\nThe innocent male college student’s eyes glowed with excitement, “Boss, thank you for the dessert.”\n\nMu Cai, who was pushed onto the bed and was stripped off his clothes, “???”\n\nWhen he faced the scum who only loved his white moonlight.\n\nMu Cai, cried at his one-sided feelings, “Why don’t you love me? Is it because I’m not good enough? Wu wu wu.”\n\nThe scum protagonist was about to speak when he was kicked over by his uncle. The uncle coaxed Mu Cai in a raspy voice, “Baby, please don’t cry. When you cry, I just want to…”\n\nMu Cai, who was getting married to the scum’s uncle as he sat in the bridal chamber, “???”\n\nMu Cai: I advised the protagonists to complete their mission, yet all they want to do is dote on me.>"
}