{
	"url": "https://www.novelupdates.com/series/the-favoured-medical-princess/",
	"title": "The Favoured Medical Princess - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/12/TFMPrincess2.jpg",
	"noveltype": "(CN)",
	"genre": "Adult   Adventure   Fantasy   Historical   Romance   ",
	"tags": "Age Regression   Ancient China   Antihero Protagonist   Aristocracy   Arrogant Characters   Betrayal   Cautious Protagonist   Child Protagonist   Complex Family Relationships   Determined Protagonist   Different Social Status   Doting Love Interests   Early Romance   Family   Family Conflict   Female Protagonist   Love Interest Falls in Love First   Maids   Medical Knowledge   Past Plays a Big Role   Pragmatic Protagonist   Revenge   Royalty   Schemes And Conspiracies   Second Chance   Sharp-tongued Characters   Smart Couple   Tragic Past   ",
	"rating": "(3.9 / 5.0, 33 votes)",
	"author": "Tian Ling   天泠   ",
	"year": "\n2018",
	"ranking": "#2114   #2553   #5436   #3971   #5618   ",
	"reviewcount": "4 Reviews sorted by",
	"description": "In the previous life, Nangong Yue was pitted to death by herself.\n\nShe was born in a well-known family and distinguished status. She was taught by the world’s miracle doctor and her medical skills were the best in the world.\n\nShe did everything she could to help him ascend the Imperial Throne from a Prince, but return she got was an imperial edict to execute the whole family!\n\nShe was imprisoned in the cold palace, forbearance to plot, and finally destroyed his world by her own hands.\n\nOnce the big hatred was reported, she ended up smiling. But she didn’t expect opened her eyes, but returned to the year when she was nine years old.\n\nThe Di Daughter was born again. In this life, she will not allow anyone to bully her, humiliate her, despise her and trample her!\n\n     Elder brother who drowned at young age and the mother who went insane and died prematurely, in this life, she must keep them happy and healthy.\n\nStepmother of the previous life, don’t you like to seduce a married man? Then I’ll find you a man with broken sleeves(gay) and divide peaches, and let you seduce enough!\n\nHusband of the previous life, don’t you use any means for the throne? In this life, no matter how you calculate, you will never get the throne!\n\nDear cousin, the pain of robbing your husband and killing your family in the past life will let you return it slowly!\n\nEccentric grandmother, the best relatives; since you want to fight, then simply fight in upside down!\n\nAt first thought that this life, she will spend rest of her life in solitary. Didn’t expect that the cruel and vicious “God of killing” Zhennan Wang who killed his own father and brother, quietly appeared in her life. It’s just….. why is it that this scene style is not right? Where is the cold-blooded, gloomy and deep-minded?>"
}