{
	"url": "https://www.novelupdates.com/series/crown-princes-ex-boyfriend/",
	"title": "Crown Prince’s Ex-Boyfriend - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/08/Crown-Princes-ExBoyfriend.png",
	"noveltype": "(KR)",
	"genre": "Comedy   Fantasy   Harem   Romance   Shoujo   ",
	"tags": "Beautiful Female Lead   European Ambience   Female Protagonist   Handsome Male Lead   Misunderstandings   Nobles   Obsessive Love   Possession   Reverse Harem   Transmigration   ",
	"rating": "(3.9 / 5.0, 42 votes)",
	"author": "웅이바보   ",
	"year": "\n2020",
	"ranking": "#3567   #2767   #7474   #4829   #6123   ",
	"reviewcount": "2 Reviews sorted by",
	"description": "I possessed the body of the villain in the BL novel I’ve read. I didn’t do good deeds, I just lived like a human being. \n\n“The young lady just opened the door herself!”\n\n“You told me that a member of a noble family shouldn’t do something so trivial!”\n\nEveryone is looking at me like, “Who are you?”\n\nMy parents even put me in a mental hospital.\n\nI clenched my teeth and cursed not to enter the asylum again. \n\n····· But why does everyone like it? \n\n***\n\nI’m the interrupter of love.\n\nI will be executed for interrupting the relationship between ‘Shou’ and ‘Gong’.\n\nI fled to the enemy country to avoid that.\n\nBut why is ‘Shou’ here? What’s going on? \n\nYou went to war looking for me? When you pushed me away saying not to bother you? Are you crazy? \n\n“A break-up? I’ll do it for you.”\n\n“……”\n\n“If you want to run away, do it.” After chasing me to death, you’d gently walk away from me?\n\nVin smiled as beautifully as an angel and held my waist, unable to readily accept it.\n\n“If it’s so fun to be caught by me.”\n\nAs if he had no intention of letting go in the first place. \n\n*** \n\nBut the madman is not only one. \n\n“Don’t flirt with my sister.” \n\nEven my brother, who hated me. \n\n“I’m just doing this because I want to keep fighting with you.” \n\nAnd the ‘gong’ that killed me in the novel. It seems he has gone crazy for me.\n\n#The-World’s-Strongest-Protagonist #Escaped-Female-Protagonist #I-thought-you-were-a-gentleman! #Obsessed-Male-Protagonist #Isn’t-this-BL? #What’s-wrong-with-you-all!>"
}