{
	"url": "https://www.novelupdates.com/series/fantasy-me-start-to-create-a-secret-building/",
	"title": "Fantasy: Me! Start To Create a Secret Building! - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/10/Fantasy-Me-Start-to-create-a-secret-building.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Fantasy   Harem   Martial Arts   Mystery   Xuanhuan   ",
	"tags": "Accelerated Growth   Alternate World   Carefree Protagonist   Confident Protagonist   Cultivation   Curses   Demi-Humans   Demons   Destiny   Divination   Dragons   Easy Going Life   Famous Protagonist   Fantasy Creatures   Fantasy World   Fast Cultivation   Ghosts   Godly Powers   Heavenly Tribulation   Immortals   Male Protagonist   Mind Control   Mysterious Past   Precognition   Prophecies   Psychopaths   Reincarnation   Skill Assimilation   Soul Power   Souls   Spatial Manipulation   Strength-based Social Hierarchy   System Administrator   Transported to Another World   ",
	"rating": "(3.7 / 5.0, 9 votes)",
	"author": "小牛坐飞机   ",
	"year": "\n2021",
	"ranking": "#2000   #2000   #11007   #3591   #11739   ",
	"reviewcount": "1 Review sorted by",
	"description": "Li Yun traveled through the fantasy world and obtained a Heavenly Secret Pavilion.\r\n\r\nThe Heavenly Secret Pavilion can calculate the past and the future, and it can also observe the number of lives. Everything in the world cannot escape the deduction of the Heavenly Secret Pavilion.\r\n\r\nHoly Master of the Beginning: 'My Holy Land of the Beginning, there are two secrets of the emperor's soldiers. How did the Heavenly Secret Pavilion know?'\r\n\r\nShaking Light Holy Master: 'I have been undercovered the right way for three thousand years, and now I am going to unifying. Why is the identity of my identity exposed by the Heavenly Secret Pavilion?\r\n\r\nThe owner of the forbidden zone: 'The landlord of Heavenly Secret Pavilion is so terrible. The old man has survived for three million years. He thinks that he is unparalleled in the world, but he did not expect to be only ranked seventeenth on the top list!'>"
}