{
	"url": "https://www.novelupdates.com/series/my-wife-is-a-general-who-killed-tens-of-thousands-on-the-battlefield/",
	"title": "My Wife Is A General Who Killed Tens Of Thousands On The Battlefield - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/05/My-Wife-Is-A-General-Who-Killed-Tens-Of-Thousands-On-The-Battlefield.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Comedy   Drama   Ecchi   Fantasy   Harem   Martial Arts   Mature   Romance   Xuanhuan   ",
	"tags": "Accelerated Growth   Arranged Marriage   Arrogant Characters   Beautiful Female Lead   Bodyguards   Cautious Protagonist   Cheats   Clever Protagonist   Clingy Lover   Comedic Undertone   Court Official   Cultivation   Cunning Protagonist   Cute Children   Devoted Love Interests   Distrustful Protagonist   Doting Love Interests   Engagement   Family   Fast Cultivation   Forced into a Relationship   Generals   Handsome Male Lead   Harem-seeking Protagonist   Hiding True Abilities   Kingdoms   Love Interest Falls in Love First   Loyal Subordinates   Male Protagonist   Manipulative Characters   Marriage   Master-Servant Relationship   Mature Protagonist   Older Love Interests   Perverted Protagonist   Playful Protagonist   Politics   Polygamy   Pragmatic Protagonist   Pregnancy   R-15   Ruthless Protagonist   Schemes And Conspiracies   Servants   Shameless Protagonist   Sharp-tongued Characters   System Administrator   Transmigration   Trickster   Unique Cultivation Technique   Wars   Weak to Strong   Wealthy Characters   Younger Love Interests   ",
	"rating": "(3.9 / 5.0, 28 votes)",
	"author": "我女儿太可爱了   ",
	"year": "\n2021",
	"ranking": "#1125   #2000   #7626   #6113   #11235   ",
	"reviewcount": "8 Reviews sorted by",
	"description": "Su Wen transmigrated and became the Prime Minister’s son, possessing both power and money.\n\nIn the capital, Su Wen was known to be a profligate young master who had no cares.\n\nHowever, all of this was merely a façade. He was provided with a goldfinger which was a cultivation system that rewarded him for triggering intense emotions in others.\n\nHe put on the image of an arrogant playboy to incur the negative emotions of others to farm points for his cultivation.\n\nThus, he started on the path towards the pinnacle of life.\n\nBut when he turned 18, something happened.\n\nA general’s daughter went to war on behalf of her father and managed to rout the enemy, killing 40,000 of them.\n\nSuch startling news became the talk of the town and everyone was apprehensive when they talked about this woman who killed without batting an eye.\n\nMeanwhile, Su Wen who had been having fun sowing his wild seeds in the capital was suddenly granted a marriage by the emperor. He was to marry this woman, the Goddess of Death.>"
}