{
	"url": "https://www.novelupdates.com/series/the-journey-of-flower/",
	"title": "The Journey of Flower - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/06/jouneyofflower4.png",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Drama   Josei   Romance   Tragedy   Xianxia   ",
	"tags": "Adapted to Drama   Adapted to Manhua   Beautiful Female Lead   Betrayal   Cold Love Interests   Demons   Female Protagonist   Handsome Male Lead   Immortals   Master-Disciple Relationship   Pets   Revenge   Schemes And Conspiracies   Strong Love Interests   Tragic Past   Weak to Strong   ",
	"rating": "(4.0 / 5.0, 79 votes)",
	"author": "Fresh Guo Guo   Fresh果果   ",
	"year": "\nN/A",
	"ranking": "#2000   #2000   #5413   #9321   #4086   ",
	"reviewcount": "4 Reviews sorted by",
	"description": "When they first met, he is the aloof and remote high deity of Chang Liu, whereas she secretly sneaked in by transforming into a small insect lying on the tree but was blown off into his wine cup. “Accidentally fell down?” His smile is mild but merciful, that was the only time in her life that she saw him like that even if for a mere insect. Because of a one year pact, she did everything possible just so she will be able to eventually call him shifu. “Shifu why do you accept me as a disciple?”\r\n\r\nHe did not reply but gave her a small bell as a present, stroking her head lightly.\r\n\r\nA shadowy figure in a billowing white robe, standing visibly on top of the stone daily, overlooking the hills.\r\n\r\nShe vowed that she will never let him feel lonely anymore.\r\n\r\nBut the frequent companionship and mutual support in Heartless Hall finally came to an end.\r\n\r\nTo save him, she committed a really big blunder. However ……\r\n\r\n“A mistake is still a mistake.” He remained indifferent.\r\n\r\nEighty-one overwhelming nails, as well as the highly raised unbreakable sword.\r\n\r\nShifu, do you know how painful it is to be hurt by the person you love most?\r\n\r\nDo you know when you feel sorrow to the extreme but still holding on to the happy memories, unwilling to forget, longing day and night for that person is how painful and pitiful?\r\n\r\nI don’t believe in good, don’t believe in evil, don’t believe in happiness, but I believe in you!\r\n\r\nSo, with a smile she did not give up, even if that love is colder than death.>"
}