{
	"url": "https://www.novelupdates.com/series/chaotic-nights/",
	"title": "Chaotic Nights - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/02/Chaotic-Nights.jpeg",
	"noveltype": "(KR)",
	"genre": "Adult   Drama   Gender Bender   Historical   Mature   Romance   Smut   ",
	"tags": "Abusive Characters   Ancient Times   Beautiful Female Lead   Cross-dressing   Different Social Status   Female Protagonist   Handsome Male Lead   Love Interest Falls in Love First   Male Yandere   Obsessive Love   Possessive Characters   Pregnancy   R-18   Royalty   R*pe   ",
	"rating": "(4.2 / 5.0, 89 votes)",
	"author": "Jin Soye   진소예   ",
	"year": "\n2022",
	"ranking": "#1217   #949   #5734   #7358   #6202   ",
	"reviewcount": "2 Reviews sorted by",
	"description": "“I can help you become anything you want. What is it that you desire the most?” he asked with a soft voice while sweeping the hair from her forehead.\n\n“You really thought that I’d sincerely embrace someone as lowly as you?”\n\nEmbarrassed, she avoided his gaze and clenched her hands until they turned white.  \n\n“Even your thoughts are silly. You are well aware of my identity…”\n\n“Yes, I know.”\n\n“Then say it. Who am I?”\n\nThe hand that was playing with her hair traveled down past her chin and ended up around her throat. Testing the strength of his grip, he slowly started applying more pressure and forced her to look at him. Her breathing became painful as he lifted her up by the neck until her heels raised slightly from the floor.\n\n“I also hold your sister’s fate in the palm of my hand.”\n\nHe could see it in her eyes, something inside her had broken. \n\nHer eyes, which once resembled the starry night sky, no longer held any stars. \n\nAs he watched the light in her eyes fade away, he relaxed his hands. \n\nShe wouldn’t try to escape him anymore. He knew this instinctively.\n\nThis feeling, which was similar to being doused in warm water, is definitely what he’s been craving. \n\nIt wasn’t anything like lust.\n\nYes, it was definitely a craving.\n\nAfter he acknowledged his feelings, he began to desire to possess her entire world.\n\n“If I can’t have you, I’ll ruin you.”>"
}