{
	"url": "https://www.novelupdates.com/series/i-am-the-older-sister-of-the-possessed-female-lead/",
	"title": "I am the Older Sister of the Possessed Female Lead - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/11/I-am-the-Older-Sister-of-the-Possessed-Female-Lead_1638253799.jpg",
	"noveltype": "(KR)",
	"genre": "Fantasy   Psychological   Romance   Shoujo   Slice of Life   ",
	"tags": "Adapted to Manhwa   Aristocracy   Beautiful Female Lead   Calm Protagonist   Discrimination   European Ambience   Familial Love   Family   Family Conflict   Fantasy World   Female Protagonist   Friendship   Nobles   Personality Changes   Siblings   Sibling's Care   Younger Sisters   ",
	"rating": "(3.3 / 5.0, 15 votes)",
	"author": "한설믜   ",
	"year": "\n2020",
	"ranking": "#2000   #2000   #11547   #10659   #8834   ",
	"reviewcount": "No Reviews",
	"description": "My younger sister who used to harass me has changed! \r\n\r\n“Me? Tied you up? My sister?”\r\n\r\nWhy, why are you suddenly speaking formally? She can't even remember what she did! \r\n\r\n“It would be good for my older sister to participate in the debutante ball this year too.”\r\n\r\nYou told me not to go even last year…\r\n\r\n“How about a cool-looking guy with black hair who doesn’t seem to get a drop of blood even if he gets stabbed? What about a pretty and delicate young man like a puppy in the rain? There are people who are a little inferior to the two in front of them, but there is one person who is really good!”\r\n\r\nShe even recited the men’s personal information saying she should know my taste.\r\nNo, rather, do I look like I'm going to play with a guy now? \r\n\r\n“Will you marry me? Annette of Valois.”\r\n\r\n“Annette, Annette, I wish you were a parrot. So that I can watch and raise you in a cage.”\r\n\r\nLet's play... It looks like we're going to play... \r\n\r\n'Ah, but older sister! That guy can't!!!'\r\n\r\nIt's all good, but sister, can't you at least tell me why you don’t want anyone? \r\n\r\nI wondered why she suddenly became kind, but this little sister seemed to have just come out of the boat! There’s a flower boy approaching my younger sister! \r\n\r\nHer Majesty the Empress, who is stuck in a strange place and only favors me! \r\n\r\nOh, I don't know. I'd rather go back to the way it was before...\r\n>"
}