{
	"url": "https://www.novelupdates.com/series/little-sweetheart/",
	"title": "Little Sweetheart - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/07/Little-Sweet.jpg",
	"noveltype": "(CN)",
	"genre": "Romance   School Life   ",
	"tags": "Age Progression   Beautiful Female Lead   Caring Protagonist   Charming Protagonist   College/University   Cute Story   Devoted Love Interests   Doting Love Interests   Female Protagonist   First Love   Handsome Male Lead   Love Interest Falls in Love First   Modern Day   Popular Love Interests   ",
	"rating": "(4.1 / 5.0, 58 votes)",
	"author": "Wu Ying Wu Zhong   ",
	"year": "\nN/A",
	"ranking": "#4617   #4747   #4673   #9323   #4507   ",
	"reviewcount": "13 Reviews sorted by",
	"description": "Xia Zhijun got the title ‘study god’ after scoring first place in the whole city. He’s the model of a good student in a teacher’s eyes: good grades, good manners, and quiet. When he wasn’t smiling, his entire body emits a cold abstinence aura. The girls only have the guts to look from afar and not get close.\n\nLater, it was rumored throughout the entire school that even the study god would fight and hit on girls. Whoever dared to provoke his girl, he would teach you how to be a person at every minute. The night of the graduation ceremony someone saw him blocking Gu Siyi in the corner. He didn’t stop kissing even when she cried. He bit her lips and said in a raspy voice, “I’m going crazy…”\n\nDuring college finals, Gu Siyi almost bursted out crying, “I’m such a failure. I won’t be able to find a good job in the future…And if I can’t find a good job, I can’t provide for myself…”\n\nXia Zhijun played with her pink earlobe and remarked, “I’ll take care of you.”\n\nAfter they graduated, Xia Zhijun created a research company and Gu Siyi became the boss’s wife.\n\nThe commercial rocket, “Star of Siyi” was successfully launched. So everyone knew that the new technology superstar, Xia Zhijun has a wife whom he spoils a lot.>"
}