{
	"url": "https://www.novelupdates.com/series/i-thought-a-villainess-divorce-would-be-easy/",
	"title": "I Thought a Villainess’ Divorce Would Be Easy - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/06/I-Thought-a-Villainess-Divorce-Would-Be-Easy.jpg",
	"noveltype": "(KR)",
	"genre": "Comedy   Drama   Fantasy   Romance   ",
	"tags": "Adopted Protagonist   Aristocracy   Beautiful Female Lead   Charismatic Protagonist   Cute Protagonist   European Ambience   Female Protagonist   Forced Marriage   Love Interest Falls in Love First   Misunderstandings   Mob Protagonist   Nobles   Reincarnated in Another World   Reincarnation   Siblings Not Related by Blood   Sickly Characters   Villainess Noble Girls   Weak Protagonist   ",
	"rating": "(4.0 / 5.0, 48 votes)",
	"author": "Lee RuNyang   이루냥   ",
	"year": "\n2019",
	"ranking": "#4080   #4064   #6226   #10839   #3156   ",
	"reviewcount": "1 Review sorted by",
	"description": "I became the soon-to-be duchess who’ll end up divorced when the female lead arrives.\n\nAnthea had a sickly body, an awful temperament, and died in an ending fitting of a villainess.\n\n“I’ll use this pretty face of mine. I won’t die as a low-quality villainess.”\n\nThe count is my guardian and I will steal everyone’s hearts in the count’s estate. I would often collapse due to my sickly body, but I was at least able to move. All of this is for the happiness I’ll attain after my divorce.\n\nAs expected, I had a political marriage, so if I act like a villainess, then I’ll be divorced, but it isn’t easy as I thought?\n\n“Goodness, Madam you’re so kind. I’ll follow you forever.”\n\n“Our Madam has a pretty face and a pretty heart.”\n\nEvery bad deed I did was perceived as a kind act.\n\n“Wife, if you can’t fall asleep, I can make you tired.”\n\nThe cold duke, Richard, why are you doing this? Your character has completely changed from the novel.\n\nLet’s stay far away from each other. Please stop clinging to me. Because if this continues, I’ll become emotionally attached to you.>"
}