{
	"url": "https://www.novelupdates.com/series/i-have-the-aura-of-overbearing-president/",
	"title": "I Have the Aura of Overbearing President - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/05/AuraOverbearPresident44.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Drama   Fantasy   Romance   ",
	"tags": "Beautiful Female Lead   Boss-Subordinate Relationship   Business Management   Businessmen   Calm Protagonist   Charismatic Protagonist   Charming Protagonist   Cold Love Interests   Confident Protagonist   Devoted Love Interests   Different Social Status   Family   Family Conflict   Female Protagonist   Handsome Male Lead   Kind Love Interests   Lazy Protagonist   Love Interest Falls in Love First   Mature Protagonist   Modern Day   Narcissistic Protagonist   Older Love Interests   Parody   Power Couple   Pregnancy   Protagonist Strong from the Start   Quirky Characters   Shameless Protagonist   Slow Romance   Smart Couple   Strong to Stronger   Stubborn Protagonist   System Administrator   Transmigration   Villainess Noble Girls   Wealthy Characters   ",
	"rating": "(4.5 / 5.0, 187 votes)",
	"author": "Jiang Yue Nian Nian   江月年年   ",
	"year": "\n2019",
	"ranking": "#914   #1115   #1751   #656   #1662   ",
	"reviewcount": "32 Reviews",
	"description": "Chu Chu suddenly transmigrated as the vicious female president in the book. The original owner wasn’t only obsessed with the male lead, but also hurt the female lead.\n\nFinally the villainess ended up having a Bad Ending. Her family business went bankrupt and she got disfigured.\n\nOn the first day Chu Chu transmigrated into the book, she opened the wardrobe full of luxury goods and had a feeling of a poor citizen becoming rich overnight.\n\nChu Chu：Are you kidding me? Does a wealthy president not like the tasty food in Michelin restaurants or feel that Chanel is not good looking?\n\nChu Chu: Let’s go bankrupt!!\n\nShe just wanted to feel the domineering life of a female president, but accidentally she set the professional benchmark for strong women.\n\nOriginal female lead: My goal is to become an independent woman like President Chu! Love delayed my journey to get rich!\n\nChu Chu: ??>"
}