{
	"url": "https://www.novelupdates.com/series/my-house-of-horrors/",
	"title": "My House of Horrors - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/05/My-House-of-Horrors.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Horror   Mature   Mystery   Seinen   Supernatural   ",
	"tags": "Absent Parents   Adapted to Manhua   Amnesia   Amusement Park   Average-looking Protagonist   Business Management   Calm Protagonist   Cannibalism   Carefree Protagonist   Charming Protagonist   Cheats   Clever Protagonist   Comedic Undertone   Crime   Dark   Death of Loved Ones   Detectives   Determined Protagonist   Doctors   Dolls/Puppets   Enemies Become Allies   Evil Organizations   Famous Protagonist   Game Elements   Ghosts   Gore   Hidden Abilities   Human-Nonhuman Relationship   Investigations   Loyal Subordinates   Male Protagonist   Manipulative Characters   Misunderstandings   Modern Day   Multiple POV   Murders   Mutations   Mysterious Family Background   Mysterious Past   Mystery Solving   Pets   Police   Possession   Proactive Protagonist   Psychopaths   Quirky Characters   Romantic Subplot   Secret Organizations   Seeing Things Other Humans Can't   Sentient Objects   Serial Killers   Shameless Protagonist   Skill Assimilation   Slow Romance   Special Abilities   Spirits   Strong Love Interests   Thriller   Unique Weapon User   Yandere   ",
	"rating": "(4.6 / 5.0, 501 votes)",
	"author": "I Can Fix Air-Conditioners   我会修空调   ",
	"year": "\n2018",
	"ranking": "#898   #796   #1554   #6887   #1250   ",
	"reviewcount": "112 Reviews sorted by",
	"description": "The hearse with the weird odor slowed to a stop before the entrance. The sound of pebbles could be heard bouncing on the ceiling. There were footsteps coming from the corridor, and there seemed to be someone sawing next door. The door knob to the room rattled slightly, and the faucet in the bathroom kept dripping even though it had been screwed shut. There was a rubber ball that rolled on its own underneath the bed. Wet footsteps started to surface one after another on the floor.\n\nAt 3 am, Chen Ge held a cleaver in his hand as he hid beside the room heater. The call he was trying to make was finally answered. “Landlord, is this what you meant by ‘the house can be a little crowded at night’‽”>"
}