{
	"url": "https://www.novelupdates.com/series/virtual-world-peerless-white-emperor/",
	"title": "Virtual World: Peerless White Emperor - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2017/05/vwpwe.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Comedy   Fantasy   Harem   Martial Arts   Romance   Sci-fi   Supernatural   Tragedy   ",
	"tags": "Androgynous Characters   Arrogant Characters   Brotherhood   Carefree Protagonist   Caring Protagonist   Cooking   Death of Loved Ones   Elves   Famous Protagonist   Friendship   Game Ranking System   Human Experimentation   Jack of All Trades   Knights   Level System   Male Protagonist   MMORPG   Money Grubber   Mysterious Past   Overpowered Protagonist   Polygamy   Protagonist Strong from the Start   Quirky Characters   Ruthless Protagonist   Shameless Protagonist   Sharp-tongued Characters   Skill Books   Slow Romance   Special Abilities   Sword And Magic   Teamwork   Tragic Past   Underestimated Protagonist   Unlucky Protagonist   Virtual Reality   ",
	"rating": "(4.3 / 5.0, 706 votes)",
	"author": "ShiFou KeYi LiuXia   Would It Be Possible To Stay   是否可以留下   ",
	"year": "\n2016",
	"ranking": "#2000   #2878   #338   #4927   #448   ",
	"reviewcount": "94 Reviews sorted by",
	"description": "Year 24XX. With several hundred years of improvements, virtual reality has become more mature. It had gradually become humanity’s second world. Socializing, working, studying and other everyday things could all be done while sleeping.\n\nAlong with the rise in virtual reality systems, virtual games also developed successfully. Additionally, with the vigorous support of the government; every season, games continued to be born, be changed, competed with each other, and be reborn. \n\nYe Cang is a black bellied, underachieving, 2nd year student at a city college. He appears to have been cured of his albinism yet his story is still full of mystery. In the game ‘New Age – Conviction’, he began walking the path of a professional gamer. An all-rounder ranger, dark cooking, with a nasty disposition, willing to do anything. He’s slowly creating his own legend.\n\n“Actually… instead of games, I prefer cooking and dramas” – The White Emperor>"
}