{
	"url": "https://www.novelupdates.com/series/instant-death/",
	"title": "Instant Death - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/09/Instant-Death.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Comedy   Fantasy   Romance   Shounen   ",
	"tags": "Adapted to Manga   Androids   Angels   Apathetic Protagonist   Assassins   Beastkin   Beautiful Female Lead   Betrayal   Calm Protagonist   Carefree Protagonist   Cheats   Corruption   Death   Depictions of Cruelty   Dragons   Elves   Enemies Become Allies   Evil Gods   Game Elements   Ghosts   Goddesses   Godly Powers   Gods   Gore   Knights   Lack of Common Sense   Lazy Protagonist   Level System   Male Protagonist   Monsters   Multiple Realms   Multiple Transported Individuals   Mysterious Past   Overpowered Protagonist   Past Plays a Big Role   Protagonist Strong from the Start   Psychic Powers   Psychopaths   R-15   Ruthless Protagonist   S*aves   Special Abilities   Spirits   Stubborn Protagonist   Survival   Sword And Magic   Transported to Another World   Underestimated Protagonist   ",
	"rating": "(3.9 / 5.0, 481 votes)",
	"author": "Tsuyoshi Fujitaka   藤孝剛志   ",
	"year": "\n2016",
	"ranking": "#3710   #3880   #382   #2136   #155   ",
	"reviewcount": "71 Reviews sorted by",
	"description": "Growth cheats? Infinite magic power? The ability to utilize all archetypes? What’s the point if instant death ends everything with a single attack?\n\nHigh school senior Yogiri Takatou was on a school field trip when he woke up to a dragon assaulting his sightseeing bus, with the only ones still on the bus being him and his female classmate, the panicking Tomochika Dannoura. Apparently the rest of his classmates had been given special powers by Sion, a woman who introduced herself as Sage, and escaped from the dragon, leaving those that hadn’t received any special powers behind as dragon bait.\n\nAnd so Yogiri was thrown into a parallel universe full of danger, with no idea of what just happened. Likewise, Sion had no way of knowing just what kind of being she had summoned to her world.>"
}