{
	"url": "https://www.novelupdates.com/series/welcome-to-the-impregnable-demon-king-castle-the-black-sorcerer-is-offered-a-seat-as-a-member-of-the-demon-king-armys-top-brass-after-being-kicked-out-of-the-heros-party-because-they-did/",
	"title": "Welcome to the Impregnable Demon King Castle – The Black Sorcerer Is Offered a Seat as a Member of the Demon King Army’s Top Brass After Being Kicked out of the Hero’s Party Because They Didn’t Need Debuffs - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/07/impregnablemaoucastle1c.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Fantasy   Romance   Shounen   Slice of Life   ",
	"tags": "Adapted to Manga   Adventurers   Beautiful Female Lead   Childhood Friends   Demi-Humans   Demons   Dense Protagonist   Hidden Abilities   Hiding True Abilities   Hiding True Identity   Love Interest Falls in Love First   Loyal Subordinates   Male Protagonist   Monster Girls   Naive Protagonist   Protagonist Strong from the Start   R-15   Secret Identity   Sword And Magic   Underestimated Protagonist   Yandere   ",
	"rating": "(3.5 / 5.0, 120 votes)",
	"author": "Hozumi Mitaka   御鷹穂積   ",
	"year": "\n2019",
	"ranking": "#178   #197   #621   #325   #1234   ",
	"reviewcount": "10 Reviews sorted by",
	"description": "“The Hero defeated the Demon King in the war of men against demons…” Those kinds of stories are a thing of the past. Nowadays, adventurers, demons, Heroes, Demon Kings, and so on are all occupations that no longer involve putting one’s life on the line. Peace has returned to the world, and dungeon exploration has now become a form of entertainment. Adventurers and monsters now all fight using clones they’ve created with magic in an extremely popular form of dungeon clearing where nobody dies. The footage of the dungeon getting cleared gets broadcasted all across the continent, and I’m a member of a Hero’s party that was ranked the 4th most popular in the world… but not anymore. Parties had a limitation of 5 members, and I was told that an unpopular job like Black Sorcerer would only get in the way of getting to 3rd place or beyond.\n\nNow that I became unemployed, I was forced to find another party but I just couldn’t find one. One day, I encountered a beautiful blonde red-eyed woman who told me she had a job for me. After being so touched from having someone recognize my abilities far more than my past comrades, I ended up agreeing to take an interview without asking for the details. When I arrived at my destination, I was at the world’s hardest dungeon where no party has ever reached the final area, the Demon King Castle, where the Big Four and the Demon King were waiting for me. This is the story of a Black Sorcerer that was kicked out of a Hero’s party and joined the side of the Demon King Army to repel the Heroes.>"
}