{
	"url": "https://www.novelupdates.com/series/shini-yasui-koshaku-reijo-to-shichi-nin-no-kikoshi/",
	"title": "Shini Yasui Kōshaku Reijō to Shichi-nin no Kikōshi - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2018/05/erika_cover1.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Fantasy   Mystery   Shoujo   Supernatural   ",
	"tags": "Academy   Adapted to Manga   Age Progression   Alchemy   Aristocracy   Beast Companions   Beautiful Female Lead   Brother Complex   Caring Protagonist   Character Growth   Child Protagonist   Childhood Friends   Clever Protagonist   Curses   Dense Protagonist   Depictions of Cruelty   Doting Older Siblings   Dragons   Enemies Become Allies   Episodic   Familial Love   Fantasy World   Female Protagonist   Friendship   Golems   Handsome Male Lead   Kingdoms   Love Triangles   Magic   Magic Beasts   Magical Space   Manipulative Characters   Misunderstandings   Monsters   Multiple POV   Mythical Beasts   Nobles   Otome Game   Past Plays a Big Role   Pets   Popular Love Interests   Proactive Protagonist   R-15   Reincarnated in Another World   Religions   Reverse Harem   Royalty   Schemes And Conspiracies   Siblings   Sister Complex   Sword And Magic   Teamwork   Time Skip   Tragic Past   Vampires   Villainess Noble Girls   Wealthy Characters   ",
	"rating": "(4.6 / 5.0, 597 votes)",
	"author": "Terasu Senoo   瀬尾照   ",
	"year": "\n2015",
	"ranking": "#2731   #1674   #471   #897   #147   ",
	"reviewcount": "119 Reviews sorted by",
	"description": "On one spring evening when I was eight years old, I, Erica, Duke of Aurelia’s daughter, realized something.\n\nHuh, I have reincarnated into a fantasy world, haven’t I?\n\nMoreover, it was the romance-fantasy girl game that had the reputation of being bloody, 『Liber Monstrorum ~Phantom Beasts and the Winter Princess~』\n\nThe face reflected in the mirror was that of the villainess character of that game.\n\nAfter repeatedly harassing many characters, including the heroine, she would die without exception, signaling the beginning of an event called the bizarre incident. She was a villain who deserved to get the consequences!\n\n—I absolutely don’t want a destiny like that, though?\n\nNo, since I have remembered the memory of my previous life, I will make sure that kind of thing does not happen.\n\nIn my previous life, I was harassed immensely by an irrationally angry yandere man who thought I was in love with him.\n\nMy cause of death, too, was from being stabbed by another yandere man who I only had talked with a few times…\n\nNow that I have become the haughty villainess Erica, I shouldn’t encounter more misunderstandings like with the previous life’s yandere men anymore, right…?\n\nIn that case, it will be fine as long as I deal with the death flags that I may have raised myself.\n\nAll right! First of all, before the bizarre incident begins at the Magic Academy, I will strike down the death flags accordingly!!\n\n—Or so I thought, but it seems that I am about to die.\n\nEeh, how did this happen—!?>"
}