{
	"url": "https://www.novelupdates.com/series/my-exes-are-everywhere/",
	"title": "My Exes Are Everywhere - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/07/My-Exes-Are-Everywhere.jpg",
	"noveltype": "(CN)",
	"genre": "Adventure   Comedy   Drama   Fantasy   Romance   Tragedy   Yaoi   ",
	"tags": "Cultivation   Death   Handsome Male Lead   Love Interest Falls in Love First   Male Yandere   Master-Disciple Relationship   Monsters   Multiple Identities   Multiple Realms   Mysterious Past   Non-linear Storytelling   Obsessive Love   Possessive Characters   Time Travel   Transmigration   Yandere   ",
	"rating": "(4.0 / 5.0, 17 votes)",
	"author": "Ji Moyao   即墨遥   ",
	"year": "\n2021",
	"ranking": "#2000   #2000   #10094   #7991   #10029   ",
	"reviewcount": "3 Reviews sorted by",
	"description": "In his previous life, Qiao Xuan had many lovers at once, and one day, he was finally caught red-handed. Once he died, he transmigrated into a bird in a cultivation world. He swore to start anew and focus on attaining a human form. \n\nBut as it turned out, after he worked arduously to cultivate a human form, when he was undergoing his tribulation, heavenly lightning struck him into ash. All that was left was a trace of his spirit. His master said that his fickle behavior in his previous life had tainted his spiritual root in this life, and the only way for him to achieve human form was to undergo seven lives of love tribulations. For the sake of becoming human, Qiao Xuan could only be reborn and undergo his tribulations. \n\nIn these seven lives, he was an emperor’s male pet, a devil lord’s furnace, a sword master’s cultivation partner, a demon king’s ugly s*ave… \n\nBut no matter how infatuated he was, no matter how much sincere affection he expended without regret, in the end, he never had a peaceful death.\n\nJust when he finally finished his seventh life and returned to the cultivation world, successfully passing his tribulation and attaining a human form, he found that something wasn’t right… \n\nIn private, the calm, aloof emperor spent his tender affection on a puppet. That puppet looked exactly like him when he was a male pet in his first life…\n\nThe cold, savage devil lord had searched the three realms for a thousand years, exhausting both the heavens and the underworld, in order to find a method to gather the soul of his lover…\n\nThe sword cultivator who killed his wife in order to prove his dedication to the Dao was faced with the most beautiful woman in the cultivation world, who had come to confess her love. Yet he publicly announced that his late wife from the mortal world was the one and only love of his life…\n\nThe demon king with overwhelming strength had lived on an icy peak in the wasteland for hundreds of years. It was said that this was all for the sake of the ugly little s*ave he had lived with there in the past, and later abandoned…\n\nAll of his lovers from his love tribulations in his previous lives were here, and they all wanted to get back together with him! \n\nQiao Xuan: …I’m sorry to bother you, but you’ve got the wrong person. \n\nQiao Xuan couldn’t put up with his exes’ desperate pursuit any longer. He could only beg his unapproachable master for help. His master’s cultivation was boundless, his heart was clean of desire, and he was uninterested in the affairs of the world. No matter how you looked at him, he seemed like someone Qiao Xuan could depend on. Most importantly, his master had a detached temperament.\n\nQiao Xuan: “Master, can you help me?”\n\nMaster: “Yes.”\n\nAfterwards, Qiao Xuan sat in his master’s embrace. What happened to being detached? It was all a lie.>"
}