{
	"url": "https://www.novelupdates.com/series/the-pa-pa-between-his-highness-and-a-long-term-kitchenhand/",
	"title": "The Pa Pa Between His Highness and a Long-Term Kitchenhand - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/02/The-Pa-Pa-Between-His-Highness-and-a-LongTerm-Kitchenhand.jpg",
	"noveltype": "(CN)",
	"genre": "Adult   Historical   Mature   Romance   Smut   Yaoi   ",
	"tags": "Ancient China   Bestiality   First-time Interc**rse   F*llatio   Futanari   Mpreg   Royalty   ",
	"rating": "(4.1 / 5.0, 42 votes)",
	"author": "Dog Baby   Sky   Tian Yi   Tiny Dog Paw   天一   小狗爪子   狗娃子   ",
	"year": "\n2014",
	"ranking": "#6970   #3136   #6277   #6710   #5631   ",
	"reviewcount": "5 Reviews sorted by",
	"description": "Wang Yisheng was just a mere kitchenhand, yet on his way home, he was suddenly attacked by a stranger. This proud meow man forcibly made use of his cucumber, and even under the influence of an aphrodisiac, he was exceptionally arrogant. Baring himself to him and bestowing him the blessing of being able to lie with him. All the while ordering him to lick here or there, or to thrust upon command.\n\nAnd for His Highness the Prince who was deflowered by a kitchenhand, he was extremely pleased by Wang Yisheng’s services. Begrudgingly, he promoted Wang Yisheng to the rank of male consort, so the latter could serve him day and night without rest. However… As the dignified and stately Prince Miao Wei of the Nation of Da Mao, how could he bestow all his favor upon one male consort?\n\nWhat if this pampering made the consort arrogant?\n\nMy princely self will have to get more male consorts, to prevent a certain dog-s*ave from getting beyond themselves so that dog-s*ave will submit to his every whim and desire.\n\n“Your Highness, you can ride me any way you like. I vow to let you ride me till your legs give out, even if your belly swells I will not shun you.”\n\n“Be quiet, I order you to service me.”\n\n“Your word is my command, your Highness.”\n\nThe work of a long-term kitchenhand truly is exhausting, especially when His Highness isn’t satisfied with a huge r*d, what’s a kitchenhand gotta do?\n\nPrince Meow: I wish to share my experience with the rest of you meows, and that is, even the most loyal, humble, and simple-minded of wang’s, will have a heart that yearns to “bully” meows.\n\nKitchenhand Wang: I aim to “bully” Prince Meow for a hundred more years.\n\nBefore he could lick him anymore, Prince Meow swatted at Kitchenhand Wang’s face with a swipe of his claws.\n\nMy princely self is the epitome of nobility, I’m not some random meow that a s*ave dog like you can mate with!>"
}