{
	"url": "https://www.novelupdates.com/series/i-am-that-little-fox-quick-transmigration/",
	"title": "I Am That Little Fox [Quick Transmigration] - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/05/I-Am-That-Little-Fox-Quick-Transmigration.jpg",
	"noveltype": "(CN)",
	"genre": "Fantasy   Romance   Supernatural   ",
	"tags": "Childish Protagonist   Female Protagonist   Fox Spirits   Lack of Common Sense   Master-Disciple Relationship   Naive Protagonist   Older Love Interests   System Administrator   Transmigration   Wealthy Characters   World Hopping   ",
	"rating": "(4.3 / 5.0, 21 votes)",
	"author": "Blooming Without Results   开花不结果   ",
	"year": "\n2021",
	"ranking": "#2000   #2000   #8197   #10660   #6967   ",
	"reviewcount": "2 Reviews sorted by",
	"description": "Bai Xiaoxi is a young fox spirit who has just reached adulthood. She binds to the system in order to go down to the mountain to look for her master.\n\nThe True Love System is happy to see that the host is a fox spirit, definitely good at seducing men!\n\nHe can already see the bright future of his promotion and pay rise to the top of his lifespan!\n\nFirst Day of Binding\n\nThe system: ” Hurry, there’s a big shot sitting in that car in front of you, rush up and touch the porcelain!”\n\nBai Xiaoxi obediently charged forward, and then\n\nBang…\n\nThe big shot was knocked away together with the car by her.\n\nSystem: “……”\n\nSecond day of binding\n\nSystem: “This is the time, go! Tease him!”\n\nBai Xiaoxi stood on her tiptoes and ruffled the hair of the man across the room.\n\n“……”\n\nThe system wanted to cry: “Aren’t you a fox spirit? Hooking up with men is a racial talent, so why can’t you do it?”\n\nBai Xiaoxi was very innocent: “But I was raised by a phoenix.”\n\nThe system, dead.\n\nNotes :\n1. big shot 大佬 (dàlǎo): big shot (leading some field or group)\n2. touch the porcelain 碰瓷 (pèngcí): (coll.) to scam sb by setting up an “accident” in which one appears to have sustained damage or injury caused by the scam victim, then demanding compensation (variations include putting “expensive” porcelain in a place where it is likely to be knocked over by passers-by, and stepping into the path of a slow-moving car)>"
}