{
	"url": "https://www.novelupdates.com/series/reborn-as-the-villain-presidents-cat-dog/",
	"title": "Reborn as the Villain President’s Cat & Dog - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/12/重生成反派总裁的猫狗.jpg",
	"noveltype": "(CN)",
	"genre": "Fantasy   Romance   Shounen Ai   Supernatural   ",
	"tags": "Acting   Beasts   Body Swap   Brother Complex   Celebrities   Childhood Friends   Comedic Undertone   Devoted Love Interests   Doting Love Interests   Handsome Male Lead   Hidden Abilities   Love Interest Falls in Love First   Mob Protagonist   Modern Day   Older Love Interests   Pets   Prophecies   Reincarnation   Second Chance   Showbiz   Slow Romance   Transformation Ability   Unconditional Love   Wealthy Characters   ",
	"rating": "(4.4 / 5.0, 100 votes)",
	"author": "Lin Ang Si   林盎司   ",
	"year": "\n2020",
	"ranking": "#4080   #4122   #2334   #4041   #1715   ",
	"reviewcount": "27 Reviews sorted by",
	"description": "Wēn MíngYì has a next door neighbour childhood gege (elder brother). His gege is wealthy, handsome, and powerful, and would spoil him. However, under the influence of the novel, Wen MingYi staged a cold war fraught with scorn and ridicule with his gege for three years.\r\n\r\nAt long last, the three years were over. Wen MingYi was about to make amends with his gege when, pushed by the novel’s main character – slam – he died.\r\n\r\nAfter his death, Wen MingYi realised that he and his childhood gege were merely side characters in a novel. He had to die to complete the main characters’ true love relationship. Because of his death, his gege turned into a villain, becoming a stepping stone for the main characters’ true love, and who eventually got reduced to a penniless person who lost his family and life.\r\n\r\nWen MingYi could not take this lying down, but! He realised that he reincarnated! He had been reborn at the point when the white lotus main character was preparing to seduce his gege!\r\n\r\nWen MingYi hurriedly ran to his gege, wanting to tell him to cherish life, to get away from the white lotus.\r\n\r\nThe clock sounded at 9 o’clock, and he found that he had turned into a cat.\r\n\r\nWen MingYi was shocked. He got closer to his childhood gege and shouted: “Ge, ge……”\r\n\r\nBut the voice that came out was, “Meow, meow, meow meow meow meow……”\r\n\r\nSī JūnDuó looked at the didi (younger brother) who suddenly turned into a cat, stunned.\r\n\r\nWen MingYi aggrievedly “meow meow meow”-ed for half a day, and bit his pants leg, don’t leave!\r\n\r\nSi JunDuo: …… \r\n\r\nSi JunDuo reached down to pick the cat up.\r\n\r\nAnyone who associates with Si JunDuo is aware that he cares greatly about Wen MingYi, whom he had grown up with. He never retaliated no matter how much Wen MingYi raised trouble with him.\r\n\r\nHis friends observed, “You like him, romantically.”\r\n\r\nSi JunDuo indifferently said, “I do not.”\r\n\r\nHalf a year later, Wen MingYi who had been sharing the same bed with Si JunDuo as a cat everyday, stated that he should probably go back to his room. Si JunDuo grabbed his hand, “Just stay here. You’re mine when you turn into a cat or dog. When you transform back into a human, naturally you’re also mine.”\r\n\r\nWen MingYi: ???\r\n\r\nSi JunDuo stroked his head, “Behave.”\r\n\r\n— I like you, romantically.>"
}