{
	"url": "https://www.novelupdates.com/series/saving-80000-gold-in-an-another-world-for-retirement/",
	"title": "Saving 80,000 Gold in an Another World for Retirement - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/03/Saving-80000-Gold-in-an-Another-World-for-Retirement.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Comedy   Fantasy   Slice of Life   ",
	"tags": "Adapted to Anime   Adapted to Manga   Aristocracy   Cheats   Clever Protagonist   Contracts   Cute Children   Death of Loved Ones   Dragons   Empires   Fantasy World   Female Protagonist   Firearms   Gunfighters   Hard-Working Protagonist   Hiding True Abilities   Hiding True Identity   Interdimensional Travel   Kingdoms   Lack of Common Sense   Loli   Loyal Subordinates   Magic   Management   Mercenaries   Merchants   Military   Modern Day   Modern Knowledge   Money Grubber   Multiple Transported Individuals   Nobles   Orcs   Protagonist Strong from the Start   R-15   Restaurant   Royalty   Sharp-tongued Characters   Technological Gap   Transported Modern Structure   Transported to Another World   World Travel   ",
	"rating": "(3.9 / 5.0, 261 votes)",
	"author": "FUNA   ",
	"year": "\n2015",
	"ranking": "#1563   #1521   #349   #989   #581   ",
	"reviewcount": "32 Reviews sorted by",
	"description": "An 18-year-old girl who lost her family in an accident, Yamano Mitsuha falls off a cliff one day and transferred to a different world with a civilization level of medieval Europe. Mitsuha who discovered it was possible to go and return to Earth after a deadly fight with wolves decided to live in both worlds.\n\n「For the sake of security in old age, I will aim for 80,000 gold coins!」\n\nI will try not to let strange things circulate and distort the progress of the world, but I won’t hold back for the sake of my easy life and safety! While carrying three handguns along with words and deeds that appear decent, in her head, Yamano Mitsuha is a sly girl.\n\nMaking an effort to make money even with a small body that looks like a child to foreigners!\n\nOh, my secrets are too dangerous, you said? It’s fine, it’s fine! I’ll transfer away when push comes to shove!>"
}