{
	"url": "https://www.novelupdates.com/series/the-devils-eye-of-destruction-is-lustrous-black-the-reincarnated-lady-duchess-is-a-warrior-in-it-broke-even-though-i-did-nothing/",
	"title": "The Devil’s Eye of Destruction Is Lustrous Black ~ The Reincarnated Lady Duchess Is a Warrior in “It Broke Even Though I Did Nothing” ~ - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/06/The-Devils-eye-of-Destruction-is-lustrous-Black-The-reincarnated-Lady-Duchess-is-a-warrior-in-It-broke-even-though-I-did-nothing.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Fantasy   Gender Bender   Seinen   Slice of Life   ",
	"tags": "Appearance Changes   Beastkin   Beautiful Female Lead   Conditional Power   Eye Powers   Fantasy World   Female Protagonist   Godly Powers   Magic   Male to Female   Reincarnated in Another World   Soul Power   Transmigration   Witches   ",
	"rating": "(4.3 / 5.0, 3 votes)",
	"author": "八百十三   ",
	"year": "\n2022",
	"ranking": "#5262   #6229   #11681   #8369   #11304   ",
	"reviewcount": "No Reviews",
	"description": "Akira Kaege, a second-year employee working at an IT company, was famous for destroying things to the point where she was nicknamed the “God of Destruction” behind the scenes.\n\nIf you try to brew tea, the electric kettle breaks, if you serve tea to customers, the tea pot breaks, and if you participate in a project and do your job, the data will be damaged. I was treated like touching a swollen object, and I worked overtime every day to catch up.\n\nOne day, after working overtime day after day, night after night, Akira breaks the master data of the customer database.\n\nThe usual “I broke down even though I didn’t do anything” doesn’t work, and Akira receives a stern reprimand from his boss. The next moment Akira was forced to stand and yell at him, and the next moment he suddenly lost consciousness due to the fatigue of overtime work and lack of sleep, Akira collapsed into a strange meadow…had.\n\nHe has chestnut-colored hair on his face. Looking curiously into his face were a beast man boy with cat-eared cats, an elderly man with horns, and a maid with winged ears. They call themselves “Eleonora-sama” by an unknown name.\n\nIn the back of Akira’s mind, who didn’t know what it was, he heard a voice claiming to be God. Akira had been reincarnated as Eleonora van Oylshat, the daughter of the Dukes of Oylshat.\n\nMoreover, Eleonora had recently been kicked out of her home and is being transported to a remote area far from the royal capital.\n\nWhen I talk to Benjamin, a beast man boy who is a kin samurai, Bartel, the butler, and Linda, the maid, the cause is the color of Eleonora’s eyes. Apparently, she was persecuted for being a witch with wet eyes.\n\nAccording to the god who interrupted the story, this eye is the “magic eye of destruction” and destroys everything in an instant!?\n\nEleonora arbitrarily decides that the phenomenon of things breaking down arbitrarily when she was on Earth is also due to this magic eye, and begins to act.\n\nTo destroy only those that harm you and the world. To repay her father for calling him a witch with her abilities.\n\nUsing the magic eye that instantly crumbles the lazy lord, the evil dragon, and even the demon king’s castle in one fell swoop, Eleonora’s rapid advance to become a real “god of destruction” begins!>"
}