{
	"url": "https://www.novelupdates.com/series/incubus-banishment/",
	"title": "Incubus Banishment - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/02/Incubus-Banishment.jpg",
	"noveltype": "(JP)",
	"genre": "Adventure   Comedy   Ecchi   Fantasy   Harem   Romance   ",
	"tags": "Adventurers   Beautiful Female Lead   Childhood Friends   Childhood Love   Comedic Undertone   Cute Protagonist   Dungeons   Fantasy World   First-time Interc**rse   Guilds   Human-Nonhuman Relationship   Kingdoms   Kuudere   Love Interest Falls in Love First   Male Protagonist   Master-Servant Relationship   M*sturbation   Obsessive Love   Older Love Interests   Polygamy   Possessive Characters   R-15   R*pe Victim Becomes Lover   Reverse R*pe   R*pe   Schemes And Conspiracies   S*xual Cultivation Technique   Shota   Strong Love Interests   Weak to Strong   Yandere   ",
	"rating": "(4.2 / 5.0, 69 votes)",
	"author": "Akagi Hirotaka   Dragon Tanishi   ドラゴンタニシ   赤城大空   ",
	"year": "\n2022",
	"ranking": "#23   #45   #2412   #72   #2637   ",
	"reviewcount": "8 Reviews sorted by",
	"description": "A world where one’s life was decided by one’s talent called Gift.\r\nThe main character Erio Scarlet who was born in the house of influential noble family that had produced a lot of Holy Knights manifested a suspicious gift Incubus in the conferment ceremony. Furthermore the skill attached to that Gift was only one embarrassing skill called Peerless.\r\n\r\nErio was banished from the city because there was no way his indecent existence could be permitted in a family of Holy Knights but……somehow he went through an amazing growth when he dealt with his horniness though!?\r\n\r\nIn addition when his childhood friend who was bestowed with the Gift Sacred Knight chased after the main character because of her love for him reverse ra-……did it with him, a lot of powerful indecent skills showed up and on top of that they even got bound by Master-Servant contract……!?\r\n\r\nThis was the indecent heroic tale of the boy who was gifted with indecent Gift rising in the world while [getting along] with a lot of girls.>"
}