{
	"url": "https://www.novelupdates.com/series/my-husband-with-scholar-syndrome/",
	"title": "My Husband With Scholar Syndrome - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/11/image.png",
	"noveltype": "(CN)",
	"genre": "Drama   Romance   Shoujo   Slice of Life   ",
	"tags": "Autism   Beautiful Female Lead   Caring Protagonist   Character Growth   Childhood Friends   Childhood Love   Clumsy Love Interests   Couple Growth   Death of Loved Ones   Devoted Love Interests   Doting Love Interests   Doting Older Siblings   Doting Parents   Female Protagonist   Handsome Male Lead   Heartwarming   Lack of Common Sense   Love Interest Falls in Love First   Marriage   Modern Day   Pregnancy   Reincarnation   Scientists   Second Chance   Terminal Illness   Unconditional Love   ",
	"rating": "(4.6 / 5.0, 791 votes)",
	"author": "Grumpy Crab   暴躁的螃蟹   ",
	"year": "\n2019",
	"ranking": "#1010   #3376   #797   #271   #479   ",
	"reviewcount": "215 Reviews sorted by",
	"description": "Mu Xiaoya lived for twenty-six years before she knew that she had a sudden genetic disease. There was no medicine for it, and there was only death waiting for her.\n\nBefore she died, many people came to see her, but she was most impressed by Bai Chuan.\n\nBai Chuan was her neighbor, an autistic child with scholar’s syndrome. At that time, his face full of scars was desperate: “I – I studied all your medical records, but I have no way to save you.”\n\nMu Xiaoya was stunned: “You are a doctor?”\n\nBai Chuan: “I am not… …”\n\nMu Xiaoya’s disease was a genetic disease. Unless the gene was changed, there was no possibility of cure. However, Bai Chuan was the only person who tried to cure her after she fell ill.\n\nMu Xiaoya: “Why are you going to cure me?”\n\nBai Chuan: “I want to marry you.”\n\nMu Xiaoya laughed: “If you marry me, you will soon become a widower.”\n\nBai Chuan insisted: “I – I want to marry you.”\n\nBai Chuan, who has cognitive impairments, can’t express his meaning very well, and can only repeat it over and over again.\n\nLater, Mu Xiaoya still died. When she woke up, she returned to the summer of her college graduation.\n\nBai Chuan: “I… I want to marry you.”\n\nMu Xiaoya: “Good.”\n\nThe starlight in the eyes of Bai Chuan was the most beautiful scenery that Mu Xiaoya had ever seen in her life.>"
}