{
	"url": "https://www.novelupdates.com/series/doing-it-with-the-creator-in-a-survival-game/",
	"title": "Doing It With the Creator in a Survival Game - Novel Updates",
	"image": "https://www.novelupdates.com/img/noimagefound.jpg",
	"noveltype": "(CN)",
	"genre": "Adult   Fantasy   Horror   Mature   Romance   Smut   Supernatural   Yaoi   ",
	"tags": "Black Belly   Clingy Lover   Corruption   Cute Protagonist   Exhibitionism   First Love   First-time Interc**rse   F*llatio   Game Elements   Gods   Handsome Male Lead   H*ndjob   Human-Nonhuman Relationship   Hypnotism   Lack of Common Sense   M*sturbation   Mind Break   Outdoor Interc**rse   Perverted Protagonist   Reincarnation   R*pe   Secret Crush   Shameless Protagonist   Survival Game   Tentacles   Unlimited Flow   Yandere   ",
	"rating": "(4.0 / 5.0, 42 votes)",
	"author": "谢仁煊   ",
	"year": "\n2021",
	"ranking": "#2425   #2793   #5844   #2891   #5776   ",
	"reviewcount": "3 Reviews sorted by",
	"description": "As an unlimited-type player, Chi Yu is a famous points demon.\n\nHis teammates watched him as he went back to the cellar all of a sudden to get an apple that was worth one point after solving the puzzle in disbelief.\n“Is this rational? That apple really is only worth one point!”\n\nChi Yu did not say anything. Chi Yu only wanted points.\n\nChi Yu who picked up the prop silently touched the prop in his hands, and thought to his crush in the real world, Gu Wen Qiao.\n\nThe hands that pick up garbage is filled with power once again!\n\nThe small little body arduously carried the bag and left the scene of the robbery(no)!\n\nGu Wen Qiao: ……\n\n(Silently gives his wife an unlimited storage bag as a clearing gift)\n\nChi Yu’s so happy! He can pick up more points now!\n\nBut, this kind of happiness could not stay for long, the survival game turned more and more strange! Clearly it was such a scary atmosphere but!\n\nWhy does the sleeping beauty he have to kiss awake have the same face as Gu Wen Qiao—— isn’t it enough to kiss for a bit why is it a French kiss…… mmmm!\n\nDamnit, when getting chased by a ghost and flipping over a wall, he got stuck, his points are going to be all gone wuuuu the game’s going to be a failure——! Wait a minute what just pulled off his pants!\n\nAlthough he drew the role of the bride of the evil spirit in the game, but no way, no way, does he really need to consummate the marriage! —— Hey, the face is the same as Gu Wen Qiao’s……\n\nThe survival game turned weirder and weirder, but the points also increased more and more.\n\nChi Yu also……\n\nWas done in so much he got all muddle-headed.\n\nDamnit, can these kind, these kind of days of constantly making love with a crush and having a lot of points be casually had!\n\nAnd at the same time, after Chi Yu went back to the real world, and saw Gu Wen Qiao—— wuuuuu can’t let him find out that I did it too much with a NPC that looked just like him in the game already!\n\nTo not have his own filthy desires discovered by his secret crush, Chi Yu acted more and more reserved, and only dared to secretly peek at Gu Wen Qiao.\n\nGu Wen Qiao: …… He is avoiding me.\n\nAfter returning to the game——\n\nWahhh why are these NPCs getting more and more outrageous! Chi Yu got done so much his tongue was sticking out, and the bottom was constantly leaking.\n\nWhile “Gu Wen Qiao” at his back was still interrogating him.\n\n“Do you like me?”\n\n“Wuuuu I-I do……”>"
}