{
	"url": "https://www.novelupdates.com/series/he-loved-my-sister/",
	"title": "He Loved My Sister - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/08/He-Loved-My-Sister.jpg",
	"noveltype": "(KR)",
	"genre": "Drama   Fantasy   Romance   ",
	"tags": "Adapted to Manhwa   Beautiful Female Lead   Calm Protagonist   Child Protagonist   Childhood Love   Clumsy Love Interests   Cold Love Interests   Cold Protagonist   Devoted Love Interests   European Ambience   Female Protagonist   First Love   Love Interest Falls in Love First   Misunderstandings   Multiple POV   Multiple Reincarnated Individuals   Older Love Interests   Reincarnated in Another World   Reincarnation   Siblings   Sibling's Care   Single Parent   Sister Complex   Special Abilities   Tragic Past   Twins   Unreliable Narrator   ",
	"rating": "(4.1 / 5.0, 52 votes)",
	"author": "꽃니랑   ",
	"year": "\n2021",
	"ranking": "#1750   #1952   #3507   #3535   #3014   ",
	"reviewcount": "10 Reviews sorted by",
	"description": "I thought I was the heroine, but I wasn’t. I knew it as soon as I saw my cute little sister that I’ve never met before. She’s the heroine. My shiny younger sister was the heroine everyone loved, and I was just an accidental bonus. \n\nThe woman will love the man, and the man will also love the woman.\n\nBut I’m not my younger sister, so why do I keep getting tangled up with the male lead? Meeting him was the worst. The problem is, I’m starting to fall in love with him. He loves my sister, and the whole story will go the way it was supposed to.\n\n“Let’s stop now. Let’s put everything down and disappear.”\n\nI ran away from the climax where he said he would marry my sister. There’s no need to have extras under a flashy spotlight. So I packed up and ran away…\n\nWhy is this man here? There was madness in his eyes while looking at me.\n\n“Did you hate me so much?”\n\n“What?”\n\n“This is where you trampled after my proposal and ran away immediately.”\n\nBloody eyes, tears? Is he crying?\n\n“Wait a minute. A proposal? What are you talking about?”\n\n“It’s no use running away again. I’ll follow you wherever you go.”\n\nThe blazing eyes were unfamiliar.\n\n“I’m the only one who’ll see it.”\n\nWhat did you just say?\n\n“I’ll make it as if you couldn’t breathe without me.”\n\n“What do you mean by that?”\n\n“That day. You didn’t answer me.”\n\nAha. Got it. I don’t know why, but my sister must have divorced him. Otherwise, The Duke, who hated me, told me that…\n\n“Let’s get married.”\n\nYou wouldn’t propose, would you?>"
}