{
	"url": "https://www.novelupdates.com/series/the-revenge-of-the-soul-eater/",
	"title": "The Revenge of the Soul Eater - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/09/81uZbZX-79L._AC_SL1500_.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Ecchi   Fantasy   Harem   Martial Arts   Romance   Seinen   Supernatural   Tragedy   ",
	"tags": "Accelerated Growth   Adapted to Drama CD   Adapted to Manga   Adventurers   Antihero Protagonist   Beastkin   Betrayal   Body Tempering   Brainwashing   Broken Engagement   Bullying   Character Growth   Cold Protagonist   Cunning Protagonist   Dark   Demi-Humans   Demons   Determined Protagonist   Dragon Riders   Dragon Slayers   Dragons   Elves   Enemies Become Allies   Enemies Become Lovers   Family Conflict   Fantasy World   Gods   Guilds   Hiding True Abilities   Human-Nonhuman Relationship   Inheritance   Level System   Loner Protagonist   Love Interest Falls in Love First   Magic Beasts   Male Protagonist   Master-Servant Relationship   Mind Break   Multiple POV   Near-Death Experience   Netori   Older Love Interests   Outcasts   Overpowered Protagonist   Personality Changes   Politics   Polygamy   R-15   Resurrection   Revenge   Ruthless Protagonist   Schemes And Conspiracies   Sealed Power   S*ave Harem   S*aves   Slow Growth at Start   Social Outcasts   Soul Power   Stockholm Syndrome   Strength-based Social Hierarchy   Strong Love Interests   Strong to Stronger   Sudden Strength Gain   Sword And Magic   Underestimated Protagonist   Unique Weapon User   Unique Weapons   Weak to Strong   Younger Love Interests   ",
	"rating": "(3.9 / 5.0, 164 votes)",
	"author": "玉兎   ",
	"year": "\n2018",
	"ranking": "#3710   #1437   #1468   #4924   #1660   ",
	"reviewcount": "22 Reviews sorted by",
	"description": "The Mitsurugi household was given the important task of guarding the demon gate by the emperor.\n\nSora Mitsurugi, who was the heir of the family, was called on to take the trial ceremony at the age of thirteen.\n\nThe trial is something that he must overcome in order to learn the phantom blade style that was passed down the Mitsurugi household from generation to generation.\n\nThe other seven pupils of the same age who had taken the trial have all passed. And now only Sora remained.\n\nHis father, brother, fiancee, and a pair of siblings who have watched over him were all looking, as Sora’s trial ceremony solemnly began…>"
}