{
	"url": "https://www.novelupdates.com/series/the-reincarnated-sage-lives-with-his-daughters/",
	"title": "The Reincarnated Sage Lives With His Daughters - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/09/The-Reincarnated-Sage-Lives-With-His-Daughters.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Comedy   Fantasy   Harem   Romance   Slice of Life   ",
	"tags": "Adapted to Manga   Adopted Children   Adventurers   Appearance Different from Actual Age   Beautiful Female Lead   Childcare   Cute Children   Familial Love   Family   Gods   Lack of Common Sense   Love Interest Falls in Love First   Magic   Magic Beasts   Male Protagonist   Overpowered Protagonist   Parent Complex   Protagonist Strong from the Start   Spirit Users   Spirits   Sudden Strength Gain   Summoning Magic   Sword And Magic   Sword Wielder   Transported to Another World   Younger Love Interests   ",
	"rating": "(4.2 / 5.0, 12 votes)",
	"author": "Kotohira Ryou   琴平 稜   ",
	"year": "\n2018",
	"ranking": "#2000   #2000   #12211   #7465   #9827   ",
	"reviewcount": "No Reviews",
	"description": "Kent Ōnarī, a former company employee, was reincarnated into another world as the strongest sage by chance, but he didn’t use his cheat abilities he had been given and lived a self-sufficient life in a remote church.\n\nOne day, his older sister ran into his house with three children.\n\nKent lived with his wife, sister, and the daughters of a mage, a swordsman, and a summoner, as if they were his family.\n\n“Dad, you’re so strong and cool! Please teach Ashuri magic too!”\n\n“Okay. First, watch the spirits’ movements closely…”\n\n“? You can see the spirits???”\n\n“Yes?”\n\n—\n\n“Noah, I killed a big bird! Now it’s going to be bird casserole.”\n\n“Kent, that’s the legendary dragon…”\n\n—\n\n“Papa, Fio, I want to ride Pegasus-sama…”\n\n“Oh, good. I’ll summon anything you want. What color Pegasus do you want?”\n\nHis daughters love Kent very, very much.\n\nAnd—\n\n“It’s like we’re a married couple…”\n\nAt night, he spends a warm time with Stella.\n\nThis is how the happy slow life of an old wise man began.>"
}