{
	"url": "https://www.novelupdates.com/series/im-completely-clueless-about-sockpuppet-accounts-being-unmasked/",
	"title": "I’m Completely Clueless About Sockpuppet Accounts Being Unmasked - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/05/Im-Completely-Clueless-About-Sockpuppet-Accounts-Being-Unmasked.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Drama   Romance   Sports   Yaoi   ",
	"tags": "Devoted Love Interests   Doting Love Interests   e-Sports   Early Romance   Gamers   Handsome Male Lead   Hiding True Identity   Modern Day   Older Love Interests   Past Trauma   Popular Love Interests   Power Couple   Proactive Protagonist   Protagonist Strong from the Start   Shameless Protagonist   Wealthy Characters   ",
	"rating": "(4.2 / 5.0, 100 votes)",
	"author": "不吃姜的胖子   ",
	"year": "\n2019",
	"ranking": "#2594   #3142   #3040   #7043   #3011   ",
	"reviewcount": "22 Reviews sorted by",
	"description": "Fu Mingyuan had become famous when he was young, with a good appearance and body. At the age of 25, he won the title of film emperor, and he once said that acting was better than dating. Until one day, he found that his younger brother, who was in junior high school, was a supporter of a male anchor named “Cyber Sweetie” who he watched every day.\n\nThe clear voice of the male anchor sounding from the phone: The winning cutie, do you want Gege to kiss you or hug you?\n\nCompletely serious · game noob · Film Emperor Fu went into the livestream room and lectured: Don’t corrupt minors\n\nLater, a poker-faced Film Emperor Fu came to the little anchor Shen Qi’s ear and said in a deep voice: I’m an adult, you can corrupt me.\n\nAfter retiring for a period of time, Angry, the former captain of M1G, who returned to the e-sports arena with a new team, won the first match. Netizens exclaimed that God A was “old but vigorous in mind and body”\n\nFans were busy rushing around spreading the news, and countless male and female fans were crying out to marry him.\n\nFilm Emperor Fu Mingyuan made a Weibo post: Thank you, @Angry is mine.\n\n? ? ? ?\n\nNetizen: What is this, did we read who made this Weibo post wrong?\n\nAngry forwarded the post: Hello everyone, I’m Cyber Sweetie. Let me introduce @Fu Mingyuan, my boyfriend, KissKissShy.Jpg>"
}