{
	"url": "https://www.novelupdates.com/series/so-youre-such-a-doctor-song/",
	"title": "So You’re Such A Doctor Song - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/02/youre-such-a-doctor-song.jpg",
	"noveltype": "(CN)",
	"genre": "Josei   Romance   ",
	"tags": "Doctors   Female Protagonist   Modern Day   ",
	"rating": "(3.1 / 5.0, 18 votes)",
	"author": "Leaf Snow   葉雪   ",
	"year": "\n2016",
	"ranking": "#2000   #2000   #9087   #3060   #10764   ",
	"reviewcount": "4 Reviews sorted by",
	"description": "Changqing has always felt that she's incomparable to Guan Ying in every aspect. Even though she is pretty and has a good family background, this world is nothing more than a world where Princes are more attracted to Cinderellas.\r\n\r\nHer first love that she dearly remembers in her heart for years eventually becomes Guan Ying’s current boyfriend and her fiancé is Guan Ying’s ex. He has yet to forget Guan Ying.\r\n\r\nA business marriage brings Changqing and Song Chuyi together despite the absence of love.\r\nIn public, he is her friend’s ex and in private he is her husband who cannot be publicly–known.\r\nAt the hospital, her good friend enjoys her husband’s embrace while she can only act as though he's a stranger.\r\nAt a gala dinner, her good friend hooks her arm around her first love’s arm shyly and she can only smile and give them her blessings.\r\n\r\n…\r\n\r\nIn this marriage, Changqing thinks that all is well other than the fact that Song Chuyi doesn’t love her.\r\nFirst, her husband is a doctor and he can treat all her illnesses while saving up on medical expenses.\r\nSecond, doctors love cleanliness and her husband would always ensure the cleanliness of the house.\r\nThird, at the end of every month, her thin wallet would grow thick with cash that her husband stuffs in secretly.\r\nFourth, as a person who doesn’t like to exercise, she always get dragged around by her husband day and night to do some pleasurable exercise that is beneficial for the body and mind.\r\nFifth, she would never have to worry that she would be out of money.\r\nThere are always so many uncountable advantages that Changqing enjoys.\r\n\r\n…\r\n\r\nAfter the marriage, on a certain night, Changqing looks at Dr. Song gloomily. 'Hubby, why are you so nice to me when you don’t even love me?'\r\nDr. Song continues reading his medical books and ignores her. It's sometimes quite a headache when your wife is too stupid and daft.\r\nUntil one day, Changqing realises that there's really no free lunch in this world…>"
}