{
	"url": "https://www.novelupdates.com/series/what-kind-of-newbie-are-you-they-said-that-summoner-is-a-terrible-job-yet-they-call-her-the-last-boss/",
	"title": "What Kind Of Newbie Are You?! They Said That “Summoner” Is A Terrible Job, Yet They Call Her The Last Boss - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/08/What-Kind-Of-Newbie-Are-You-They-Said-That-Summoner-Is-A-Terrible-Job-Yet-They-Call-Her-The-Last-Boss.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Comedy   Fantasy   Sci-fi   ",
	"tags": "Adapted to Manga   e-Sports   Female Protagonist   Game Elements   Gamers   Guilds   Level System   Management   MMORPG   Overpowered Protagonist   Pets   Summoning Magic   Virtual Reality   ",
	"rating": "(3.6 / 5.0, 26 votes)",
	"author": "魚虎・瀧岡くるじ   ",
	"year": "\n2020",
	"ranking": "#269   #240   #5067   #162   #7425   ",
	"reviewcount": "No Reviews",
	"description": "Kei Aikawa, a 28-year-old office lady, sees a certain advertisement during her train commute. She learned that the VRMMO game, Genesis Omega Online, beloved by young people online, will be collaborating with the anime “Virtumon” that Kei loved since childhood.\r\n\r\n“Huh, VR means you can interact with Virtumons in the game world!? I’m sold!”\r\n\r\nTo play with her favorite Virtumon and heal her daily fatigue, she chooses the Summoner job and starts the game! However, Kei played the collaboration event as a total beginner and accidentally fulfills the conditions for obtaining the most powerful equipment because her love for the original anime is just too strong…\r\n\r\n“Status points? I’ve never used them before?” “A guild? What is that?” “What the, I’m on the official advertising videos… stop?!”\r\n\r\nShe thought she was just enjoying the game as a newbie, but before she knew it, she was being recognized by the top players.\r\n\r\nThis is the story of an office lady who has zero game experience and becomes a player called “The Last Boss Who Thinks She’s A Newbie”.>"
}