{
	"url": "https://www.novelupdates.com/series/the-vicious-supporting-female-character-and-the-white-lotus-female-lead/",
	"title": "The Vicious Supporting Female Character And The White Lotus Female Lead - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/08/07-d239f44.jpg",
	"noveltype": "(CN)",
	"genre": "Adventure   Comedy   Drama   Fantasy   Romance   School Life   Yuri   ",
	"tags": "Acting   Beautiful Female Lead   Calm Protagonist   Clever Protagonist   Dense Protagonist   Episodic   Famous Protagonist   Female Protagonist   First Love   Friendship   Heartwarming   Interdimensional Travel   Kind Love Interests   Love Interest Falls in Love First   Male Yandere   Modern Day   Multiple Realms   Quiet Characters   Shy Characters   Strong Love Interests   Strong to Stronger   System Administrator   Transmigration   Unconditional Love   Villainess Noble Girls   Wealthy Characters   World Hopping   World Travel   ",
	"rating": "(4.6 / 5.0, 131 votes)",
	"author": "戈云栖   ",
	"year": "\nN/A",
	"ranking": "#296   #471   #1558   #333   #2930   ",
	"reviewcount": "19 Reviews sorted by",
	"description": "Luan Qingxiao became a member of the Plot Amendment Research Institute, and already encountered a hurdle on her first mission.\n\nShe was to play the role of the antagonist, who would become the fuel the male and female lead needed to finally fall in love. However, the results from her work are unacceptable, the white lotus female lead is developing feelings toward her…\n\nNie Zhen’er’s face is like a delicate peach blossom. Remaining shy, and frightened to leave, with her eyes and red lips gently open: Qingxiao, I like you.\n\nLuan Qingxiao: … I do too!\n\nWho would be willing to reject such a beauty?\n\nSystem 520: Wait, wait a minute! What is this situation?!\n\n1. [Campus Hipster], the school bully x the campus belle √\n\n520: Great Host, you must bully her, humiliate her, frame her, it’s crucial that the male lead saves her in these situations!\n\nLuan Qingxiao: No problem.\n\n…\n\n520: Great Host, the situation doesn’t seem quite right, why would the female lead like the girl who bullied her, humiliated her, and framed her??\n\nLuan Qingxiao lowered her eyes and smiled softly: because she understands me.>"
}