{
	"url": "https://www.novelupdates.com/series/special-agents-rebirth-the-almighty-goddess-of-quick-transmigration/",
	"title": "Special Agent’s Rebirth: The Almighty Goddess of Quick Transmigration - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2018/07/SARTAGOQT.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Comedy   Martial Arts   Romance   Sci-fi   Shoujo   Supernatural   Tragedy   ",
	"tags": "Acting   Ancient Times   Artifact Crafting   Beautiful Female Lead   Bloodlines   Calm Protagonist   Clever Protagonist   Complex Family Relationships   Cultivation   Dancers   Devoted Love Interests   Doctors   Economics   Episodic   Female Protagonist   Feng Shui   Futuristic Setting   Gamers   Genius Protagonist   Hackers   Late Romance   Love Interest Falls in Love First   Magic   Mercenaries   Military   Modern Day   Multiple Realms   Multiple Timelines   Overpowered Protagonist   Parallel Worlds   Pill Concocting   Psychic Powers   Scientists   Secret Organizations   Sibling Rivalry   Siblings   Singers   Soldiers   Special Abilities   System Administrator   Time Skip   Transmigration   Transported Modern Structure   Transported to Another World   World Hopping   Writers   Younger Brothers   ",
	"rating": "(3.7 / 5.0, 136 votes)",
	"author": "Road of Flowers   Yīlù Fán Huā   一路烦花   ",
	"year": "\n2018",
	"ranking": "#2000   #2000   #1063   #3855   #2297   ",
	"reviewcount": "28 Reviews sorted by",
	"description": "She is the rising (new) movie queen of the entertainment circle, who is also Beijing’s Ye Family long-lost Second Young Miss. Everyone knows that the Ye Family Eldest Young Miss is the chairman of Fenghai Group; Ye Family Third Young Master is a Major General of the military area; and yet, Ye family wants the second young miss to come back home, but she is just a flower vase (pretty face) of the entertainment industry.\n\nFather doesn’t love her, Mother is not fond of her. However, no one knows that she is merely a vase on the surface. In fact, she is actually the top special agent that gives endless headaches to all international big shots. She, is higher (loftier) than the military industry added together!\n\nBut she didn’t imagine that, with one slip, she unexpectedly got bound to a system that draws energy from completing tasks.\n\nFrom then on, she crossed numerous parallel worlds and rewrote all kinds of miserable lives. Regardless of which world, she lived flourishingly. But she did not expect to attract a mysterious force’s big shot during these tasks…\n\nWhen she draws the energy to return to the summit of reality, With the body of Ye’s family second miss, she can have whatever she wants​, but the family business can’t accept it. It’s just that it’s not good to have a man who is always behind her, how can she be worthy of the title ‘Top Secret Agent’ given by the international big shots?! \n\nWait for her to unmask her identity, one by one, it is precisely the time for the Phoenix to overlook the land under the heavens.\n\nOne is a mysterious teenager who is frighteningly outstanding. The other is a top agent who is famous all over the world. It’s a love showdown between the strong and the strong.>"
}