{
	"url": "https://www.novelupdates.com/series/i-am-sorry-but-the-ending-is-already-messed-up/",
	"title": "I Am Sorry, but the Ending Is Already Messed Up - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/08/I-Am-Sorry-but-the-Ending-Is-Already-Messed-Up_1660195451.jpg",
	"noveltype": "(KR)",
	"genre": "Fantasy   Romance   ",
	"tags": "Antihero Protagonist   Beautiful Female Lead   Dead Protagonist   Empires   European Ambience   Fantasy World   Female Protagonist   Handsome Male Lead   Late Romance   Otome Game   Personality Changes   Poor Protagonist   Possession   Possessive Characters   Power Struggle   Royalty   Transmigration   Transported into a Game World   Unlucky Protagonist   Villainess Noble Girls   ",
	"rating": "(4.8 / 5.0, 10 votes)",
	"author": "윤놀이   ",
	"year": "\n2022",
	"ranking": "#5262   #2000   #12470   #6109   #10155   ",
	"reviewcount": "No Reviews",
	"description": "The female lead of the game dies, and her fiancé falls into despair. There is an epidemic that has no cure in the country.\n\nA world after the ending that is referred to as ‘the most terrible, the worst, and the most disgusting’ in the game. I stood in the middle of that world, becoming the female lead’s twin sister and the villainess that killed her sister.\n\nOh, I’m screwed.\n\nThe new life ended before it even started.\n\nMy name is Fay Le O’Belle, the twin sister of the female lead, the blood of a beautiful fairy, and the last head of a prestigious family. It’s all useless. For me, ‘Fay’ is just a villainess that killed the female lead.\n\nThe ending is already messed up. There is no turning back. So I will live with my mouth shut like a dead rat.\n\n“s*upid, arrogant, crazy….., did you kill René just for this?”\n\nIt’s apparently impossible. There’s a guy who already knows all the truth and is eager to kill me. He is René’s half-brother, Denev, who loves her.\n\nFrom now on, I have to think about how to run away from him.\n\n……in a world where everyone loves René, how can I, who killed René, save my life?\n\n‘I don’t want to die even though I’m a villainess with a bad ending.’\n\nAll right. So, let’s run away first.>"
}