{
	"url": "https://www.novelupdates.com/series/the-story-of-hero-among-heroes-the-founding-chronicles-of-arestia/",
	"title": "The Story of Hero Among Heroes ~The Founding Chronicles of Arestia - Novel Updates",
	"image": "https://www.novelupdates.com/img/noimagefound.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Fantasy   Harem   Martial Arts   Romance   ",
	"tags": "Aristocracy   Army   Army Building   Arranged Marriage   Beastkin   Beautiful Female Lead   Calm Protagonist   Charismatic Protagonist   Cheats   Clever Protagonist   Cunning Protagonist   Demons   Determined Protagonist   Domestic Affairs   Dragons   Dwarfs   Elves   Famous Protagonist   Fantasy World   Genius Protagonist   Hard-Working Protagonist   Heroes   Inheritance   Kind Love Interests   Kingdom Building   Kingdoms   Legends   Love Interest Falls in Love First   Loyal Subordinates   Magic   Male Protagonist   Marriage   Multiple POV   Nobles   Overpowered Protagonist   Past Plays a Big Role   Politics   Polygamy   Protagonist Strong from the Start   Reincarnation   Royalty   Schemes And Conspiracies   Special Abilities   Spirit Advisor   Strategic Battles   Strategist   Strong Love Interests   Strong to Stronger   Sword And Magic   Sword Wielder   Underestimated Protagonist   Wars   ",
	"rating": "(3.4 / 5.0, 105 votes)",
	"author": "Kanpachi   勘八   ",
	"year": "\n2017",
	"ranking": "#6970   #6207   #1382   #5808   #3044   ",
	"reviewcount": "10 Reviews sorted by",
	"description": "The Arcadia continent where numerous races such as Elves, Beastmen and Demons, with Humanity as the lead.\n\nAn Era of War where nation fought nation, particularly a country known as the Holy Arcadia Empire.\n\nAres Schwarzer, who was born among the aristocrats of The Holy Arcadia Empire, possessed a deep secret.\n\nHe was born with the memories of heroes from the past, a God of War, a Master Swordsman and a Genius Alchemist.\n\nThis is a story of a man who ruled the warfare of the Arcadia Continent, supported by the predecessors’ knowledge and skills and many fellows, gradually called the “Hero of Heroes”>"
}