{
	"url": "https://www.novelupdates.com/series/easily-set-aflame/",
	"title": "Easily Set Aflame - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/10/0DD0C596-FBAF-4FB5-A6A0-A1A04E7EC6A7.jpeg",
	"noveltype": "(CN)",
	"genre": "Josei   Romance   Slice of Life   ",
	"tags": "Acting   Celebrities   Cute Protagonist   Cute Story   Doting Love Interests   Female Protagonist   Handsome Male Lead   Heartwarming   Kind Love Interests   Modern Day   Older Love Interests   Quiet Characters   Showbiz   Shy Characters   Slow Romance   Unconditional Love   Writers   ",
	"rating": "(4.3 / 5.0, 180 votes)",
	"author": "Mo Bao Fei Bao   墨宝非宝   ",
	"year": "\n2011",
	"ranking": "#5262   #2911   #2459   #1927   #2372   ",
	"reviewcount": "35 Reviews sorted by",
	"description": "Jia He is a worker-bee screenwriter in China, a profession that really does not get much for recognition but suits her personality of not liking to be in the spotlight. One day, she gets a call and finds out who will be the leading actor of her latest script—Yi Wenze, her longtime idol since her teenage days. Jia He is the screenwriter on-location for this project. So, she is there, trying best to maintain her composure and contain her starstruck giddiness in front of her idol. In the process, she happily discovers, some time later, that she has become friends with her idol. Aaaah! Already a dream come true, right? Her time with this project comes to an end, and she bids farewell and returns home, thinking that if some day she runs into Yi Wenze again, they are acquainted enough that they can nod their heads in friendly greeting to one another. But then, soon after, she gets a phone call, and the name that shows up on her caller ID is… Yi Wenze.\n\nAnd so, this is a story of how a little screenwriter is pursued by her idol, the one who had been in all her teenage dreams, how she goes from being idol’s diehard fan, to idol’s friend, to idol’s girlfriend, to idol’s fiancee, to idol’s… Hehehehe.>"
}