{
	"url": "https://www.novelupdates.com/series/blessing-from-the-goddess-and-transfer-to-another-world-no-thanks-i-dont-need-a-special-ability/",
	"title": "Blessing from the Goddess and Transfer to Another World! ~No Thanks, I Don’t Need a Special Ability~ - Novel Updates",
	"image": "https://www.novelupdates.com/img/noimagefound.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Comedy   Ecchi   Fantasy   Harem   Shounen   Supernatural   ",
	"tags": "Ability Steal   Adventurers   Angels   Aristocracy   Betrayal   Brainwashing   Calm Protagonist   Charismatic Protagonist   Cheats   Childhood Friends   Clever Protagonist   Cunning Protagonist   Demons   Dense Protagonist   Devoted Love Interests   Dragons   Dungeon Master   Dungeons   Elves   Fallen Angels   Fanaticism   Fantasy Creatures   Fantasy World   Game Elements   Goddesses   Heroes   Hiding True Abilities   Hiding True Identity   Kind Love Interests   Kingdoms   Knights   Loli   Magic   Magic Beasts   Maids   Male Protagonist   Monster Girls   Monster Tamer   Monsters   Multiple Transported Individuals   Older Love Interests   Overpowered Protagonist   Polygamy   R-15   Royalty   Ruthless Protagonist   Seven Deadly Sins   Shameless Protagonist   Siblings Not Related by Blood   Skill Assimilation   S*ave Harem   S*aves   Soul Power   Special Abilities   Spirits   Strong Love Interests   Strong to Stronger   Summoned Hero   Sword And Magic   Sword Wielder   Torture   Transported to Another World   Vampires   Weak to Strong   World Travel   Yandere   Younger Love Interests   ",
	"rating": "(3.5 / 5.0, 533 votes)",
	"author": "Kooda   コーダ   ",
	"year": "\n2015",
	"ranking": "#1380   #1437   #304   #1343   #194   ",
	"reviewcount": "46 Reviews sorted by",
	"description": "The people who stayed at school after class are summoned to another world. They were asked to defeat the demon king at the royal palace. The People, who were summoned, were to receive one blessing per person, but the protagonist and another girl did not.\n\nThe eyes from people around them become cold and the two of them were driven out by the soldiers and decided to leave the capital and travel. They were rewarded with skills and status more than what the soldiers snatched away.>"
}