{
	"url": "https://www.novelupdates.com/series/senior-green-tea-turned-into-an-abused-heroine/",
	"title": "Senior Green Tea Turned Into an Abused Heroine - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/05/Senior-Green-Tea-Turned-Into-an-Abused-Heroine.jpg",
	"noveltype": "(CN)",
	"genre": "Adventure   Josei   Romance   Xianxia   ",
	"tags": "Acting   Aggressive Characters   Ancient Times   Antihero Protagonist   Beast Companions   Beautiful Female Lead   Calm Protagonist   Character Growth   Clever Protagonist   Cold Love Interests   Comedic Undertone   Cultivation   Cunning Protagonist   Demons   Determined Protagonist   Evil Protagonist   Fantasy Creatures   Female Protagonist   Gods   Handsome Male Lead   Hard-Working Protagonist   Harem-seeking Protagonist   Hiding True Abilities   Hiding True Identity   Immortals   Jealousy   Love Interest Falls in Love First   Manipulative Characters   Money Grubber   Multiple Reincarnated Individuals   Older Love Interests   Playful Protagonist   Possessive Characters   Proactive Protagonist   Secretive Protagonist   Seduction   Shameless Protagonist   Strong Love Interests   System Administrator   Transmigration   Underestimated Protagonist   ",
	"rating": "(4.3 / 5.0, 133 votes)",
	"author": "You Ying   尤听   ",
	"year": "\n2020",
	"ranking": "#4265   #4153   #3744   #1943   #3935   ",
	"reviewcount": "34 Reviews sorted by",
	"description": "Lin Xiaocha is a veteran green tea full of lovable skills: pretending to be cute and innocent, tearing opponents, and raising a lot of fish in her green tea fish pond.\n\nShe was selected by the system to fulfill the wish of the heroine of an abusive novel, to target the hero and the supporting male characters obsessed with the white lotus, in order to receive huge rewards.\n\nWhen she found that getting rich is so simple, and when the task is about to be accomplished…\n\nShe realized that she had…\n\nTargeted! the wrong! person!\n\n…\n\nLin Xiaocha: Don’t panic, I’ll do it again. It is not a big deal.\n\nUntil—\n\nLin Xiaocha: Xianjun, why did you lock up Xiaocha?!\n\nThe cold and pure full-level boss: “Didn’t you say that you want to join hands with me until we are white-headed, inseparable in life and death?”\n\nHe kissed Lin Xiaocha’s earlobe. “This lord is very sure.”\n\nNote:\n\n1. Green Tea (or Green Tea B*tch) in the title is internet slang for a girl who seems innocent and charming but is actually calculating and manipulative.\n\n2. A lot of fish raised in a fish pond is another internet slang meaning a large number of spare tires or suitors under her own control.>"
}