{
	"url": "https://www.novelupdates.com/series/loving-you-is-too-difficult/",
	"title": "Loving You Is Too Difficult - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/10/242437188-176-k190478.jpg",
	"noveltype": "(CN)",
	"genre": "Drama   Josei   Mature   Romance   ",
	"tags": "Beautiful Female Lead   Bodyguards   Clingy Lover   Female Protagonist   Handsome Male Lead   Modern Day   Past Trauma   Second Chance   Tragic Past   ",
	"rating": "(4.1 / 5.0, 145 votes)",
	"author": "Sugar   舒格   ",
	"year": "\n2007",
	"ranking": "#2000   #2000   #3574   #5342   #3926   ",
	"reviewcount": "36 Reviews sorted by",
	"description": "An arrogant personality with no brains whatsoever, she was the typical spoilt, rich child. He was the only one who could handle being her bodyguard. But how did this man manage her ? Did he use extreme and effective tyranny to counter her temper tantrums? He was so cold that even a polar bear would tremble. She didn’t have the courage to go against him. But this delicate lady stuck to him like super glue! Like a stalker, she followed him everywhere. This led to gossips flying everywhere. The most outrageous one was that he had abandoned his girlfriend to embark on a relationship with this rich girl!\n\nBut he didn't care what people thought about him. He didn't care if they criticised or made fun of him. Even if he was being ridiculed as a dedicated watchdog, it didn’t matter to him. He had no qualms being in the same room with this spoilt child. But sometimes it only took a spark to light a gigantic inferno….\n\nThis is a short story about a rich spoilt girl, Song Yu Shang and bodyguard Xiang Yu. The story starts when Xiang Yu is assigned to guard a 17 year old Song Yu Shan, a girl he detests as being a brainless bimbo only interested in the latest bags and fashion articles. So when Song Yu Shan shows an interest in him, she is ruthlessly and immediately rejected. Xiang Yu moves on .. but a few years later he is drawn back to Taiwan. But the Song Yu Shan he meets is not the same girl he knew.>"
}