{
	"url": "https://www.novelupdates.com/series/the-demon-king-took-off-his-little-horns/",
	"title": "The Demon King Took Off His Little Horns - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/07/The-Demon-King-Took-Off-His-Little-Horns.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Comedy   Fantasy   Mystery   Romance   Shounen Ai   ",
	"tags": "Angels   Animal Characteristics   Apathetic Protagonist   Appearance Different from Actual Age   Demon Lord   Demons   Devoted Love Interests   Earth Invasion   Fallen Angels   Heaven   Hell   Heroes   Hiding True Identity   Investigations   Love Interest Falls in Love First   Loyal Subordinates   Misunderstandings   Modern Day   Multiple Identities   Multiple Realms   Quirky Characters   ",
	"rating": "(4.7 / 5.0, 17 votes)",
	"author": "Yu Meng   羽萌   ",
	"year": "\n2022",
	"ranking": "#3017   #2829   #9192   #7585   #9311   ",
	"reviewcount": "2 Reviews sorted by",
	"description": "300 years after becoming a Demon King, the war angel Ansel faced a serious problem during a certain expedition.\n\n——His halo grew out once again.\n\nAnsel picked an auspicious place that was definitely and absolutely unmanned, and while cursing, he simply and skillfully broke off the newly emerged angelic aperture.\n\nThis thing was growing out faster and faster!\n\nWhen will his undercover mission end already?!\n\nThe demon realm was divided and ruled by three kings. Demon King Saros was forced to go on an expedition with his sworn enemy, Ansel.\n\nOne day, he noticed Ansel sneaking away from everyone.\n\nSaros decisively followed him, and was shocked to find that his sworn enemy, another demon king of the demon realm, took off a horn headband and fake bat wings. As Ansel cursed up and down, Saros watched as he skillfully removed a cute halo from his head.\n\nThis irritable, easily angered guy who loves fighting; the type that was cute when he shuts up but could make even demons angered to the point of ascending to heaven the moment he opens his mouth… \n\n..was actually an angel???>"
}