{
	"url": "https://www.novelupdates.com/series/the-champion-of-the-big-exam-draw-the-protagonists-halo-at-the-beginning/",
	"title": "The Champion of the Big Exam: Draw the Protagonist’s Halo at the Beginning - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/02/The-Champion-of-the-Big-Exam-Draw-the-Protagonists-Halo-at-the-Beginning.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Fantasy   Harem   Martial Arts   Romance   ",
	"tags": "Accelerated Growth   Early Romance   Male Protagonist   Shameless Protagonist   System Administrator   Weak to Strong   ",
	"rating": "(3.1 / 5.0, 9 votes)",
	"author": "欲买桂花同载酒   ",
	"year": "\nN/A",
	"ranking": "#2000   #2000   #11263   #7856   #12853   ",
	"reviewcount": "No Reviews",
	"description": "On the eve of the college entrance examination, Qin Feng accidentally obtained the [Protagonist Halo System].\n\nAs long as he performs system tasks, he can infinitely extract protagonist halos with different attributes.\n\nScholar halo: IQ against the sky, the number one student in the college entrance examination is scheduled!\n\nKung Fu Halo: Skeleton surprise, martial arts prodigy, proficient in martial arts!\n\nBoyfriend Power Halo: In front of your girlfriend, never get shriveled!\n\nThe halo of the genius doctor: the silver needle crosses people, and the medical skills are unparalleled!\n\nSoldier King Halo: The combat power is on the table, and there are 100,000 soldiers behind him!\n\nThe halo of overbearing president : worth trillions, and there are mines at home!\n\nThe halo of Critical Strike: One punch to fly the international killer, slaughter the Immortal Venerable and the Demon Emperor!\n\nHalo of Immortality: Immortal,Immortal!\n\nInvincible Halo: You’re invincible, you can do whatever you want!\n\n…\n\nAfter Qin Feng extracted thousands of protagonist’s halos, he found that he had become an invincible existence, and he also dominated countless parallel worlds, and deeply realized how lonely it is to be invincible as the protagonist.>"
}