{
	"url": "https://www.novelupdates.com/series/the-forsaken-hero/",
	"title": "The Forsaken Hero - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2017/12/TL_cover.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Comedy   Ecchi   Fantasy   Harem   Mature   Psychological   Romance   Seinen   ",
	"tags": "Adventurers   Antihero Protagonist   Appearance Changes   Beautiful Female Lead   Betrayal   Bullying   Charming Protagonist   Clingy Lover   Conditional Power   Cunning Protagonist   Dark   Death   Death of Loved Ones   Demon Lord   Demons   Dungeons   Enemies Become Lovers   Evil Gods   Fantasy World   Fat to Fit   Former Hero   Game Elements   Goddesses   Gods   Handsome Male Lead   Heroes   Hidden Abilities   Hiding True Identity   Immortals   Knights   Level System   Love Interest Falls in Love First   Male Protagonist   Monsters   Multiple Transported Individuals   Near-Death Experience   Obsessive Love   Overpowered Protagonist   Past Plays a Big Role   Personality Changes   Polygamy   R-15   Revenge   Ruthless Protagonist   S*ave Harem   S*aves   Special Abilities   Strong Love Interests   Strong to Stronger   Sudden Strength Gain   Summoned Hero   Summoning Magic   Sword And Magic   Transported to Another World   Ugly to Beautiful   Weak to Strong   Yandere   ",
	"rating": "(3.7 / 5.0, 143 votes)",
	"author": "Yujima Ran   ",
	"year": "\n2017",
	"ranking": "#2000   #4760   #1899   #2590   #1315   ",
	"reviewcount": "9 Reviews sorted by",
	"description": "Katsuragi Daichi, a youth that had suffered through gruesome bullying, suddenly teleported into another world together with his classmates.\n\nDaichi did his best in trying to be a hero, but as he was useless even after reincarnating, he was abandoned in a Monster House to be a scapegoat.\n\nDaichi should have died.\n\nHowever, he rose, somehow unharmed.\n\nThe ability he gained was [Revenge of the Grudgebearer]. It was a unique ability, one that would revive him each and every time he died and bring him an extreme level of growth!\n\nThe strongest ability in his grasp, Daichi set out to take his revenge…>"
}