{
	"url": "https://www.novelupdates.com/series/after-marrying-the-evil-god/",
	"title": "After Marrying the Evil God - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/04/After-Marrying-an-Evil-God.jpeg",
	"noveltype": "(CN)",
	"genre": "Comedy   Fantasy   Romance   Slice of Life   Supernatural   Yaoi   ",
	"tags": "Amnesia   Appearance Different from Actual Age   Childhood Friends   Childhood Love   Cute Protagonist   Doting Love Interests   Evil Gods   First-time Interc**rse   God Protagonist   Gods   Handsome Male Lead   Hard-Working Protagonist   Love at First Sight   Love Interest Falls in Love First   Male Yandere   Marriage   Modern Day   Multiple POV   Near-Death Experience   Non-humanoid Protagonist   Overpowered Protagonist   Past Plays a Big Role   Possessive Characters   Power Couple   Protagonist Strong from the Start   Saving the World   Second Chance   Strong Love Interests   Time Travel   Transmigration   World Travel   Yandere   ",
	"rating": "(4.6 / 5.0, 134 votes)",
	"author": "Fu Bai Qu   浮白曲   ",
	"year": "\n2020",
	"ranking": "#3923   #4873   #3209   #2185   #1883   ",
	"reviewcount": "23 Reviews sorted by",
	"description": "Qi Baicha was the last god in the world. He lived until the modern age, where he found an ordinary person to fall in love with and marry because life was too boring.\r\n\r\nThen he really fell in love with him. Every day, he worried about what he would do when his partner got old and died. It turned out that his partner was also a god, and he worried about the same thing every day.\r\n\r\nAfter Qi Baicha mentally prepared himself, he decided to tell his lover the fact that he was a god: “My dear, I want to tell you something.”\r\n\r\nFu Mingye said nervously, “My dear, I also have something to tell you. Actually, I am not a mortal, I am an evil god. Don’t be scared when you hear the word ‘evil’. Those self-proclaimed righteous gods are a group of sanctimonious things… Right, what did you want to say?”\r\n\r\nQi Baicha: “Actually, I am not a mortal either.”\r\n\r\nFu Mingye: “… What are you?”\r\n\r\nQi Baicha: “A sanctimonious thing.”\r\n\r\nThe evil god, who listened to every person’s hatred, curses, greed, and arrogance, fell in love with the world’s most gentle and clean snow.\r\n\r\n“I will love you against my divinity.”\r\n\r\nCold and gentle snow god shou x domineering when outside, controlled by his wife when inside gong>"
}