{
	"url": "https://www.novelupdates.com/series/fields-of-gold/",
	"title": "Fields of Gold - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/06/D7809d-UYAAL-vS.png",
	"noveltype": "(CN)",
	"genre": "Drama   Fantasy   Josei   Romance   Slice of Life   Supernatural   ",
	"tags": "Abusive Characters   Alternate World   Ancient China   Bickering Couple   Charming Protagonist   Cheats   Child Protagonist   Clever Protagonist   Cold Love Interests   Coming of Age   Cooking   Court Official   Cute Children   Doting Love Interests   Doting Older Siblings   Doting Parents   Familial Love   Family   Farming   Female Protagonist   Handsome Male Lead   Hard-Working Protagonist   Kingdom Building   Love Interest Falls in Love First   Male Yandere   Modern Knowledge   Money Grubber   Multiple Transported Individuals   Older Love Interests   Overprotective Siblings   Persistent Love Interests   Poor to Rich   Romantic Subplot   Royalty   Slow Romance   Transmigration   ",
	"rating": "(3.9 / 5.0, 332 votes)",
	"author": "Tranquil Fine Rain   姽婳晴雨   ",
	"year": "\n2016",
	"ranking": "#2836   #4772   #198   #328   #899   ",
	"reviewcount": "105 Reviews sorted by",
	"description": "She transmigrated into the body of a little girl from a fishing village! Her father is honest and foolishly filial, while her mother is weak and ill. Moreover, her siblings are still young children. \n\nHer father was the best fisher in the village and breadwinner of the entire family. However, when he got injured and was on the verge of death, her cruel grandparents and uncle kicked her whole family out. They were hungry and cold with nothing but an empty house…\n\nBut that’s ok! She has a multicolored stone that can accelerate the growth of crops. She was also an expert at preparing braised meat in her previous life. \n\nJust watch as she, an eight year-old girl, challenges the taste buds of people who lived during ancient times. With improved high-yielding crops, she’s going to become the most famous farming expert in the world!>"
}