{
	"url": "https://www.novelupdates.com/series/i-really-am-not-the-lord-of-demon/",
	"title": "I Really Am Not The Lord of Demon - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/05/I-Really-Am-Not-The-Lord-of-Demon.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Fantasy   Harem   Mystery   Sci-fi   Slice of Life   Supernatural   Xuanhuan   ",
	"tags": "Alternate World   Demon Lord   Demons   Futuristic Setting   Game Elements   Ghosts   God Protagonist   Goddesses   Godly Powers   Gods   Interdimensional Travel   Male Protagonist   Misunderstandings   Modern Day   Multiple POV   Multiple Realms   Naive Protagonist   Nationalism   Nightmares   Overpowered Protagonist   Parallel Worlds   Parody   Pets   Protagonist Strong from the Start   Protagonist with Multiple Bodies   Racism   Shameless Protagonist   Soul Power   Souls   Store Owner   Survival Game   ",
	"rating": "(3.3 / 5.0, 99 votes)",
	"author": "Blind Leek   要离刺荆轲   ",
	"year": "\nN/A",
	"ranking": "#6970   #2000   #4265   #6619   #5397   ",
	"reviewcount": "28 Reviews sorted by",
	"description": "As the owner of an ordinary bookstore, Ling PingAn’s biggest wish was to muddle through life and do absolutely nothing. \n\nHowever, customers that were right in the middle of their pubescent crisis kept visiting his store in the dead of night. \n\nFor the sake of his business, Ling PingAn had to mimic their childish tones, sparing no effort to promote the books in his store. \n\nWhen he finally managed to sell his books after going through a great verbal tug-o-war, each and every one of them said that they don’t have money and that they wish to use various tools that were seemingly divine artifacts as pledge. \n\nLooking at these customers, Ling PingAn could only agree to them resignedly. \n\nBut little did he know that every single book that these customers purchased from him had altered in appearance. \n\n“Secrets of Cosplay” became “Lower Abyss Research Report” \n\n“Stellaris: Settings for Synth Ascension” was in fact “Gospel for Synthetic Beings” \n\nWhat’s more, in the eyes of these customers, he was actually a horrifying ruler of Diablos, an indefinable entity that held the reins of all realms. \n\nIn this regard, Ling PingAn said, “I’m not, I didn’t, don’t talk nonsense.>"
}