{
	"url": "https://www.novelupdates.com/series/bungaku-shoujo/",
	"title": "Bungaku Shoujo - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2015/08/bungakushoujo1.png",
	"noveltype": "(JP)",
	"genre": "Drama   Mystery   Psychological   Romance   School Life   Shounen   ",
	"tags": "Adapted to Anime   Adapted to Manga   Adapted to Movie   Award-winning Work   Bookworm   Clever Protagonist   Female Protagonist   Senpai-Kouhai Relationship   Writers   ",
	"rating": "(3.8 / 5.0, 51 votes)",
	"author": "Mizuki Nomura   野村美月   ",
	"year": "\n2006\r\n",
	"ranking": "#2000   #2000   #10031   #13807   #7839   ",
	"reviewcount": "No Reviews",
	"description": "For Tohko Amano, a third-year high-school student and self-styled “book girl,” being the head of the literary club is more than just an extracurricular activity. It’s her bread and butter…literally! Tohko is actually a literature-gobbling demon, who can be found at all hours of the day munching on torn out pages from all kinds of books. But for Tohko, the real delicacies are hand-written stories. To satisfy her gourmet tastes, she’s employed (rather, browbeaten) one Konoha Inoue, who scribbles away each day after school to satisfy Tohko’s appetite. But when another student comes knocking on the literary club door for advice on writing love letters, will Tohko discover a new kind of delicacy?\r\n\r\nBungaku Shoujo won Kadokawa Shoten’s 2007 light novel award for light novels under the mystery category.\r\n\r\nPlaced 7th (2007) and 3rd (2008) on “このライトノベルがすごい!” (This Light Novel is Amazing!) without an anime nor manga associate.\r\n\r\nNovels:\r\n\r\n– Main story:\r\n\r\n1. Book Girl and the Suicidal Mime\r\n\r\n2. Book Girl and the Famished Spirit\r\n\r\n3. Book Girl and the Captive Fool\r\n\r\n4. Book Girl and the Corrupted Angel\r\n\r\n5. Book Girl and the Wayfarer’s Lamentation\r\n\r\n6. Book Girl and the Undine Who Bore a Moonflower\r\n\r\n7-8 Book Girl and the Scribe Who Faced God\r\n\r\n– Short stories:\r\n\r\n1-4. Bungaku Shoujo to Koisuru Souwashuu (Episode)\r\n\r\n– Gaiden:\r\n\r\n1. Bungaku Shoujo Minarai no, Hatsukoi\r\n\r\n2. Bungaku Shoujo Minarai no, Shoushin\r\n\r\n3. Bungaku Shoujo Minarai no, Sotsugyou\r\n\r\n– Last Volume:\r\n\r\nHanjuku Sakka to Bungaku Shoujo na Henshuusha (Muse)>"
}