{
	"url": "https://www.novelupdates.com/series/the-imperial-princess-accidentally-seduced-her-husband/",
	"title": "The Imperial Princess Accidentally Seduced Her Husband - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2015/10/the-imperial-princess-accidentally-seduced-her-husband1.jpg",
	"noveltype": "(CN)",
	"genre": "Adult   Drama   Harem   Historical   Josei   Mature   Tragedy   ",
	"tags": "Ancient China   Female Protagonist   Forced Marriage   Pregnancy   R*pe Victim Becomes Lover   R*pe   Short Story   ",
	"rating": "(2.0 / 5.0, 200 votes)",
	"author": "Mo Chen   ",
	"year": "\nN/A",
	"ranking": "#2000   #2000   #3850   #13807   #4813   ",
	"reviewcount": "34 Reviews sorted by",
	"description": "Ah……..she was married to a Marquis, yet he only had intent to treat her as a concubine not as his first wife, a princess (princess refers to a person’s first wife, it is a position of power among the wives and in the household). Now she overheard that he only married her for appearances sake?\r\n\r\nIt was just great! Not only was she forced to marry, she also lost her freedom. Since her husband was also unwilling to marry, they might as well not bother with each other…….\r\n\r\nHis newly wedded wife was so very strange!\r\n\r\nA night before the wedding he caught her peeking shamelessly. She also demanded that the favor he owed her for having saved his life, two years prior in the desert was to not touch her?\r\n\r\nUsually a wife would be sharing a husband with three or four other women. Thus they would be full of worry and trepidation, serving their husband to the best of their ability attempting to become the favourite and obtain the valued Princess position. Yet she actually tried to distance herself from him as much as possible. How was this a relationship?\r\n\r\nThough it did not matter to him, for he long had the intention to separate himself from her, he was only marrying her because of the Imperial Edict after all. If he didn’t seize this golden opportunity then he was too dumb to deserve it.\r\n\r\nLet her regret it!\r\n\r\nShe was very proficient in the art of Qi Huang. Even though this princess’ beauty wasn’t too outstanding, it wasn’t bad and her temperament was unquestionable. This Prime Minister’s Daughter even had a touch of feminine charisma. Her varying facial features made him forget about the other beautiful concubine completely and made him want to……..only care for her!?\r\n\r\nAlthough he swore to the moon that he would not touch her, however tonight the night sky was cloudy………>"
}