{
	"url": "https://www.novelupdates.com/series/ill-be-the-male-leads-sister-in-law/",
	"title": "I’ll Be the Male Leads Sister-in-Law - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/12/Ill-Be-the-Male-Leads-SisterinLaw.png",
	"noveltype": "(CN)",
	"genre": "Drama   Fantasy   Martial Arts   Romance   ",
	"tags": "Ancient China   Arranged Marriage   Beautiful Female Lead   Bickering Couple   Broken Engagement   Caring Protagonist   Devoted Love Interests   Disabilities   Doting Love Interests   Female Protagonist   Handsome Male Lead   Older Love Interests   Persistent Love Interests   Poisons   Power Couple   Pregnancy   Rebellion   Reincarnation   Revenge   Schemes And Conspiracies   Second Chance   Shameless Protagonist   Sharp-tongued Characters   Sickly Characters   Slow Romance   Strong Love Interests   ",
	"rating": "(4.3 / 5.0, 193 votes)",
	"author": "September Flowing Fire   九月流火   ",
	"year": "\n2020",
	"ranking": "#189   #235   #763   #202   #917   ",
	"reviewcount": "45 Reviews sorted by",
	"description": "Today, I am a substitute for your fiancee. Tomorrow, I’ll become your sister-in-law!\n\nMu Mingtang is the substitute of the male lead’s first love. After she lost her family, she was adopted by the Jiang family and eventually became engaged to the male lead, the Prince of Jin.\n\nUnderstanding very well that she was only a substitute, she removed her claws and fangs and turned herself into an imitation of the Prince of Jin’s first love. She couldn’t speak or laugh as she wished, she was prepared to live in the shadow of another woman for her entire life… until one day, the real Miss Jiang returned.\n\nThe real Miss Jiang was reborn. When she learned that she was the male lead’s first love, she immediately returned to fight for her engagement and identity. \n\nIn order to please his first love, the Prince of Jin gave the substitute to the Prince of Qiyang, who had become a dying madman. She was just a low-quality fake, anyway. If she dared to anger his first love, he would turn her into a childless and powerless widow for the rest of her life.\n\nMu Mingtang, the target of their mockery, finally snapped: Okay, since you gave me to another man, I’ll make you bow and call me sister-in-law!\n\nHowever, none of them expected the Prince of Qiyang, the God of War, to actually wake up!\n\n—\n\nXie Xuanchen is the son of the late emperor. The whole world once trembled beneath his feet, but one day, for a reason unknown to even Xie Xuanchen himself, his nature suddenly changed. He became cruel and bloodthirsty, leaving his father with no choice but to pass the throne to his uncle.\n\nEventually, Xie Xuanchen was unable to resist the illness and fell into a coma. \n\nWhen he woke up again, there was a beauty standing before his bed, looking at him in surprise. Then, for the sake of his domineering little princess, he revived his name as the God of War, reclaimed the throne, and united the world.\n\nI once captured the world to satisfy my own ambition. Now, you are the reason for my ambition.>"
}