{
	"url": "https://www.novelupdates.com/series/golden-boy/",
	"title": "Golden Boy - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/09/Golden-Boy.jpeg",
	"noveltype": "(CN)",
	"genre": "Mature   Romance   Yaoi   ",
	"tags": "Childcare   Family Conflict   Handsome Male Lead   Love Interest Falls in Love First   Misunderstandings   Modern Day   Past Trauma   Poor Protagonist   Showbiz   Slow Romance   Straight Uke   Writers   ",
	"rating": "(4.3 / 5.0, 15 votes)",
	"author": "Cui Luo Shi   崔罗什   ",
	"year": "\n2019",
	"ranking": "#2000   #2000   #11018   #11528   #10663   ",
	"reviewcount": "No Reviews",
	"description": "He then takes a cigarette out of its carton and lights it. He’s been trying to quit smoking for a few years, but writing this script was ruining his efforts. He slowly enjoyed breathing in the tar and nicotine, and took advantage of this break to check the unread messages on his phone. \r\n　　\r\n　　Some ads. \r\n　　Several notices of loan repayment deadlines. \r\n　　Su Pei quickly moved past those, not daring to take a closer look. \r\n\r\n　While browsing toys for his little girl, a chat message jumped out: \r\n　　‘Are you in L city? I heard that He Yiming is going to be in L City for a couple of days. Do you want to meet up with him for a meal?’ \r\n　　\r\n　　Su Pei held the cigarette in one hand and pursed his lips. The news was sent to him by his old college classmate and friend Yao Zhicheng. \r\n　　\r\n　　He Yiming is coming to L city. \r\n\r\n　　Su Pei stared at the message. Seeing He Yiming’s name now, he begins to feel detached. It’s almost surreal. \r\n\r\n      Being friends with someone for many years makes it feel like you’re an old married couple. Su Pei hasn’t seen He Yiming since they had a falling out years ago. Their friendship stagnated and drifted apart. Now He Yiming is going to be in L City while Su Pei is working as a script writer for a T.V. Drama. What are the odds?! What happens when they meet up again for the first time in years ?\r\n\r\n    This is the story of two friends who finally get together after ten years of friendship. Dealing with issues on being deep in the closet, homophobia, and the exploration of sexuality.>"
}