{
	"url": "https://www.novelupdates.com/series/i-married-a-disabled-tyrant-after-transmigrating/",
	"title": "I Married a Disabled Tyrant After Transmigrating - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/06/I-Married-a-Disabled-Tyrant-After-Transmigrating.jpg",
	"noveltype": "(CN)",
	"genre": "Drama   Fantasy   Romance   Slice of Life   ",
	"tags": "Alchemy   Ancient Times   Clumsy Love Interests   Cold Love Interests   Cultivation   Curses   Cute Story   Doting Love Interests   Dragons   Dwarfs   Elves   Farming   Fated Lovers   Female Protagonist   Hard-Working Protagonist   Heartwarming   Inferiority Complex   Love Interest Falls in Love First   Male Yandere   Obsessive Love   Older Love Interests   Pill Concocting   Poor Protagonist   Possessive Characters   Sickly Characters   Strong Love Interests   Tragic Past   Transmigration   Tsundere   Weak to Strong   ",
	"rating": "(4.5 / 5.0, 143 votes)",
	"author": "Mu Mu Liang Chen   沐沐良辰   ",
	"year": "\n2019",
	"ranking": "#274   #265   #1838   #376   #1760   ",
	"reviewcount": "26 Reviews sorted by",
	"description": "Mu Wanwan transmigrated into a novel.\n\nAnd became a cannon fodder side character used to counteract the disabled tyrant’s ill fortune.\n\nThe tyrant is a huge villain. He challenged the leader of the seven tribes alone and had been beaten into a vegetative state.\n\nThe original character lived in the tyrant’s territory. Her parents, who were greedy for power, randomly made came up with compatible bazi* and sent their daughter into the tyrant’s manor, turning her into a wife to ward off ill luck.\n\nAlso sent off together with her was a little white flower maidservant, who was the heroine of the story.\n\nThe original character and the heroine agreed to escape together—but the original character was stabbed to death that very night.\n\nAnd just as they were about to implement their escape plan, she transmigrated over\n\nMu Wanwan: “…”\n\nWhat a horrible script!!\n\nIn order to live, she had to do her best to take care of the disabled, comatose dragon. Three years later, she actually turned the tragic story into a sickeningly sweet love story.\n\nNote: *bazi: A Chinese astrological concept that a person’s destiny or fate can be divined by the two sexagenary cycle characters assigned to their birth year, month, day, and hour.>"
}