{
	"url": "https://www.novelupdates.com/series/what-to-do-when-the-campus-idol-is-too-overbearing/",
	"title": "What to Do When the Campus Idol Is Too Overbearing - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/02/what-to-do-when-the-campus-idol-is-too-overbearing.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Romance   School Life   Yaoi   ",
	"tags": "Businessmen   Calm Protagonist   Clever Protagonist   Clingy Lover   Cunning Protagonist   Hiding True Abilities   Hiding True Identity   Misunderstandings   Proactive Protagonist   Protagonist Strong from the Start   Quirky Characters   Schemes And Conspiracies   Tsundere   ",
	"rating": "(4.3 / 5.0, 29 votes)",
	"author": "漆环念   ",
	"year": "\n2019",
	"ranking": "#6970   #6277   #7329   #9324   #6105   ",
	"reviewcount": "6 Reviews sorted by",
	"description": "Lu Rong, the school bully, kept a low-profile as he made his fortune in silence. Using his diligence and intelligence, he successfully turned his school’s dark forces into a money-making machine. He was then known as the leading business figure at Southside High.\r\n\r\nOne day, a rich campus idol, Ji Wenfeng, appeared in the school out of nowhere. His excellent appearance and ridiculous monetary power stirred up commotion throughout the student body.\r\n\r\nLu Rong exclaimed, “Is he extraordinary just because he’s a rich-second-generation?!”\r\n\r\nThen he went home and discovered that his aunt married Ji Wenfeng’s dad; he’s now living at the Ji family until he’s of age. He’s going to eat Ji Wenfeng’s food, ride Ji Wenfeng’s car, stay in Ji Wenfeng’s house…\r\n\r\nJi Wenfeng: “Are rich-second-generations extraordinary?”\r\n\r\nLu Rong: “Yes, incredibly extraordinary.”\r\n\r\nJi Wenfeng: “You’re just a little brother (note, slang for someone weak/of lower status).”\r\n\r\nLu Rong: “Hello, Gege.”\r\n\r\nJi Wenfeng: “In this house, you have to listen to me. Starting for now, you are my little s*ave.”\r\n\r\nLu Rong nodded obediently, appearing like a coward. “Understood, I’ll go wash your clothes then.”\r\n\r\nAnd immediately turned around, mercilessly packing up Ji Wenfeng’s entire closet: “Official Campus Idol’s real branded jacket! Starting bid at ￥3500! Come take a look! Don’t miss the deal!”>"
}