{
	"url": "https://www.novelupdates.com/series/i-become-a-staff-officer-in-the-demon-army-but-i-can-only-do-office-work/",
	"title": "I Become a Staff Officer in the Demon Army, but I Can Only Do Office Work! - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/02/Demon-Army-Staff-Officer.jpg",
	"noveltype": "(JP)",
	"genre": "Fantasy   ",
	"tags": "Army   Demon Lord   Male Protagonist   Management   Military   Transported to Another World   Wars   ",
	"rating": "(3.7 / 5.0, 48 votes)",
	"author": "Waruichi   悪一   ",
	"year": "\n2016",
	"ranking": "#2000   #2000   #4197   #4317   #4437   ",
	"reviewcount": "2 Reviews sorted by",
	"description": "The demon army who faced the never-ending war against the humans is in great crisis. Iron dragon dominated the sky, and Iron Horses dominated the ground, and steel rain that comes strikingly from beyond the horizon.\r\n\r\nFacing such incredible mechanical weapons used by humans, the demon army then tried to summon a savior from another world, to reverse this situation.\r\n\r\nJust like that, the demon army is saved— (Or so the story should go but)…\r\n\r\n“Emm, I can only do office work though?”\r\n\r\n“Wait…”\r\n\r\nAkitsu Akira who was living in modern Japan was hit by a Truck, and flew high…\r\n\r\nWhen he realized he was being blown off to another world, he was asked to do an impossible work such as, “Please Save the Demon army!”\r\n\r\nIn response, he screamed, “There’s no way I can do that can I?”, with an unreasonable reason such as being, “wasteful to not use him”, he was placed in the office of the demon army, as an officer.\r\n\r\nSince he could not go back home, he thought of doing military service in the supply department within the demon army, but…\r\n\r\n“What is Logistics​?”\r\n\r\n“Huh?”\r\n\r\nThis is a story about the demon army that changes just by using paper, pen, and ink…\r\n\r\n“For now please sign here…”\r\n\r\n“I cannot read or write…”\r\n\r\n“Eh—-…”\r\n\r\nOr so that’s how the story supposedly goes…>"
}