{
	"url": "https://www.novelupdates.com/series/the-film-emperor-asks-for-divorce-every-day/",
	"title": "The Film Emperor Asks for Divorce Every Day - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/06/20200420154711.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Romance   Yaoi   ",
	"tags": "Acting   Bisexual Protagonist   Calm Protagonist   Caring Protagonist   Celebrities   Character Growth   Charismatic Protagonist   Clever Protagonist   Confident Protagonist   Cute Children   Doting Love Interests   Family   First Love   Handsome Male Lead   Honest Protagonist   Love Interest Falls in Love First   Marriage   Modern Day   Mpreg   Narcissistic Protagonist   Power Couple   Previous Life Talent   Proactive Protagonist   Protagonist Strong from the Start   Second Chance   Sharp-tongued Characters   Showbiz   Smart Couple   Strong Love Interests   Transmigration   Underestimated Protagonist   Wealthy Characters   ",
	"rating": "(4.4 / 5.0, 167 votes)",
	"author": "Lin Ang Si   林盎司   ",
	"year": "\n2020",
	"ranking": "#3633   #3237   #1711   #3563   #1049   ",
	"reviewcount": "51 Reviews",
	"description": "Film Emperor Ling Qing transmigrated and found himself on the receiving end of old dog blood scum abuse and must separate himself from the scum gong Yu Chen before he enters a cycle of pregnancy and miscarriage. \n\nLing Qing decided he must negotiate a divorce agreement. \n\nYu Chen was born a handsome wealthy man with countless men and women, and did not ask for marriage but married Ling Qing, who was useless except for his face. \n\n“True love?” His friends ridiculed. \n\nYu Chen was disgusted, “What a joke. If I touch him then I must be a dog.”\n\nLing Qing was overjoyed. Great, it should be easy to divorce this way.\n\nHowever, one day passed, two days passed, and Yu Chen was always unwilling to divorce. \n\nA few months later, Ling Qing finished filming and returned home to hear, “Why do I think this actor looks at Ling Qing with the wrong eyes? F*ck, he’s not gonna like Ling Qing is he? This frog wants to eat swan meat but he’s not a match!”\n\nFriend: “He’s not worthy, are you worthy?”\n\nYu Chen: “He’s my wife, we are a perfect match!”\n\nLing Qing: ??? That isn’t what you said at first?>"
}