{
	"url": "https://www.novelupdates.com/series/dark-beast-summoner/",
	"title": "Dark Beast Summoner - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/11/Dark-Beast-Summoner.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Romance   Slice of Life   Xuanhuan   ",
	"tags": "Adapted to Manhua   Alchemy   Beast Companions   Beasts   Contracts   Cultivation   Female Protagonist   Monster Tamer   Nobles   Royalty   Summoning Magic   Transmigration   ",
	"rating": "(2.5 / 5.0, 19 votes)",
	"author": "青扇   ",
	"year": "\nN/A",
	"ranking": "#2000   #2000   #5680   #8979   #7752   ",
	"reviewcount": "2 Reviews sorted by",
	"description": "Mu Wushuang, a top secret agent of the twenty-first century with divine medical skills. Bringing people back from the dead with one hand, while killing criminals with the other. If she wanted someone dead at midnight, that person would not live past dawn, winning her the nickname “Lady Hades”. She passed through space and time and was transmigrated into the Hou Manor’s Third Young Miss, an ugly woman known far and wide to be a useless piece of trash.\r\n\r\nWho could have known? When those glacial eyes open, all beasts submit, shaking up Heaven and earth. She’s an one-of-a-kind summoner with heaven defying abilities, and a super prodigy among elixir cultivators. She contracts divine beasts, tramples over evil scums and dregs of society, stopping buddha if she encounters one, killing gods if they hinder her! But who is going to tell her that the Imperial Uncle that she had accidentally become entangled with will be so hard to shake off?\r\n\r\nA certain prince: “The Royal Lady is as beautiful as a goddess. All of you better watch her closely, and anyone who tries to hit on her shall be killed without exception!” “My Lord, are you blind? Don’t you realize that it will be the Lady trying to hit on others instead!” The secret guard cried in silent anguish in his heart, his gaze fixed upon the pudgy and rotund Royal Lady. \r\n\r\n >"
}