{
	"url": "https://www.novelupdates.com/series/nirvana-in-fire-2-the-wind-blows-in-chang-lin/",
	"title": "Nirvana in Fire 2: The Wind Blows in Chang Lin - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/02/Nirvana-in-Fire-The-Wind-Blows-in-Chang-Lin.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Drama   Historical   ",
	"tags": "Adapted to Drama   Male Protagonist   Politics   Revenge   Schemes And Conspiracies   ",
	"rating": "(4.7 / 5.0, 9 votes)",
	"author": "Hai Yan   海宴   ",
	"year": "\n2018",
	"ranking": "#2000   #2000   #12519   #10839   #11742   ",
	"reviewcount": "No Reviews",
	"description": "2 generations after Mei Changsu left for war and Xiao Jingyan became the Emperor of Da Liang……\n\nThe Liang Dynasty was stable, but the border wars were unceasing. The Chang Lin Army guarding the northern border of Da Liang was famous for its repeated military exploits, but because of its great reputation, there were undercurrents of suspicion in the court…\n\nIn a battle in the North, Chang Lin’s heir Xiao Pingzhang faced the dilemma of interrupted military supplies, but continued to defend the city in a bloody battle and was seriously injured. Upon hearing the news, the second son, Xiao Pingjing descended Lang Ya Mountain to visit his brother, and shouldered the responsibility of investigating the case. Step by step, he uncovered an even greater mystery. Before the truth could be uncovered, more perilous situations emerged – plague in the capital, a rebellion in the East China Sea, the assassination of foreign princes, and the involvement of Lang Ya list masters in conspiracies…will these destroy the political stability that Da Liang had enjoyed for decades?\n\nThe son of Chang Lin found his strength in Lang Ya, but because he couldn’t let go of the important responsibility of protecting the country, he had to step onto an iron-paved road. The most dangerous enemy on this road was not from the battlefield, but from the hearts of the people.>"
}