{
	"url": "https://www.novelupdates.com/series/the-hidden-male-lead-in-the-game-is-obsessed-with-me/",
	"title": "The Hidden Male Lead in the Game Is Obsessed With Me - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/03/The-hidden-male-lead-in-the-game-is-obsessed-with-me.jpeg",
	"noveltype": "(KR)",
	"genre": "Fantasy   Romance   Shoujo   ",
	"tags": "Aristocracy   Beautiful Female Lead   European Ambience   Female Protagonist   Handsome Male Lead   Love Interest Falls in Love First   Love Triangles   Male Yandere   Nobles   Obsessive Love   Royalty   Transmigration   Transported into a Game World   Transported to Another World   Yandere   ",
	"rating": "(3.7 / 5.0, 16 votes)",
	"author": "비르다   ",
	"year": "\n2021",
	"ranking": "#6970   #2000   #10360   #10839   #6717   ",
	"reviewcount": "No Reviews",
	"description": "At an unknown time, I was trapped in the game seven times, failing to reach the ending. Frequently initialised by an “unknown bug”, this was my last chance. I will succeed. By any means necessary! As I had not been able to see the ending when I teamed up with Edrich, the “true male lead” of the game, I decided to attack the “hidden male lead” this time, which I had never conquered before. \r\n \r\n“Love me. Sincerely.”\r\n \r\n“Love? You’re smart, aren’t you?”\r\n \r\nThe true identity of the hidden male lord is Johannes, the Grand Duke of Lagos, known as the killing angel of the battlefield.\r\n \r\nWith the help of the system, I offered a contract love affair in exchange for unraveling his curse.\r\n \r\n[System: “Lifesaver” event is underway! Johannes’ likability will increase with a thank you greeting!] \r\n \r\n[System:Currently 2% likeability] \r\n \r\nIf I were about to drown, his likeability would increase by only 1%. Maybe it’s because he’s a hidden male lead, but it’s not easy to increase his likability—. \r\n \r\n“Weirdly, if I see you, I’ll be thrilled.” \r\n \r\nMoreover, my ex-boyfriend Edrich, who is supposed to be initialized and has no previous memories, seems to remember me…?\r\n >"
}