{
	"url": "https://www.novelupdates.com/series/saint-of-the-subspace-onee-sama-you-are-no-longer-needed-said-my-little-sister-as-she-falsely-accused-me-and-sealed-me-up-but-im-back-with-a-mastery-of-space-magic-it-seems-like-twenty-years-ha/",
	"title": "Saint of the Subspace ~[Onee-Sama You Are No Longer Needed] Said My Little Sister as She Falsely Accused Me and Sealed Me up, but I’m Back With a Mastery of Space Magic. It Seems Like Twenty Years Have Passed and My Country Is on the Verge of Destruction, but Now I’m a Traveling Healer~ - Novel Updates",
	"image": "https://www.novelupdates.com/img/noimagefound.jpg",
	"noveltype": "(JP)",
	"genre": "Fantasy   ",
	"tags": "Aristocracy   Betrayal   Female Protagonist   Magic   Multiple POV   Overpowered Protagonist   Revenge   Saints   ",
	"rating": "(3.3 / 5.0, 18 votes)",
	"author": "Ratimu   ラチム   ",
	"year": "\n2021",
	"ranking": "#2000   #2000   #7386   #7471   #7998   ",
	"reviewcount": "1 Review sorted by",
	"description": "A young girl named Soalis was a genius at magic. By the time she was ten years old, she had become one of the top court magicians in the country. Now at the age of sixteen, she iss respected and called a saint by the people.\r\n\r\nWhether it was Demons, Demon Kings, and Evil Gods, she had defeated anything that threatens her country.\r\n\r\nBut one day, she is tricked by her own little sister, who was also a court magician. She was framed for a crime she did not commit, as she was found to have the banned magic potion, Elixir, in her room.\r\n\r\nShe was tricked by her sister, whom she trusted, and without realizing the trap, Soalis was sealed inside the strongest mythical grade magic tool.\r\n\r\nHowever, it only took her 20 years to break the powerful seal that was supposed to last for hundreds of years. In addition, while she was sealed, she had created spatial magic to escape and return to the kingdom.\r\n\r\nWhile in the seal, Soalis had not aged and was still a 16-year-old-girl. In the past twenty years, the kingdom had been invaded by demons and had fallen into a critical situation.\r\n\r\nExpecting to be treated as a criminal, Soalis hid her own identity as a saint and started over.\r\n\r\nThe next thing people knew, the saint had returned. She would return the favor to those who wronged her.\r\n\r\nThe story of the world’s restoration by the strongest saint begins here.>"
}