{
	"url": "https://www.novelupdates.com/series/in-a-different-world-with-a-smartphone/",
	"title": "In a Different World with a Smartphone - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/06/In-a-Different-World-with-a-Smartphone.jpeg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Comedy   Fantasy   Harem   Mecha   Romance   Sci-fi   Shounen   Slice of Life   Supernatural   ",
	"tags": "Adapted to Anime   Adapted to Drama CD   Adapted to Manga   Adventurers   Androids   Aristocracy   Artifact Crafting   Beast Companions   Beastkin   Cheats   Demons   Dense Protagonist   Engagement   Fantasy World   First-time Interc**rse   God Protagonist   Goddesses   Godly Powers   Gods   Guilds   Heartwarming   Interdimensional Travel   Kingdom Building   Late Romance   Loli   Magical Technology   Male Protagonist   Marriage   Master-Servant Relationship   Modern Knowledge   Monsters   Naive Protagonist   Ninjas   Nobles   Older Love Interests   Overpowered Protagonist   Politics   Polygamy   Protagonist Strong from the Start   R-15   Resurrection   Returning from Another World   Revenge   Royalty   Skill Assimilation   Spirits   Strong to Stronger   Sword And Magic   Technological Gap   Time Travel   Transported to Another World   Tsundere   Wars   World Travel   Younger Love Interests   ",
	"rating": "(3.6 / 5.0, 742 votes)",
	"author": "Fuyuhara Patora   ",
	"year": "\n2013\r\n",
	"ranking": "#2686   #3134   #120   #630   #101   ",
	"reviewcount": "91 Reviews sorted by",
	"description": "Mochizuki Touya, a 15-year-old boy, who got zapped by a flash of lightning due to a freak accident caused by God, wakes up and finds himself face-to-face with God.\n\n“I am afraid to say that I have made a blunder…” laments the old coot. In order to smooth over the fault, God says that he can reincarnate Touya into a world of fantasy, and allow Touya to bring the smartphone! Then in a new, anachronistic pseudo-medieval world begins Touya’s adventure.\n\nFriends! Laughs! Tears! Inexplicable Deus ex Machina! Mochizuki Touya sets off on a journey full of wonder as he absentmindedly travels from place to place, following whatever goal catches his fancy. The curtains on an epic tale of swords, sorcery, and smartphone apps lift!>"
}