{
	"url": "https://www.novelupdates.com/series/expelled-sss-rank-architect-rebuilding-the-demon-kings-castle/",
	"title": "Expelled SSS-Rank Architect, Rebuilding the Demon Kings Castle! - Novel Updates",
	"image": "https://www.novelupdates.com/img/noimagefound.jpg",
	"noveltype": "(JP)",
	"genre": "Adventure   Comedy   Fantasy   Harem   ",
	"tags": "Adventurers   Antihero Protagonist   Army Building   Betrayal   Cheats   Demon Lord   Demons   Depictions of Cruelty   Determined Protagonist   Dungeon Master   Dungeons   Engineer   Fantasy World   Former Hero   Friends Become Enemies   Game Elements   Guilds   Hard-Working Protagonist   Kingdom Building   Level System   Loli   Male Protagonist   Management   Overpowered Protagonist   Protagonist Strong from the Start   Special Abilities   Underestimated Protagonist   ",
	"rating": "(3.7 / 5.0, 59 votes)",
	"author": "Izaki Norito   伊崎則人   ",
	"year": "\n2018",
	"ranking": "#2000   #2000   #4720   #3030   #4055   ",
	"reviewcount": "5 Reviews sorted by",
	"description": "Johann Grecia belonged to the hero party as an adventurer with the SSS-rank skill [Architect]. He contributed to the suppression of the demon king in his own unique ways. Such as building a guild in the vicinity of the Demon King’s castle, or building a trap house to destroy many demons.\r\n\r\nHowever, on the very day the heroes brought down the Demon King, he was branded as useless, and pressured by the party to leave. Furthermore, all his qualifications as an adventurer have been revoked, and all the constructions he produced with his skill had been taken.\r\n\r\nJohann who lost everything, does not care about building with his skill anymore, and is currently camping all alone. Around that time, he encountered a little girl who seemed to have the same idea.\r\n\r\n“The Castle of Felukia… It’s completely lost…”\r\n\r\nBut it seemed that this girl, was the Demon King’s daughter! The castle of Felukia used to belong to the demon king, but the heroes invaded it. It seemed likely that this girl had lost all her relatives. And thus Johann made up his determination.\r\n\r\n“Leave it up to me! I, for the sake of Felukia, will build a new Demon King castle!”\r\n\r\n“Eh?!” she said as she almost danced in joy. And so Johann promised to build the most beautiful, highest difficulty, most brutal castle for her. “And if the heroes invade the resurrected Demon King castle again, I will repel them with my [Architect] skill!”>"
}