{
	"url": "https://www.novelupdates.com/series/warrior-im-afraid-theres-something-wrong-with-your-obsession/",
	"title": "Warrior, I’m Afraid There’s Something Wrong With Your Obsession - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/02/Warrior-Im-Afraid-Theres-Something-Wrong-With-Your-Obsession.jpg",
	"noveltype": "(KR)",
	"genre": "Comedy   Drama   Fantasy   Romance   ",
	"tags": "Abandoned Children   Appearance Different from Actual Age   Aristocracy   Beautiful Female Lead   Boss-Subordinate Relationship   Caring Protagonist   Childcare   Clever Protagonist   Conditional Power   Conflicting Loyalties   Cunning Protagonist   Demon Lord   Demons   Different Social Status   Enemies Become Allies   Enemies Become Lovers   European Ambience   Familial Love   Family   Female Protagonist   Hard-Working Protagonist   Heroes   Hidden Abilities   Hiding True Abilities   Hiding True Identity   Kind Love Interests   Knights   Love at First Sight   Love Interest Falls in Love First   Loyal Subordinates   Maids   Mature Protagonist   Obsessive Love   Proactive Protagonist   Reincarnated in a Game World   Royalty   Schemes And Conspiracies   Sealed Power   Secret Identity   Secret Relationship   Strong Love Interests   Transmigration   Villainess Noble Girls   Wealthy Characters   Younger Love Interests   ",
	"rating": "(4.2 / 5.0, 109 votes)",
	"author": "다라빛   ",
	"year": "\n2021",
	"ranking": "#4080   #6323   #2579   #3380   #1963   ",
	"reviewcount": "10 Reviews sorted by",
	"description": "I am inside a common RPG game.\n\nI’ve become the devil who kidnapped a little princess… who is happily eating cake next to me.\n\n“Devil, isn’t the weather nice today?”\n\n“Would you like to go to the village festival with me?”\n\n“I’ll even go and destroy the warrior for you!”\n\n“… Won’t you please be patient?”\n\nI grabbed the princess by the arm with a serious face.\n\nWarrior or whoever, come quickly and take the princess whose head seems to be wrong.\n\n***\n\nThe warrior who came kissed the back of my hand. \n\n“You’re the one who freed this low-grade dog that grew up in a narrow cage.”\n\nHe whispered in my ear with a sad and tickling voice. \n\n“So please don’t abandon me.”\n\nI think there’s also something wrong with the warrior.>"
}