{
	"url": "https://www.novelupdates.com/series/koko-wa-ore-ni-makasete-saki-ni-ike-to-itte-kara-10-nen-ga-tattara-densetsu-ni-natteita/",
	"title": "Koko wa Ore ni Makasete Saki ni Ike to Itte kara 10 Nen ga Tattara Densetsu ni Natteita - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/03/Koko-wa-Ore-ni-Makasete-Saki-ni-Ike-to-Itte-kara-Nen-ga-Tattara-Densetsu-ni-Natteita.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Comedy   Fantasy   Harem   Romance   Shounen   ",
	"tags": "Adapted to Manga   Adventurers   Age Regression   Alchemy   Appearance Different from Actual Age   Beast Companions   Calm Protagonist   Clever Protagonist   Cohabitation   Demon Lord   Demons   Dense Protagonist   Determined Protagonist   Dragons   Evil Gods   Fantasy World   Fast Learner   Former Hero   Game Elements   Godly Powers   Gods   Guilds   Hidden Abilities   Hiding True Identity   Level System   Magic Formations   Male Protagonist   Overpowered Protagonist   Protagonist Strong from the Start   Skill Assimilation   Special Abilities   Strong to Stronger   Sword And Magic   Vampires   World Travel   ",
	"rating": "(3.5 / 5.0, 291 votes)",
	"author": "Ezo Gingitsune   えぞぎんぎつね   ",
	"year": "\n2018",
	"ranking": "#1380   #635   #343   #1527   #453   ",
	"reviewcount": "34 Reviews",
	"description": "The Hero’s party was attacked by a large group of powerful devils. The party will no doubt be annihilated if this were to go on. One member of the party, the strongest mage, Rakku, decided to stop the enemies in their tracks.\n\n「Leave it to me here and go!」\n\n「But……」\n\n「Hey, I’ll catch up immediately, alright?」\n\nRakku mindlessly defeated the enemies, over and over again. Using his special skill, Learning, Rakku learned the devils’ magic. As he studied and utilised the devils’ abilities such as Drain Touch, he continued fighting, without rest nor sleep. The devils got stronger and stronger, but Rakku grew rapidly as well.\n\nRakku battled for 10 years, until no devils came at him. Rakku returned to the capital, and was surprised to discover that his own name had become the currency, and a gigantic statue of him, albeit fairly beautified, was made.\n\nDue to him relentlessly absorbing the vitality of the devils, he had become young again. An appearance unfitting of his age. Godly abilities.\n\n「I stand out too much」\n\nRakku concealed his true identity, and decided to pretend being a novice adventurer by disguising himself as a F-rank warrior despite being an S-rank mage. His adventure in this now peaceful (?) world starts now!>"
}