{
	"url": "https://www.novelupdates.com/series/the-glamorous-daily-life-of-a-fake-mistress/",
	"title": "The Glamorous Daily Life of a Fake Mistress - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/07/The-Glamorous-Daily-Life-of-a-Fake-Mistress_1625423210.jpg",
	"noveltype": "(KR)",
	"genre": "Drama   Fantasy   Josei   Romance   ",
	"tags": "Adultery   Age Regression   Aristocracy   Arranged Marriage   Beautiful Female Lead   Contracts   Female Protagonist   Handsome Male Lead   Love Interest Falls in Love First   Marriage   Marriage of Convenience   Nobles   Second Chance   ",
	"rating": "(3.4 / 5.0, 5 votes)",
	"author": "Kim Poppy   김뽀삐   ",
	"year": "\n2018",
	"ranking": "#2000   #2000   #11819   #9500   #8949   ",
	"reviewcount": "1 Review sorted by",
	"description": "“I will no longer be used by you anymore!” \n\nSally became the mistress of the Duke of Esteban. But to the Duke, she was nothing but a tool. She resented him and painfully ended her life.\n\nBut when she opened her eyes again, she was back as a 16-year-old maid.  And in order to avoid her future meeting with him, Sally decides to live as her shabby maid!\n\nBut this time, Sarah, the young lady Sally is serving, was chosen as Duke Esteban’s mistress! \n\n“I’ll meet the Duke of Esteban instead of you, my lady.” \n\nUnable to push Sarah, who is like a family member, into an unwanted path, Sally accepts the fate of meeting him again. \n\nBut she won’t be as unhappy as she was in the past.\n\nBecause she didn’t love him anymore.\n\nAnd the reason why the Duke, which I learned later, chose a woman of low status as his mistress is…\n\n“The reason I need a fake mistress is to divorce a woman named as my wife.”\n\n“Since it is a fake relationship, we won’t ever sleep together, right?”\n\n“Of course, there will never be anything like that between us. Never.” \n\nBut contrary to his assurance, Duke Esteban gradually falls for Sally. \n\nSally, who became the Duke’s contract (fake) mistress, takes over high society!>"
}