{
	"url": "https://www.novelupdates.com/series/the-glory-after-rebirth/",
	"title": "The Glory After Rebirth - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/09/313652_243.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adult   Fantasy   Historical   Martial Arts   Mature   Yaoi   ",
	"tags": "Adopted Children   Ancient Times   Arranged Marriage   Betrayal   Bloodlines   Calm Protagonist   Childcare   Clever Protagonist   Cultivation   Cute Children   Devoted Love Interests   Doting Love Interests   Empires   Engagement   Familial Love   Family Conflict   Fated Lovers   First Love   First-time Interc**rse   Friendship   Genius Protagonist   Handsome Male Lead   Hard-Working Protagonist   Jealousy   Kingdom Building   Love at First Sight   Love Interest Falls in Love First   Loyal Subordinates   Magic Formations   Marriage   Military   Mysterious Family Background   Older Love Interests   Past Plays a Big Role   Politics   Possessive Characters   Reincarnation   Revenge   Romantic Subplot   Schemes And Conspiracies   Second Chance   Secret Organizations   Strong Love Interests   Tragic Past   Unconditional Love   Unique Cultivation Technique   Wars   ",
	"rating": "(3.9 / 5.0, 134 votes)",
	"author": "Huai Ruo Gu   怀若谷   ",
	"year": "\n2018",
	"ranking": "#3133   #2000   #2328   #1157   #2320   ",
	"reviewcount": "35 Reviews sorted by",
	"description": "A letter to break off the engagement leads Ling Family in Tangyang to endless doom. And he, Ling Zhang, is tortured to death after his legs are cruelly broken.\n\nThis time after rebirth, he swears to restore glory to his family and to seek revenge. The very first he should do is to break the engagement himself!\n\nYuewen Family? Far in the capital enjoying high privilege and glory?\n\nI simply don’t care.\n\nYou think yourself some delicious cake that everyone crazes to grab a bite?\n\nBah! Too hard that it hurts my teeth!\n\nYet never has Ling Zhang expected that this ‘hard cake’ would promise him a life of glory after rebirth.>"
}