{
	"url": "https://www.novelupdates.com/series/dressed-as-the-film-emperors-fiancee/",
	"title": "Dressed as the Film Emperor’s Fiancée - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/04/Dressed-as-the-Film-Emperors-Fiance.jpeg",
	"noveltype": "(CN)",
	"genre": "Drama   Fantasy   Romance   Slice of Life   ",
	"tags": "Acting   Contracts   Female Protagonist   Handsome Male Lead   Modern Day   Popular Love Interests   Showbiz   Transmigration   ",
	"rating": "(3.8 / 5.0, 30 votes)",
	"author": "Sui Zhan   冰糖不是雪梨   ",
	"year": "\n2020",
	"ranking": "#2000   #3804   #8148   #9324   #8598   ",
	"reviewcount": "3 Reviews sorted by",
	"description": "Yu Mian was an orphan since childhood. Fortunately, there are still some good people who give her subsidies, and the kind man is a Little star.\r\n\r\n With gratitude, she became the first fan of the little star, gave him a message of encouragement, helped him get in the rankings, tearing up the black spots for him and accompanied him in silence, all the way to the top of the entertainment circle, winning the Best Actor trophy. \r\n\r\nYu Mian thought that she would guard him silently for the rest of her life, but in a car accident, she reincarnated as Yu MianMian, the fiancee of the Film Emperor.\r\n\r\n On her first day as You MianMian, the Film Emperor appeared in front of her. Before Yu Mian could recover from the joy of seeing her idol, she saw a Cold faced man handing over a piece of paper. The tone was low and indifferent: 'We are getting married just for the Family, we just need to act accordingly on the scene'.\r\n\r\n Yu Mian nodded with Star eyes, took the contract and smiled. Idols are used to look up to. As a qualified fan, she is satisfied with being able to get close to them.\r\n\r\n Once dressed as the Miss of a wealthy family, Yu Mian, a petty citizen, just wanted to eat and wait for death, and throw money at idols! \r\nBut the idol who was supposed to be a good performer, sees her eyes becoming more and more wrong?\r\n\r\nOne day, the Film Emperor blocked her in the corner: 'When will we get married?' \r\nYu Mian blinked in confusion: 'Didn't you said that you don't want to get married too early?'\r\nThe Film Emperor gritted his teeth secretly: 'I changed my mind, and suddenly wanted to try how is it like to be called Husband by you.'>"
}