{
	"url": "https://www.novelupdates.com/series/im-not-the-final-boss-lover/",
	"title": "I’m Not the Final Boss’ Lover - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/02/Im-Not-the-Final-Boss-Lover.jpg",
	"noveltype": "(KR)",
	"genre": "Adventure   Comedy   Drama   Fantasy   Romance   ",
	"tags": "Adventurers   Aristocracy   Beautiful Female Lead   Betrayal   Caring Protagonist   Character Growth   Cheats   Couple Growth   Death   Demon Lord   Demons   Dense Protagonist   Determined Protagonist   Devoted Love Interests   Doting Love Interests   European Ambience   Fantasy World   Female Protagonist   Friendship   Game Elements   Handsome Male Lead   Hard-Working Protagonist   Harsh Training   Heartwarming   Kingdoms   Knights   Love Interest Falls in Love First   Magic   Misunderstandings   Mob Protagonist   Nobles   Power Couple   Pragmatic Protagonist   R-15   Religions   Romantic Subplot   Royalty   Schemes And Conspiracies   Second Chance   Slow Romance   Special Abilities   Strength-based Social Hierarchy   Strong Love Interests   Sword And Magic   Sword Wielder   Time Loop   Transmigration   Transported into a Game World   Underestimated Protagonist   Wars   Wealthy Characters   ",
	"rating": "(4.3 / 5.0, 71 votes)",
	"author": "Ken   켄   ",
	"year": "\nN/A",
	"ranking": "#103   #62   #2500   #63   #2993   ",
	"reviewcount": "13 Reviews",
	"description": "When our protagonist becomes the game character Jun Karentia,\n she thinks she has it made.\n She may be just a lowly support mage but with her knowledge of the game,\n she knows she can finagle her way to the good ending \n following around the main character, Fabian.\n The problem?.. This game doesn’t end after one playthrough. \nJun is prepared to guide Fabian through the second playthrough to the true ending when… Fabian abandons her. \nNow Grand Duke Mayer Knox—captain of the Dark Knights and the secret final boss—is determined to have her join his party. \nCan Jun turn the final boss into the main character? \nWhy is Mayer Knox so intent on having her at his party? \nAnd when will these rumors about being his lover stop?!>"
}