{
	"url": "https://www.novelupdates.com/series/when-a-villain-meets-a-villain/",
	"title": "When A Villain Meets A Villain - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/02/When-A-Villain-Meets-A-Villain.jpg",
	"noveltype": "(KR)",
	"genre": "Action   Comedy   Fantasy   Romance   ",
	"tags": "Assassins   Beautiful Female Lead   Different Social Status   European Ambience   Female Protagonist   Handsome Male Lead   Love Interest Falls in Love First   Organized Crime   Possessive Characters   Power Couple   Villainess Noble Girls   ",
	"rating": "(3.9 / 5.0, 26 votes)",
	"author": "임하얌   ",
	"year": "\n2021",
	"ranking": "#6970   #2000   #10875   #8979   #7724   ",
	"reviewcount": "No Reviews",
	"description": "“Please, become Atalante Blanc.”\n\nBeing proposed by the man she was supposed to kill, in a nutshell, it sucked. \n\nAtalante went against her foster father’s last words to be a good child, and became the boss of the underground organisation. \n\nShe received a request from the Emperor to assassinate the tyrant, Grand Duke Lionel Blanc. \n\nOf course, there was also a suggestion to bewitch him. \n\n‘As long as I finish this, I can wash my hands off from the underground.’\n\nAfter assassinating the Grand Duke, she dreamt of halting all villainous acts and living peacefully with her group’s members, but what was this? \n\n“What’s your name?”\n\nAs the Grand Duke asked for his assassin’s name, he was blushing. His eyes, definitely… they were ones of someone that had fallen in love.\n\nLove potion. Because of that absurd drug, Atalante had stolen the heart that she wanted to cease. \n\nAs Atalante was half-forcibly ascended to Grand Duchess’s position, she made a resolution.  \n\nSince the situation was like that, she’ll reap a substantial profit before divorcing him, just like the part of a villain. However…\n\n“I don’t have any intention of letting go of someone that’s mine.”\n\n“What?”\n\n“In this world, I only have one person, and that is my wife, you.”\n\nIt seems that it would be a little difficult to actualize her resolution.>"
}