{
	"url": "https://www.novelupdates.com/series/the-rebirth-of-the-malicious-empress-of-military-lineage/",
	"title": "The Rebirth of the Malicious Empress of Military Lineage - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2016/12/IMG_4707.jpg",
	"noveltype": "(CN)",
	"genre": "Fantasy   Historical   Josei   Martial Arts   Mature   Romance   ",
	"tags": "Absent Parents   Adapted to Drama   Adapted to Drama CD   Ancient China   Beautiful Female Lead   Betrayal   Black Belly   Calm Protagonist   Caring Protagonist   Clever Protagonist   Complex Family Relationships   Cruel Characters   Cunning Protagonist   Death   Death of Loved Ones   Depictions of Cruelty   Devoted Love Interests   Female Protagonist   Flashbacks   Handsome Male Lead   Hard-Working Protagonist   Love Interest Falls in Love First   Marriage   Mature Protagonist   Military   Past Plays a Big Role   Personality Changes   Politics   Possessive Characters   Power Couple   Power Struggle   Pregnancy   Reincarnation   Revenge   Royalty   R*pe   Ruthless Protagonist   Schemes And Conspiracies   Second Chance   Slow Romance   Smart Couple   Strong Love Interests   Tragic Past   Tsundere   Twins   Unconditional Love   Underestimated Protagonist   Wealthy Characters   ",
	"rating": "(4.7 / 5.0, 2280 votes)",
	"author": "Qian Shan Cha Ke   千山茶客   ",
	"year": "\n2016",
	"ranking": "#624   #736   #49   #452   #32   ",
	"reviewcount": "499 Reviews sorted by",
	"description": "Shen Miao, the Di daughter of a military family, was pure, quiet, gentle, and gracious. Because of her foolish love for Prince Ding, she forced her way into becoming his wife.\n\nAfter six years of assisting her husband, she finally became the mother of the world: The Empress.\n\nShe had stayed with him during the fight for dominion over the empire and during the efforts to expand its territory. She even went so far as to put herself in danger and be taken hostage by a neighboring empire. In spite of this, when she returned to the Imperial Palace five years later, she no longer had a place in the Imperial Harem.\n\nThat beautiful woman he kept in his embrace gave her a bright, stunning smile and told her, “Older Sister, the country has settled down. It is time for you to step back as well.”\n\nHer daughter died tragically and her son the Crown Prince was deposed. No one in her Shen family, who had been completely loyal to the Emperor, were spared. With arrival of a new reign, everything was overturned! \n\nShen Miao never thought that all of the perils they encountered as husband and wife, all of the assistance they gave each other mutually, were nothing but a joke in his eyes!\n\nHe told her, “Because you have been with this Emperor for more than two decades, this Emperor will allow you to keep an intact corpse. You should be grateful for this kindness.”\n\nBeneath a meter of white silk, Shen Miao established a malicious oath: Once the day of reckoning arrives, every single one of you will die!\n\nOnce reborn, she returns to the year when she was only fourteen years old, a time when tragedy has not yet befallen, when her family still lived, and when she was still the pure, quiet, gentle, and gracious Di daughter of a military family.\n\nClose relatives conceal evil intentions, her cousins are vicious and merciless, the new concubine is like tiger watching its prey and that scum wants the previous life’s events to be repeated?\n\nHer family must be protected, the great enmity must be avenged, and the prize must include the empire’s imperial throne. In this lifetime, let us see who comes out on top!\n\nBut that Xie Family’s young marquis, that tyrannical and arrogant spear-wielding young man on horseback, stays stubbornly on her side and proudly declares, “It is merely toppling the Imperial Family. Do not forget, the world belongs to you, and you—you belong to me!”\n\n–\n\nThe Thirteen Capitals of You Zhou: This belongs to you.\n\nThe Ding Yuan City in the North Dessert: This belongs to you.\n\nThe Southern River of Yu Zhou, the Eastern Sea of Ding Xi, the Green Lakes of Lin’an, the Ancient City of Luo Yang: All of these belong to you.\n\n“Xie Jing Xing, if all of this belongs to me, then can you tell me what you want?”\n\n“Alright, you.”>"
}