{
	"url": "https://www.novelupdates.com/series/escape-from-the-library/",
	"title": "Escape From the Library - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/04/Escape-From-the-Library.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Comedy   Romance   School Life   Supernatural   Yaoi   ",
	"tags": "Academy   Alternate World   Calm Protagonist   Carefree Protagonist   Caring Protagonist   Charming Protagonist   Clever Protagonist   Cold Love Interests   College/University   Confident Protagonist   Cousins   Dancers   Dense Protagonist   Devoted Love Interests   Famous Protagonist   Friendship   Handsome Male Lead   Heartwarming   Helpful Protagonist   Honest Protagonist   Lawyers   Leadership   Library   Love Interest Falls in Love First   Manly Gay Couple   Mature Protagonist   Medical Knowledge   Monsters   Music   Power Couple   Righteous Protagonist   Scientists   Slow Romance   Smart Couple   Strong Love Interests   Student Council   Survival   Survival Game   Teamwork   Twins   ",
	"rating": "(4.1 / 5.0, 39 votes)",
	"author": "Die Zhiling   蝶之灵   ",
	"year": "\n2020",
	"ranking": "#4265   #3890   #7249   #6189   #6813   ",
	"reviewcount": "7 Reviews sorted by",
	"description": "One day late at night, Yue Xingwen went to the library to check out some information, and as soon as he entered the door, he heard a cold mechanical sound ringing in his ears — Welcome to the ‘Escape From the Library’ real-life survival game. Library rules:\n\n1.  Credits can be obtained for each clearance, and the credits can be exchanged for field of study-related skill books or props;\n\n2. Each department has a different subject course;\n\n3. If you can’t pass the course, you will be obliterated!\n\nThe library was full of crises. In order to escape their life, the students trapped in the library crossed the sea with eight immortals and showed their remarkable abilities—\n\nDepartment of Chemistry’s schoolmate: Acid, base, salt, chemical reaction melt everything!\n\nDepartment of Physics’ classmate: Light, electricity, spring, magnetic field, gravity, the demons and ghosts stay away from me!\n\nDepartment of Medicine’s senior: Scalpel, surgical suture, medical gauze, what the hell with pulling out the electric chainsaw?\n\nA student from the Department of Biological Science can do mitosis to directly split himself into countless numbers?\n\nThe senior sister from the Department of Environment can plant trees on the spot, and the junior brother from the Department of Architecture can dig a hole in the ground to make tunnels…\n\nDepartment of Chinese Language and Literature’s protagonist: Don’t panic!\n\nConveniently taking out a copy of 'Modern Idioms Dictionary. '\n\nSchoolmates: ….???\n\nThis escape team is getting stranger and stranger.>"
}