{
	"url": "https://www.novelupdates.com/series/after-the-soft-sister-differentiated-into-a/",
	"title": "After the Soft Sister Differentiated Into A - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/10/After-the-soft-sister-differentiated-into-A.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Romance   School Life   Yuri   ",
	"tags": "Dense Protagonist   Enemies Become Lovers   Omegaverse   Rivalry   ",
	"rating": "(4.0 / 5.0, 39 votes)",
	"author": "Sleepless Night   金夜无眠   ",
	"year": "\n2020",
	"ranking": "#5262   #3795   #6581   #7724   #7718   ",
	"reviewcount": "7 Reviews sorted by",
	"description": "As the two famous beauties of the school, not a day goes by without Jin Siming and Yao Jin competing with each other. Although her grades are not as good as Yao Jin’s, in terms of her face and body, Jin Siming will never admit defeat! \n\nRecently she heard that Yao Jin had differentiated into an A-rank Omega. Jin Siming’s heart bloomed with joy when she heard this because, in the hospital’s recent report, it said that she will differentiate into an S-level omega in the future. With this alone, she will finally be above Yao Jin in something!\n\nHowever, she was only happy for a few days when the tables turned on her. \n\nBecause she….actually differentiated into an Alpha. \n\nAlthough she usually drools over the Alpha’s peerless and perfect bodies, she doesn’t want to become an Alpha herself! \n\nAfter she was differentiated, not only did her appearance change, but her originally weak and weak temperament has disappeared too. Even the Alphas who used to surround and diligently chase her every day are now all avoiding her. \n\nOn the other hand, Yao Jin only becomes more and more charming after she differentiates into an Omega. Even just looking at her back, one can feel her boundless charm. The admirers around her continue to increase every day instead.  \n\nShe secretly made a decision as she gazed at her former rival’s boundless beauty–\n\nShe will drive all of Yao Jin’s admirers away! \n\nHowever, Yao Jin’s admirers haven’t even been driven away yet when the rumors began to spread in school. \n\n“Shocking development! The relationship between Jin Siming and Yao Jin has been reversed, from former rivals to lovers! Jin Siming has apparently been in love with Yao Jin for a long time and has made a move on her former rival!”\n\nJin Siming: ????\nYao Jin (leans forward): I’ve heard you have a crush on me? \nJin Siming: That’s your imagination, why would I ever fall for you? \nYao Jin: Oh?\n\nOn the campus forum the next day, photos of Jin Siming being pressed down by Yao Jin spread all over the homepage. >"
}