{
	"url": "https://www.novelupdates.com/series/unspeakable/",
	"title": "Unspeakable - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/08/1429724cf6683b426dbd1052a3f26594cc2e41e5.jpg",
	"noveltype": "(CN)",
	"genre": "Drama   Mature   Tragedy   Yaoi   ",
	"tags": "Abandoned Children   Absent Parents   Abusive Characters   Blackmail   Brainwashing   Bullying   Child Abuse   Childcare   Childhood Love   Clingy Lover   Cold Love Interests   Cruel Characters   Cute Children   Cute Protagonist   Emotionally Weak Protagonist   Familial Love   First Love   Forced into a Relationship   Forced Marriage   Hard-Working Protagonist   Hated Protagonist   Hospital   Inferiority Complex   Loneliness   Loner Protagonist   Love at First Sight   Love Triangles   Marriage   Misunderstandings   Mpreg   Past Trauma   Poor Protagonist   Protagonist Falls in Love First   R*pe   Secrets   Sickly Characters   Unconditional Love   Unrequited Love   Weak Protagonist   ",
	"rating": "(4.0 / 5.0, 84 votes)",
	"author": "梨花糖   ",
	"year": "\n2019",
	"ranking": "#2384   #4123   #3874   #6708   #5089   ",
	"reviewcount": "23 Reviews sorted by",
	"description": "In the purest days of early springtime, my selfish love was given to you.\r\nTime passes and my heart has never changed, but my feelings have become completely unspeakable.\r\n\r\nShen Kanyu had chased after Gu Yansheng from the moment they met and all years following. He has been married to him for 3 years, has birthed a daughter for him, and now lives at this house he hates to return to, cooking for him even on days he doesn’t return. Still, he is content to continue on as long as their days pass like this. In a place where their hands touch the same bowl, where Gu Yansheng comes to linger in his daughter’s grip, and where warmth softly ghosts him. Easing the ache in his bones, a home that belongs to him, a place he can watch a beautiful little girl and the man he loves happily till the day he dies. A piece of paper at the bottom of a drawer, a rough sketch of a family of three as they walk hand in hand and a dark smear staining the corner of the page. Yet all this still feels sweet.>"
}