{
	"url": "https://www.novelupdates.com/series/rebirth-to-become-the-presidents-omega-wife/",
	"title": "Rebirth to Become the President’s Omega Wife - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/05/o-wife.jpg",
	"noveltype": "(CN)",
	"genre": "Fantasy   Romance   Yaoi   ",
	"tags": "Child Abuse   Complex Family Relationships   Couple Growth   Cute Children   Determined Protagonist   Devoted Love Interests   Doting Love Interests   Family Conflict   Futuristic Setting   Handsome Male Lead   Inheritance   Marriage   Mpreg   Multiple Reincarnated Individuals   Older Love Interests   Omegaverse   Outer Space   Past Trauma   Poisons   Possessive Characters   Power Couple   Proactive Protagonist   Protagonist Falls in Love First   Reincarnation   Secrets   Strong Love Interests   Transmigration   Unconditional Love   Wealthy Characters   ",
	"rating": "(4.2 / 5.0, 560 votes)",
	"author": "Hanmen Yatou   Humble Servant Girl   寒门丫头   ",
	"year": "\n2019",
	"ranking": "#2261   #605   #838   #312   #368   ",
	"reviewcount": "141 Reviews sorted by",
	"description": "Su Ling transmigrated into an ABO novel, and his imaginary male god Gu Liheng was the supporting cannon fodder of this novel.\n\nIn the novel, a cannon fodder shou sought refuge with Gu Liheng, using a favor gained previously to make Gu Liheng marry him. But after getting married, the cannon fodder shou went to pester the protagonist gong instead, framing the protagonist shou, causing Gu Liheng’s reputation to be damaged, resulting in his death in the end.\n\nSu Ling decided to take Gu Liheng down before he gets forced into marriage by that cannon fodder shou!\n\nSu Ling’s body fell softly on Gu Liheng.\n\n“President Gu, let me smell your pheromones, I feel uncomfortable QAQ”\n\nGu Liheng handed him an inhibitor.\n\nSu Ling gave Gu Liheng roses every day for a whole week.\n\n“President Gu, I love you, can you marry me?”\n\nGu Liheng: “No.”\n\nSu Ling: “…” Eff this.\n\nGotten tired of chasing people around, Su Ling decided to give himself a few days off.\n\nThe first day\n\nSu Ling didn’t show up.  Gu Liheng: “…”\n\nThe second day.\n\nGu Liheng:  [Looking Out Of The Window]\n\nThe third day.\n\nGu Liheng knocked on Su Ling’s door and said: “Why don’t you come over anymore?”>"
}