{
	"url": "https://www.novelupdates.com/series/the-way-to-protect-the-female-leads-older-brother/",
	"title": "The Way to Protect the Female Lead’s Older Brother - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/02/The-Way-to-Protect-the-Female-Leads-Older-Brother_1613177428.jpeg",
	"noveltype": "(KR)",
	"genre": "Drama   Fantasy   Harem   Mature   Psychological   Romance   Shoujo   Supernatural   ",
	"tags": "Abusive Characters   Adapted to Manhwa   Aggressive Characters   Antihero Protagonist   Aristocracy   Arrogant Characters   Beautiful Female Lead   Black Belly   Calm Protagonist   Charismatic Protagonist   Charming Protagonist   Child Abuse   Clever Protagonist   Cold Protagonist   Complex Family Relationships   Confident Protagonist   Confinement   Cruel Characters   Cunning Protagonist   Dark   Death of Loved Ones   Depictions of Cruelty   Empires   Enemies Become Lovers   European Ambience   Evil Organizations   Familiars   Family Conflict   Female Protagonist   Gore   Handsome Male Lead   Hard-Working Protagonist   Harsh Training   Hidden Abilities   Hiding True Abilities   Insects   Love Interest Falls in Love First   Magic   Magic Beasts   Magic Formations   Male Yandere   Manipulative Characters   Nobles   Obsessive Love   Past Trauma   Poisons   Possessive Characters   Power Struggle   Prison   Proactive Protagonist   Protagonist Strong from the Start   Reincarnation   Reverse Harem   Sadistic Characters   Schemes And Conspiracies   Sealed Power   Second Chance   Secret Relationship   Secretive Protagonist   Sister Complex   S*aves   Survival   Survival Game   Torture   Tragic Past   Twisted Personality   Villainess Noble Girls   Weak to Strong   Wealthy Characters   Yandere   ",
	"rating": "(4.1 / 5.0, 184 votes)",
	"author": "Kin   킨   ",
	"year": "\n2018",
	"ranking": "#1957   #1788   #3333   #8979   #1640   ",
	"reviewcount": "12 Reviews sorted by",
	"description": "I accidentally took possession of someone in a 19+ reverse harem novel.\r\n\r\nThe problem is that I became Roxana Agriche, the older sister of the sub-villain. My damn father kidnapped the heroine’s brother. Now, is the only thing left to meet a terrible end from the vengeance of the heroine?\r\n\r\nBut what if I can avoid that horrible development?\r\n\r\n“I’m also interested in this toy.”\r\n\r\n“I’ll protect you until you can get out of here safely.”\r\n\r\nThe heroine’s brother, Cassis Pedalian, will definitely be able to pay me back later.>"
}