{
	"url": "https://www.novelupdates.com/series/i-advise-you-to-like-me-as-soon-as-possible/",
	"title": "I Advise You To Like Me As Soon As Possible - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/07/New-Novel.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Romance   Slice of Life   ",
	"tags": "Arrogant Characters   Beautiful Female Lead   Betrayal   Bickering Couple   Boss-Subordinate Relationship   Calm Protagonist   Caring Protagonist   Character Growth   Clever Protagonist   Clumsy Love Interests   Co-Workers   Cold Love Interests   Comedic Undertone   Complex Family Relationships   Cunning Protagonist   Dense Protagonist   Enemies Become Allies   Enemies Become Lovers   Family Conflict   Female Protagonist   Handsome Male Lead   Hard-Working Protagonist   Hiding True Identity   Lawyers   Love Interest Falls in Love First   Love Rivals   Love Triangles   Low-key Protagonist   Misunderstandings   Modern Day   Multiple POV   Office Romance   Older Love Interests   Popular Love Interests   Power Couple   Quirky Characters   Secret Identity   Shameless Protagonist   Sharp-tongued Characters   Slow Romance   Smart Couple   Strong Love Interests   Stubborn Protagonist   Student-Teacher Relationship   Teamwork   Wealthy Characters   ",
	"rating": "(4.5 / 5.0, 110 votes)",
	"author": "叶斐然   ",
	"year": "\n2020",
	"ranking": "#1678   #1735   #2715   #2256   #2672   ",
	"reviewcount": "32 Reviews sorted by",
	"description": "Not long after Ning Wan was ‘banished’ to a rural neighbourhood by Zhengyuan Law Firm headquarters, a second victim was exiled to join her.\n\nVivacious, tall, handsome, a complete gentleman, he exuded the unique aura…\n\n…of a character likely to die off-screen in a historical drama. Were he to become a community lawyer, he would surely end up berated by middle-aged aunties until he cried a river and came to doubt life. He was a big, silly softie, a newbie easy to pick on!\n\nNing Wan decided that she would beat this poor neglected novice into shape—\n\n“Fu Zheng, isn’t it? Newcomers here must be obedient and discerning.”\n\n“When I dig a pit, you’ll fill it in. When I eat meat, you’ll drink the broth. When I head east, you can’t head west. In short, consider me your God in this remote wilderness beyond the reach of the government.”\n\nAlthough a little silly, the newbie was handsome, obedient, and tactful. She developed a soft spot for him and decided to impart the ultimate skills she had cultivated for a lifetime: how to shift the blame; how to loaf on the job; how to pay lip service to the boss.\n\nShe was very sincere, holding nothing back—\n\n“Truthfully, my unique skills are not without cost. I advise you to like me as soon as possible. Let me analyze the advantages and disadvantages of liking me…”\n\nThat big, silly softie, Fu Zheng, succumbed to her coercion and temptation. From that day on, he devoted himself to Ning Wan.\n\nHalf a year later, Ning Wan attended the annual meeting at headquarters. There, she was introduced to the new senior partner…\n\nA vivacious, tall, handsome gentleman.\n\n“Hello everyone, I’m Fu Zheng,” he grinned. “I joined this firm to get rid of the bad atmosphere, such as: shifting the blame, loafing on the job, and paying lip service to the boss…”\n\n‘Fu Zheng, you—! Goddammit! This is fraud!’>"
}