{
	"url": "https://www.novelupdates.com/series/the-homemaker-of-the-dungeon/",
	"title": "The Homemaker of the Dungeon - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/01/The-Homemaker-of-the-Dungeon.jpeg",
	"noveltype": "(KR)",
	"genre": "Fantasy   Romance   ",
	"tags": "Beautiful Female Lead   Dungeons   Female Protagonist   Game Elements   Game Ranking System   Handsome Male Lead   Hunters   Reincarnated in a Game World   Reincarnation   ",
	"rating": "(4.2 / 5.0, 16 votes)",
	"author": "GeumSong Hwang   Golden Song   황금송   ",
	"year": "\n2021",
	"ranking": "#3633   #2000   #8823   #2254   #8758   ",
	"reviewcount": "1 Review sorted by",
	"description": "[System: Congratulations. You have been upgraded to Hidden Class ‘Homemaker’!]\n\nAt age 25, an ordinary salarywoman Hena during afterhours levels up into a ‘homemaker.’\n\n[Comfy bed(D): Make a bed that would allow one to rest in peace without being bothered by other entities. Active skill.]\n\n[System: Passive skill ‘digging up plants(C) is auto-activated!]\n\nThe skills list is filled with embarrassing skills that are too cringey to be read out loud. The home that she received unexpectedly is giving her a weird feeling?\n\nIn a storm where she is randomly teamed up with the number one ranked hunter, will the shy, safety-first Hena be able to protect a normal daily life?\n\n* * *\n\nA handsome man dug through his jacket.\n\nInside, in which he brought out a card. \n\nHena knew what it was. It was a card key.\n\nWell, a house key to be exact.\n\n“Will you take responsibility for my future?”\n\nThe man asked such a big question while handing her the card.\n\nHena’s two eyes became as wide as bulbs.\n\n‘My goodness.’\n\n“…..umm…excuse me, hunter Jin Hyung Kang.”\n\n“I will let you handle everything, myself included.”\n\n“Well, it’s just that”\n\nYes, go ahead, there’s nothing that I cannot do for you.”\n\nFinally, Hena replied with a half cry.\n\n“Why do you ask me to be your housekeeper in such a creepy fashion?”>"
}