{
	"url": "https://www.novelupdates.com/series/the-killing-of-three-thousand-crows/",
	"title": "The Killing of Three Thousand Crows - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2015/08/threethousandcrow.jpg",
	"noveltype": "(CN)",
	"genre": "Romance   Xianxia   ",
	"tags": "Adapted to Drama   ",
	"rating": "(4.1 / 5.0, 41 votes)",
	"author": "Shi Si Lang   十四郎   ",
	"year": "\n2010",
	"ranking": "#2000   #2000   #9598   #12437   #8540   ",
	"reviewcount": "No Reviews",
	"description": "On the mountain balcony, Princess Di Ji stunned the world with the song《Peach Blossoms of the Eastern Wind》.\n\nAfter the stained glass fire, the Great Nation of Yan was no more, the matters of it’s past as if a dream. Concealing her identity, Di Ji hides herself at a place where immortality is cultivated, Qiang Qu Mountain, and becomes the servant Qin Chuan.\n\nBut unexpectedly, old friends begin to turn up one after the other. An old lover, Zuo Zi Chen is now entangled with Xuan Zhu after losing his memories, and an elegant and distinguished Fu Jiu Yun suddenly appears, purposely teasing her in every way possible. It’s hard to separate his truth from lies, and difficult to accept his favour.\n\nTaking advantage of the White River Dragon King’s arrival in Qiang Qu Mountain, Qin Chuan steals the Master’s treasures and flees. Knowing that he had been deceived, Fu Jiu Yun is extremely angry, and chases after her however far she goes. After knowing her mission, and being unable to stop her, he can only use his own life to help her succeed.\n\nBut she doesn’t know, in order to meet her, he has kept watch for a millennium.\nShe kept strong despite feeling otherwise, vehemently refusing him: You can have me, but never think for once you can have my heart!\n\nThat man completely didn’t care. He faintly smiled: I only want you, who said anything about your heart?\n\n**\n\nShe held onto his leg, crying: Your lordship! Please! I’m willing to offer myself!\n\nThe man kept his attention on the book in his hand and replied her absent-mindedly: You want to offer, but I don’t want you.\n\n*\n\nTakasugi Shinsaku penned: “I’d kill all the crows in the world, to sleep with you till morning tolls (1).” The novel is drawn from here.>"
}