{
	"url": "https://www.novelupdates.com/series/hidden-assassin/",
	"title": "Hidden Assassin - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2017/11/yinsha.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Harem   Mature   Romance   Slice of Life   Supernatural   ",
	"tags": "Age Progression   Assassins   Average-looking Protagonist   Beautiful Female Lead   Calm Protagonist   Childhood Love   Clever Protagonist   Cohabitation   Cross-dressing   Cunning Protagonist   Early Romance   Firearms   First-time Interc**rse   Hackers   Hiding True Abilities   Hiding True Identity   Low-key Protagonist   Male Protagonist   Marriage   Master-Disciple Relationship   Mature Protagonist   Misunderstandings   Modern Day   Organized Crime   Overpowered Protagonist   Polygamy   Pregnancy   Second Chance   Strong to Stronger   Threesome   Time Skip   ",
	"rating": "(4.1 / 5.0, 182 votes)",
	"author": "Angry Banana   愤怒的香蕉   ",
	"year": "\n2007",
	"ranking": "#2000   #2000   #1399   #5008   #2189   ",
	"reviewcount": "26 Reviews sorted by",
	"description": "One of the top expert killers, tired of endless assassinations and having survived a cruel and suppressed life, decided to escape the world’s strictest assassin organization.\n\nA chance came during one of the nights when the organization was least prepared, and he fled. However, he discovered that the night he escaped was the night when the organization had sent out many experts and ability type users to capture a phoenix weakened by its rebirth. Eventually, when surrounded and knowing that his situation was hopeless, he desperately shot at the ability user blocking his way. This helped the phoenix break out of the encirclement and grant him his one and only wish – freedom.\n\nThe assassin’s soul was sent back to his ten year old self. He woke up at a point in time that would allow him to drastically change his fate – he killed the two assassins that picked him up and brought him to the organization.\n\nThus, he began a brand new life.\n\nTwo naive little girls and one experienced boy living together and filling their days with warm memories of childhood…>"
}