{
	"url": "https://www.novelupdates.com/series/how-to-extend-a-marriage-contract/",
	"title": "How to Extend a Marriage Contract - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/07/How-to-Extend-a-Marriage-Contract.jpg",
	"noveltype": "(KR)",
	"genre": "Adult   Comedy   Fantasy   Mature   Romance   Smut   ",
	"tags": "Academy   Aggressive Characters   Amnesia   Aristocracy   Beautiful Female Lead   Carefree Protagonist   Charming Protagonist   Clumsy Love Interests   C*nnilingus   Comedic Undertone   Contracts   Cute Protagonist   Dense Protagonist   Determined Protagonist   Devoted Love Interests   Dishonest Protagonist   Doting Love Interests   Doting Parents   European Ambience   Fearless Protagonist   Female Protagonist   First-time Interc**rse   Flashbacks   Handsome Male Lead   Jealousy   Knights   Kuudere   Lack of Common Sense   Love Interest Falls in Love First   Marriage   Marriage of Convenience   Misunderstandings   Naive Protagonist   Nobles   Nudity   Possessive Characters   R-18   Sadistic Characters   Seduction   Shameless Protagonist   Short Story   Stoic Characters   Strong Love Interests   Tomboyish Female Lead   Wealthy Characters   ",
	"rating": "(4.1 / 5.0, 72 votes)",
	"author": "Deer Graveyard   사슴묘묘   ",
	"year": "\n2021",
	"ranking": "#650   #372   #4375   #1267   #4508   ",
	"reviewcount": "9 Reviews",
	"description": "Emily, the only daughter of a Count who was looking for a marriage partner to inherit the title.\r\nAnd Kyle, the leader of the Order of the Holy Knights, who just appeared in front of Emily.\r\n\r\n'I need you and you need a decent husband.”\r\n\r\nTwo people who are supposed to pretend to be husband and wife during the contract.\r\nBut Emily fell for Kyle during her fake marriage,\r\nThree years goes by so quickly that their contract ends.\r\nKyle, who lost his memory in a timely manner, returns from the expedition.\r\n\r\n'So he doesn't remember the marriage contract?’\r\n\r\nAn idea that Kyle might be a little scared to know crossed Emily's mind.\r\n\r\n* * *\r\n\r\n'I think I told you before.'\r\n\r\nThe harsh voice gave her goosebumps. As soon as the man's solid body fell off of her for a while, her body floated into the air. And when she closed her eyes and opened up, she was lying on the bed.\r\n\r\nBefore she could get up, Kyle climbed on top of her. And slowly unbuttoned his cuffs.\r\nIn the meantime, his gaze did not fall from Emily.\r\n\r\nHis expression seemed dull, but his eyes were burning. And the lower body that was touching her was already....\r\n\r\n'I'm the only one who can get in and out of you.'\r\n“…….”\r\n'I won't let you do that again.'>"
}