{
	"url": "https://www.novelupdates.com/series/pearl-in-the-palm/",
	"title": "Pearl in the Palm - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/05/Pearl-in-the-Palm.jpg",
	"noveltype": "(CN)",
	"genre": "Josei   Romance   ",
	"tags": "Ancient China   Beautiful Female Lead   Buddhism   Calm Protagonist   Cold Love Interests   Devoted Love Interests   Doting Parents   Familial Love   Fated Lovers   Handsome Male Lead   Love Interest Falls in Love First   Nobles   Older Love Interests   Possessive Characters   Pregnancy   Royalty   Sickly Characters   Strong Love Interests   ",
	"rating": "(3.6 / 5.0, 34 votes)",
	"author": "纷纷和光   ",
	"year": "\n2019",
	"ranking": "#6970   #6270   #7412   #7144   #7781   ",
	"reviewcount": "5 Reviews sorted by",
	"description": "Ye Lizhu is a delicate beauty with the flesh of ice and bones of jade*. Having reached the age of marriage, yet no one dared to come and marry her.\r\n(T/N: A woman with smooth and fair skin)\r\n\r\nEveryone knows that Ye Lizhu’s body is weak- even when walking two steps away, she needs someone to support her. Moreover, the Prime minister loved and spoiled her to the heavens. If such a sick beauty is married home and wasn’t served well, he will definitely be killed by the ruthless Prime minister Ye.\r\n\r\nYe Lizhu also feels quite vexed, her body is getting worse day by day. When she was at peace with death, an indifferent man started coming to the Prime minister’s residence. The man is tall and jade*, with a cold appearance just like a celestial being, and looks at Ye Lizhu with frightening eyes.\r\n\r\n(T/N: A handsome man with a good figure)\r\n\r\nHowever, as soon as Ye Lizhu approached the man, her sickly body somewhat recovered. Once the man moved away, she couldn’t breathe easily.\r\n\r\nFinally one day, Ye Lizhu pretended to fall down, thinking that she could preserve her life if she stays close to this man.\r\n\r\nPrime Minister Ye, who feared nothing in Heaven or Earth, quickly grabbed his daughter and whispered in her ear: “This is the Regent, Prince Qin, who came to the capital with one hundred thousand to frighten the emperor. Baby girl, let’s try to find someone gentle and soft, don’t look at this evil god.”\r\n.\r\nLater, the regent held poor little Lizhu in his arms: “Good, come closer.”\r\n.\r\nOnly the regent himself knew how long he’s liked this little beauty.>"
}