{
	"url": "https://www.novelupdates.com/series/its-not-easy-being-your-love-rivals-big-brother/",
	"title": "It’s Not Easy Being Your Love Rival’s Big Brother - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2017/12/801f2a38tw1epyqxx4mojj205k07st9e.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Mature   Romance   Smut   Yaoi   ",
	"tags": "College/University   Fat to Fit   Handsome Male Lead   Harsh Training   Love Interest Falls in Love First   Modern Day   Police   Possessive Characters   Previous Life Talent   Reincarnation   Revenge   Second Chance   Shameless Protagonist   Siblings Not Related by Blood   Teamwork   Wealthy Characters   ",
	"rating": "(3.9 / 5.0, 461 votes)",
	"author": "精分柚子茶   ",
	"year": "\n2015",
	"ranking": "#2463   #3365   #1185   #701   #678   ",
	"reviewcount": "76 Reviews sorted by",
	"description": "The 27-year-old Wei Han is a slightly fat, slightly chicken-livered, and slightly foolish, pure-hearted and besotted top, and his sweetheart who had been together with him for seven years, in the end, was stolen away by Qi ZhiFan one morning.\r\nDeeply broken-hearted and in despair, he went overboard with binge eating, and ended up pathetically choking to death…\r\n\r\nLuckily, he received a second chance, yet his timing, position, and destiny all got warped, and the him who returned to being twenty followed his remarried mother into the Qi family, turning into Qi ZhiFan’s non-blood-related older brother.\r\n\r\nWell, Wei Han swore that this time, he must alter his dumped-as-cannon-fodder fate, and since he’s become his love rival’s big bro, he can definitely torment this scumbag little brother to death, restoring his position as the rightful top and quickly carry his bottom home!\r\n\r\nHowever, why is the development of the plot spiraling further and further out of his control?\r\nWhy is Qi ZhiFan looking at him with a scorching, burning gaze, acting more and more questionable ( ⊙ o ⊙ ) eh?!\r\nThus, Wei Han was pushed down into an official bottom…>"
}