{
	"url": "https://www.novelupdates.com/series/reborn-into-young-master-huos-little-fairy/",
	"title": "Reborn into Young Master Huo’s Little Fairy - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/01/Reborn-into-Young-Master-Huo39s-Little-Fairy.jpg",
	"noveltype": "(CN)",
	"genre": "Fantasy   Romance   School Life   ",
	"tags": "Cruel Characters   Depression   Family Conflict   Female Protagonist   Male Yandere   Medical Knowledge   Misunderstandings   Modern Day   Multiple Personalities   Obsessive Love   Possessive Characters   Reincarnation   R*pe   Schizophrenia   Second Chance   Sickly Characters   Suicides   Torture   ",
	"rating": "(2.6 / 5.0, 7 votes)",
	"author": "Sweets Flood   ",
	"year": "\nN/A",
	"ranking": "#2000   #2000   #10914   #12293   #11136   ",
	"reviewcount": "3 Reviews sorted by",
	"description": "In Yun City, there are rumors about Young Master Huo being temperamental and extreme. He is cold-hearted and will kick any woman away if they get close to him. \r\n\r\nLittle Fairy Wen was at loggerheads with Young Master Huo in her previous life. \r\n\r\nLittle Fairy Wen: 'Can I suck up to you?' \r\n\r\n'Scram.' \r\n\r\nThat was expected. It would only be strange if Little Fairy Wen could succeed. \r\n\r\nNot long later— \r\n\r\n'Young Master Huo brought Little Fairy Wen to the countryside to watch shooting stars.' \r\n\r\n'Young Master Huo beat his love rival up so badly the latter is in the hospital.' \r\n\r\nLittle Fairy Wen, the person involved, is pushed into a corner by Young Master Huo. \r\n\r\n'I dare you to break up with me.' \r\n\r\nLittle Fairy Wen smiles brightly. 'You were the one who told me to scram.' \r\n\r\nThe fierce Young Master Huo becomes a meek little puppy in the next second. 'Don't break up with me. My life is yours from now on.' \r\n\r\n... \r\n\r\nWen Ruan died brutally in her previous life. Young Master Huo, who was terminally ill, collected her corpse and even laid into the crystal coffin with her after consuming poison. \r\n\r\nNow that she's reborn, her goal is to tear the scumbags and bitches apart, cure his illness, suck up to him, and become his precious little fairy. \r\n\r\n[The Little Fairy who is sweet and delicate, meek and charming VS The temperamental Young Master Huo who is extremely faithful and only pampers the little fairy ]>"
}