{
	"url": "https://www.novelupdates.com/series/transmigrated-as-the-domesticated-rabbit-of-the-sick-and-frail-villain-in-the-apocalypse/",
	"title": "Transmigrated as the Domesticated Rabbit of the Sick and Frail Villain in the Apocalypse - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/12/Transmigrated-as-the-Domesticated-Rabbit-of-the-Sick-and-Frail-Villain-in-Doomsday.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Fantasy   Romance   ",
	"tags": "Apocalypse   Comedic Undertone   Cute Children   Disabilities   Evolution   Female Protagonist   Gore   Handsome Male Lead   Human-Nonhuman Relationship   Magical Space   Mutated Creatures   Mutations   Non-humanoid Protagonist   Possessive Characters   Power Couple   Shapeshifters   Slow Romance   Survival   Tragic Past   Transmigration   ",
	"rating": "(4.4 / 5.0, 91 votes)",
	"author": "Tian zhu   甜竹   ",
	"year": "\n2020",
	"ranking": "#735   #389   #2283   #762   #2480   ",
	"reviewcount": "13 Reviews sorted by",
	"description": "Yin Yiliu transmigrated into a novel.\n\nShe became a mutated rabbit in the apocalypse which even came with two interspatial spaces. Her owner, Jin Yang, was the ultimate Villain Boss who would wreck the world in the later parts of the novel. Her mission was to help the villain counterattack and to prevent his death in the end.\n\nAt this time, Jin Yang was crippled and lifeless. Due to the apocalypse, he had been stuck in the villa all alone.\n\nThus, the bunny undertook the responsibility of looking after him. As the world underwent a global mutation, she worked hard to protect her owner and to provide him with food.\n\nThen, baam, the little rabbit turned into a little girl with rabbit ears. In a cute baby voice, she said to the male and female lead, 'You’re not allowed to hurt him!'\n\nBut never would she have expected that the one being pampered and doted on would be her instead.\n\nFrom feeding her to taking care of her daily life, Jin Yang who had always been indifferent and reticent began raising a child/pet during the apocalypse, becoming an omnipotent stay-at-home dad. He took care of her so well that there was no chance for her to take care of him instead.\n\nYin Yiliu looked at the Villain Boss who was holding her with one arm while ripping apart mutated beasts with the other.\n\nWhere was the weak and frail villain we agreed on?\n\n\n＊\n\nJin Yang's legs were broken by his enemies in a deliberate car accident.\n\nFrom the favored son of heaven to falling into the quagmire, when the apocalypse arrived, people like him were not worthy to live.\n\nIn a daze, he saw a white little rabbit pressing his lips with its paw and feeding him fresh dew again and again.\n\nAt that moment he felt that life was worth living after all.>"
}