{
	"url": "https://www.novelupdates.com/series/beloved-enemy/",
	"title": "Beloved Enemy - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2018/11/161412jf5uuyy1uzmlkgag.jpg.thumb_.jpg",
	"noveltype": "(CN)",
	"genre": "Adult   Drama   Mature   Romance   Smut   Yaoi   ",
	"tags": "Abusive Characters   Adapted to Drama   Adapted to Drama CD   Adapted to Manhua   Bickering Couple   Black Belly   Blackmail   Bullying   Business Management   Businessmen   Calm Protagonist   Clever Protagonist   Confident Protagonist   Confinement   Drugs   Enemies Become Lovers   F*llatio   Glasses-wearing Protagonist   Handsome Male Lead   Kidnappings   Love Interest Falls in Love First   Lovers Reunited   Male Yandere   Mature Protagonist   Military   Modern Day   Pacifist Protagonist   Possessive Characters   R*pe Victim Becomes Lover   R*pe   S*xual Abuse   Straight Seme   Time Skip   Wealthy Characters   Younger Love Interests   ",
	"rating": "(3.9 / 5.0, 196 votes)",
	"author": "Shui Qian Cheng   水千丞   ",
	"year": "\nN/A",
	"ranking": "#1326   #856   #2535   #6026   #1675   ",
	"reviewcount": "59 Reviews sorted by",
	"description": "GuQingPei, the new director who was poached with a high salary, his first challenge at his new post was to help his boss raise his son!\n\nA rich, hot-tempered, and arrogant second generation princeling best at causing trouble -- YuanYang who had been cultured in the army for many years is rebellious and domineering but GuQingPei has the confidence to make him bow down and submit. No one in this life has dared to make him (YuanYang) feel so grievous and troubled! Facing GuQingPei’s treacherous smiles and oppressing advances step by step, forcing him to learn to take over the family business, YuanYang decides to give GuQingPei a profound lesson. Instead, he loses control of the situation and they developed into another type of relationship!\n\nWith GuQingPei and YuanYang's equally opposing and hostile attitude... like enemies….will they look at each other with hatred or will it ignite into a different kind of spark!?>"
}