{
	"url": "https://www.novelupdates.com/series/wishing-you-eternal-happiness/",
	"title": "Wishing You Eternal Happiness - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/08/Wishing-You-Eternal-Happiness.jpeg",
	"noveltype": "(CN)",
	"genre": "Drama   Fantasy   Mature   Romance   ",
	"tags": "Ancient China   Arranged Marriage   Beautiful Female Lead   Broken Engagement   Caring Protagonist   Character Growth   Complex Family Relationships   Conflicting Loyalties   Couple Growth   Court Official   Cousins   Determined Protagonist   Female Protagonist   Handsome Male Lead   Kind Love Interests   Marriage   Multiple POV   Multiple Reincarnated Individuals   Nobles   Politics   Protagonist Falls in Love First   Royalty   R*pe   Schemes And Conspiracies   Second Chance   Secret Identity   Wars   ",
	"rating": "(4.5 / 5.0, 31 votes)",
	"author": "Peng Lai Ke   蓬莱客   ",
	"year": "\n2017",
	"ranking": "#1768   #1727   #7567   #3520   #6933   ",
	"reviewcount": "5 Reviews sorted by",
	"description": "The brilliant and young high minister, noble and benevolent in character, was once renowned in the capital.\r\n\r\nOnce the situation at court changed, his identity was questioned, and his name had since been tainted. As such, he left for a faraway place.\r\n \r\nThe pure and innocent pearl of the Zhen family, favored and loved by all, once led a smooth and tranquil life.\r\n\r\nOvernight, the great mansion completely collapsed. She married a bad husband, and her soul succumbed to eternal rest. One day, she awoke from a great dream.\r\n\r\nConfronting the junction of fate, she was determined to change the course of events.\r\n\r\nTheir reencounter transformed the trajectory of their lives.\r\n\r\nWith his life-saving grace and meticulous care, Pei You’an brought hope to the helpless her.\r\n\r\nStaying by his side in happiness and in sorrow, in life and in death, Zhen Jiafu reawakened feelings of concern in the apathetic him.\r\n\r\nA letter replete with ardent love: traveling a thousand miles to be with the gentleman.\r\n\r\nDespite the chill of the snowy night, with warmth sustained by love, the two hearts were the most intimate they had ever been.\r\n\r\nAlthough the world has its ups and downs, with you keeping me company, this life is enough.>"
}