{
	"url": "https://www.novelupdates.com/series/are-you-going-to-break-off-the-engagement-and-expel-me-at-the-same-time-im-an-alchemist-whos-endured-constant-harassment-and-unfaithfulness-but-im-going-to-make-a-fresh-s/",
	"title": "Are You Going to Break off the Engagement and Expel Me at the Same Time? ~I’m an Alchemist Who’s Endured Constant Harassment and Unfaithfulness, but I’m Going To Make a Fresh Start and Settle Down in the Frontier~ - Novel Updates",
	"image": "https://www.novelupdates.com/img/noimagefound.jpg",
	"noveltype": "(JP)",
	"genre": "Comedy   Fantasy   Romance   Shoujo   ",
	"tags": "Alchemy   Betrayal   Charming Protagonist   Childhood Friends   Female Protagonist   Kingdom Building   Magic   Nobles   ",
	"rating": "(3.6 / 5.0, 22 votes)",
	"author": "Hinokage Sora   日之影ソラ   ",
	"year": "\n2021",
	"ranking": "#2000   #6275   #5215   #4077   #7432   ",
	"reviewcount": "1 Review sorted by",
	"description": "Amelia was adopted by the Alster family, a famous alchemist family. Thanks to her unparalleled talent and sincere efforts, she became the youngest alchemist in the history of the court. However, the situation changed drastically with the birth of her younger sister Rivera. All the expectations of those around her turned to her sister, and she became a nuisance to both her family and her colleagues.\r\n\r\nDespite this, Amelia continues to work diligently and manages to keep up with the amount of work that she is assigned to do day after day as if she were being harassed. Then, one day, her fiance, Caius, tells her that he is breaking off their engagement and expelling her from the Court.\r\n\r\nHer fiance is taken away by her sister, her position at the Court is revoked, and she loses everything she has built up and falls into despair......\r\n\r\nRather, Amelia was grateful.\r\n\r\n'Thank you for everything, Caius. And Rivera, I know you have a lot of work ahead of you, but please hang in there, okay?'\r\n\r\nAmelia is happy to be free from the harassment at work, to be free from her unfaithful fiance, and to start afresh in a new place with her reunited childhood friend.\r\n>"
}