{
	"url": "https://www.novelupdates.com/series/heaven-officials-blessing/",
	"title": "Heaven Official’s Blessing - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/07/Heaven-Officials-Blessing.jpg",
	"noveltype": "(CN)",
	"genre": "Drama   Mystery   Romance   Shounen Ai   Xianxia   ",
	"tags": "Adapted to Anime   Adapted to Drama CD   Adapted to Manhua   Ancient Times   Betrayal   Calm Protagonist   Cannibalism   Carefree Protagonist   Caring Protagonist   Character Growth   Clever Protagonist   Conflicting Loyalties   Couple Growth   Cultivation   Death of Loved Ones   Depictions of Cruelty   Devoted Love Interests   Doting Love Interests   Fallen Nobility   Famous Protagonist   First Love   Flashbacks   Gambling   Generals   Ghosts   God Protagonist   Goddesses   Godly Powers   Gods   Handsome Male Lead   Hard-Working Protagonist   Hated Protagonist   Heaven   Helpful Protagonist   Hiding True Identity   Immortals   Kingdoms   Long Separations   Love Interest Falls in Love First   Lovers Reunited   Mysterious Past   Mystery Solving   Obsessive Love   Past Plays a Big Role   Past Trauma   Polite Protagonist   Politics   Poor Protagonist   Power Couple   Pragmatic Protagonist   Proactive Protagonist   Quirky Characters   Revenge   Royalty   Sealed Power   Secret Crush   Secret Identity   Secrets   Selfless Protagonist   Sentient Objects   Slow Romance   Smart Couple   Strong Love Interests   Suicides   Teamwork   Torture   Tragic Past   Unconditional Love   Unlucky Protagonist   Wealthy Characters   ",
	"rating": "(4.7 / 5.0, 2275 votes)",
	"author": "Mò Xiāng Tóngxiù   墨香铜臭   ",
	"year": "\n2017",
	"ranking": "#1768   #662   #407   #1513   #40   ",
	"reviewcount": "440 Reviews",
	"description": "Eight hundred years ago, Xie Lian was the Crown Prince of the Xian Le kingdom. He was loved by his citizens and was considered the darling of the world. He ascended to the Heavens at a young age; however, due to unfortunate circumstances, was quickly banished back to the mortal realm. Years later, he ascends again–only to be banished again a few minutes after his ascension.\n\nNow, eight hundred years later, Xie Lian ascends to the Heavens for the third time as the laughing stock among all three realms. On his first task as a god thrice ascended, he meets a mysterious ghost who rules over the ghosts and terrifies the Heavens, yet, unbeknownst to Xie Lian, this ghost king has been paying attention to him for a very, very long time.>"
}