{
	"url": "https://www.novelupdates.com/series/harmless-obsession-for-the-captivating-male-lead/",
	"title": "Harmless Obsession for the Captivating Male Lead - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/11/HarmlessObsessionfortheCaptivatingMaleLead.jpg",
	"noveltype": "(KR)",
	"genre": "Adult   Fantasy   Josei   Mature   Romance   ",
	"tags": "Beautiful Female Lead   Dense Protagonist   Doting Love Interests   Doting Older Siblings   European Ambience   Female Protagonist   First-time Interc**rse   Handsome Male Lead   Love Interest Falls in Love First   Magic   Male Yandere   Mob Protagonist   Nobles   Obsessive Love   Possessive Characters   Reincarnated in Another World   Reincarnation   Strong Love Interests   Villainess Noble Girls   Yandere   ",
	"rating": "(4.1 / 5.0, 122 votes)",
	"author": "Sisse   시세   ",
	"year": "\n2020",
	"ranking": "#4617   #3772   #2444   #1217   #1286   ",
	"reviewcount": "18 Reviews sorted by",
	"description": "I reincarnated as the villain’s younger sister who will be killed by the male lead. It was a forgone conclusion that my brother and I will die to the male lead if my brother continued his evil ways. So, I tried to live quietly while trying to change my wicked brother, but for some reason the male lead was lying in front of our villa? I couldn't let him die, so at first I helped him up, but…the male lead’s condition was a bit strange.\n\nWait a minute…did it start already? The male lead’s mana congestion? There was only one way to calm the raging mana within the male lead’s body. Immediate physical contact…\n\nBut that’s the female lead’s job!\n\nAren’t I the villain’s sister? Why me?! What the hell is going on?!\n\n“Rose…Please, I need you. Save me…”\n\nThis is driving me crazy…I can’t turn a blind eye to the dying male lead, and there’s not enough time to find the female lead!\n\n…Gosh, I don’t know!\n\nLet’s save the male lead first! I’ll help him, then we'll part ways once I find the female lead! I quietly approached him and we kissed. But as if that alone wasn't enough, with a deep sigh, he spoke.\n\n“Let’s have a deeper relationship.”\n\n“Deeper…relationship?”\n\n“Kissing, and other things…”\n\nHe looked at me sorrowfully. I couldn’t take my eyes off this great beauty when he looked at me in such a somber way. Blinking my eyes absentmindedly, I inadvertently nodded my head. Then, he pulled me in and locked his arms. With a dazzling gaze and a bright smile, he spoke.\n\n“Rose, you’re my first.”\n\nNo, I can’t be your first time!>"
}