{
	"url": "https://www.novelupdates.com/series/accidentally-married-a-man-full-of-vinegar/",
	"title": "Accidentally Married a Man Full of Vinegar - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/12/Accidentally-Married-a-Man-Full-of-Vinegar.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Drama   Romance   Yaoi   ",
	"tags": "Adapted to Drama CD   Businessmen   Early Romance   Familial Love   Family   Handsome Male Lead   Heartwarming   Jealousy   Marriage   Marriage of Convenience   Older Love Interests   Possessive Characters   Protagonist Falls in Love First   Stoic Characters   ",
	"rating": "(4.4 / 5.0, 98 votes)",
	"author": "Yi Mei Niukou   一枚纽扣   ",
	"year": "\n2019",
	"ranking": "#714   #591   #3134   #1800   #2737   ",
	"reviewcount": "16 Reviews sorted by",
	"description": "On a certain day, Chu Yi, feeling quite peculiar, goes to a bar for a drink and ends up drastically changing his life.\n\nUnspeakable deeds were done and he accidentally picks up a husband.\n\nIt was quite a coincidence that this husband of his turned out to be a senior from his school, the one who people call a ‘mountaintop flower’.\n\nHowever, he didn’t expect that this aloof and hard-to-approach husband of his to not only flirt without batting an eye but also love eating vinegar (getting jealous).\n\nWhen he talks to others, his husband eats vinegar.\n\nWhen he laugh with others, his husband eats vinegar.\n\nWhen he compliment others, his husband eats vinegar.\n\nEven when he post about anything related to others on his Moments on WeChat, his husband eats vinegar.\n\nChu Yi understood later that his husband should be pampered, and should be the only one in his heart.\n\n—\n\nQin Yiheng has always lived his life the way he planned and he has never strayed off from his plans. Until one day, he met a certain person in a bar and certain things happened.\n\nIn a responsible manner, he decided to marry this person, brought them back home and included him in his plans. He was ready to live a life of mutual respect with this person.\n\nHowever, he didn’t expect that the husband he picked up would actually make him so addicted.>"
}