{
	"url": "https://www.novelupdates.com/series/learning-god-in-hand-i-have-the-world/",
	"title": "Learning God in Hand, I Have the World - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/02/Learning-God-in-Hand-I-Have-the-World.jpg",
	"noveltype": "(CN)",
	"genre": "Drama   Fantasy   Romance   Yaoi   ",
	"tags": "Ancient China   Black Belly   Business Management   Calm Protagonist   Carefree Protagonist   Character Growth   Charismatic Protagonist   Charming Protagonist   Clever Protagonist   Cosmic Wars   Cruel Characters   Cunning Protagonist   Doting Love Interests   Evil Gods   First Love   Genius Protagonist   God-human Relationship   Godly Powers   Gods   Hackers   Handsome Male Lead   Interdimensional Travel   Level System   Love Interest Falls in Love First   Medical Knowledge   Mind Control   Mob Protagonist   Modern Day   Modern Knowledge   Omegaverse   Outer Space   Post-apocalyptic   Power Couple   Protagonist Strong from the Start   Shameless Protagonist   Smart Couple   Strong Love Interests   System Administrator   Time Travel   Transmigration   Unconditional Love   Vampires   War Records   Wars   World Hopping   Zombies   ",
	"rating": "(4.3 / 5.0, 58 votes)",
	"author": "Casanovanic Bookworm   Feng Liu Shu Dai   風流書呆   风流书呆   ",
	"year": "\n2021",
	"ranking": "#2463   #3165   #5874   #6711   #7839   ",
	"reviewcount": "15 Reviews sorted by",
	"description": "System 7480 was conquered by its own host and became the s*ave of the other party. But it doesn’t matter, the 7480 that can choose to go through the world independently has a thousand mission scenarios to kill the host, so as to get rid of the fate of being controlled. \n\nWeak chicken fighting five scum? Great, send you to the apocalypse!\n\nA few years later, the weak chicken transformed the apocalypse into a new world where technology is prosperous. \n\nThe weak chicken has low emotional intelligence and is disgusting? That’s great, I’ll send you to the heartthrob Mary Sue who ran with the ball and gave birth to a talented son as a pick-up man, and then let the overbearing president and the man kill you because of jealousy! \n\nAs a result, the weak chicken is more talented than the genius son of the heroine who kills the Quartet, and makes the overbearing president kneel down and call Dad in minutes. \n\nWeak chickens are afraid of getting dirty, tired, afraid of death, and only greedy for enjoyment? Very good! Send you to the battlefield as a deserter, and let the strategist male lead kill you! As a result, within a few years, the lord, who was assisted by a weak chicken, was invincible in all battles, and soon unified the divided continent. \n\nAfter changing N mission scenarios, 7480, who failed to kill the host, finally found a truth – the host’s name is not called Weak Chicken, it is called Learning God, Learning God is invincible!>"
}