{
	"url": "https://www.novelupdates.com/series/after-the-rebirth-of-the-wealthy-young-master-who-was-replaced/",
	"title": "After The Rebirth Of The Wealthy Young Master Who Was Replaced - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/10/After-The-Rebirth-Of-The-Wealthy-Young-Master-Who-Was-Replaced.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Romance   Yaoi   ",
	"tags": "Abandoned Children   Black Belly   Cold Love Interests   Complex Family Relationships   Cunning Protagonist   Family Conflict   Handsome Male Lead   Modern Day   Multiple Reincarnated Individuals   Past Plays a Big Role   Past Trauma   Reincarnation   Revenge   Schemes And Conspiracies   Second Chance   Secret Organizations   Torture   Tragic Past   ",
	"rating": "(3.9 / 5.0, 28 votes)",
	"author": "芝芝麻酱   ",
	"year": "\n2020",
	"ranking": "#3802   #2000   #7809   #7589   #7221   ",
	"reviewcount": "5 Reviews sorted by",
	"description": "The Zhan family was wealthy and noble. Zhan Wuyou was the only child of the Zhan family. He could live a smooth life, but his father made mistakes that every scumbag would make. He hooked up with a terrible xiao san (mistress).\r\n\r\nXiao san came from a 'special area'. In order to be with Zhan's father, she kidnapped Zhan Wuyou and transformed her and Zhan's father's children into Zhan Wuyou's appearance so he could become the only young master of the Zhan family.\r\n\r\nHis mother was sent to a mental hospital by the two of them and he was thrown into a special department and became a dog without fangs in the Zhan family.\r\n\r\nBecause the fake young master offended the big guy, he was driven to replace the fake young master to make amends, and finally he fell in love with the big guy.\r\n\r\nHe didn't want his lover to die tragically because of him. His life was completely ruined by the mother and son. Once reborn, he returned to his lover's bed. At this time his lover was still young and powerful, the eyes that looking at him were harsh, 'Dare to climb my bed, who gives you the courage! Get off!'\r\n\r\nZhan Wuyou: '...' There was a kind of feeling don't ask me to go on!\r\n\r\n>"
}