{
	"url": "https://www.novelupdates.com/series/desharow-merman/",
	"title": "Desharow Merman - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/06/Theme-pic.jpg",
	"noveltype": "(CN)",
	"genre": "Adult   Fantasy   Horror   Psychological   Romance   Sci-fi   Smut   Supernatural   Yaoi   ",
	"tags": "Adapted to Drama CD   Aliens   Appearance Changes   Black Belly   Brainwashing   Cannibalism   Character Growth   Conflicting Loyalties   Cruel Characters   Curious Protagonist   Dark   Death   Depictions of Cruelty   Determined Protagonist   Devoted Love Interests   Fantasy Creatures   Gore   Half-human Protagonist   Handsome Male Lead   Hard-Working Protagonist   Human-Nonhuman Relationship   Incest   Love Interest Falls in Love First   Love Rivals   Male Yandere   Mystery Solving   Mythical Beasts   Possessive Characters   R*pe Victim Becomes Lover   R*pe   S*xual Abuse   Shapeshifters   Thriller   Wars   Weak to Strong   ",
	"rating": "(4.0 / 5.0, 149 votes)",
	"author": "Mr. Deep Sea   深海先生   ",
	"year": "\n2014",
	"ranking": "#4265   #4786   #1938   #2904   #1403   ",
	"reviewcount": "32 Reviews sorted by",
	"description": "In order to fulfill his lifelong wish and graduation project of researching merfolks, Desharow, a student of Biology Department of Russian Maritime Academy, went on a long distance voyage with his mentor, Rhine, and caught a special species of male Merfolk in Iceland. Little did he know that this mysterious dark and evil creature had long since regarded him as his “prey” (cough cough spouse) and had been invading his body, leading to an unexpected trigger to a thrilling conflict.\n\nIn the end, can the merman’s instinctive desire prevail or not, and will the research of Desharow proceed smoothly under the obstruction of his mentor with the same misguided idea? What is the real purpose of the investigation that seems to be hidden in the presence of military forces when a terrifying conspiracy dating back to World War II begins to emerge….?\n\nWith the development of the research and the frequent occurrence of various dangerous incidents at sea, emotional struggle, and instinctive love, Desharow soon discovers some incredible connection toward the evil black-scaled merman and how his body has undergone some unique alteration.>"
}