{
	"url": "https://www.novelupdates.com/series/im-actually-really-rich/",
	"title": "I’m Actually Really Rich - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/09/Im-Actually-Really-Rich.jpg",
	"noveltype": "(CN)",
	"genre": "Romance   Slice of Life   ",
	"tags": "Beautiful Female Lead   Businessmen   College/University   Doting Love Interests   Familial Love   Family Business   Female Protagonist   Handsome Male Lead   Misunderstandings   Modern Day   Protagonist Strong from the Start   Wealthy Characters   ",
	"rating": "(4.4 / 5.0, 9 votes)",
	"author": "南风北寄   ",
	"year": "\n2020",
	"ranking": "#1944   #1646   #10771   #3732   #10005   ",
	"reviewcount": "2 Reviews sorted by",
	"description": "Wen Le’s grandfather was a revered literary writer who escaped to the mountains for inspiration and has lived there for over 10 years.\n\nEver since she was a child, Wen Le has lived in the mountains with her grandparents. Only upon attending school did Wen Le discover that they only had a black and white TV while her friends all had LED ones.\n\nThus the young Wen Le who matured early knew that they were poor and that she had to work hard. However, Wen Le gradually realized that something felt a bit odd. Wen Le hesitantly gave her grandfather a call.\n\n“Yeye*, when I passed the university entrance exam, what are the two keys that you and Dad gave to me for?”\n\n[Yeye – a term to refer to one’s paternal grandfather]\n\nGrandpa snorted in reply, “I gave you a courtyard house, and your dad gave you a building.”\n\nWen Le trembled in trepidation, “Then what about that document which Dad got me to sign a few days ago?”\n\nGrandpa snorted, “How would I know? But your Dad recently bought a gem mine.”\n\nWen Le cautiously asked, “Yeye, is our family really not poor?”\n\nGrandpa got so angry and scolded her for being s*upid.\n\nAfter Wen Le got together with the school crowned hunk Zhou Kao, who was cold to everyone, it shook the entire school. Zhou Kao was a wealthy young master from birth, and Wen Le was only a poor child from the mountains. With their social status deemed unfavorably matched, Wen Le was deemed as a scheming girl who wanted to marry into wealth. \n\nUntil someone secretly recorded the interaction between the two of them. In the video, Zhou Kao had unexpectedly backed Wen Le up to a secluded corner. He played with Wen Le’s long hair, “It’s said that this jewel that’s currently on you is worth millions but was bought from a street stall for $20?”\n\nWen Le smiled: “The stall owner was probably my Dad.”\n\n“However…” Wen Le raised Zhou Kao’s chin and looked at him with her seductive eyes, “How much are you selling this ten million beauty for?”\n\nReputed as being hellishly difficult, Zhou Kao, the famed hunk whom nobody could successfully chase, was infatuated. He leaned down for a kiss, and with a raspy voice said, “I’ll give it to you for $10.”\n\nWen Le dodged the kiss with a laugh, “Isn’t $10 a little expensive?”\n\nZhou Kao clenched his teeth, and directly kissed her, “I’ll bear a deficit of $10.”\n\nThe whole school was SHOCKED!\n\n[A beautiful top student who thought her family was poor but is actually wealthy X A handsome tycoon who has been in love with her for many years] >"
}