{
	"url": "https://www.novelupdates.com/series/transmigration-raising-the-child-of-the-male-lead-boss/",
	"title": "Transmigration: Raising the Child of the Male Lead Boss - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/08/Transmigration-Raising-the-Child-of-the-Male-Lead-Boss.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Fantasy   Romance   Slice of Life   ",
	"tags": "Acting   Arrogant Characters   Beautiful Female Lead   Bickering Couple   Bullying   Carefree Protagonist   Caring Protagonist   Celebrities   Childcare   Childish Protagonist   Clumsy Love Interests   Cold Love Interests   Complex Family Relationships   Confident Protagonist   Couple Growth   Cunning Protagonist   Cute Children   Cute Protagonist   Dense Protagonist   Determined Protagonist   Devoted Love Interests   Doting Love Interests   Familial Love   Family   Famous Parents   Famous Protagonist   Female Protagonist   Handsome Male Lead   Heartwarming   Hot-blooded Protagonist   Human-Nonhuman Relationship   Jealousy   Lack of Common Sense   Misunderstandings   Modern Day   Multiple POV   Naive Protagonist   Narcissistic Protagonist   Playful Protagonist   Popular Love Interests   Possessive Characters   Power Couple   Pregnancy   Previous Life Talent   Protagonist Falls in Love First   Protagonist Strong from the Start   Quirky Characters   Seduction   Shameless Protagonist   Showbiz   Slow Romance   Transmigration   Tsundere   Underestimated Protagonist   Villainess Noble Girls   Wealthy Characters   ",
	"rating": "(4.3 / 5.0, 478 votes)",
	"author": "Salted Lobster   盐焗大龙虾   ",
	"year": "\n2019",
	"ranking": "#247   #390   #317   #615   #258   ",
	"reviewcount": "110 Reviews sorted by",
	"description": "Yu Yaoyao was a snake spirit who died by lightning and as a result, transmigrated to a novel she had read in her past life. This third-rate actress had the same name as her, but then she remembered she was only a pitiful cannon fodder in the novel she had read.\n\nThis obscure actress’s life was riddled with scandals, and as a result, her diamond husband left her. She then hit the rock bottom of her career and ultimately became paralyzed by an accident. Not to mention, she had neglected her child, leading him to an early death.\n\nGraced with a new life, Yu Yaoyao is determined to steer her path away from the plot’s death flags. She’ll be the best wife, the most loving mother and she’ll rise to the top of the entertainment industry!>"
}