{
	"url": "https://www.novelupdates.com/series/the-vicious-supporting-role-only-wants-to-debut-as-center/",
	"title": "The Vicious Supporting Role Only Wants to Debut as Center - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/01/The-Vicious-Supporting-Role-Only-Wants-to-Debut-as-Center.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Harem   Romance   Yaoi   ",
	"tags": "Celebrities   Clever Protagonist   Dense Protagonist   Different Social Status   Doting Love Interests   Doting Older Siblings   Dreams   Enemies Become Lovers   Famous Protagonist   Handsome Male Lead   Love Interest Falls in Love First   Misunderstandings   Modern Day   Previous Life Talent   Showbiz   Siblings   Singers   Slow Romance   Transmigration   Underestimated Protagonist   Wealthy Characters   ",
	"rating": "(3.6 / 5.0, 57 votes)",
	"author": "凉白开开   ",
	"year": "\n2020",
	"ranking": "#5262   #6164   #5296   #10478   #4582   ",
	"reviewcount": "15 Reviews sorted by",
	"description": "Ji Zeyu was a professional at participating in talent shows in his past life. He had real skills, but he didn’t have good looks and a powerful backer. After being the useless “background” in multiple talents shows for seven to eight years, he died in a car crash. After his death, he transmigrated into a feel-good BL web novel about the entertainment circle, and he became a vicious male supporting character who had the same name as he did.\r\n\r\nIn the original novel, the vicious side role had handsome looks and body type, not to mention his famous family background. The only thing was, his brain malfunctioned a lot. Not only did he try to use the ‘unspoken rule’ on the male gong, Lu Nanyun, but he also pushed the male shou, Wei Yichen, down the stage during a rehearsal.\r\n\r\nThe night before the debut announcement, his terrible acts got exposed, and he lost his privilege to debut, becoming the stepping stone for the main characters. His past fans even poured sulfuric acid on him as revenge.\r\n\r\nWhen he transmigrated, Ji Zeyu was about to implement the ‘unspoken rule’ on Lu Nanyun while Lu Nanyun’s hidden camera was about to capture everything.\r\n\r\nHe was initially planning to follow the storyline and get out of the place.\r\n\r\nThen abruptly, a ring came from his phone —\r\n\r\nHis oldest brother sent a message: “If you can debut, you will get the spot as the male lead in this big film.”\r\n\r\nHis second brother sent a message: “If you can debut, these private islands are all yours to pick from.”\r\n\r\nHis sister sent a message: “If you can debut, you will be on the covers of these three top magazines.”\r\n\r\nJi Zeyu, who had just experienced what it was like to have a powerful background for the first time, joyfully kicked Lu Nanyun aside.\r\n\r\nLu Nanyun: “Didn’t you say you want to sleep with me?”\r\n\r\nJi Zeyu: “Sorry, you’re not worthy of me.”\r\n\r\nLu Nanyun: “… Come back here!”\r\n\r\nJi Zeyu left without turning back. He decided to stay away from the original main characters and fulfill his previous life’s dream of becoming a superstar.>"
}