{
	"url": "https://www.novelupdates.com/series/a-guide-to-raising-your-natural-enemy/",
	"title": "A Guide to Raising Your Natural Enemy - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/09/A-Guide-to-Raising-Your-Natural-Enemy.png",
	"noveltype": "(CN)",
	"genre": "Adventure   Comedy   Romance   Sci-fi   Slice of Life   Yaoi   ",
	"tags": "Animal Characteristics   Appearance Different from Actual Age   Carefree Protagonist   Caring Protagonist   Childish Protagonist   Cultivation   Cute Protagonist   Cute Story   Dense Protagonist   Devoted Love Interests   Doting Love Interests   First-time Interc**rse   Futuristic Setting   Handsome Male Lead   Hard-Working Protagonist   Heavenly Tribulation   Humanoid Protagonist   Kind Love Interests   Lack of Common Sense   Language Barrier   Love Interest Falls in Love First   Manipulative Characters   Master-Disciple Relationship   Modern Knowledge   Mpreg   Naive Protagonist   Narcissistic Protagonist   Outer Space   Phobias   Proactive Protagonist   Shapeshifters   Strong Love Interests   Survival   Transported to Another World   Underestimated Protagonist   ",
	"rating": "(4.5 / 5.0, 736 votes)",
	"author": "Jué Jué   决绝   ",
	"year": "\n2016",
	"ranking": "#754   #847   #442   #522   #209   ",
	"reviewcount": "161 Reviews",
	"description": "As long as hamster spirit Shu Shu can survive the lightning tribulation, then his cultivation will be able to turn him into a human. In the end, the lightning tribulation strikes him and he arrives in the… future?\n\nIn order to avoid people and being mistaken for a monster, Shu Shu decides to dig a hole in the forest to hide and live, and as a result… a very big snake aaaahhhh! Please, don’t eat me!\n\nThe crown prince of the beast empire is seriously injured and becomes a beast that could no longer change into human form. He lives alone in the forest. One day, he sees a cute sub beastman deep in the forest. The sub beastman also sees him. At once, the sub beastman’s eyes roll backwards and he faints…. Scared to death?\n\nShu Shu: I have a unique technique of faking death.>"
}