{
	"url": "https://www.novelupdates.com/series/after-the-rebirth-of-the-film-emperor/",
	"title": "After the Rebirth of the Film Emperor - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/03/After-the-Rebirth-of-the-Film-Emperor.png",
	"noveltype": "(CN)",
	"genre": "Comedy   Drama   Yaoi   ",
	"tags": "Acting   Fat to Fit   Love Interest Falls in Love First   Misunderstandings   Modern Day   Older Love Interests   Second Chance   Showbiz   ",
	"rating": "(3.4 / 5.0, 36 votes)",
	"author": "风露沁酒   ",
	"year": "\n2021",
	"ranking": "#6970   #6280   #5782   #5008   #6203   ",
	"reviewcount": "3 Reviews sorted by",
	"description": "When the 32 year old Wen Che received his sixth “Best Male Lead” award, he got into an accident and was reborn as the 22 year old Ji Zhinong.\n\nJi Zhinong had just returned to his wealthy family but was ditched at his wedding by the fake young master’s show of pitifulness, becoming a complete laughingstock.\n\nHis family members cold, his career path obstructed, he could only save himself.\n\nFirst he had to find someone whose coattails he could latch onto.\n\nLi Shaoyao: “I see the shadow of my beloved in you.”\n\nJi Zhinong: “Huh?”\n\nJi Zhinong, focused on making money, accepted the role of acting as a substitute. He was always clear that in and outside the acting, he only sought self-protection, not true love.\n\nBut Li Shaoyao was very earnest. When Ji Zhinong was forced into the eye of the storm of criticism, disdained by thousands because of the scandals of the original owner of the body, Li Shaoyao said, “The one dating him is me.”\n\nAnd then he proposed marriage for legal status.\n\nJi Zhinong: ???\n\nThis marriage didn’t last very long. Li Shaoyao, who was the best at lying to himself, brought up divorce.\n\nSix Months Later\n\nBig Boss Li took great pains to make a variety show tailor-made for himself: We Remarried\n\nEmcee: “Why did you come to participate in this variety show?”\n\nJi Zhinong was stubborn. “For company resources.”\n\n Li Shaoyao: “To pursue my wife.”\n\nThe year Wen Che got into an accident and passed away, the outside world was all paying attention to his family members, his fiancé, his managing team for their reactions. No one knew that the young master of the Li family who was unrelated to Wen Che had previously gone crazy for three months upon seeing the obituary.>"
}