{
	"url": "https://www.novelupdates.com/series/im-the-mc-why-do-i-suck-at-cultivation/",
	"title": "I’m the MC, Why Do I Suck at Cultivation - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/07/mcsuckatcultivation1b.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Harem   Xuanhuan   ",
	"tags": "Acting   Adapted to Manhua   Adventurers   Buddhism   Calm Protagonist   Charismatic Protagonist   Charming Protagonist   Clever Protagonist   Confident Protagonist   Cultivation   Cunning Protagonist   Dao Comprehension   Daoism   Demons   Destiny   Enlightenment   Famous Protagonist   Genius Protagonist   Handsome Male Lead   Heavenly Tribulation   Immortals   Lucky Protagonist   Male Protagonist   Mature Protagonist   Misunderstandings   Modern Knowledge   Overpowered Protagonist   Parody   Pragmatic Protagonist   Proactive Protagonist   Saints   Schemes And Conspiracies   Sect Development   Shameless Protagonist   Transmigration   Transported to Another World   Trickster   Unrequited Love   Weak Protagonist   World Travel   ",
	"rating": "(3.6 / 5.0, 41 votes)",
	"author": "Dark Knight   黑夜弥天   ",
	"year": "\nN/A",
	"ranking": "#2000   #6382   #6558   #6112   #12857   ",
	"reviewcount": "9 Reviews sorted by",
	"description": "Lu Changsheng is depressed.\n\nIn this world full of cultivators and immortals, because of his face and irresistible fine bearing as a protagonist, women fall in love with him within three seconds. Unusual heavenly phenomena occur to celebrate his breakthroughs. His literary talent can easily shock all scholars and his random citations are eulogized by the heaven and earth. Legendary beasts offer themselves as mounts, celestial treasures throw themselves into his pockets.\n\nHowever, there is one thing he does not understand.\n\nHe’s the main character, the protagonist, the MC! Why does his cultivation suck?\n\nAlso known as “Super Ultra Ordinary and Average Eldest Senior Brother,” “Why Am I Still the MC Even When I Suck at Cultivation,” “My Good-looking Face But Hopeless Cultivation.”>"
}