{
	"url": "https://www.novelupdates.com/series/i-opened-a-clinic-in-the-apocalypse/",
	"title": "I Opened a Clinic in the Apocalypse - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/11/I-Opened-a-Clinic-in-the-Apocalypse.png",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Fantasy   Sci-fi   Shounen Ai   Supernatural   ",
	"tags": "Antihero Protagonist   Apathetic Protagonist   Apocalypse   Cold Protagonist   Comedic Undertone   Doctors   Farming   Healers   Love Interest Falls in Love First   Manly Gay Couple   Overpowered Protagonist   Power Couple   Power Struggle   Resurrection   Revenge   Romantic Subplot   Secret Identity   Slow Romance   Smart Couple   Special Abilities   Strong Love Interests   Strong to Stronger   Survival   Zombies   ",
	"rating": "(4.2 / 5.0, 55 votes)",
	"author": "沧海犹蓝   ",
	"year": "\n2020",
	"ranking": "#1969   #1897   #4291   #3146   #3759   ",
	"reviewcount": "14 Reviews sorted by",
	"description": "Wen QingLing, as a wood and psychic type ability user, was sabotaged by his cousin at a critical moment and was pushed out to block zombies. He was bitten and his teammates fled.\n\nHe decided to find an auspicious place to die.\n\nBut while he didn’t die, the zombies around him did.\n\nWen QingLing, “???”\n\nYes, Wen QingLing became a zombie, but he mutated.\n\nHe breathed, had a heartbeat, and had consciousness, there was practically no difference between him and humans.\n\nHe had authority over zombies, his wounds healed themselves, and where his blood was spilled, life was restored.\n\nWen QingLing returned home to help his zombie parents regain their consciousness and restored their decomposing bodies back to their original appearance.\n\nThey opened a clinic in the City of Zombies, and would only treat zombies or infected people. All it cost was nuclei.\n\nNews that living people lived in the City of Zombies spread like wildfire.\n\nSomeone said, “There is a clinic that only treats zombies.”\n\nAnother person said, “There is a doctor that can heal the infected.”\n\nThere was another who said, “The living people there are all those who were saved after becoming zombies.”\n\nThe survivors went crazy, they all went looking for their zombified relatives in hopes of a miracle.>"
}