{
	"url": "https://www.novelupdates.com/series/yu-wu/",
	"title": "Yu Wu - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/05/006zgIkkly1fz7dvoq8ebj30q0126q5f.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adult   Drama   Fantasy   Romance   Smut   Xianxia   Yaoi   ",
	"tags": "Amnesia   Ancient China   Anti-social Protagonist   Aristocracy   Arrogant Characters   Betrayal   Character Growth   Clever Protagonist   Cold Protagonist   Comedic Undertone   Conflicting Loyalties   Corruption   Couple Growth   Cruel Characters   Dark   Death   Death of Loved Ones   Debts   Demons   Depictions of Cruelty   Different Social Status   Discrimination   Drugs   Enemies Become Lovers   Famous Protagonist   First Love   First-time Interc**rse   Flashbacks   Friends Become Enemies   Generals   Ghosts   Gore   Handsome Male Lead   Honest Protagonist   Kind Love Interests   Loneliness   Loner Protagonist   Long Separations   Lovers Reunited   Magic   Magic Formations   Manly Gay Couple   Military   Mysterious Past   Mystery Solving   Near-Death Experience   Non-linear Storytelling   Obsessive Love   Older Love Interests   Past Plays a Big Role   Personality Changes   Politics   Possessive Characters   Prostit**es   Protagonist Strong from the Start   Revenge   Royalty   R*pe   Schemes And Conspiracies   Secret Relationship   Seme Protagonist   S*aves   Slow Romance   Social Outcasts   Soldiers   Spirits   Strategic Battles   Strong Love Interests   Strong to Stronger   Tragic Past   Wars   Wealthy Characters   ",
	"rating": "(4.5 / 5.0, 350 votes)",
	"author": "Meatbun Doesn't Eat Meat   肉包不吃肉   ",
	"year": "\n2018",
	"ranking": "#493   #2656   #1776   #4351   #605   ",
	"reviewcount": "72 Reviews sorted by",
	"description": "The traitorous general Gu Mang was returning to his homeland. Everyone wanted to see him dead, and it was said that the one who hated him most was his former best friend—the cold and ascetic Young Master Mo. \n\nThe rumours said: Young Master Mo prepared three hundred and sixty-five methods of torture to interrogate him with, just waiting to try them out on Gu Mang. They were so varied it was more than enough to toy with him for a year without repetition. \n\nExcept these rumours were very quickly forbidden by Young Master Mo. The reason given was that they described him as a lunatic, and were severely inconsistent with reality.\n\nSo what was the truth?\n\nThe truth was even more unspeakable—\n\nMo Xi’s identity: the most abstinent commander of the empire.\n\nHis relationship with the traitor Gu Mang: they’d slept together before.>"
}