{
	"url": "https://www.novelupdates.com/series/god-bless-your-ruin/",
	"title": "God Bless Your Ruin - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/04/God-Bless-Your-Ruin.jpg",
	"noveltype": "N/A",
	"genre": "Drama   Fantasy   Mystery   Romance   ",
	"tags": "Aristocracy   Confinement   Different Social Status   European Ambience   Female Protagonist   First-time Interc**rse   Love Triangles   Nobles   Obsessive Love   Possessive Characters   Pregnancy   ",
	"rating": "(4.2 / 5.0, 12 votes)",
	"author": "Fiorenti   피오렌티   ",
	"year": "\n2021",
	"ranking": "#2000   #4117   #10561   #7242   #8733   ",
	"reviewcount": "2 Reviews sorted by",
	"description": "Angie, a girl who grew up in an earthly paradise where everything is perfect.\r\n\r\nOne day, she is invited to Blackrell Mansion as a companion of the young veiled master.\r\n\r\n'... Who are you?'\r\n\r\nThe existence beyond the veil she met there, Kyle. Unlike Angie, who is full of emotion, his reaction is cold, but....\r\n\r\n'I'm here to tell you a story.'\r\n\r\nAngie takes a step closer to the boy who can't get sunlight or go outside, telling the story she imagined.\r\n\r\nThe more time they spent together, the more they were drawn to each other, but the love she thought would last forever.\r\n\r\n'Stop. Don't come.'\r\n\r\n'I'll explain everything to you, Angie. Listen to me. Trust me...!'\r\n\r\nThe secret he'd been hiding was shattering....\r\n\r\n                                                             ...\r\n\r\n'When I come back... be my wife. That's the gift I want.'\r\n\r\nThe soft bed rocked heavily and a strong shadow immediately covered Angie's body. Angie gasped.\r\n\r\n'You love me too, Angie. As long as you wait for me...you'll find out.'\r\n\r\nWhen Kyle took her tongue and sucked on it, Angie's eyelashes trembled convulsively. The blood rushed to her head and the warning sounded.\r\n\r\nUnder the exhilarating pleasure and excitement, her mind quickly became fuzzy.\r\n\r\nAn intense ecstasy enveloped her entire body with a force that would take even her soul.\r\n\r\nAngie closed her eyes Is this... a dream? If it is a dream, she would never want to wake up.\r\n\r\nA girl clearer and happier than anyone else in the world, a boy noble and unhappy, they met like this.\r\n>"
}