{
	"url": "https://www.novelupdates.com/series/lets-finish-what-we-started/",
	"title": "Let’s Finish What We Started! - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/06/Lets-Finish-What-We-Started.jpg",
	"noveltype": "(KR)",
	"genre": "Drama   Fantasy   Romance   ",
	"tags": "Aristocracy   Arranged Marriage   Beautiful Female Lead   Calm Protagonist   Clever Protagonist   Clumsy Love Interests   Confident Protagonist   Cunning Protagonist   Curses   Determined Protagonist   Empires   European Ambience   Famous Protagonist   Fearless Protagonist   Female Protagonist   Handsome Male Lead   Hard-Working Protagonist   Hot-blooded Protagonist   Kind Love Interests   Marriage   Mature Protagonist   Nobles   Playful Protagonist   Protagonist Strong from the Start   Quirky Characters   Revenge   Royalty   Shameless Protagonist   Sharp-tongued Characters   Shy Characters   Slow Romance   Strong Love Interests   Stubborn Protagonist   Sword Wielder   Transmigration   Underestimated Protagonist   Villainess Noble Girls   Younger Love Interests   ",
	"rating": "(4.1 / 5.0, 34 votes)",
	"author": "유다루   ",
	"year": "\n2021",
	"ranking": "#6970   #2000   #7721   #9319   #5879   ",
	"reviewcount": "3 Reviews sorted by",
	"description": "She possessed the body of a side character who was suffering because of her toxic fiancée.\n\nAs soon as she realized she transmigrated into the novel, she went to her (ex) fiancée and threw a tantrum.\n\nThen she got married with the cursed male lead, Apollyon, who was also known as the Monster Archduke, which was her favorite character in the novel.\n\nPeople ridiculed her when they heard she got married to the Monster Archduke.\n\nBecause of the curse which covered his face, Apollon had to cover his face with a mask.\n\nBut no one could ever know.\n\nThe beauty that’s hidden behind the mask.\n\nThe fact that Apollon is actually so handsome!\n\nThe way to break his curse was more simple than she would have thought.\n\nHaving both mental and physical love!\n\nThe curse could only be lifted when both were together.\n\nTwo years before the heroine appeared.\n\nAll she had to do to lift his curse was to work hard during these 2 years.\n\nHis curse would be lifted if he loved her.\n\nAnd she too would be happy and be with a handsome man.\n\nWasn’t this killing two birds with one stone?\n\nWell,\n\n“My lady, I-I, I’m not ready yet…”\n\n“You were the one who proposed to me. Don’t couples do this thing all the time?”\n\n“…”\n\n“We are married. We have to fulfill the obligations of couples.”\n\nThe male lead was way too shy than she had thought.\n\nShe wasn’t trying to satisfy her needs, but was trying to lift his curse!>"
}