{
	"url": "https://www.novelupdates.com/series/brewing-alcohol-in-another-world-for-living/",
	"title": "Brewing Alcohol in Another World for Living - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/03/Brewing-Alcohol-in-Another-World-for-Living.jpg",
	"noveltype": "(JP)",
	"genre": "Adult   Fantasy   Harem   ",
	"tags": "Fantasy World   Male Protagonist   Reincarnated in Another World   ",
	"rating": "(4.0 / 5.0, 2 votes)",
	"author": "KoSummon   The Demon King Who Hates Tragedy   悲劇を嫌う魔王   ",
	"year": "\n2022",
	"ranking": "#2000   #2000   #13002   #4792   #12450   ",
	"reviewcount": "No Reviews",
	"description": "Since childhood, the protagonist has had a keen sense of taste and smell. He devoted himself to becoming a chef, but when he came of age, he discovered alcohol. However, it turns out that the protagonist is a down-and-out drinker, and he becomes absorbed in his own shortcomings. He finds himself working at an alcohol brewery, wanting to give his mother, who loves to drink, the best alcohol.\r\n\r\nThere, he was assigned to the blender's office, taking advantage of his natural talent. However, the young protagonist, jealous of those around him, is unfairly dismissed for being a non-drinker. After everything went bankrupt, the protagonist opened a BAR in Kabukicho, where he could enjoy himself even if he could not drink alcohol. However, he is unable to break his passion for brewing alcohol, and one day he gets drunk and is hit by a truck in his drunken state and dies.\r\n\r\nThe protagonist, who was left with unfulfilled regrets, was not able to reincarnate and was supposed to be left behind in the chasm between the floating world and the real world. A god who loves alcohol takes pity on him and offers him a chance to live a life of a brewer in another world, instead of demanding alcohol as tribute.\r\n\r\nThe hero accepts the offer and transfers to another world. There, he ignites his passion for alcohol brewing, and the people of the other world are caught up in the flames of his passion. His alcohol spreads across continents and races, and it becomes a status symbol to drink his alcohol and to have it in one's cabinet at home.>"
}