{
	"url": "https://www.novelupdates.com/series/the-rebirth-of-the-general-who-always-sees-himself-as-a-replacement/",
	"title": "The Rebirth Of The General Who Always Sees Himself As A Replacement - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/02/The-Rebirth-Of-The-General-Who-Always-Sees-Himself-As-A-Replacement.jpg",
	"noveltype": "(CN)",
	"genre": "Adult   Comedy   Drama   Yaoi   ",
	"tags": "Adapted to Manhua   Ancient China   Ancient Times   Aristocracy   Comedic Undertone   Couple Growth   Doting Parents   Family Conflict   Handsome Male Lead   Long Separations   Love at First Sight   Manly Gay Couple   Marriage   Multiple Reincarnated Individuals   Past Plays a Big Role   Politics   Power Couple   Power Struggle   Revenge   Schemes And Conspiracies   Second Chance   Slow Romance   Smart Couple   Tragic Past   ",
	"rating": "(4.2 / 5.0, 37 votes)",
	"author": "Yi Yi Yi Yi   伊依以翼   ",
	"year": "\n2021",
	"ranking": "#764   #846   #5205   #2282   #4501   ",
	"reviewcount": "7 Reviews sorted by",
	"description": "In his previous life, Mu Zhiming was deceived and persecuted by the man he admired the most, dying tragically on the road of exile.\n\nAfter being reborn, he was determined to change the course of events and have a peaceful life.\n\nHowever, just when he started to seek power, come in contact with the mysteries of the Capital, a raging war, and the Princes disputing their claim to the throne; he caught a glimpse of a sincere love. Mu Zhiming fell into it, unable to stop himself.\n\nDespite that, on their wedding night, the first thing Gu Heyan said to Mu Zhiming was: “I know that I’m nothing more than his replacement.”\n\nMu Zhiming: “….?? Husband, is there something wrong with your brain?”\n\nGu Heyan: “I don’t mind.”\n\nMu Zhiming: “….”\n\nGu Heyan: “When things are over, you can go find him. I won’t pursue you.”\n\nMu Zhiming: “….”\n\nGu Heyan: “I’m willing to be used by you.”\n\nMu Zhiming: “….”\n\nGu Heyan: “I’m already satisfied with your companionship, I won’t ask for anything else.”\n\nMu Zhiming couldn’t bear it anymore and dragged Gu Heyan towards their wing room.\n\nGu Heyan: “Where are you taking me?”\n\nMu Zhiming gritted his teeth and said: “To! Consummate! Our! Marriage!”>"
}