{
	"url": "https://www.novelupdates.com/series/necromancer-survival/",
	"title": "Necromancer Survival - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/03/Necromancer-Survival.jpg",
	"noveltype": "(KR)",
	"genre": "Adventure   Drama   Fantasy   Horror   Mature   Psychological   Romance   Shounen Ai   ",
	"tags": "Adapted to Manhwa   Amnesia   Average-looking Protagonist   Betrayal   Contracts   Cruel Characters   Cute Protagonist   Dark   Depictions of Cruelty   Depression   Dungeons   Game Elements   Handsome Male Lead   Level System   Magic   Male Yandere   Modern Day   Near-Death Experience   Necromancer   Persistent Love Interests   Revenge   Servants   Slow Romance   Strong Love Interests   Summoning Magic   Torture   Tragic Past   Twisted Personality   Unreliable Narrator   Weak to Strong   ",
	"rating": "(4.3 / 5.0, 206 votes)",
	"author": "키마님   ",
	"year": "\n2019",
	"ranking": "#789   #1226   #1348   #1123   #1319   ",
	"reviewcount": "44 Reviews sorted by",
	"description": "Sometime after ‘Gates’ appeared in this world, humanity was divided into two: [User] and [ordinary human beings]\nLee-kyung was able to awaken into a user and choose a [Class]…but, in momentary misjudgement, chose to be a [Necromancer], the worst of all classes.\n\nLee-kyung, searching for the materials to evolve his skeletal servant, ‘Lackey,’ was barely able to participate in a high-level raid for [Tower of Command] Dungeon. In an accident, he falls down alone to uncover a hidden conspiracy. \n\nInjured and desperate to survive, Lee-kyung called out to anyone…and reached a vengeful spirit. “Please, I’ll do anything….Please form a contract with me and save me!” \n\n–-You’ll do anything?….\n\n[Will you accept the ‘oath’ offered by ‘Seo Dawon’?]\n–-You’ll do your best to help me achieve my revenge. And, I will do my best to save you wherever, whenever you are in danger. Is that acceptable?\n\n[Initiating a new contract with ‘Seo Dawon’]\nJunior Necromancer Choi Lee-kyung and Ranker Mage Seo Dawon’s delightful revenge play!\n\nTW: Depictions of mental health>"
}