{
	"url": "https://www.novelupdates.com/series/toy-lady/",
	"title": "Toy Lady - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/08/Toy-Lady.jpg",
	"noveltype": "(KR)",
	"genre": "Adult   Mature   Psychological   Romance   Smut   ",
	"tags": "Abandoned Children   Aristocracy   Cohabitation   Different Social Status   Empires   Female Protagonist   F*llatio   Maids   Male Yandere   Manipulative Characters   Nobles   Obsessive Love   Orphans   Politics   Possessive Characters   R-18   Royalty   ",
	"rating": "(3.9 / 5.0, 60 votes)",
	"author": "세리안   ",
	"year": "\n2020",
	"ranking": "#2318   #2108   #4926   #3518   #4419   ",
	"reviewcount": "6 Reviews sorted by",
	"description": "“I will… play with Your Highness.”\n\nEloise, who entered the palace as a maid under the order of the Empress, was trapped in a dark playroom and became the Crown Prince’s toy. Rishid, the unfortunate crown prince whose mental age had regressed and suffered from aphasia.\n\nHe was like a broken doll, but as he worked with Eloise, he gradually regained his ability to think according to his age and began to speak.\n\nHowever, the Crown Prince did not let her go and tried to tie her to stay by his side even when his illness was cured and was no longer needed as a playmate.\n\nBut as a different type of 'play.'\n\nEloise was trapped in the Crown Prince’s palace and loved by him day and night, but she was afraid that one day she would be forgotten like a toy she used to play with as a child.\n\nEventually, she escaped, taking advantage of Rishid’s carelessness…\n\n“Did you have fun playing with me?”\n\nHe had no intention to let go of his toy.\n\n* * * * *\n\n“What would they all think about when they see you? Everyone must be busy trying to get a bite, for being so naughty.”\n\nEloise shook her head frantically whenever he uttered harsh words. Tears dripped down her eyes filled with unjust light and soaked his fingers.\n\n“I'll let it go freely, and everyone in the Imperial Palace would be wagging their tails.”\n\n“…...…”\n\nEloise couldn’t answer any of his words.\n\n‘Because I didn’t know what more severe, corporal punishment would be inflicted if I did. At times like this, I know from experience that it is best to match his mood.’\n\n“You need to be disciplined,” he tilted his head.\n\n“Come up,” he said, spreading her legs wide.>"
}