{
	"url": "https://www.novelupdates.com/series/accidental-mark/",
	"title": "Accidental Mark - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/01/Accidental-Mark.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Romance   Slice of Life   Yaoi   ",
	"tags": "Acting   Adapted to Drama CD   Alternate World   Black Belly   Business Management   Businessmen   Calm Protagonist   Caring Protagonist   Celebrities   Charismatic Protagonist   Childcare   Clever Protagonist   Clingy Lover   Cute Children   Cute Story   Dense Protagonist   Devoted Love Interests   Doting Love Interests   Family Business   First Love   Handsome Male Lead   Love Interest Falls in Love First   Mature Protagonist   Misunderstandings   Modern Day   Movies   Mpreg   Multiple POV   Omegaverse   Possessive Characters   Power Couple   Proactive Protagonist   Seme Protagonist   Showbiz   Slow Romance   System Administrator   Transmigration   Unconditional Love   Younger Love Interests   ",
	"rating": "(4.7 / 5.0, 942 votes)",
	"author": "Die Zhiling   蝶之灵   ",
	"year": "\n2020",
	"ranking": "#198   #502   #630   #172   #395   ",
	"reviewcount": "224 Reviews sorted by",
	"description": "Pei Shaoze unintentionally heard about a novel called Accidental Mark. Once he woke up, he found he had transmigrated into the alpha scumbag in the book, Pei Shaoze. The omega protagonist of the novel, Cheng Xia happened to have his pheromones out of control. The original scumbag not only took the opportunity to mark the protagonist but also killed the protagonist’s parents and ruined his reputation. The protagonist was completely blackened and returned five years later to stab the scumbag to death.\n\nPei Shaoze, “……” What type of melodramatic plot was this? Why not invest well in movies and TV shows when he was the boss? His brain was used to bully the protagonist. No wonder why he would be stabbed to death.\n\nTherefore, he thoughtfully sent Cheng Xia home and helped select a school drama for Cheng Xia. “This drama is suitable for Cheng Xia and has the potential to be popular.”\n\nIt turned out to be really popular. Cheng Xia said, “Thank you, President Pei!”\n\n“Cheng Xia should expand his shows and challenge himself.”\n\nCheng Xia whose fans soared to the tens of millions. “Thank you so much, President Pei!”\n\n“Do you want to try this drama? I think you are talented enough to handle this difficult role.”\n\nAt the awards ceremony, Cheng Xia said, “The person I want to thank most is President Pei!”\n\nOn Pei Shaoze’s birthday, all the stars of the company came to congratulate him. After the party, Cheng Xia personally sent Pei Shaoze home. The young man’s cheeks were slightly red and his eyes were shining as he stared at Pei Shaoze. “President Pei, in fact, I know your feelings toward me and I like you very much.”\n\nPei Shaoze, “……?”\n\nLater, it was found that Pei Shaoze was a producer in every one of Cheng Xia’s shows.\n\nThe fans said, “This alpha is pretty good. Xia Xia, hurry and chase him!”\n\nCheng Xia answered, “I’ve caught him :)”\n\n—Give you the most tolerant love and help you spread your wings to fly high.>"
}