{
	"url": "https://www.novelupdates.com/series/always-by-your-side/",
	"title": "Always By Your Side - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/05/Always-By-Your-Side_26177_1558341783.jpg",
	"noveltype": "(CN)",
	"genre": "Historical   Romance   Supernatural   ",
	"tags": "Complex Family Relationships   Female Protagonist   Handsome Male Lead   Kind Love Interests   Love Interest Falls in Love First   Modern Day   Older Love Interests   Reincarnation   Unconditional Love   ",
	"rating": "(3.5 / 5.0, 24 votes)",
	"author": "Celine Gu Xi Jue   顧西爵   顾西爵   ",
	"year": "\n2015",
	"ranking": "#2000   #2000   #8271   #9694   #8558   ",
	"reviewcount": "5 Reviews sorted by",
	"description": "This novel tells a love story that surpasses several lives. The male protagonist has loved the female protagonist for thousands of years.\n\n—\n\nThe world is like a landscape that rotates in a sequence of frames. But he is outside that frame, never knowing where he is, what time it is. He only knows that there is someone he must meet in this lifetime.\n\nIn the eyes of everyone else, Fu Beichen is a person who genuinely deserves to be “a modest nobleman, gentle as jade”. Whether family background or personal character, everything about him is perfect. Only Fu Beichen himself knows that his soul is not complete.\n\nThe shattered and prolonged dream makes Fu Beichen realize that this dream is a desire he does not want to forget, a memory from his previous life. And in that dream is her, who is carved into his bones and engraved in his heart.\n\nUntil Cheng Yuanyuan appears, just one glance, and already his heart rises up in great waves.\n\nHe would willingly sacrifice his life to save her, would willingly bear all disasters for her.\n\nHe uses his gentleness to weave an invisible net and quietly surrounds her life.\n\n“I’ve never kissed anyone else.”\n\n“And I’ve never thought of anyone else.”\n\n“Only you, I want to grow old with.”\n\nWhether in my previous life or this life, I always want to be by your side.>"
}