{
	"url": "https://www.novelupdates.com/series/i-became-popular-after-acting-like-a-green-tea/",
	"title": "I Became Popular After Acting Like a Green Tea - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/11/I-Became-Popular-After-Acting-Like-a-Green-Tea.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Fantasy   Romance   ",
	"tags": "Beautiful Female Lead   Celebrities   Clever Protagonist   Devoted Love Interests   Doting Love Interests   Female Protagonist   Handsome Male Lead   Love Interest Falls in Love First   Modern Day   Showbiz   System Administrator   Transmigration   Wealthy Characters   ",
	"rating": "(3.7 / 5.0, 31 votes)",
	"author": "叶子已青   ",
	"year": "\n2020",
	"ranking": "#697   #1385   #6810   #1476   #8273   ",
	"reviewcount": "9 Reviews sorted by",
	"description": "In a melodramatic[1] novel, there is always that type of rich and beautiful female supporting character with a hot body. However, her fiancé is always snatched away by the delicate and pretty white lotus flower.[2]\n\nIt just so happens that Xia An transmigrated into this type of female supporting character, chasing all over the world for the scum. The system informs her that if she wants to avoid the tragic death ending, she has to resist the influence of the plot setting and reduce the amount of  supporting female character’s bad luck value. Her current bad luck value is 999.\n\nXia An and the white lotus flower were attending a live variety show together. While they were talking, the white lotus flower suddenly fell to the ground.\n\nXia An: Hm??\n\nIn the white lotus flower’ heart: Xia An, just wait to be cursed to death by the whole internet!\n\nThe next second, Xia An fell to the ground as an “ah” escaped from her lips. She held her knees with one hand and looked up timidly. With a hauntingly beautiful gaze, she cried out, “Ouch~”\n\nWhite Lotus Flower: Huh? Why is she not following the usual way of things?!\n\n[Beep—Bad Luck Value reduced by 10.]\n\nNotes:\n[1] 狗血[gǒuxiě]- dog blood/ unbelievable/ exaggerated/ Melodramatic.  Firstly, it could be describing trite and highly predictable movie or Tv drama scenes. Secondly, it could be related to ludicrously unrealistic movie or TV drama scenes. Thirdly, it could relate to or characterised by schmaltz, dramatised sentimentalism, as in TV shows and movies. Lastly, it may be relating to life events that are ridiculous or infuriating.\n\n[2] 白莲花 (bái lián huā) ‘White lotus flower’ – someone who is pure in appearance, but opposite inside.\n\n[3] 绿茶(lǜchá)- Green tea also known as green tea b*tch (绿茶婊(lǜchábiǎo)) is a slang that refers to a girl who seemingly innocent and charming but is, in fact, calculating and manipulative.>"
}