{
	"url": "https://www.novelupdates.com/series/imperial-favour/",
	"title": "Imperial Favour - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/10/5cf8e52c091d612653.jpg",
	"noveltype": "(CN)",
	"genre": "Fantasy   Historical   Romance   Slice of Life   ",
	"tags": "Ancient China   Arranged Marriage   Beautiful Female Lead   Caring Protagonist   Cold Love Interests   Couple Growth   Female Protagonist   Handsome Male Lead   Imperial Harem   Love Interest Falls in Love First   Pregnancy   Reincarnation   Royalty   Second Chance   Strong Love Interests   ",
	"rating": "(3.8 / 5.0, 34 votes)",
	"author": "Hua Qi   画七   ",
	"year": "\nN/A",
	"ranking": "#2000   #2000   #5980   #4721   #6890   ",
	"reviewcount": "9 Reviews sorted by",
	"description": "In the capital city, the eldest daughter of the Tang family’s main bloodline, Tang Zhuo Zhuo, lavishly married into the Eastern Palace. Yet, she chose to spend her remaining years within the broken walls of the Cold Palace’s courtyard.    \n\nTill her death, she never forgot the general who always resided in her heart. \n\nBut only after her death did she know that the cold-hearted emperor, who was thought to harbour hatred towards her, had watched the candle flame of his wife every night from above the Cold Palace’s courtyard walls.\n\nWhilst the general had married the girl of his dreams from the start. \n\nWho would have imagined that the scene that greeted her when she opened her eyes again was the event that happened when she first entered the Eastern Palace – where she grimaced in displeasure towards the future Chong Jian Emperor. \n\nThe male’s face whitened with fury. \n\nTang Zhuo Zhuo flinched, ‘I…I’m done for!’ \n\nHuo Qiu had an uncanny feeling. His wife, who had rejected him so severely before, seemingly changed into a new person. Not only did she not create any disturbances, but also made him some pastries. \n\nIn the face of the sudden goodwill expressed by his beloved, the future wise, divine and mighty Chong Jiang Emperor frowned, but naturally accepted everything.>"
}