{
	"url": "https://www.novelupdates.com/series/everyday-the-bigshot-roomates-are-not-very-likable/",
	"title": "Everyday the Bigshot Roomates Are Not Very Likable - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/09/Everyday-the-bigshot-roomates-are-not-very-likable.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Drama   Mature   Romance   Shounen Ai   ",
	"tags": "Calm Protagonist   College/University   Complex Family Relationships   Devoted Love Interests   Doting Love Interests   Early Romance   Family Conflict   Handsome Male Lead   Love Interest Falls in Love First   Modern Day   Reincarnation   Roommates   Second Chance   Straight Uke   Unconditional Love   Wealthy Characters   ",
	"rating": "(4.3 / 5.0, 12 votes)",
	"author": "一面风情   ",
	"year": "\n2021",
	"ranking": "#2000   #2000   #9739   #7858   #8927   ",
	"reviewcount": "4 Reviews sorted by",
	"description": "Tang Mu was not just in name only, but also in reality(1*) a child by a previous marriage(2*). When he was ten years old, his mother remarried to a wealthy family, and he followed her to the wealthy family’s home. However, the life in the wealthy family has been a total tragedy from the very beginning.\n\nThe step-brother and step-sister bullied him, and his grandmother always got angry at him when there was nothing to do. His mother always taught him to be patient and that when he graduated from university and left home, everything would be fine. However, Tang Mu could not endure until the day he graduated from college, and there was an accident…\n\nOnce he started all over again, Tang Mu knew that he was the cannon fodder in the book, and the heirs such as step-brother and step-sister were the real protagonists. His forbearance and perseverance had no effect other than adding some flavouring to other people’s lives.\n\nOn the first day of entering the university campus, the step-brother asked Tang Mu’s roommate to bully Tang Mu. Tang Mu, who had to live again, didn’t want to endure anymore, and beat all the people who bullied him.\n\nIn order to separate Tang Mu from his roommate, Tang’s mother arranged for him a new dormitory, a high school room, and a double dormitory. However, Tang Mu’s new roommate is not good news. On the first day after moving to the dormitory, the new roommate Yan Xi and his friend blocked him at the door of the dormitory to prevent him from entering…\n\nYan Xi’s friend: “This man is our boss. He doesn’t like to live in the same house with others. We’ll trouble you to change the place?”\nTang Mu: “The school assigned me to this dormitory. Why don’t you go out to rent a house?”\nYan Xi (smiling face): “I think you are crazy. If you have the courage to live here, you have to bear the consequences of living with me!”\n\nA year later, Tang Mu finally knew what terrible consequences will be there of living together with Yan Xi …\n\n— Yan Xi: One day I will let you serve (3*) me!\n\nTang Mu raised his eyebrows: What do you mean to let me serve?\nYan Xi hooked the corner of his mouth: Guess?\n\n1* an idiom meaning being worthy of name/ live up to one’s reputation\n\n2* derogatory term for a woman to bring one’s children into a second marriage; children by a previous marriage\n\n3* can also mean admire/obey>"
}