{
	"url": "https://www.novelupdates.com/series/cool-goddess-special-agent/",
	"title": "Cool Goddess Special Agent - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2018/09/cover.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Comedy   Fantasy   Harem   Josei   Romance   Supernatural   Xuanhuan   ",
	"tags": "Assassins   Beasts   Beautiful Female Lead   Calm Protagonist   Clever Protagonist   Cold Protagonist   Complex Family Relationships   Cultivation   Cunning Protagonist   Familial Love   Female Protagonist   Handsome Male Lead   Love Interest Falls in Love First   Magic   Polyandry   Poor to Rich   Power Couple   Reverse Harem   Ruthless Protagonist   Sibling Rivalry   Slow Romance   Transmigration   ",
	"rating": "(3.9 / 5.0, 97 votes)",
	"author": "Jiang Xiang   蒋湘   ",
	"year": "\n2012",
	"ranking": "#6970   #2000   #2719   #6512   #3215   ",
	"reviewcount": "9 Reviews sorted by",
	"description": "What will happen when a wild, arrogant, and cold secret agent transmigrates into the body of a weak and timid young miss of an aristocratic family?\n\nShe, Chu Ye, is the CIA agent who grabbed the outstanding title of “Agent 007” after the death of Qian Xie. However, she fell in love with the enemy during an assassination mission and died for love.\n\nShe, Boling Yili, is the seventh young miss of the Boling clan, the greatest aristocratic clan of the Eastern Nation, but because of her natural timidity and cowardice and her inability to become a wizard, she was regarded by the family as a disgrace and was exiled to a small remote town, where she supposedly drowned in a pond due to suicide.\n\nWhen matters are left unsettled, the heart and body will almost thirst for blood, longing for the wildness and madness and even undergoing change to the point of blurring the fine line between life and death. From the moment Chu Ye transmigrated, the Autonomous Wizard Continent better wait for they will witness what it means for the sky and the earth to turn upside down!>"
}