{
	"url": "https://www.novelupdates.com/series/who-says-omegas-cant-be-as-explosive-as-alphas/",
	"title": "Who Says Omegas Can’t be as Explosive as Alphas - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/06/Who-Says-Omegas-Cant-be-as-Explosive-as-Alphas.png",
	"noveltype": "(CN)",
	"genre": "Mecha   Romance   School Life   Shounen Ai   Yaoi   ",
	"tags": "Battle Academy   Cold Love Interests   Handsome Male Lead   Military   Omegaverse   Overpowered Protagonist   Protagonist Strong from the Start   Smart Couple   Strong Love Interests   ",
	"rating": "(3.9 / 5.0, 22 votes)",
	"author": "Green Plum Sauce   Qīngméi jiàng   青梅酱   ",
	"year": "\n2019",
	"ranking": "#6970   #6170   #9119   #8368   #7478   ",
	"reviewcount": "3 Reviews sorted by",
	"description": "It has been five years since an Omega held a post in the military of the Empire. After all, the delicate and soft Omegas are obviously not suited for the tough military system. Until one day, the Imperial Navy with an Alpha-Omega ratio of nearly 99:1, appeared a freshman like Lu Jingning, who directly overwhelmed a group of seniors in a competition on the first day of school. \n\nThe whole school was shocked, this Omega was as explosive as an Alpha! Lu Jingning, the Demon King of Chaos and Light amidst the sea, Emperor Wen Xingchen became the two great legends of the Imperial Navy. During the military school league, the two teamed up and infiltrated deep into the enemy camp, directly obliterating the strongholds of other schools. \n\nEveryone was very curious, if these two get into a fight, who will come out stronger?\n\nOne day, Lu Jingning blocked Wen Xingchen in the corridor and stretched his neck in front of him. “Come, take a bite. Be good and mark me,” he said.\n\nWen Xingchen: “I’m happy to help.”\n\nMany years later-\n\nWen Xingchen: “Why did you choose me?”\nLu Jingning: “Do you want to hear the truth?”\nWen Xingchen: “Speak.”\nLu Jingning: “Of course it’s because you are the first person who didn’t kneel when you smelled my pheromones.”\nWen Xingchen: “?”\n\nLu Jingning’s quote: if you smell my pheromones but don’t kneel, count me as the loser~ >"
}