{
	"url": "https://www.novelupdates.com/series/saijaku-muhai-no-bahamut/",
	"title": "Saijaku Muhai no Bahamut - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2015/07/saijakumuhai.png",
	"noveltype": "(JP)",
	"genre": "Action   Drama   Ecchi   Harem   Mecha   Romance   School Life   Sci-fi   Shounen   ",
	"tags": "Adapted to Anime   Adapted to Manga   All-Girls School   Amnesia   Aristocracy   Army   Artifacts   Battle Academy   Beautiful Female Lead   Betrayal   Bloodlines   Brother Complex   Caring Protagonist   Character Growth   Charismatic Protagonist   Childhood Friends   Clever Protagonist   Clingy Lover   Conditional Power   Dense Protagonist   Determined Protagonist   Discrimination   Enemies Become Allies   Enemies Become Lovers   European Ambience   Fallen Nobility   Fast Learner   Handsome Male Lead   Hard-Working Protagonist   Heroes   Hiding True Identity   Knights   Kuudere   Loli   Love Interest Falls in Love First   Male Protagonist   Mysterious Past   Nudity   Orphans   Past Plays a Big Role   Politics   Polygamy   Poor Protagonist   Popular Love Interests   Protagonist Strong from the Start   Royalty   Strong Love Interests   Strong to Stronger   Tsundere   Unreliable Narrator   Younger Sisters   ",
	"rating": "(3.9 / 5.0, 106 votes)",
	"author": "Akatsuki Senri   ",
	"year": "\n2013\n",
	"ranking": "#6970   #2000   #2693   #5506   #1715   ",
	"reviewcount": "8 Reviews sorted by",
	"description": "Lux, who was a prince from the Empire that was destroyed five years ago due to the revolt, met with the princess of the new Kingdom, Lizsharte, by accidentally breaking into the bathroom of the girl's dormitory.\r\n\r\n'......How long are you planning to stare at my body, you fooooool!'\r\n\r\nThe ancient weapons found from the ruins, the Drag-Ride. Lux who was called the strongest Drag-Knight in the past was now known as the 'Weakest Undefeated', a Drag-Knight who doesn't attack at all. After the duel that started by the challenge from Lizsharte, Lux ended up entering the girls' school that raised Drag-Knights......!\r\n\r\nLux's story where he is surrounded by the noble girls from the academy is about to unfold.\r\n\r\nThe 'ultimate' academy fantasy battle where the right and the might cross passes now begins!>"
}