{
	"url": "https://www.novelupdates.com/series/after-transmigrating-i-made-the-antagonist-cry/",
	"title": "After Transmigrating I Made The Antagonist Cry - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/01/After-Transmigrating-I-Made-The-Antagonist-Cry_1610355707.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Drama   Romance   Slice of Life   Yaoi   ",
	"tags": "Acting   Clingy Lover   Cold Love Interests   Confident Protagonist   Doting Love Interests   Handsome Male Lead   Jack of All Trades   Love at First Sight   Love Interest Falls in Love First   Multiple Transported Individuals   Older Love Interests   Possessive Characters   Reincarnated in Another World   Reincarnation   Seme Protagonist   Showbiz   Time Travel   Transmigration   Transported to Another World   Wealthy Characters   ",
	"rating": "(4.0 / 5.0, 214 votes)",
	"author": "喬木裏   ",
	"year": "\n2020",
	"ranking": "#1192   #879   #1633   #549   #1517   ",
	"reviewcount": "60 Reviews sorted by",
	"description": "He transmigrated into this book with the mission to prevent the antagonist from ending up ‘blackened’ too early.\n\nAnd became a cannon fodder that is supposed to abandon the antagonist and prostrate himself at the Protagonist Bottom’s feet.\n\nTo this, Liu Yu’an would like to say – To abandon a bossy CEO antagonist who likes him and is elegant and beautiful and can even shut down the world economy with one sentence, and go prostrate at the feet of the little idol, the Protagonist Bottom who doesn’t even like him?\n\nThe original person must have had his brain bonked silly.\n\nThank the gods he transmigrated instead.\n\nLater, Liu Yu’an realises – that the elegance and distance is merely a shell the bossy CEO has put about himself. The bossy CEO without the shell is sensitive, lacks confidence and especially lacks a sense of security. He’s also… a crybaby.\n\n—\n\nAs a member of the Virtual Worlds Management Centre, Liu Yu’an has been through dozens of different worlds already. He has been the emperor, the evil court minister, the Lord of all Demons, the Demonic Cultivator Overlord, the Ruler of the Ascended Realm, a teacher, a student, a doctor, a CEO, a general…\n\nThough he never did expect to one day have to play the role of the characters he has been as an actor in another world.\n\nLooking at the Internet, with all sorts of,\n\nCommenter A: Aaaaah! Gege’s acting looks like the genuine Demon Lord himself.\n\nCommenter B: Holy shit! An-ge tell us in all honesty were you a high school homeroom teacher before you debuted?!\n\nCommenter C: I’m in love, seriously, is it too late for me to declare my fanhood allegiance now?!\n\n…\n\nLiu Yu’an is quite nonplussed, my, oh my, you all are too young, too young…\n\nYet, not even the experienced transmigrator that he was expected that, one day, he would apply to be allowed taking a book character back out to the real world.>"
}