{
	"url": "https://www.novelupdates.com/series/there-will-always-be-protagonists-with-delusions-of-starting-a-harem/",
	"title": "There Will Always Be Protagonists With Delusions of Starting a Harem - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2017/11/therewillalwaysbe.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Fantasy   Romance   Supernatural   Yaoi   ",
	"tags": "Acting   Aliens   Ancient Times   Animal Characteristics   Appearance Changes   Beasts   Cultivation   Devoted Love Interests   Fat to Fit   Futuristic Setting   Game Elements   Genius Protagonist   Love Interest Falls in Love First   Magical Space   Male Yandere   Modern Day   Multiple Realms   Mystery Solving   Older Love Interests   Omegaverse   Orphans   Possessive Characters   Power Couple   Royalty   Schemes And Conspiracies   Showbiz   Smart Couple   Souls   System Administrator   Time Skip   Transmigration   Unreliable Narrator   Wealthy Characters   World Hopping   Zombies   ",
	"rating": "(4.3 / 5.0, 493 votes)",
	"author": "Can’t Play Chess   不会下棋   ",
	"year": "\n2017",
	"ranking": "#2114   #1936   #373   #1169   #203   ",
	"reviewcount": "98 Reviews sorted by",
	"description": "Suddenly, the unmarried twenty-year-old Ye Zhizhou had many more relatives, yet it was too late for him to clearly understand the circumstances as he nearly died in a car accident. After that, he somehow managed to survive and was even forcibly bound to a Salvation System.\n\nHow is it salvation?\n\nHarems destroy worlds! Preventing a harem will save them!\n\n. . . .\n\nOk, prevent harems. After seeing the entire system introduction, the corners of Ye Zhizhou’s mouth twitched. In order to return home safely, he decisively began his risky journey, he’d just treat it as if he was playing a large-scale strategy game.\n\nSince then, the people the protagonist would rescue, he rescued first. The businesses the protagonist would make, he made first. The little brother the protagonist would take in, he took in first. The cliff the protagonist would jump off of, he jumped off of first. The gay s*x the protagonist would have, he’d have. . . . Wait wait, can’t do this one, change it, let me change it.\n\n???: No, you can do this one.\n\nYe Zhizhou (alarmed): Who’s speaking?\n\n???: Your husband.\n\nYe Zhizhou: . . . .>"
}