{
	"url": "https://www.novelupdates.com/series/supreme-god/",
	"title": "Supreme God - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2018/04/14562s.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Fantasy   Harem   Historical   Shounen   Supernatural   ",
	"tags": "Adultery   Affair   Age Progression   Alternate World   Ancient Times   Archery   Aristocracy   Arranged Marriage   Artifacts   Beautiful Female Lead   Betrayal   Calm Protagonist   Caring Protagonist   Character Growth   Charismatic Protagonist   Cheats   Clever Protagonist   Complex Family Relationships   Demi-Humans   Destiny   Doting Older Siblings   Familial Love   Fantasy Creatures   Fantasy World   Genius Protagonist   God-human Relationship   God Protagonist   Goddesses   Godly Powers   Gods   Handsome Male Lead   Heaven   Heroes   Immortals   Incest   Kidnappings   Kingdoms   Loyal Subordinates   Magic   Magical Space   Male Protagonist   Marriage   Monsters   Mythical Beasts   Mythology   Politics   Polygamy   Popular Love Interests   Pregnancy   Prophecies   Reincarnation   Romantic Subplot   Royalty   R*pe   Schemes And Conspiracies   Sister Complex   S*aves   Strength-based Social Hierarchy   Twins   Unconditional Love   Wars   Weak to Strong   ",
	"rating": "(3.5 / 5.0, 21 votes)",
	"author": "会说忘言   ",
	"year": "\n2017",
	"ranking": "#2000   #2000   #9833   #9499   #9778   ",
	"reviewcount": "No Reviews",
	"description": "The legend of the Supreme God tells his tale beginning as the Star God, the wheels of fate began to set into motion. Soon, he will become ruler of all. This tale tells of the rise and fall of many gods and goddesses, their prosperity and their downfall.\n\n'There is no way for man to become a God until the Supreme God opened us the road towards the path.' Said Plato as he looked above the starry night.\n\n'If there is anything which can grant the freedom of my people, I think it must be the stars above guiding me and the faith in my heart which drives me forward.' Moses lied down as he reached his hands towards the obsidian black sky.\n\n'He is both my friend and my enemy.' Said Jesus.\n\nThe thread of fate and destiny prophesied the birth of a god paving a new era and bringing glory to all.>"
}