{
	"url": "https://www.novelupdates.com/series/m-e-m-o-r-i-z-e/",
	"title": "M E M O R I Z E - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/06/memorize.jpeg",
	"noveltype": "(KR)",
	"genre": "Action   Adventure   Fantasy   Harem   Mature   Psychological   Romance   ",
	"tags": "Adapted to Game   Adapted to Manhwa   Adapted to Visual Novel   Adopted Children   Angels   Antihero Protagonist   Artifacts   Beautiful Female Lead   Brotherhood   Calm Protagonist   Carefree Protagonist   Character Growth   Childcare   Clever Protagonist   Cold Protagonist   Cunning Protagonist   Cute Children   Demi-Humans   Demon Lord   Demons   Depictions of Cruelty   Determined Protagonist   Dragons   Enemies Become Allies   Enemies Become Lovers   Eye Powers   Famous Protagonist   Fantasy Creatures   Fantasy World   First-time Interc**rse   Friendship   Game Elements   God-human Relationship   God Protagonist   Goddesses   Gods   Guilds   Handsome Male Lead   Hidden Abilities   Hiding True Abilities   Loyal Subordinates   Male Protagonist   Mercenaries   Misunderstandings   Monsters   Multiple Realms   Mysterious Past   Overpowered Protagonist   Parent Complex   Past Plays a Big Role   Polygamy   Pragmatic Protagonist   Pregnancy   Protagonist Strong from the Start   Returning from Another World   Schemes And Conspiracies   Second Chance   Slow Romance   Strength-based Social Hierarchy   Strong Love Interests   Strong to Stronger   Student-Teacher Relationship   Survival   Sword And Magic   Sword Wielder   Teachers   Teamwork   Time Skip   Time Travel   Tragic Past   Transported to Another World   Tsundere   Underestimated Protagonist   ",
	"rating": "(3.9 / 5.0, 434 votes)",
	"author": "Ro Yu-jin   로유진   ",
	"year": "\n2012",
	"ranking": "#6970   #3089   #694   #2364   #312   ",
	"reviewcount": "50 Reviews sorted by",
	"description": "A man who had lost everything.\n\nAn almighty power, the [Zero Code] held within his hand.\n\n“Player Kim Su Hyun, do you truly wish to revert the time of Hall Plain?”\n\n“I want to go back 10 years. To the period when I first came here.”>"
}