{
	"url": "https://www.novelupdates.com/series/the-end-of-the-worlds-reborn-cannon-fodder-counter-attacks/",
	"title": "The End of The World’s Reborn Cannon Fodder Counter-attacks - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2018/02/ecc.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Romance   Yaoi   ",
	"tags": "Apocalypse   Appearance Different from Actual Age   Bickering Couple   Cold Love Interests   Cute Protagonist   Dense Protagonist   Handsome Male Lead   Hidden Abilities   Late Romance   Magical Space   Modern Day   Multiple POV   Multiple Reincarnated Individuals   Popular Love Interests   Second Chance   Slow Romance   Special Abilities   Straight Seme   Straight Uke   Strong Love Interests   Tsundere   Weak to Strong   Zombies   ",
	"rating": "(4.0 / 5.0, 122 votes)",
	"author": "汝夫人   ",
	"year": "\n2013",
	"ranking": "#3017   #6371   #3365   #7250   #2670   ",
	"reviewcount": "20 Reviews sorted by",
	"description": "I’ve been reborn? Xiao Ziling, who was facing the eve of the apocalypse, pulled a bitter face. The apocalypse isn't easy to live in, you know!\n\nIn order to have a good life in the future, he must first hug a big, thick thigh. Xiao Ziling’s eyes are on the apocalypse’s future king, Chu Zhitian. He strived to be his reliable and capable Younger Brother, in hopes of being protected under this tree’s shade.\n\nOnly, why is it so hard to accomplish this small goal?\n\nThis big brother, you are a cheat carrier, you should be able to call the wind and summon the rain. Why the hell are you fighting with me for the Younger Brother position?\n\nThat big sister who transmigrated, you want to sponge on my family’s Big Brother? Also, please don’t think of me as a thorn in your side. My sexual orientation is very normal.\n\nCold-faced little brother, do not always look at me with those suspicious eyes. History has never had someone as ordinary as me. I am a reborn man.\n\nLittle sister selling meng, where did you come from? Why are you clearer on future events than I am?\n\n……Your mom, what kind of world is this? Xiao Ziling was left in disarray – this world has a diverse variety of transmigration and rebirth loophole cheats everywhere. Even becoming a younger brother requires you to compete for it. Xiao Ziling was seriously under great pressure!\n\nSeems like a big thick thigh must definitely be hugged securely, Xiao Ziling realized.>"
}