{
	"url": "https://www.novelupdates.com/series/returning-from-death-i-want-to-fulfill-my-love-im-a-saint-and-was-taken-in-by-a-duke-but-i-was-treated-as-trash-but-ive-fallen-in-love-and-will-fulfill-it/",
	"title": "Returning From Death, I Want To Fulfill My Love ~ I’m a Saint and Was Taken in by a Duke, but I Was Treated as Trash, but I’ve Fallen in Love and Will Fulfill It ~ - Novel Updates",
	"image": "https://www.novelupdates.com/img/noimagefound.jpg",
	"noveltype": "(JP)",
	"genre": "Comedy   Drama   Fantasy   Romance   Shoujo   ",
	"tags": "Abandoned Children   Early Romance   European Ambience   Female Protagonist   Nobles   Orphans   Revenge   Saints   Second Chance   Time Travel   ",
	"rating": "(4.0 / 5.0, 2 votes)",
	"author": "Sazuka   さーづか   ",
	"year": "\n2022",
	"ranking": "#2000   #2000   #13576   #6262   #12753   ",
	"reviewcount": "No Reviews",
	"description": "I’m Ariel Midades, the most unwanted woman in the world. When I was three years old, I was abandoned and living in the slums because my sister, Sophia, found out that I didn’t have the capabilities of a saint.\n\nI was originally born a duchess, but my father died shortly after I was born, and my mother soon remarried and brought my stepfather into the ducal family; and she gave birth to Sophia.\n\nWhen I was three years old, my mother, too, died, and my stepfather and Sophia utilized the power of the dukedom, and as a result, …I was disowned so that I was driven out of the dukedom.\n\nI had been living without assurance for food each day, …but one day I was brought back as the daughter of a duchess because of the selfishness of my parents, who abandoned me to see if I still had the saint’s abilities.\n\nAnd I knew I had a happy life in front of me.\n\n…But reality wasn’t that sweet.\n\nI’d been pulled back into the duke’s family and I was being treated like… tr*sh, including being insidiously bullied by Sophia and almost losing my chastity to my stepfather.\n\nWhy… do I have to live like this?\n\nIt’s really unfair!!!\n\nI don’t know how many times I’ve thought that.\n\nBut not now.\n\n…Because I’ve died too many times already.\n\nIt turned out my saint’s divination was the ability to die and then go back in time to rewrite history into a better life, and I could go back to the past over and over again.\n\nI don’t even remember how many times I’ve lived this life.\n\nBut there’s only one thing I remember.\n\nIt was that I met a kind man when I was dying.\n\nI loved him… as I went over and over to the same time again with that wonderful man.\n\nBut I’m doomed to die.\n\nI’ve tried too many times to identify the person who’s going to kill me, but …there was no luck.\n\nI wonder who in the world he… Oh, maybe that guy I love will protect me.\n\nYes!\n\nThis time I’m definitely going to make it out alive to be with that wonderful man!\n\nDear overwatching Goddess… please protect me.>"
}