{
	"url": "https://www.novelupdates.com/series/isekai-mahou-wa-okureteru-ln/",
	"title": "Isekai Mahou wa Okureteru! (LN) - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2016/12/Isekai-Mahou-wa-Okureteru.jpeg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Comedy   Fantasy   Harem   Seinen   ",
	"tags": "Adapted to Drama CD   Adapted to Manga   Amnesia   Calm Protagonist   Caring Protagonist   Cautious Protagonist   Childhood Friends   Chuunibyou   Cousins   Cunning Protagonist   Curses   Demon Lord   Demons   Dense Protagonist   Depictions of Cruelty   Determined Protagonist   Divine Protection   Dwarfs   Elves   Fantasy World   Friendship   Handsome Male Lead   Heroes   Kingdoms   Loli   Male Protagonist   Monsters   Multiple Transported Individuals   Polygamy   Protagonist Strong from the Start   R-15   Romantic Subplot   Strong Love Interests   Summoned Hero   Sword And Magic   Transported to Another World   Tsundere   ",
	"rating": "(4.1 / 5.0, 329 votes)",
	"author": "Gamei Hitsuji   樋辻臥命   ",
	"year": "\n2014",
	"ranking": "#5262   #4688   #1235   #398   #681   ",
	"reviewcount": "22 Reviews sorted by",
	"description": "Felmenia Stingray was a genius magician. She quickly became the most distinguished magician of the Astel Kingdom after her discovery of white fire magic, which had the power to burn anything.\r\n\r\nHowever, the world is in peril due to the Demon King. The kingdom’s court magicians perform a summoning ritual for heroes and bring forth a hero and two youths, a boy and a girl. Unlike the girl, the young man refused to fight the Demon King alongside the Hero and demanded to be sent back to his world. The kingdom, angry with his behavior, locked him away.\r\n\r\nNow Felmenia stands before the young man with her strongest magic, the white flame, being completely useless and asks who he is. It was already obvious to her that this man was far stronger than she was. To this he simply responds.\r\n\r\n“Yakagi Suimei, a magician.”>"
}