{
	"url": "https://www.novelupdates.com/series/wu-dong-qian-kun/",
	"title": "Wu Dong Qian Kun - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2015/07/wu-dong-qian-kun.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Comedy   Fantasy   Harem   Martial Arts   Seinen   Xuanhuan   ",
	"tags": "Adapted to Anime   Adapted to Drama   Adapted to Manhua   Artifacts   Average-looking Protagonist   Battle Academy   Battle Competition   Beast Companions   Beautiful Female Lead   Bloodlines   Body Tempering   Brotherhood   Calm Protagonist   Confident Protagonist   Cultivation   Death of Loved Ones   Demon Lord   Demons   Destiny   Determined Protagonist   Dragons   Earth Invasion   Enlightenment   Fast Cultivation   First-time Interc**rse   Genius Protagonist   Godly Powers   Hard-Working Protagonist   Harsh Training   Heavenly Tribulation   Heroes   Hiding True Abilities   Inheritance   Late Romance   Legends   Long Separations   Love Interest Falls in Love First   Magical Space   Male Protagonist   Polygamy   Puppeteers   R*pe Victim Becomes Lover   Revenge   Romantic Subplot   R*pe   Ruthless Protagonist   Saving the World   Sentient Objects   Siblings Not Related by Blood   Spatial Manipulation   Spirit Advisor   Strong Love Interests   Strong to Stronger   Sudden Strength Gain   Time Skip   Tragic Past   Unique Weapon User   Wars   Weak to Strong   World Travel   ",
	"rating": "(3.6 / 5.0, 1171 votes)",
	"author": "Heavenly Silkworm Potato   Tian Can Tu Dou   天蚕土豆   ",
	"year": "\n2011",
	"ranking": "#4617   #2000   #28   #395   #122   ",
	"reviewcount": "111 Reviews sorted by",
	"description": "The Great Yan Empire exists in a world where respect can only be earned through strength. Within this Great Yan Empire, the four great clans have always stood above the rest. Among them, a particular incident in the Lin Clan resulted in the banishment of a certain individual who went on to start his own family, in hopes of one day being recognized again by the Lin Clan, and rejoining them…\n\nHailing from a banished family of the Great Lin Clan, when Lin Dong was very young, he watched, powerless, as his talented father was easily crushed and crippled by the overwhelming genius of the great Lin Clan, Lin Langtian.\n\nWith a despairing father, a heartbroken grandfather, and a suffering family, ever since that fateful day, Lin Dong has been driven by a deep purpose; to take revenge on the man who had taken everything and more from his family.\n\nArmed with nothing but willpower and determination, join Lin Dong as he unknowingly discovers a destiny greater than he could ever hope to imagine when he stumbles upon a mysterious stone talisman…>"
}