{
	"url": "https://www.novelupdates.com/series/the-enchanting-empress-dowager-is-really-poisonous/",
	"title": "The Enchanting Empress Dowager is Really Poisonous - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2018/09/dowager1.jpg",
	"noveltype": "(CN)",
	"genre": "Drama   Harem   Historical   Josei   Martial Arts   Romance   Smut   ",
	"tags": "Ancient China   Assassins   Beautiful Female Lead   Bickering Couple   Calm Protagonist   Clever Protagonist   Cold Protagonist   Cunning Protagonist   Doctors   Female Protagonist   Handsome Male Lead   Imperial Harem   Jealousy   Love Interest Falls in Love First   Persistent Love Interests   Politics   Polyandry   Possessive Characters   Proactive Protagonist   Reverse Harem   Royalty   Ruthless Protagonist   Schemes And Conspiracies   Shameless Protagonist   Strong Love Interests   Transmigration   Tsundere   Unconditional Love   ",
	"rating": "(4.3 / 5.0, 69 votes)",
	"author": "Wo Fei Zhu Jue   我非主角   ",
	"year": "\nN/A",
	"ranking": "#2000   #2000   #4779   #1030   #3444   ",
	"reviewcount": "7 Reviews sorted by",
	"description": "She came from a modern secret society. Cold and heartless, her appearance is nevertheless enchanting, and thinks of men as playthings. But someone plotted against her and her body was thrown into the sea. \n\nWhen she woke up next, she had transmigrated to become the youngest Empress Dowager of the Feng Yu dynasty. Her beauty is unparalleled and her heart is poisonous like a snake. \n\nPoisoning the imperial concubines to death, executing the emperor, her means are cruel and bloody, truly hateful!\n\nHer old lover, the new emperor absolutely hates her? Not only does he want to banish her to the cold palace, he also dares to slap her in the face?\n\nThe court ministers can’t wait to execute her under the law? \n\nThe imperial concubines in the inner palace are all hypocrites and vicious?\n\nWith an enchanting smile, if a tiger does not show her might, they will treat her as a decoration? Ever since the Empress Dowager has been reborn, the inner palace will never be peaceful again!\n\nHooking up and joining the imperial uncle for no reason, then teasing the prime minister. If nothing happens, she will find a small bun to abuse, then sit back and watch a bunch of imperial concubines fight among each other. Her days are exciting and smooth. Except, why are all these men stripping naked and ask her to be responsible for them?\n\n[Imperial Uncle Edition]\n\n“The Empress Dowager seems to be in a good mood these days!”\n\n“Yes! It’s indeed good”\n\n“The peach blossoms in this King’s courtyard are in full bloom. I wonder if the Empress wants to come over to see them?”\n\n“Looking at them is fine! However, imperial uncle, can you remove your hand from my leg?”\n\n[Prime Minister Edition]\n\nOne night, a certain Empress Dowager appeared on the cold and stoic prime minister’s bed. She lifted his chin with one hand and wickedly ravaged him. Looking at the ‘unsatisfied’ man below her, she evilly and charmingly smiled. Her voice was filled with temptation: “If it is painful, please tell me. I will be more gentle.”\n\nThe cold and stoic prime minister’s eyes flashed. However, he uncomfortably turned his head away. His earlobes were red as blood pearls!\n\n[Man Slag]\n\n“Empress Dowager! What else do you want before you are willing to let go of the Empress?”\n\n“Get out!”\n\n“Empress Dowager! What do you actually want?”\n\n“Throw him out!”\n\n“Jinghua! Whatever you want, I can give it to you. But, first release the Empress!”\n\n“Castrate him and throw him “.>"
}