{
	"url": "https://www.novelupdates.com/series/fangsi/",
	"title": "Fangsi - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/05/Fangsi.jpg",
	"noveltype": "(CN)",
	"genre": "Adult   Drama   Mature   Romance   Smut   Yuri   ",
	"tags": "Acting   Beautiful Female Lead   Celebrities   Charming Protagonist   Cold Love Interests   Cute Children   Multiple POV   Past Trauma   Tragic Past   ",
	"rating": "(4.3 / 5.0, 47 votes)",
	"author": "xuan Jian   玄笺   ",
	"year": "\n2020",
	"ranking": "#6970   #6382   #5962   #4389   #6925   ",
	"reviewcount": "4 Reviews sorted by",
	"description": "Tang Ruoyao, only 22 years old, has just received the award titled “Queen of Film.” What a bright future she must have! The next day, headline after headline named her the “Little Qin Yinong.” Tang Ruoyao’s fan were furious; Qin Yinong had developed a terrible reputation: she had a face that could only bring disaster. Whether women or men, it didn’t matter.. she had been to bed with most of the industry! She is not yet married yet she has a daughter, and her daughter is already a few years old! You shameless media, you insult our Tang Ruoyao with this comparison! Fans of Qin Yinong were also offended. Qin Yinong’s arms were heavy with both domestic and international awards. How could Tang Ruoyao compare with that?\n\nA new reporter interviewed the two stars to ask their impression of each other. Qi Yinong smiled like a fox: “We’re not close.” Tang Ruoyao formulated her tone and said lightly, “Qin Yinong is a senior I respect highly, and I hope to have the opportunity to work together.”\n\nSoon, the news broke out: Qin Yinong and Tang Ruoyao would co-star in a sapphic film. Nevermind their fans, even the general public was excited to see what would happen next. But who would have guessed that after filming ended, they hadn’t had any involvement with each other.\n\nThe two fanbases fought fiercely, their momentum the same as ever before. Of course, in any given kingdom there could only be one king.\n\nLater, Qin Yinong took her daughter to the show, and the host asked: “I hear that you and Tang Ruoyao are at odds. Is this true?” Then a huge image had flashed onto the screen: it was Tang Ruoyao. Qin Yinong smiled slightly, just about to speak. In her arms, her daughter’s eyes lit up, and she pointed her arm at Tang Ruoyao’s likeness. Her voice was bright and clear, and she shouted happily, “Mommy!”\n\nThe host and the audience, “!!!!!!” The entertainment industry was quite astir…\n\n340 chapters\n2.2M words>"
}