{
	"url": "https://www.novelupdates.com/series/i-was-reincarnated-as-the-older-brother-of-a-villainess-destined-to-die-so-i-want-to-change-the-future-by-raising-my-younger-sister-with-my-own-hands-i-am-the-strongest-in-the-world-but-my-little-s/",
	"title": "I Was Reincarnated As The Older Brother Of A Villainess Destined to Die, So I Want To Change The Future By Raising My Younger Sister With My Own Hands ~I Am The Strongest In The World, But My Little Sister Must Be The Cutest In The World~ - Novel Updates",
	"image": "https://www.novelupdates.com/img/noimagefound.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Fantasy   Harem   Romance   School Life   Slice of Life   Supernatural   ",
	"tags": "Academy   Adventurers   Beastkin   Brother Complex   Calm Protagonist   Character Growth   Demi-Humans   Devoted Love Interests   Elves   Hard-Working Protagonist   Heroes   Incest   Kind Love Interests   Love Interest Falls in Love First   Magic   Maids   Male Protagonist   Mature Protagonist   Multiple Reincarnated Individuals   Nobles   Older Love Interests   Otome Game   Overpowered Protagonist   Polygamy   Pragmatic Protagonist   Reincarnated in a Game World   Reincarnated in Another World   Ruthless Protagonist   Saints   Shounen-Ai Subplot   Sister Complex   Strong to Stronger   Sword And Magic   Trap   Weak to Strong   Younger Love Interests   Younger Sisters   ",
	"rating": "(3.9 / 5.0, 70 votes)",
	"author": "泉里侑希   ",
	"year": "\n2021",
	"ranking": "#39   #74   #3356   #50   #4485   ",
	"reviewcount": "7 Reviews sorted by",
	"description": "I, Zechs Levit y San Foranada, have a younger sister. Her name is Caroline, and she is a very lovely girl with beautiful blond hair and red eyes. It’s no exaggeration to say that she’s the cutest girl in the world, and her smile can be described as that of an angel.\r\n \r\nDespite the fact that I can't get enough of her cuteness, my little sister is doomed to die.\r\nThis world is similar to a game in my previous life called “Tōzai no Isamu Sei-ki,” in which Caroline appears in the game as a rival—A villainess—of the main character, who’s a Saint. And as a result, she dies brutally on every route.\r\n \r\n \r\nMy beloved sister is going to die?\r\nI can’t allow such an unreasonable future to happen!\r\n \r\n \r\nThat's why I decided to resist fate.\r\nI will raise my little sister in a pure and righteous manner, and I will forcefully overcome the numerous death flags.\r\nBelieving that there’s a bright future ahead for me and Caroline.\r\n \r\n \r\nThis is the story of me, who became the strongest to protect my sister, and Caroline, the cutest little sister in the world.\r\n>"
}