{
	"url": "https://www.novelupdates.com/series/i-became-a-beautiful-girl-but-im-still-an-mmo-junkie/",
	"title": "I Became a Beautiful Girl, but I’m still an MMO Junkie - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/01/6hkuk8x0h5yokuah2r0k71pcg685_j0x_go_nq_bryx.jpg",
	"noveltype": "(JP)",
	"genre": "Adventure   Comedy   Fantasy   Gender Bender   Mystery   Psychological   Shoujo Ai   ",
	"tags": "Accelerated Growth   Adapted to Manga   Age Regression   Alchemy   Appearance Changes   Appearance Different from Actual Age   Beautiful Female Lead   Chuunibyou   Curious Protagonist   Cute Protagonist   Demi-Humans   Disabilities   Doting Older Siblings   Fairies   Famous Protagonist   Fast Learner   Friendship   Loli   Male to Female   Misunderstandings   MMORPG   Mysterious Illness   Older Love Interests   Overprotective Siblings   Past Plays a Big Role   Past Trauma   Pill Concocting   Popular Love Interests   Race Change   Sword And Magic   Virtual Reality   Weak to Strong   ",
	"rating": "(4.1 / 5.0, 161 votes)",
	"author": "Hoshikuzu Ponpon   星屑ぽんぽん   ",
	"year": "\n2015",
	"ranking": "#3923   #3594   #1342   #5506   #1475   ",
	"reviewcount": "18 Reviews sorted by",
	"description": "A highschool student, Jintarou, failed miserably in his confession of love.\r\n\r\nHis misfortune continued, and he contracted a sex-transformation condition that was all over the news. His gender was swapped and he was transformed into a beautiful silver-haired girl. He was so shocked that he decided to escape reality by immersing in a VR game…\r\n\r\nJintarou played in the form as the same little girl he was in real life, and he was constantly trying to master his alchemy skills, which other players said were garbage skills.\r\n\r\n『Become a mercenary and fight, steal, dominate, explore, pioneer, produce — you are free to live your life!』 In the world of Clan・Clan where you are free to do as you like, he met various mercenaries (players) and developed with a smile.\r\n\r\nJintarou claimed to his friends that his appearance was a bug, and he went on his adventures while hiding the fact the he turned into a cute girl in real life.\r\n\r\nWhen summer vacations ends, they will meet at school.\r\n\r\nThis was the story of an alchemist who will be able to fight in a “war” comparable to the military and national class.\r\n\r\nWhat would really happen when a high school boy was suddenly transformed into a beautiful girl?\r\n\r\nThe answer was to become hikikomori, a hopeless net gamer.>"
}