{
	"url": "https://www.novelupdates.com/series/the-return-of-the-noble-abandoned-consort/",
	"title": "The Return of the Noble Abandoned Consort - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2018/02/35593s.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Drama   Fantasy   Historical   Josei   Romance   ",
	"tags": "Absent Parents   Ancient China   Beautiful Female Lead   Betrayal   Childcare   Clever Protagonist   Cooking   Cunning Protagonist   Cute Children   Doctors   Doting Love Interests   Doting Older Siblings   Doting Parents   Female Protagonist   Handsome Male Lead   Heartwarming   Marriage   Misunderstandings   Modern Knowledge   Pets   Power Couple   Royalty   Shameless Protagonist   Single Parent   Transmigration   Twins   Wealthy Characters   ",
	"rating": "(3.9 / 5.0, 65 votes)",
	"author": "Home Remedy   Pian Fang Fang   偏方方   ",
	"year": "\nN/A",
	"ranking": "#4080   #4192   #4221   #8805   #3098   ",
	"reviewcount": "10 Reviews sorted by",
	"description": "When she woke up, she had already jumped through time and space. Qiao Wei fell silent. How could she be so unlucky? Sleeping can also cause time travel? Not just simple time travel, but becoming the mother of the two small buns.\n\nBut looking at the small buns' sparkling little eyes, Qiao Wei could not say a word of complaint.\n\nBad! How could she handle such a situation? She had never been a mother! Could anything be worse than this?\n\nWell then, time to make a plan. Raise the buns, get a fortune, and become prosperous.\n\nIf someone is not being evil, I will leave them untouched. If people respect me, I will also respect them, but if people make trouble for me, I will punish them, no matter what.\n\nXinglin spring, even if she was an abandoned woman, she could make a beautiful life too.\n\n“Nān Nān, finally aunt found you! How could you leave that year? Aunt was looking for you like crazy! You still being alive is really good, let’s go home with aunt! A woman earning so much money is very unsafe outside!” Said a beautiful woman with a veil.\n\n“You do not care about my children but want to touch my money. You know what, Aunt, it really hurts me!' Qiao Wei looked cold.\n\nThe little buns looked back and forth between their mother and a cold-looking man: “Mother, Uncle said he is my father.”\n\nQiao Wei smiled: “Good son, tell your father to prove his identity. What should be done?\n\nSmall buns opened a gold booklet and started reading one by one: “101 Qiao Family Rules”, insulting an underage girl, will be given palace punishment. “Uncle, if you are really our father … …”\n\nAfter winning over the little buns, the man grabbed Qiao Wei’s chin with a long finger, showing a touch of a cold and dangerous smile: “If this Lord remembers right, it seems that night you were the one being hard on this Lord!”>"
}