{
	"url": "https://www.novelupdates.com/series/my-dad-is-the-galaxys-prince-charming/",
	"title": "My Dad Is the Galaxy’s Prince Charming - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/02/My-Dad-Is-the-Galaxys-Prince-Charming.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Fantasy   Josei   Romance   Sci-fi   Xuanhuan   ",
	"tags": "Average-looking Protagonist   Battle Academy   Bloodlines   Carefree Protagonist   Celebrities   Cryostasis   Doting Love Interests   Fated Lovers   Female Protagonist   Futuristic Setting   Game Elements   Gamers   Handsome Male Lead   Hidden Abilities   Humanoid Protagonist   Immortals   Interdimensional Travel   Late Romance   Long Separations   Lost Civilizations   Lucky Protagonist   Military   Older Love Interests   Outer Space   Psychic Powers   Secret Identity   Secret Organizations   Shounen-Ai Subplot   Slow Romance   Special Abilities   Student Council   Time Skip   Vampires   Wars   World Travel   ",
	"rating": "(4.3 / 5.0, 247 votes)",
	"author": "Mrs. Ago   Yóu qián   尤前   ",
	"year": "\n2017",
	"ranking": "#3567   #6281   #1876   #36   #1909   ",
	"reviewcount": "46 Reviews sorted by",
	"description": "What would you do if your planet ceased to exist after a nap?\n\nOnce upon a time, there was a princess…\n\nScrap that.\n\nOnce upon a time, there was a hermit called Yao Si.\n\nShe was an orphaned hikikomori who lived a peaceful and mundane life in her cosy little apartment.\n\nJust when she thought she’d live out the rest of her mundane days… she died.\n\nBy a strange twist of fate, she was somehow turned into a vampire, even worse, a fifth-generation weakling with no combat ability at all.\n\nVampires had their own little secret society, cultural feuds, and called themselves bloodlings.\n\nWith the threats of another civil war among the bloodlings, Yao Si remained composed.\n\n‘Even if this war of bloodlings rages on again, it will need a miracle to affect me,’ she thought.\n\nSo, a miracle occurred…\n\nWhen she was woken up from a millennnia-long nap, she found that her beautiful mother planet Earth had ceased to exist.\n\nEven the oldest bloodling in the entire universe was now one of her grand [ times infinity] child.\n\nEveryone will have to call her “ancestor” from this moment onwards!\n\nThe peasant Yao Si had successfully revolted and taken charge, let’s see who dares to call her a weakling anymore!\n\n“Hey! You, that guy over there!\n\n“Yes, you.\n\n“Come on, let’s fight, if I lose, I will call you ‘dad’!”\n\nSo… she has a new dad.\n\nYao Si “…”\n\nMu Xuan “…”>"
}