{
	"url": "https://www.novelupdates.com/series/my-princess-has-been-reborn/",
	"title": "My Princess Has Been Reborn - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/10/115299s.jpg",
	"noveltype": "(CN)",
	"genre": "Drama   Fantasy   Historical   Martial Arts   Romance   Yuri   ",
	"tags": "Absent Parents   Ancient China   Aristocracy   Betrayal   Clever Protagonist   Cohabitation   Couple Growth   Court Official   Cross-dressing   Death   Devoted Love Interests   Doting Older Siblings   Doting Parents   Engagement   Female Protagonist   First Love   Hiding True Identity   Love Interest Falls in Love First   Lovers Reunited   Multiple Identities   Multiple POV   Multiple Reincarnated Individuals   Multiple Timelines   Murders   Mystery Solving   Orphans   Persistent Love Interests   Possessive Characters   Power Couple   Reincarnation   Reversible Couple   Royalty   Secrets   Sibling Rivalry   Siblings   Smart Couple   Twins   Wars   Wealthy Characters   ",
	"rating": "(4.4 / 5.0, 53 votes)",
	"author": "或许有一天   ",
	"year": "\n2019",
	"ranking": "#438   #302   #4306   #613   #4945   ",
	"reviewcount": "8 Reviews sorted by",
	"description": "Lu Qipei has died at the hands of the person she trusted most.\n\nHowever, what she regretted most before she died was that she had appeared before Princess Qi Yang and had an abnormal (gay) marriage with her. After dying, she would still be pulling Princess Qi Yang into a quagmire.\n\nThus, after being reborn, Lu Qipei decided to break free of her shackles and abandon everything. She did not want to appear in front of Princess Qi Yang again.\n\nYet, Princess Qi Yang had been reborn as well and even managed to successfully capture this wild, escaped prince consort on the first day of being reborn…\n\nQi Yang (smiling): You still want to run? Servants, come and bring this prince consort back!\n\nLu Qipei (tightly covering her clothes): No no no, who are you? You’re not that cute and innocent little princess of mine!>"
}