{
	"url": "https://www.novelupdates.com/series/this-alphas-pheromones-are-exploding/",
	"title": "This Alpha’s Pheromones Are Exploding - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/06/Screen-Shot-2020-06-08-at-12.49.31-PM.png",
	"noveltype": "(CN)",
	"genre": "Comedy   Drama   Romance   Slice of Life   Yaoi   ",
	"tags": "Acting   Calm Protagonist   Character Growth   Clingy Lover   Cold Love Interests   Confident Protagonist   Cooking   Dense Protagonist   Devoted Love Interests   Doting Older Siblings   Enemies Become Lovers   Famous Protagonist   Handsome Male Lead   Love Interest Falls in Love First   Modern Day   Mpreg   Multiple Reincarnated Individuals   Omegaverse   Playful Protagonist   Possessive Characters   Power Couple   Proactive Protagonist   Showbiz   Slow Romance   Strong Love Interests   Transmigration   Wealthy Characters   ",
	"rating": "(4.3 / 5.0, 174 votes)",
	"author": "Shao Tang   勺棠   ",
	"year": "\n2020",
	"ranking": "#315   #96   #1492   #723   #942   ",
	"reviewcount": "50 Reviews sorted by",
	"description": "Qiu Jin transmigrated into a book once again.\n\nLast time, he transmigrated into an omega with pheromones that could make people go crazy. This time the heavens were merciful and finally had him transmigrate into an alpha. Moreover, it was the sexiest alpha in the entertainment circle.\n\nUnfortunately, it was a cannon fodder.\n\nThe main gōng in the original book was Ji Shenxiao, an aloof tyrant CEO. He was alpha to the max. His self-control was so strong that no matter how omegas tried to seduce him, he would remain unmovable like a mountain. Until he met the protagonist omega shòu, which activated his second vein and turned him into the fiercest gōng dog.\n\nAnd Qiu Jin was the cannon fodder alpha that competed with Ji Shenxiao. Arrogant and despotic, he tried to forcefully take, and grandly lost. He challenged the protagonist’s bottom line again and again. In the end, his gland was destroyed, and his family fell into destitution.\n\nIn this regard, Qiu Jin expressed that he would not be a toxic alpha male, so protagonist you go scram. However, humans could not defy the fates, and just when Qiu Jin was striving to become a high-quality alpha, the pheromones that made all the alphas go crazy in the last world came back!\n\nAt that moment, he saw the protagonist gōng suppressing his desires till his eyes were red, and his pheromones went out of control.\n\nQiu Jin swallowed: “Bro, let’s talk this out…”\n\nThe alpha squeezed the back of his neck, his voice hoarse: “But I prefer to do it directly.”\n\nLove rivals become lovers. Alpha becomes omega.>"
}