{
	"url": "https://www.novelupdates.com/series/thereafter-of-an-exiled-magician-somehow-my-engagement-was-cancelled-and-i-was-driven-out-so-i-will-stop-living-the-tough-aristocrat-life-and-live-leisurely-in-a-distant-foreign-developing-villa/",
	"title": "Thereafter of an Exiled Magician ~Somehow My Engagement Was Cancelled, and I Was Driven Out, so I Will Stop Living the Tough Aristocrat Life, and Live Leisurely in a Distant, Foreign, Developing Village~ - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/01/Thereafter-of-An-Exiled-Magician-Somehow-my-engagement-was-cancelled-and-I-was-driven-out-so-I-will-stop-living-the-tough-Aristocrat-life-and-live-leisurely-in-a-distant-foreign-developing-village_1642335465.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Comedy   Fantasy   Harem   Romance   Shounen   Slice of Life   ",
	"tags": "Alchemy   Average-looking Protagonist   Broken Engagement   Calm Protagonist   Curses   Depictions of Cruelty   Discrimination   Elves   Fallen Nobility   Fantasy World   Hiding True Abilities   Late Romance   Loli   Magic   Male Protagonist   Multiple POV   Nobles   Protagonist Strong from the Start   R-15   Reincarnated in Another World   Reincarnation   Royalty   Schemes And Conspiracies   Tragic Past   Underestimated Protagonist   ",
	"rating": "(3.3 / 5.0, 78 votes)",
	"author": "Satou Tarou   砂糖多労   ",
	"year": "\n2020",
	"ranking": "#1515   #1168   #1757   #1883   #4520   ",
	"reviewcount": "8 Reviews sorted by",
	"description": "Lain, a reincarnated person, lives his life as an 「Anti-Demon Aristocrat」 who is responsible for defeating demons in the frontier.\n\nAt the age of 15, his engagement to the princess, a privilege of the Anti-Demon Aristocrats, is supposed to be announced, but he is told to break the engagement and is also stripped of his status as a member of the anti-demon aristocracy.\n\nCast out not only by his country, but also by his adoptive-father, Lain leaves the royal capital and uses wind magic to fly through the air to a faraway village.\n\nFor some reason, Lain decides to live in the village, where only young girls live, and works with the girls to strengthen the village, teach them magic, and enjoy the freedom he has never had before…\n\nLain has escaped his black environment and is enjoying the slow life, but Lain’s power is affecting the world――!>"
}