{
	"url": "https://www.novelupdates.com/series/quick-transmigration-face-slapping-the-second-female-lead/",
	"title": "Quick Transmigration: Face Slapping The Second Female Lead - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2018/07/201704060718256738.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Comedy   Romance   Sci-fi   Shoujo   Supernatural   Xianxia   ",
	"tags": "Ancient Times   Appearance Changes   Betrayal   Calm Protagonist   Clever Protagonist   Cold Protagonist   Cultivation   Cute Protagonist   Death   Dense Protagonist   Detectives   Devoted Love Interests   Dolls/Puppets   Early Romance   Episodic   Female Protagonist   Game Elements   Gamers   Handsome Male Lead   Human-Nonhuman Relationship   Interdimensional Travel   Love Interest Falls in Love First   Male Yandere   Manipulative Characters   Modern Day   Multiple Realms   Multiple Reincarnated Individuals   Pets   Police   Possessive Characters   Post-apocalyptic   Proactive Protagonist   Schemes And Conspiracies   Siblings Not Related by Blood   Special Abilities   Strong Love Interests   System Administrator   Transmigration   World Hopping   World Travel   Yandere   Zombies   ",
	"rating": "(4.1 / 5.0, 210 votes)",
	"author": "Yue Tu Yue Tu   月土月土   ",
	"year": "\nN/A",
	"ranking": "#2000   #2000   #947   #4188   #1375   ",
	"reviewcount": "35 Reviews sorted by",
	"description": "On what basis is a golden finger or a new life necessary once you transmigrate? On what basis should a transmigrated cannon fodder definitely counterattack? \n\nIs peacefully staying as a cannon fodder too much to ask for? Why come out and wreck everything? Slags….. The Male Lead is dead because of you, the world is even collapsing, okay?! \n\nIn order to earn Points, every time she enters a new world, Xia Liang expresses that she completes her missions very seriously, face slapping those secondary female characters who wish to counterattack, setting order to all the chaos, restoring the plot, and avoiding the collapse of the worlds.\n\nAs for why the Male Leads all fell in love with me, that was actually an accident. Em, it’s just, aren’t these accidents a little bit too many…>"
}