{
	"url": "https://www.novelupdates.com/series/little-tyrant-doesnt-want-to-meet-with-a-bad-end/",
	"title": "Little Tyrant Doesn’t Want to Meet with a Bad End - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/09/Little-Tyrant-Doesnt-Want-to-Meet-with-a-Bad-End.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Comedy   Fantasy   Harem   Romance   ",
	"tags": "Academy   Adapted to Manhua   Age Progression   Angels   Aristocracy   Artifacts   Beautiful Female Lead   Bloodlines   Brother Complex   Bullying   Caring Protagonist   Character Growth   Charismatic Protagonist   Cheats   Child Protagonist   Childhood Love   Clever Protagonist   Cute Protagonist   Dense Protagonist   Determined Protagonist   Devoted Love Interests   Divination   Doting Love Interests   Doting Parents   Dragons   Elves   Empires   European Ambience   Evil Gods   Evil Religions   Familial Love   Fantasy World   First-time Interc**rse   Galge   Game Elements   Goddesses   Gods   Handsome Male Lead   Hard-Working Protagonist   Hidden Abilities   Kidnappings   Kingdoms   Lost Civilizations   Love Interest Falls in Love First   Love Rivals   Loyal Subordinates   Magic   Male Protagonist   Mature Protagonist   Misunderstandings   Monsters   Multiple POV   Mysterious Family Background   Mythical Beasts   Nobles   Persistent Love Interests   Polygamy   Popular Love Interests   Possessive Characters   Pregnancy   Prophecies   Reincarnated in a Game World   Religions   Reverse R*pe   Sadistic Characters   Schemes And Conspiracies   Secret Organizations   Siblings Not Related by Blood   Sister Complex   Special Abilities   Strong Love Interests   Sword And Magic   System Administrator   Time Manipulation   Time Skip   Time Travel   Underestimated Protagonist   Wars   Weak to Strong   Witches   Yandere   Younger Sisters   ",
	"rating": "(4.1 / 5.0, 1092 votes)",
	"author": "Bells on Cat Ears   猫耳铃铛   ",
	"year": "\n2019",
	"ranking": "#1391   #1147   #75   #335   #205   ",
	"reviewcount": "259 Reviews",
	"description": "The moment the little tyrant of the nobles, Roel Ascart, saw his stepsister, he recalled his memories. He realized that he was in the world of a gal game he played in his previous life. To make things worse, he was the greatest villain in the common route of the game!\n\n“I’ll be killed by the main character and the four capture targets ten years from now. Is there still any hope for me?”\n\nJust thinking about the fearsome glints of those sharp swords those beautiful capture targets held in their hands, Roel couldn’t help but tremble in fear.\n\nTill a voice finally sounded in his head.\n\n【Welcome to the House Resurgence System】>"
}