{
	"url": "https://www.novelupdates.com/series/i-reincarnated-as-a-losing-heroine-the-heros-childhood-friend-who-lost-to-the-main-heroine-so-i-switched-jobs-to-alchemist/",
	"title": "I Reincarnated as a Losing Heroine, the Hero’s Childhood Friend Who Lost to the Main Heroine, so I Switched Jobs to Alchemist - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/04/81AXBs0tvL.jpg",
	"noveltype": "(JP)",
	"genre": "Adventure   Comedy   Fantasy   Romance   Shoujo   ",
	"tags": "Adapted to Manga   Alchemy   Character Growth   Childhood Friends   Elves   Female Protagonist   Heroes   Mob Protagonist   Reincarnated in a Game World   ",
	"rating": "(4.0 / 5.0, 59 votes)",
	"author": "Harumine   日峰   ",
	"year": "\n2018",
	"ranking": "#2000   #2000   #3464   #5248   #2534   ",
	"reviewcount": "6 Reviews sorted by",
	"description": "When I saw the fangs of a demon roaring in front of me …\n\nAt that moment, I remembered “I’ve seen this before”\n\n“I’m in the world of the classic RPG I used to play in my previous life.”\n\n“And I’m … a losing heroine who is the hero’s childhood friend, but will be forgotten by him in the future!”\n\nThis character is a childhood friend of the Brave Hero, she confessed to the hero, before he went on his journey to defeat the Demon King, and promises to wait for him until his return …\n\nBut her time on screen ended there, after only an hour.\n\nThe hero fell in love with another girl, the Main Heroine, on his journey and forgets her promise … making many players feel sorry for her.\n\n…\n\nIf I stay in this village like in the original story, my future is only the one of a losing heroine!\n\nIn order to prevent this from happening, I’ll leave the village, armed with the talent for concoction of magical potions that I’ve been working on.\n\nAnd then, I’ll aim to become an alchemist Master in the Royal City.\n\nI’m not sure what the end was for the childhood friend of the Brave Hero in the original story but …\n\nI’ll grab a happy future on my own!>"
}