{
	"url": "https://www.novelupdates.com/series/the-rebirth-of-an-ill-fated-consort/",
	"title": "The Rebirth of an Ill-Fated Consort - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2018/01/illfated2.jpg",
	"noveltype": "(CN)",
	"genre": "Drama   Fantasy   Mature   Psychological   Romance   ",
	"tags": "Ancient China   Beautiful Female Lead   Betrayal   Black Belly   Brotherhood   Calm Protagonist   Cannibalism   Child Abuse   Clever Protagonist   Complex Family Relationships   Cruel Characters   Cunning Protagonist   Death   Death of Loved Ones   Depictions of Cruelty   Doting Older Siblings   Family Conflict   Female Protagonist   Gore   Handsome Male Lead   Jealousy   Long Separations   Love Interest Falls in Love First   Love Rivals   Lovers Reunited   Manipulative Characters   Marriage   Mature Protagonist   Military   Misunderstandings   Multiple Reincarnated Individuals   Nobles   Older Love Interests   Past Plays a Big Role   Personality Changes   Politics   Power Couple   Pregnancy   Reincarnation   Revenge   R*pe   Ruthless Protagonist   Schemes And Conspiracies   Second Chance   Secrets   Slow Romance   Smart Couple   Strong Love Interests   Tragic Past   ",
	"rating": "(4.5 / 5.0, 284 votes)",
	"author": "Qian Shan Cha Ke   เชียนซานฉาเค่อ   千山茶客   ",
	"year": "\n2014",
	"ranking": "#302   #273   #544   #466   #547   ",
	"reviewcount": "69 Reviews sorted by",
	"description": "Crying blood and tears, she pledged a poisonous vow. The gods did not fail her. She was sent back to a decade ago. The legitimate daughter of Jiang family returned from hell.\n\nForget it, whatever! Since they already claimed that she was a temptress that wrecked the country, she shall overturn the world into complete chaos starting with her beguiling sister, her malicious stepmother, her cruel lover and her heartless family. Let her end the lives that Yama refused to end.\n\nShe was a pawn in her past life. In this life, however, the world was her chess board. With an alluring smile and a charming figure that enchanted the entire nation, the red-clothed woman wrecked chaos among the lands. She was a vengeful spirit from hell, determined to make those who wronged her pay in blood.\n\n“I want those who owe me a life debt to hold their hearts out in front of me. I want those who looked down on me to only be able to admire me. I want Lord Zhong Zi to shiver when he sees me. I want to step on this splendid river and mountains!”\n\n                                                               — — — \n\n“You are a temptress and I am a thief.” His robe was as dark as the night and his gaze was as cold as the Northern Star. “A perfect match.”\n\nHer red dress was akin to fire, but her heart was the coldest ice in the winter. \n\nHe was stoic in his black robe, yet he was willing to warm her frozen heart.\n\nIn this life, the elegant man seemed like a snowy bamboo grove with tall, chilly mountains, walking step by step towards her like an unstoppable force.\n\n“Ruan Ruan, if you hate the world, then I shall conquer the lands with you.”\n\n“What if I love the world?” She asked.\n\n“I am the world, so you can only love me,” he answered.>"
}