{
	"url": "https://www.novelupdates.com/series/dangerous-survival-in-the-apocalypse/",
	"title": "Dangerous Survival in the Apocalypse - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/05/dsa.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Romance   Supernatural   Yaoi   ",
	"tags": "Apocalypse   Childcare   Cold Protagonist   Cooking   Cultivation   Doting Love Interests   Evolution   Handsome Male Lead   Human-Nonhuman Relationship   Love Interest Falls in Love First   Magical Space   Near-Death Experience   Overpowered Protagonist   Power Couple   Slow Romance   Special Abilities   Zombies   ",
	"rating": "(4.1 / 5.0, 124 votes)",
	"author": "He Daren   何大仁   ",
	"year": "\n2019",
	"ranking": "#2000   #4059   #2026   #2594   #1440   ",
	"reviewcount": "14 Reviews sorted by",
	"description": "Part 1: \n\nOn April 3rd, 2019, there was a virus outbreak and the cities were besieged with zombies.\n\nA month later, on the national road outside H City, Shen Shian carried a heavy sword and walked around the vehicles abandoned everywhere.\n\n“Don’t make trouble,” he said while turning back. “Keep up, the sky is becoming dark.”\n\n“Yea!” A child who looked to be only four or five years old answered. He slashed the sword in his hand and cut the head of a zombie. Then he reached in and pulled out a marble-sized transparent crystal.\n\nAfter rubbing it a few times on his clothes, he carried a Tang Sword that was half the height of an adult human and ran to Shen Shian.\n\n“An An, I’ll give it to you!”\n\nPart 2:\n\nShen Shian picked up a miserable puppy with dirty and knotty fur and a terrible smell.\n\nThe first time he brought the dog into the spirit spring, the dog turned into a child.\n\nThe second time the child was brought into the spirit spring, he turned into a man.\n\nOn the edge of the misty spring, Shen Shian looked at the man swimming and asked with a frown, “Can you change back?”\n\n“Why?”\n\nShen Shian pursed his lips. “…You will eat too much.”\n\nThe man wrapped himself in a bath towel and emerged from the space with the Tang sword. After a short while, he inserted the sword into the grass and handed Shen Shian a handful of sparkling crystals.\n\n“I might eat more but I am also more capable!”>"
}