{
	"url": "https://www.novelupdates.com/series/the-big-villain-asked-me-to-save-him-when-i-was-reborn/",
	"title": "The Big Villain Asked Me to Save Him When I Was Reborn - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/04/The-big-villain-asked-me-to-save-him-when-I-was-reborn.jpg",
	"noveltype": "(CN)",
	"genre": "Drama   Psychological   Romance   ",
	"tags": "Adopted Protagonist   Amnesia   Beautiful Female Lead   Bullying   Child Abuse   College/University   Dancers   Discrimination   Early Romance   Famous Parents   Female Protagonist   Handsome Male Lead   Hypnotism   Inferiority Complex   Kidnappings   Modern Day   Past Trauma   Poor to Rich   Second Chance   Time Travel   ",
	"rating": "(4.2 / 5.0, 79 votes)",
	"author": "Chunfeng Liuhuo   春风榴火   ",
	"year": "\n2021",
	"ranking": "#1653   #742   #3714   #2950   #3543   ",
	"reviewcount": "21 Reviews sorted by",
	"description": "Jiang Yu was born again and returned to a time when she was a poor and naive 17-year-old. In her previous life, because of poverty, she was forced to abandon her dreams of ballet and become the substitute for the white moonlight of a second generation scumbag. Jiang Yu really didn’t want to experience her poor and miserable youth again.\n\nHowever, when she was helpless, she accidentally discovered that her mobile phone had also traveled with her. Through this mobile phone, she could actually contact people in the future.　\n\nSo, a steady stream of future business found Jiang Yu——　　\n\n“Please help me tell my mom, to not do stock trading when she has money!”\n\n“Please help me tell myself in the past, to not study in the same university as my boyfriend, for which I made a deliberate mistake in the college entrance examination”\n\n“My dad is no longer alive, help me tell him that I am not a waste of space.”\n\nJiang Yu relied on the mobile phone business and earned a lot of money. Until one day, when Jiang Yu received a man’s request for help. The man’s voice was low and magnetic, with a hint of wickedness.\nUpon hearing this sound, Jiang Yu was so scared that the phone almost flew out of her hand.\n\nHe is a criminal with a high intelligence quotient, Qiu Li, who has been constantly reported in the TV news for ten days. For committing a sensational crime. He hoped that Jiang Yu would save him when he was a teenager so that he would not go astray.\nAccording to his information, Jiang Yu found the teenager Qiu Li.　\n\nYoung Qiu Li was held up in the dark alley, being punched and kicked and his eyes filled with repressed and a forbearing light.\nAnd that day, Qiu Li lying in a pool of blood saw the girl in a white dress at the end of the alley.\nAfter seventeen years of endless night, that was the first time he saw the moon.>"
}