{
	"url": "https://www.novelupdates.com/series/xiao-qi-wait/",
	"title": "Xiao Qi, Wait! - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/09/Xiao-Qi-Wait.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Drama   Historical   Romance   Shoujo   ",
	"tags": "Amnesia   Ancient China   Dense Protagonist   Female Protagonist   Handsome Male Lead   Marriage   Misunderstandings   Protagonist Falls in Love First   ",
	"rating": "(3.5 / 5.0, 134 votes)",
	"author": "You Ruo Qing Feng   悠若清风   ",
	"year": "\n2011",
	"ranking": "#6970   #6382   #2594   #3283   #3248   ",
	"reviewcount": "18 Reviews sorted by",
	"description": "Song Liang Zhuo is a young and poor county magistrate. Qian Xiao Qi’s father is a rich man. Qian Xiao Qi falls in love with Song Liang Zhuo the moment she sees him. Each day she waits outside the court’s gates to see him, hoping he will glance her way once. She patiently waits for him to notice her for two years, but he ignores her. She realises it is futile to wait for someone who does not know she exists and she gives up pursuing Song Liang Zhuo.\n\nSong Liang Zhuo despises the shallow young girls who pursue him, but his heart softens seeing Qian Xiao Qi waiting for him to look at her for two years. He relents and he asks for her father’s permission to marry her.\n\nSong Liang Zhuo marries Qian Xiao Qi , but she loses her memory. Qian Xiao Qi’s maid tells her how much Qian Xiao Qi loves Song Liang Zhuo. Qian Xiao Qi not remember why her old self loves someone who despises her. She asks Song Liang Zhuo to divorce her. But he tells her that her father will not give her wedding dowry to him to help poor villagers living in provinces which are affected by floods… until her father is holding a grandchild so he refuses to divorce her. She promises him she will find a way to get her father to give him the wedding dowry without her being pregnant, and she will find him a new wife if he promises to divorce her.\n\nSong Liang Zhuo slowly falls in love with his wife. But he is too slow, because his wife secretly regains her memories… she remembers her pathetic old self for loving the heartless Song Liang Zhuo and she makes secret plans to run away.>"
}