{
	"url": "https://www.novelupdates.com/series/second-marriage-in-the-1970s/",
	"title": "Second Marriage in the 1970s - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/09/Second-Marriage-in-the-s.jpg",
	"noveltype": "(CN)",
	"genre": "Fantasy   Historical   Romance   Slice of Life   ",
	"tags": "Business Management   Childcare   Clever Protagonist   Cooking   Cute Children   Devoted Love Interests   Divorce   Doting Love Interests   Familial Love   Family   Female Protagonist   First-time Interc**rse   Hard-Working Protagonist   Love Interest Falls in Love First   Marriage   Military   Poor to Rich   Pregnancy   Transmigration   ",
	"rating": "(4.1 / 5.0, 141 votes)",
	"author": "洲是   ",
	"year": "\n2017",
	"ranking": "#2352   #2311   #2405   #964   #3533   ",
	"reviewcount": "38 Reviews sorted by",
	"description": "Dong Jiahui, the daughter of the Dong family, was kicked out of the house by the Lu family because she had been married for three years and was unable to get pregnant. Dong Jiahui, who felt ashamed, jumped into the river in search of death. Immediately after she was rescued, her soul also changed.\n\nThe Dong family’s Jiahui was five miles away from the Shanghe Village. Zhao Donglin’s wife was an educated youth who left her two children to go back to the city. In order to take care of the children, Zhao Donglin, who was about to become a battalion commander, retired to the countryside. \n\n“This damned little bit*h cried and shouted to marry us, to let her marry our Donglin. Now she doesn’t even care about her children and wants to go back to the city!” \n\nFor the six-month-old girl, Yingbao, Zhao Donglin wants to give his two children a stepmother. He refused the introduction of 17 or 18 people who were matched with him and finally chose the infertile Dong Jiahui. Zhao Donglin thought that since Dong Jiahui couldn’t have a baby, she would certainly treat Heidan and Yingbao as her own child. \n\nHe inquired and found out that Dong Jiahui was a woman with a submissive personality, and such a woman leads a stable life. As long as she treats the children well, he will treat her well for the rest of his life. \n\nOn the wedding night, Dong Jiahui finally discovered the secret of the original owner’s infertility. It turned out that she was still a v*rgin!>"
}