{
	"url": "https://www.novelupdates.com/series/the-soft-and-cute-omega-male/",
	"title": "The Soft and Cute Omega Male - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/03/The-Soft-and-Cute-Omega-Male.jpeg",
	"noveltype": "(CN)",
	"genre": "Action   Comedy   Gender Bender   Romance   School Life   Sci-fi   ",
	"tags": "Academy   Battle Academy   Cold Love Interests   Cosmic Wars   Female Protagonist   Fleet Battles   Futuristic Setting   Handsome Male Lead   Hard-Working Protagonist   Military   Omegaverse   Power Couple   Protagonist Strong from the Start   Smart Couple   Strategic Battles   Strategist   Strong Love Interests   Tomboyish Female Lead   Tsundere   Wars   ",
	"rating": "(4.3 / 5.0, 22 votes)",
	"author": "Hong Ci Bei   红刺北   ",
	"year": "\n2021",
	"ranking": "#3017   #2956   #8142   #8980   #8261   ",
	"reviewcount": "8 Reviews sorted by",
	"description": "It was the year when Ji Yuezhi differentiated.\r\n\r\nEveryone had expected that the only son of the Ji family would differentiate into an alpha like his rival Zuo Luohuan. After all, Ji Yuezhi excelled in school, was good at fighting, had a tall stature, and exhibited traits typical of alphas before differentiation, yet he had ended up differentiating into an omega.\r\n\r\nThose who supported Ji Yuezhi: Gender doesn’t matter, it’s already 9432, omegas can be independent, self-sufficient and fight in war. Schoolmate Ji’s grades are outstanding, his prospects won’t be worse than those rotten alphas.\r\n\r\nAfter differentiation, the budding alphas, omegas and betas will have to reschedule classes. Following the Affirmative Action Movement, omegas and betas can choose to take the same classes as alphas, such as marksmanship and fighting……\r\n\r\nEveryone was waiting for Ji Yuezhi to take the alphas’ curriculum and f*ck over the alphas but instead he chose to follow a typical omega’s curriculum: “The Art of Flower Arrangement”, “How to Keep a Small Cozy Home”, etc.\r\n\r\nHe even chose “Yoga Class for Omegas”! That’s a course that specializes in training flexibility for an omega’s body!!!\r\n\r\nNo one knew that Ji Yuezhi had someone in mind, and that someone was a female alpha. For the sake of a compatible cohabitation in the future, he planned to gradually transform himself into an O, ideally the kind of omega that emits a pleasant, sweet scent, is traditional and stays at home.\r\n\r\nMany years later, the Federation’s strongest female alpha Zuo Luohuan, only obeyed the words of one person, and that person was none other than Ji Yuezhi.\r\n\r\nEveryone saw the light: This is rich, really rich! Ji Yuezhi is truly worthy of his title, number one in the Department of Strategy. He realized that differentiating into an alpha may not necessarily allow him to beat Zuo Luohan, so back then, he chose to differentiate into an omega to seduce her.>"
}