{
	"url": "https://www.novelupdates.com/series/nigoru-hitomi-de-nani-wo-negau/",
	"title": "Nigoru Hitomi de Nani wo Negau - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/01/Nigoru-Hitomi-de-Nani-wo-Negau_1641798463.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Drama   Fantasy   Mature   Shounen   Tragedy   ",
	"tags": "Adapted to Manga   Adventurers   Appearance Changes   Aristocracy   Army   Boss-Subordinate Relationship   Calm Protagonist   Childhood Friends   Clever Protagonist   Curious Protagonist   Dark   Death of Loved Ones   Depictions of Cruelty   Empires   Fantasy Creatures   Fantasy World   Fast Learner   Flashbacks   Friendship   Gore   Magic   Male Protagonist   Military   Multiple Transported Individuals   Near-Death Experience   Nobles   Past Plays a Big Role   Reincarnated in Another World   Reincarnation   Soldiers   Survival   Sword And Magic   Transported to Another World   War Records   Wars   Weak to Strong   ",
	"rating": "(4.1 / 5.0, 98 votes)",
	"author": "Torutonen   トルトネン   ",
	"year": "\n2020",
	"ranking": "#199   #121   #2020   #253   #3380   ",
	"reviewcount": "6 Reviews",
	"description": "One day, Raizou ​​Takakura, an average salaryman, had a Heart Attack and his life ended that day.\n\nBut, he got a second life, in a different world.\n\nReincarnated with strong skills―― wasn’t what happened to him, instead, he was reincarnated as a foot soldier in a small country, Highserk Empire, which was surrounded by large countries.\n\nWith a new name, Walm, he was thrown into the frontline of war.\n\nCovered in blood and the stench of death, along with his comrades, he was slipping through life-or-death situations.\n\nAn adventurer party with members that could use powerful magic, transferees with overwhelming power called the “heroes”.\n\nIn a deadly battle with them, Walm gradually developed his talent as a warrior which would’ve never awakened if he were to stay in times of peace.\n\nWhile his eyes becoming dark and muddy over time――>"
}