{
	"url": "https://www.novelupdates.com/series/the-big-bosses-are-not-what-i-expected-after-i-transmigrated-into-a-book/",
	"title": "The Big Bosses Are Not What I Expected After I Transmigrated Into A Book - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/09/130943s.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Fantasy   Romance   Yaoi   ",
	"tags": "Artists   Businessmen   Cute Protagonist   Devoted Love Interests   Doting Love Interests   Doting Older Siblings   Familial Love   Family Business   First Love   First-time Interc**rse   Handsome Male Lead   Love Interest Falls in Love First   Male Yandere   Misunderstandings   Modern Day   Multiple Reincarnated Individuals   Music   Obsessive Love   Older Love Interests   Possessive Characters   Power Couple   Second Chance   Transmigration   Wealthy Characters   Yandere   ",
	"rating": "(4.4 / 5.0, 132 votes)",
	"author": "小叶丸   ",
	"year": "\n2020",
	"ranking": "#6970   #2217   #2544   #3518   #1992   ",
	"reviewcount": "34 Reviews sorted by",
	"description": "Qiao Yang transmigrated into a novel full of the rich and the powerful’s scheming.\n\nIn the novel, he fought with his brothers over the family’s inheritance. He engaged in internecine strife and the brothers turned against each other. Also in the novel, he fought openly and secretly with the male protagonist, Gu Ye, in the business world. The two just couldn’t coexist together. \n\nOnly to quickly be defeated and lose everything. In the end, his reputation was ruined, and even abandoned by his family, he came to a miserable end. \n\nQiao Yang checked his bank account balance and counted the long series of zeros behind it: ten … hundred …  thousand … hundred thousand … million…ten million.\n\nDamn! There’s no point in me continuing to work hard anymore! \n\nFirst he gave up his middle position to his brothers, and then withdrew the bidding project with the male protagonist Gu Ye. From then on, he stayed away from the business world and lived the life of a noble son.\n\nEvery day is to play music, go to nightclubs, relax and enjoy the time. It’s just that people who were at odds with him, the look in his eyes is getting more and more kind.>"
}