{
	"url": "https://www.novelupdates.com/series/transmigrated-as-a-villain-i-rely-on-sand-sculpture-to-survive/",
	"title": "Transmigrated As a Villain, I Rely on Sand Sculpture to Survive - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/05/Transmigrated-As-a-Villain-I-Rely-on-Sand-Sculpture-to-Survive.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Romance   Shounen Ai   ",
	"tags": "Adapted to Drama CD   Adopted Children   Adopted Protagonist   Brotherhood   Complex Family Relationships   Cute Protagonist   Doting Love Interests   Doting Older Siblings   Doting Parents   Familial Love   Family   Family Business   Handsome Male Lead   Love Interest Falls in Love First   Older Love Interests   Overprotective Siblings   Possessive Characters   Shameless Protagonist   Sibling Rivalry   Siblings   Sibling's Care   Siblings Not Related by Blood   Slow Romance   Transmigration   Wealthy Characters   ",
	"rating": "(4.3 / 5.0, 128 votes)",
	"author": "马户子君   ",
	"year": "\n2020",
	"ranking": "#223   #285   #2872   #996   #3068   ",
	"reviewcount": "33 Reviews sorted by",
	"description": "Su Huayi became the vicious adopted son with the same name in a novel about the struggle of the rich. \r\n\r\nHe was adopted as a child into the Su family. He was beautiful but with a scorpion’s heart. He repeatedly persecuted his older brother and tried to take over the family business.\r\n\r\n Su Huayi transmigrated at a time when the original owner was up to his usual schemes. \r\n\r\nHe crawled out from under his elder brother’s bed and looked up to meet the latter face-to-face. \r\n\r\nSu Chi’s expression was sullen: 'What are you doing here?'\r\n\r\nSu Huayi shyly bowed his head: '… I wanted to give you a surprise.'\r\n\r\n* \r\n\r\nAs the eldest son of the Su family, Su Chi not only managed the family business but also had to take care of his younger brothers. He was planning to give that malicious adopted brother some trouble, to let him know that the sea of bitterness has no end and that he should turn a new leaf…\r\n\r\nSu Huayi: It all depends on the waves.\r\n\r\nSu Chi: '…'\r\n\r\nTo protect himself, Su Huayi acted coquettish to the point of no return, but he did not notice that the look in his elder brother’s eyes had gradually changed.>"
}