{
	"url": "https://www.novelupdates.com/series/nidome-no-yuusha-ln/",
	"title": "Nidome no Yuusha (LN) - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/04/Nidome-no-Yuusha-LN.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Drama   Fantasy   Harem   Mature   Psychological   Romance   Seinen   Tragedy   ",
	"tags": "Adapted to Manga   Antihero Protagonist   Beastkin   Betrayal   Brother Complex   Clever Protagonist   Cold Protagonist   Cross-dressing   Dark   Death of Loved Ones   Demi-Humans   Demon Lord   Demons   Elves   Evil Gods   Evil Protagonist   Fearless Protagonist   Former Hero   Game Elements   Gods   Human-Nonhuman Relationship   Incest   Level System   Loli   Love Interest Falls in Love First   Magic   Male Protagonist   Mind Break   Personality Changes   Polygamy   R-15   Revenge   Ruthless Protagonist   Sadistic Characters   Second Chance   Seven Deadly Sins   S*aves   Strong Love Interests   Summoned Hero   Torture   Transported to Another World   Twisted Personality   Weak to Strong   Yandere   ",
	"rating": "(3.5 / 5.0, 26 votes)",
	"author": "Kizuka Nero   木塚ネロ   ",
	"year": "\n2016",
	"ranking": "#2000   #2000   #8439   #13807   #6622   ",
	"reviewcount": "2 Reviews sorted by",
	"description": "Ukei Kaito fought a desperate struggle in order to fulfill his role as a summoned hero. He defeated the Demon Lord and saved the very world, only to meet an end filled with betrayal. The companions that he’d trusted throughout his journey betrayed him and killed him by sticking a blade through his chest.\r\n\r\nIt was then that he swore to himself.\r\n\r\nHe swore that, if given another chance, he would no longer so rigidly cling to the concept of “faith.”\r\n\r\nHe swore that, if given another chance, he would dedicate himself to enacting the most atrocious act of revenge possible.\r\n\r\nHe swore that, if given another chance, he would do things right.\r\n\r\n「I’ll kill every single last one of you… I swear it…」\r\n\r\nAnd so, he died, leaving behind not but a series of menacing last words — but his story had yet to end. A voice resounded through his head and informed him that there was more to his fate than what lay beyond the grave.\r\n\r\n【The following is a system message. Tutorial Mode has been terminated.】>"
}