{
	"url": "https://www.novelupdates.com/series/additional-inheritance/",
	"title": "Additional Inheritance - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/10/Additional-Inheritance.jpg",
	"noveltype": "(CN)",
	"genre": "Adult   Drama   Mature   Romance   Smut   Yaoi   ",
	"tags": "Absent Parents   Adapted to Drama CD   Adopted Children   Betrayal   Black Belly   Blackmail   Carefree Protagonist   Confinement   Contracts   Cruel Characters   Cute Protagonist   Family Conflict   First-time Interc**rse   Handsome Male Lead   Inheritance   Kidnappings   Love Interest Falls in Love First   Male Yandere   Manipulative Characters   Mysterious Family Background   Obsessive Love   Persistent Love Interests   Possessive Characters   Righteous Protagonist   Schemes And Conspiracies   Suicides   Tragic Past   Wealthy Characters   Younger Love Interests   ",
	"rating": "(3.8 / 5.0, 44 votes)",
	"author": "Shui Qian Cheng   水千丞   ",
	"year": "\n2015",
	"ranking": "#2917   #1592   #6142   #4595   #4584   ",
	"reviewcount": "6 Reviews sorted by",
	"description": "Yaya died.\n\nShe committed suicide.\n\nThis person, with whom he had no blood relation – whom he’d called ‘elder sister’ for many years, was all too suddenly gone. She left him not just a considerable sum of inheritance, but also a child.\n\nThat year he was only 19 years old, still a child himself, and yet all of a sudden was in charge of the welfare of a 15 year old youth.\n\nThis child was not bothersome, he had none of the impatience nor rebelliousness characteristics of a typical adolescent.\n\nHe had an extremely high IQ, paired with a stability and maturity far exceeding his physical age.\n\nBe it daily living or academics, he didn’t have to worry at all about with the boy. He was able to keep the house in order all on his own.\n\nBut the more he got to know the boy, the more he realized how frightening this child’s many intentions were.\n\nHe wanted to change his mind, could he just take the money and leave the person?>"
}