{
	"url": "https://www.novelupdates.com/series/im-a-humiliated-incompetent-person-but-i-alone-can-talk-to-dragons-so-i-can-choose-all-the-sss-skills-and-loophole-items-i-want-to-im-going-to-become-famous-and-respected-so-to-the-people-wh/",
	"title": "I’m a Humiliated, Incompetent Person, but I Alone Can Talk to Dragons, So I Can Choose All the SSS Skills and Loophole Items I Want to. I’m Going to Become Famous and Respected, So, to the People Who Humiliated Me – Go Die in a Ditch - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/05/Im-a-Humiliated-Incompetent-Person-but-I-Alone-Can-Talk-to-Dragons-So-I-Can-Choose-All-the-SSS-Skills-and-Loophole-Items-I-Want-to-I.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Comedy   Fantasy   Harem   Romance   Supernatural   ",
	"tags": "Adapted to Manga   Animal Rearing   Appearance Changes   Appearance Different from Actual Age   Aristocracy   Beast Companions   Beasts   Charismatic Protagonist   Charming Protagonist   Childcare   Conditional Power   Contracts   Dense Protagonist   Different Social Status   Dragon Riders   Dragons   Fantasy World   Godly Powers   Guilds   Human-Nonhuman Relationship   Immortals   Knights   Lack of Common Sense   Love Interest Falls in Love First   Magic   Magic Beasts   Male Protagonist   Mythical Beasts   Overpowered Protagonist   Poor to Rich   Resurrection   Royalty   Sealed Power   Special Abilities   Sudden Strength Gain   Sudden Wealth   Transformation Ability   Weak to Strong   Wealthy Characters   ",
	"rating": "(2.6 / 5.0, 63 votes)",
	"author": "Miki Nazuna   三木なずな   ",
	"year": "\n2020",
	"ranking": "#2071   #300   #3077   #2477   #5726   ",
	"reviewcount": "10 Reviews sorted by",
	"description": "Cyril was banished from a dragon knight guild.\n\nHe was banished because he wanted to interact with dragons, but the guild and the world beyond it thought of dragons as items. Cyril was treated like a crazy person.\n\nEven after he was banished, though, Cyril didn’t change how he thought of dragons.\n\nTo beat dragons into submission may have yielded short-term results, but Cyril valued building long-term relationships with dragons.\n\nWhen the guild realized he was right, they came crawling back to him with their heads bowed, but it was too late for them.\n\nDragons treated Cyril like he was family, and together, they would rise to the top.>"
}