{
	"url": "https://www.novelupdates.com/series/the-demon-king-of-the-frontier-life-reincarnated-to-become-the-strongest-mage-the-former-demon-king-who-grows-up-while-being-loved-wants-to-know-the-human/",
	"title": "The Demon King of the Frontier Life, Reincarnated to Become the Strongest Mage ~The Former Demon King Who Grows Up While Being Loved, Wants to Know Humans~ (WN) - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/07/The-Demon-King-of-the-Frontier-Life_v2b.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Fantasy   Harem   Romance   ",
	"tags": "Adapted to Manga   Adventurers   Beautiful Female Lead   Fantasy World   Handsome Male Lead   Hiding True Abilities   Hiding True Identity   Magic   Male Protagonist   Naive Protagonist   Overpowered Protagonist   Past Plays a Big Role   Polygamy   Reincarnation   Strong to Stronger   Timid Protagonist   Wizards   Younger Sisters   ",
	"rating": "(3.4 / 5.0, 61 votes)",
	"author": "Sengetsu Sakaki   千月さかき   ",
	"year": "\n2019",
	"ranking": "#2000   #4103   #4674   #6184   #4121   ",
	"reviewcount": "1 Review sorted by",
	"description": "There was a mage called ‘The Lone Demon King’ at the frontier.\r\n\r\nHe was just a creature that never grew old, but he was loved by the villagers as something of a guardian deity.\r\n\r\nHowever, he was destroyed by a magic organization that sees his existence as dangerous.\r\n\r\n200 years later, he is reincarnated as the second son of an aristocrat and obtains the strongest magic power.\r\n\r\n“Let’s pretend to be a human this time”\r\n\r\nHowever, being a human lover, he didn’t particularly think of revenge and has decided to pretend to be human in this life.\r\n\r\nIn his past life, he was the guardian deity of a region, and in this life, he’s a local aristocrat, but he does not know common sense. He doesn’t know how to take it easy.\r\n\r\nAs the second son of an aristocrat, he is loved by his family and friends, and while he is regarded as a master of magic in the magic guild, he becomes an ‘Immortal Mage’ behind the scenes.>"
}