{
	"url": "https://www.novelupdates.com/series/ive-been-reincarnated-as-a-perishable-character-and-im-terrified-of-my-plans-to-be-miserable/",
	"title": "I’ve Been Reincarnated as a Perishable Character, and I’m Terrified of my plans to be Miserable - Novel Updates",
	"image": "https://www.novelupdates.com/img/noimagefound.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Comedy   Fantasy   Harem   Horror   Romance   School Life   Slice of Life   Supernatural   ",
	"tags": "Academy   Beautiful Female Lead   Male Protagonist   Modern Day   Reincarnation   ",
	"rating": "(3.7 / 5.0, 9 votes)",
	"author": "@GINGO   Takudice   卓ダイス   ",
	"year": "\n2021",
	"ranking": "#2000   #2000   #11826   #6185   #11149   ",
	"reviewcount": "No Reviews",
	"description": "After dying of an illness at a young age, I found myself in a game called ［Kagetsu Kaidan］.\r\n\r\nThe problem is that this person is the main character's rival, and he dies in every route.\r\n\r\nIn addition, his 『Spiritual Power』, which is a unique ability in this world, is weak, and it's impossible to counteract it with the original knowledge.\r\n\r\nIf you don't strengthen your body, your head will fall off with a single pinprick.\r\n\r\nI'm not going to inherit the family name, I'm going to be a member of a different family, but I'm going to be enrolled in the 'High School of Shion Academy', where the game takes place.\r\n\r\n「One of the heroines from the original game is watching me, and I'm screwed .......」\r\n\r\nOne day, I was overwhelmed with despair.\r\n\r\nA beautiful girl with a fantastic atmosphere came to me and said,\r\n\r\n「I'm here!」\r\n\r\n「Hey, I'd like to spend some time alone, quietly. ......」\r\n\r\n「Give up!」\r\n\r\nI struggled to avoid the looming dead end, but my knowledge of the original story was already useless.\r\n\r\nI mean, I'm the villain who is spreading the damage in most cases.\r\n\r\nThe more results I produce, the more active I am, the more the world's major powers are paying attention to me.\r\n\r\nBut I want to do what I can.\r\n\r\nEven if there is no scenario, even if we are in a game, we are alive.>"
}