{
	"url": "https://www.novelupdates.com/series/my-groom-ran-away/",
	"title": "My Groom Ran Away - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/09/My-Groom-Ran-Away.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Drama   Romance   Slice of Life   ",
	"tags": "Absent Parents   Beautiful Female Lead   Bickering Couple   Calm Protagonist   Cold Love Interests   Devoted Love Interests   Doting Love Interests   Female Protagonist   First Love   Handsome Male Lead   Heartwarming   Love Interest Falls in Love First   Marriage   Orphans   Persistent Love Interests   Popular Love Interests   Sharp-tongued Characters   Smart Couple   Wealthy Characters   ",
	"rating": "(4.2 / 5.0, 85 votes)",
	"author": "喝口雪碧   ",
	"year": "\n2021",
	"ranking": "#691   #737   #3306   #1186   #3736   ",
	"reviewcount": "23 Reviews sorted by",
	"description": "All the rich people in City B know how much Ruan ZhiYin likes Qin Jue. She had blindly followed behind Qin Jue for many years and watched as he matured from a youthful boy to a young man. Eventually, she had finally waited until a grand wedding was planned for them.\n\nThe Qin and Ruan families were to be connected by marriage. On the day of the wedding, the groom Qin Jue went missing. Ruan ZhiYin knew that Qin Jue had rushed to City C for his ex-girlfriend who had tried to commit suicide. The guests had completely filled the seats and she, who had been looking forward to this wedding for years, finally completely gave up on Qin Jue.\n\nShe was not willing to let the Ruan family become a laughingstock, so she gritted her teeth and dialed the number of her arch-enemy: “Cheng YueLin, come and marry me right now. We will divorce in one year and I will give you the BeiCheng project.”\n\nOn the other side, Cheng YueLin stood in front of a floor covered in cigarette butts and held his phone as he raised a brow: “Miss Ruan’s groom ran away? Okay. Just wait. This Lord will come marry you.”\n\nThe next day, young master Qin and his good friend returned to B City. The assistant who had come to pick them up looked a bit hesitant.\n\nGood Friend: “Could it be that Ruan ZhiYin wants to terminate the marriage contract?”\n\nAssistant: “No, that is not it. But…”\n\nQin Jue: “But what?”\n\nAssistant: “Miss Ruan has switched to a new husband.”\n\nQin Jue: “?”\n\n— Cheng YueLin who had returned home with a beauty: I’ve already received the certificate. You don’t need to call me. Thanks.\n\n***\n\nAfter the wedding.\n\nRuan ZhiYin realised: No matter what I do, I cannot leave this marriage.\n\nCheng YueLin was secretly overjoyed: This is a pie that I never would have thought would fall down from the heavens.\n\nQin Jue who was full of regrets: This is a wife that I can never get back even after she is cremated.\n\n“You dare to run away from the wedding. I dare to change the groom.”\n\n“Even after cremation, you will never be able to get this wife back.”>"
}