{
	"url": "https://www.novelupdates.com/series/rebirth-of-the-generals-granddaughter/",
	"title": "Rebirth Of The General’s Granddaughter - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2017/11/210e0ef19e3c4bb6bba8fcf2755cdc63_th.jpg",
	"noveltype": "(CN)",
	"genre": "Drama   Fantasy   Historical   Josei   Martial Arts   Romance   Tragedy   ",
	"tags": "Beautiful Female Lead   Betrayal   Cunning Protagonist   Family Conflict   Female Protagonist   Handsome Male Lead   Love Interest Falls in Love First   Medical Knowledge   Politics   Reincarnation   Revenge   Reverse Harem   Royalty   Schemes And Conspiracies   Second Chance   ",
	"rating": "(3.5 / 5.0, 112 votes)",
	"author": "bīng yùn   冰愠   ",
	"year": "\nN/A",
	"ranking": "#5262   #4714   #775   #2028   #1746   ",
	"reviewcount": "14 Reviews sorted by",
	"description": "Lanxuan smiled gently as she said, “My dear sister, who told you to obstruct my path? Your man belongs to me, your dowry belongs to me, your everything, belongs to me.”\n\nWith bloodshot eyes, Zhao Hong Xiang gritted his teeth and said clearly, ”Don’t blame me, when you were alive, you were a part of the Zhao family, even when you die, you will remain a ghost of the Zhao family. I will not allow myself to be mocked by the world because of you. Instead of living so miserably, why not die early and reincarnate early? Xuan’er has said that your dowry is 60,000 silvers. I can’t let you take it away, so… why don’t you… GO TO HELL!”\n\nJust when she thought she had died wrongfully under the hands of her friend and husband, she opened her eyes once more only to realize that she had been given a second chance. She had been transported back by four years. Forcefully breaking through the seal her mother had left on her soul, she was granted with supernatural power. “I swear that I will only allow myself to let others down but not the other way around! From now, I want my revenge!”\n\nEvil stepmother? It’s alright, I’ll destroy your reputation before sending you on your way to hell. Hypocritical friend? I’ll ruthlessly tear off your facade and give you a taste of the pain that I once felt. The princess conspiring against me? I’ll just throw her into the mass grave. Since none of you are willing to let me enjoy my life, I’ll drag all of you down with me!\n\nJust as she intends to distance herself from hypocritical slag males, who knew that her devastatingly beautiful appearance would attract even more bees and butterflies?\n\nThat man who had abandoned her like a dirty shoe is now saying that he will marry no one else but her.\n\nPrinces chasing after her, willing to use any methods and do anything just to get in her good graces, and a drop dead gorgeous hoodlum getting involved with her — Who will she choose?>"
}