{
	"url": "https://www.novelupdates.com/series/the-sole-monster-tamer-in-the-world-i-was-mistaken-as-the-demon-king-when-i-changed-my-job/",
	"title": "The Sole Monster Tamer in the World ~I was Mistaken as the Demon King When I Changed My Job~ - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2018/05/mistaken-for-the-demon-king.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Comedy   Ecchi   Fantasy   Harem   Mystery   ",
	"tags": "Adapted to Manga   Antihero Protagonist   Beast Companions   Corruption   Demon Lord   Demons   Dense Protagonist   Discrimination   Dragons   Game Elements   Heroes   Kingdom Building   Kingdoms   Level System   Magic   Magic Beasts   Male Protagonist   Misunderstandings   Monster Tamer   Monsters   Overpowered Protagonist   Protagonist Strong from the Start   Religions   Schemes And Conspiracies   Sword And Magic   ",
	"rating": "(3.7 / 5.0, 56 votes)",
	"author": "Kakei Chisato   筧 千里   ",
	"year": "\n2017",
	"ranking": "#6970   #2000   #3758   #3538   #2323   ",
	"reviewcount": "4 Reviews sorted by",
	"description": "The Class that I, Noah Whitefield, was given by the heavens was no other than “Hero”. The moment I was to be recognized as such, I would be pushed into a journey where I couldn’t return until after I defeated the Demon King. But this job is such a hassle, so excuse me... but I'll pass. So after desperately searching for a way to change this Job, I decided to look for the Divine Job Tome.\n\nBut the words I heard after changing professions were…\n\n――You are now a Monster Tamer.\n\nThus, I became the world’s only Monster Tamer, with a skill to make a variety of monsters into my companions. In the first place, there were no monsters that me, a former “Hero”, couldn’t defeat. So slowly, a big army of monsters started to be built. But wait! I’m a Monster Tamer followed by monsters. I just want to befriend monsters, I don’t want to be thought to be the Demon King just because monsters are following me!>"
}