{
	"url": "https://www.novelupdates.com/series/matrilocal-marriage/",
	"title": "Matrilocal Marriage - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/07/metrilocalmarriage3.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Drama   Romance   Yuri   ",
	"tags": "Ancient Times   Beautiful Female Lead   Betrayal   Business Management   Businessmen   Caring Protagonist   Character Growth   Clever Protagonist   Cross-dressing   Cute Children   Devoted Love Interests   Female Protagonist   Hard-Working Protagonist   Marriage   Nobles   Parallel Worlds   Poor to Rich   Power Couple   Pregnancy   Protagonist Falls in Love First   Slow Romance   Technological Gap   Time Travel   Wealthy Characters   Younger Love Interests   ",
	"rating": "(4.7 / 5.0, 204 votes)",
	"author": "请君莫笑   ",
	"year": "\n2020",
	"ranking": "#2917   #2515   #2676   #2817   #3338   ",
	"reviewcount": "46 Reviews",
	"description": "Yun An was a volunteer chosen among thousands by the space time research institute. Simply planning to record the true historical events of the military revolt in the year nine hundred and sixty, she signed the consent form, stepped into the time machine, but a peculiar thing happened during her travel through time, causing Yun An to be sent to an unknown place and time…\r\n\r\nThis dynasty was not recorded in earth’s history; perhaps Yun An had entered a parallel world.\r\n\r\nThis kingdom was known as the ‘Yan’ kingdom. It’s regime was similar to the middle period of the Ming dynasty. The economy was an unprecedented level of prosperity, and the men were regarded as superior to women.\r\n\r\nThe renowned Lin family of the Yan kingdom lived in luxury and extravagance. Their extreme wealth had already continued for three generations.\r\n\r\nHowever, the famous Lin family faced an awkward problem at their third generation— the master of the family had no son.\r\n\r\nAlthough the master of the Lin family had seven concubines, he had not gained a son for years. Master Lin eventually became too old to have any hope for a male heir.\r\n\r\nThe rise and fall of the Lin family now rests on the shoulders of master Lin’s only legitimate daughter: Lin Buxian.\r\n\r\nThe Lin family appeared to be powerful and untouchable, but it was actually surrounded with danger.\r\n\r\nTheir wealth was hankered after by powerful ministers and coveted by their relatives. Lin Buxian was a woman, but she had to step out often. Because of this, she was often denounced by the public. Eight merchants came to attend Lin Buxian’s twentieth birthday, but they heard the shocking news that her past childhood friend had already become the lucky son-in-law of a Minister, and he intended to take her as a concubine?\r\n\r\nLin Buxian made an announcement to the entire kingdom during her birthday banquet; the Lin estate is looking for a handsome son-in-law, to marry and live with the bride’s family.>"
}