{
	"url": "https://www.novelupdates.com/series/the-invasion-day/",
	"title": "The Invasion Day - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/09/The-Invasion-Day-cover.png",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Fantasy   Sci-fi   Shounen Ai   ",
	"tags": "Aliens   Apocalypse   Army   Calm Protagonist   Character Growth   Comedic Undertone   Determined Protagonist   Earth Invasion   Evolution   Glasses-wearing Protagonist   Handsome Male Lead   Hard-Working Protagonist   Introverted Protagonist   Mutated Creatures   Mutations   Mysterious Past   Politics   Proactive Protagonist   Saving the World   Slow Growth at Start   Slow Romance   Special Abilities   Strategic Battles   Strong Love Interests   Survival   Teamwork   Weak to Strong   ",
	"rating": "(4.4 / 5.0, 102 votes)",
	"author": "Nan Gua Lao Yao   南瓜老妖   ",
	"year": "\n2014",
	"ranking": "#4265   #3561   #3416   #6880   #2775   ",
	"reviewcount": "17 Reviews sorted by",
	"description": "A strange phenomenon fell down from the sky and aliens came over Earth.\n\nOffice nerd Fu Shiwu’s life was turned upside down, but luckily for him, Tang Xuhai, his fierce and powerful neighbour whom he wasn’t exactly on good terms with, took him on a journey to escape.\n\nBut Fu Shiwu could never imagine that halfway through the escape, this unbreakable man turned out to carry a steel plate in his body, which brought on an infection and sent him into a deadly fever.\n\nIn order to save him, Fu Shiwu, a white-collar elite who couldn’t even restrain a chicken, had to bite the bullet and go all out on the unknown terror waiting outside.\n\nIn this apocalypse, people survived with all sorts of tricks.\n\nBy having IQ, having muscles, or hugging the right thighs!\n\nIn order to compete for resources and talents, they also had to exhibit their character, flaunt their morals and push their very limits.\n\nFu Shiwu and Tang Xuhai’s team would like to implicitly express that: They definitely had all the above “virtues”.\n\nThis is a story with zero rebirth, zero transmigration, zero system, but still the right amount of golden fingers to pave a new way for humanity.>"
}