{
	"url": "https://www.novelupdates.com/series/mother-of-school-grass/",
	"title": "Mother of School Grass - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/05/Mother-of-School-Grass.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Romance   School Life   Supernatural   ",
	"tags": "Familial Love   Love Interest Falls in Love First   Persistent Love Interests   Younger Love Interests   ",
	"rating": "(3.3 / 5.0, 3 votes)",
	"author": "Mo Xi Ke   墨西柯   ",
	"year": "\n2019",
	"ranking": "#6970   #2000   #13372   #9890   #12207   ",
	"reviewcount": "No Reviews",
	"description": "Chai Meichen, an unmarried single mother, has a handsome son, who is slightly on a ‘naughty’ side.  \r\n\r\nSuddenly one day, after waking up, Chai Meichen found that her appearance had reverted back to her sixteen-year-old self! Her beauty was still there, and she hadn’t gained weight yet. Her hair was still voluminous too. \r\n\r\nShe wasn’t short on money, and had lots of time. Thus, she decided to go to her son’s school as his classmate and guide him to become well-mannered. \r\n\r\nZhou Rui neither feared Heaven nor Earth, but was terrified of his mother!  Usually, he wasn’t forced to listen any less to his mother braggings that she was a peerless beauty when she was young.\r\nHowever, as a result, suddenly, one day, his mother reverted back to her sixteen-years-old appearance. And damn she was truly a beauty! \r\n\r\nAfter adjusting to the changed appearance of his mother, he found that his mother couldn’t return to her former appearance. And out of nowhere, on a whim, she joined his school and became his classmate?! \r\n\r\nLater on…..\r\n\r\nJust as the tyrannical school grass, whose mere name was enough to make one tremble with fear, lifted a rod, intending to join the brawl…\r\n\r\nHe was slapped by the school flower, the new transfer student, and was made to do his homework.\r\n\r\nUnder the scrutiny of the school flower, Zhou Rui, with a stiff smile, proclaimed to the entire school, “Henceforward, I will strive to study for betterment and make progress everyday. And become a scientist in the future.” \r\n\r\nZhen Rui gave an ultimatum: “Bullying her is tantamount to cursing him.”\r\n>"
}