{
	"url": "https://www.novelupdates.com/series/born-as-the-daughter-of-the-wicked-woman/",
	"title": "Born as the Daughter of the Wicked Woman - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/07/EZVclB2U8AAWsIM.jpg",
	"noveltype": "(KR)",
	"genre": "Drama   Fantasy   Romance   Tragedy   ",
	"tags": "Adapted to Manhwa   Age Progression   Apathetic Protagonist   Beautiful Female Lead   Calm Protagonist   Child Abuse   Child Protagonist   Death of Loved Ones   European Ambience   Family   Family Business   Female Protagonist   Knights   Merchants   Mob Protagonist   Nobles   Orphans   Reincarnated in Another World   Reincarnation   Survival   ",
	"rating": "(4.5 / 5.0, 147 votes)",
	"author": "Suncy   썬씨   ",
	"year": "\n2020",
	"ranking": "#3923   #3424   #2421   #6964   #950   ",
	"reviewcount": "22 Reviews sorted by",
	"description": "I was born as the daughter of a wicked woman in a novel. \n\nAt birth, my mother had already been exposed to her evil deeds and was confined to the spire, and would soon face a miserable death in the hand of the main characters.\n\nI looked at my mother, who was still searching for her ex-husband until the moment she died and held her hands. \n\nMy little hand got tangled with my mother’s rough hand and her eyes full of warmth turned to me.\n\n“I understand Mom.”\n\n“….”\n\n“Don’t suffer anymore, sleep tight.”\n\nDon’t wait for the dad who won’t come. \n\nTears fell from my mother’s eyes at my words, and soon she fell asleep peacefully. \n\nSince the novel’s “Wicked Woman” is now dead, her daughter, I will be beaten to death by people tomorrow night.\n\nAnd the second part of the novel will begin. \n\nA warm novel in which the daughter of the main characters begins her adventure full of happiness. \n\nBut I didn’t want to die, and I had no intention of letting the story flow that way.\n\n“It’s okay to be mean.”\n\nI decided to completely re-write the second part of the novel because it’s a life that may be killed anytime anyway.>"
}