{
	"url": "https://www.novelupdates.com/series/i-decided-to-not-compete-and-quietly-create-dolls-instead/",
	"title": "I Decided to Not Compete and Quietly Create Dolls Instead - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2016/10/a1iqqczofnl.jpg",
	"noveltype": "(JP)",
	"genre": "Comedy   Fantasy   Harem   Romance   Shoujo   Slice of Life   ",
	"tags": "Age Progression   Alchemy   Aristocracy   Arranged Marriage   Beautiful Female Lead   Broken Engagement   Cheats   Crafting   Dolls/Puppets   Female Protagonist   Handsome Male Lead   Magic   Male Yandere   Misunderstandings   Multiple POV   Nobles   Otome Game   Overpowered Protagonist   Reincarnated in a Game World   Reverse Harem   Sentient Objects   Special Abilities   Spirits   Transmigration   Villainess Noble Girls   ",
	"rating": "(4.0 / 5.0, 312 votes)",
	"author": "Toono Konoe   遠野九重   ",
	"year": "\n2013",
	"ranking": "#1233   #3773   #1214   #3417   #348   ",
	"reviewcount": "28 Reviews sorted by",
	"description": "Apparently, this looks like the fantasy world from the Otome game that I used to play in my previous life. “I”, Altrea, am the lively rival character who challenged the heroine again and again until she/I received painful backlashes. \n\nLike only chasing to have the engagement canceled in the Magic Academy, even breaking and taking over the Duke’s house. For all this eventful stuff, please just give me a break! Or should I say the heart of the game’s heroine is too scarily impregnable! Living differently with the game’s knowledge? Dating the love interests in real life is super troublesome, so I refuse!\n\nAnd so my main priority is to definitely not get involved. I will absolutely not go to that academy. I will go to a different country. Living as a Magic Doll Master in a new land is the best way to live. \n\nEh- The Mystic-eyed Doll Princess? Queen Mage of the Netherworld? Even though I seriously tried my best, I have changed class into the last boss. Why!? \n\nWait for a second, It’s a misunderstanding! Stop, forgive me-.>"
}