{
	"url": "https://www.novelupdates.com/series/starting-a-cohabitation-life-with-her-im-going-to-live-with-a-beautiful-girl-in-my-class/",
	"title": "Starting a Cohabitation Life with Her, I’m Going To Live With a Beautiful Girl In My Class - Novel Updates",
	"image": "https://www.novelupdates.com/img/noimagefound.jpg",
	"noveltype": "(JP)",
	"genre": "Comedy   Romance   School Life   Slice of Life   ",
	"tags": "Beautiful Female Lead   Caring Protagonist   Cohabitation   Cooking   Hard-Working Protagonist   Heartwarming   Male Protagonist   Modern Day   Part-Time Job   Popular Love Interests   ",
	"rating": "(3.6 / 5.0, 47 votes)",
	"author": "Red Fox   紅狐   ",
	"year": "\n2019",
	"ranking": "#1444   #468   #3960   #892   #6451   ",
	"reviewcount": "1 Review sorted by",
	"description": "Tsukasa Tendou is a first-year high school student at one of the leading prep schools in the prefecture.\n\nIn his class, there is a beautiful girl who can be described as a Yamato Nadeshiko. She is in the same class as Tsukasa, but they have almost no contact. She has excellent academics, good looks, and is the only daughter of the president. The difference between her and Tsukasa is so great that there is a wall between them that cannot be overcome. They only occasionally exchange greetings, and he doesn’t think they’ll have anything to do with each other in the future. \n\nTsukasa lives alone and works part-time on weekends. He doesn’t interact much with his classmates and is somewhat of a loner. Although he can study reasonably well, he always listens to music at his desk during breaks.\n\nIn the midst of this repetitive daily routine, he met her.\n\nShe was sitting alone on a bench in front of the station. Normally, he would have walked past her without saying a word. But that time, he called out to her.\n\nShe had a large Boston bag beside her schoolbag and was staring into the distance. It was late at night, and normally she would have gone home by now.\n\n“What are you doing here at this hour? Hurry up and go home.”\n\nShe looks at him and bites her lip as she answers.\n\n“Tendo-san? It’s none of your business.”\n\n“I see. Have a safe trip home.”\n\nThis is the story of two people who begin with such a conversation.>"
}