{
	"url": "https://www.novelupdates.com/series/i-heard-that-i-am-poor/",
	"title": "I Heard That I Am Poor - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/09/IHTIAP-trans-cover.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Drama   Romance   Yaoi   ",
	"tags": "Absent Parents   Acting   Adapted to Drama CD   Adapted to Manhua   Calm Protagonist   Cute Protagonist   Devoted Love Interests   Love Interest Falls in Love First   Modern Day   Music   Showbiz   ",
	"rating": "(4.2 / 5.0, 36 votes)",
	"author": "Su Jingxian   苏景闲   ",
	"year": "\n2019",
	"ranking": "#2000   #2000   #6402   #6963   #4787   ",
	"reviewcount": "6 Reviews sorted by",
	"description": "Cold tyrant lord President Xie You has a one ton heavy weibo focus on Yu Nian, the new singer. Yu Nian participated in a singing variety show and became popular overnight, and his singing voice was called the sound of nature.\n\nXie You: Oh, it must be a tuner, how could it be so good!\n\nYu Nian’s GIF with a smile while singing swept the whole internet and he was praised for his looks.\n\nXie You: Oh, must have been a plastic surgery, how could it be so beautiful!\n\nA few months later, President Xie, the antifan leader, updated his Weibo: Hello everyone, we are together @YuNian\n\nSunspots & Netizens: Joking with us? \n\nYu Nian was invited to be a guest on a treasure appraisal program. Yu Nian only glanced at it and concluded that an ancient painting worth 70 million yuan was fake.\n\nAfter the show was broadcast, many netizens started the group mocking mode. They were addicted to mocking Yu Nian crazily, looking forward to slapping him in the face. \n\nWhen Xie You knew: “No, no, no, NianNian, listen to me, this time it really wasn’t me who brought the water army!”\n\nSoon after, Yu Nian’s life experience was picked up… \n\nAfter all the netizens had fallen silent, they entered the collapse mode: “Painting is indeed false, because the authentic one has been in his house for three hundred years!”\n\n“The point is, this is the same person who can not afford to takeout, why are you so good? Been trained, trained, trained – do we still have a chance to call you laoji?”>"
}