{
	"url": "https://www.novelupdates.com/series/the-marshals-want-to-get-divorced/",
	"title": "The Marshals Want to Get Divorced - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2017/11/87a93f03gy1fehuasoomrj205k07s0uh.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Drama   Fantasy   Romance   Sci-fi   Supernatural   Yaoi   ",
	"tags": "Acting   Adapted to Manhua   Aliens   Celebrities   Clever Protagonist   Clones   Couple Growth   Demonic Cultivation Technique   Devoted Love Interests   Doctors   Dreams   Fallen Angels   Futuristic Setting   Genius Protagonist   Handsome Male Lead   Jealousy   Male Yandere   Misunderstandings   Modern Day   Multiple Identities   Multiple Personalities   Multiple Realms   Mysterious Illness   Mysterious Past   Non-linear Storytelling   Overpowered Protagonist   Past Plays a Big Role   Past Trauma   Persistent Love Interests   Possessive Characters   Power Couple   Tragic Past   Transmigration   Unconditional Love   Vampires   Virtual Reality   World Hopping   Younger Love Interests   ",
	"rating": "(4.4 / 5.0, 157 votes)",
	"author": "Long Qi   龙柒   ",
	"year": "\n2017",
	"ranking": "#6970   #6195   #2179   #2942   #1178   ",
	"reviewcount": "26 Reviews sorted by",
	"description": "After the fall of the Galactic Federation, long-time lovers Lu Li and Xie Jianwei defeated the alien invaders, and formed the Empire with Lu Li as commander. Everyone thought that all was well between them, but...\n\nXie Jianwei one day found out that Lu Li’s personality had split into several parts. \n\nThey were all individuals, yet they were still the same Lu Li. How could Xie Jianwei bear to watch as each Lu Li plotted to kill the others?\n\nXie Jianwei used his SSS-class spiritual strength to enter Lu Li’s inner world, where Lu Li was god, director and actor all in one. To get to the bottom of the mystery, Xie Jianwei had to act along with Lu Li’s delusions, or else the dreamworld would collapse, worsening Lu Li’s condition, and splitting the personalities even further.>"
}