{
	"url": "https://www.novelupdates.com/series/the-former-kingdom-toppling-beauty-and-the-flag-crusher-crown-prince/",
	"title": "The Former Kingdom-toppling Beauty and the Flag-crusher Crown Prince - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/01/The-Former-Kingdomtoppling-Beauty-and-the-Flagcrusher-Crown-Prince.jpg",
	"noveltype": "(JP)",
	"genre": "Adventure   Comedy   Fantasy   Romance   Supernatural   ",
	"tags": "Adapted to Manga   Average-looking Protagonist   Dragons   Engagement   Female Protagonist   Inferiority Complex   Magic   Nobles   Quirky Characters   Reincarnation   Reluctant Protagonist   Royalty   Strong Love Interests   Sword And Magic   Tomboyish Female Lead   ",
	"rating": "(3.9 / 5.0, 29 votes)",
	"author": "Rumi Rumiko   瑠美るみ子   ",
	"year": "\n2020",
	"ranking": "#3567   #3174   #6256   #4427   #5478   ",
	"reviewcount": "1 Review sorted by",
	"description": "Azalea, the Duke’s daughter, had the misfortune of remembering her previous life. It was a pathetic and tragic life where she was executed for throwing the country into chaos by seducing the emperor of the time. In her final moments before being executed, as she was falsely accused of evil acts and with her family and everyone close to her having already been killed, she decided that if she had another chance, she would never be involved with people in powerful positions ever again.\r\n\r\nBut by some cruel twist of fate, Azalea somehow ended up as the fiancée of Crown Prince Lotus. In her previous life, everything was caused by her beautiful appearance, but that wasn’t even the case anymore!\r\n\r\n“I’m sure that someone who is more suitable for His Highness than my pitiful self will come along, so I’ll just gracefully retreat when that time comes,” is what Azalea thought, hoping to live a long and peaceful life this time.\r\n\r\nBut she never expected…\r\n\r\n“Your Highness! Stop casually getting along with the Emperor of the enemy country! Their Majesties’ hearts are about to stop!?”\r\n\r\n“Your Highness! Please stop using the Demon Lord as a training dummy! Look! The Hero is crying!”\r\n\r\n“Your Highness! You can’t just go to the Land of the Spirits because you’re curious! Everyone is worried about you! Come home quickly… You don’t know how to get home? That’s… *just perfect*! I’ll try to come pick you up as soon as I can! Just please wait quietly and *don’t do anything*!”\r\n\r\nThe only one who can handle the high-spec Prince Lotus is the equally high-spec Azalea.\r\n\r\nThis is the story of how Azalea, the depressive first-class flag architect, and the oblivious flag-crushing Prince Lotus came together.>"
}