{
	"url": "https://www.novelupdates.com/series/we-live-in-dragons-peak/",
	"title": "We Live in Dragon’s Peak - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2016/01/rdlm9ul.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Comedy   Fantasy   Harem   Romance   Shounen   ",
	"tags": "Adventurers   Beastkin   Beautiful Female Lead   Bloodlines   Character Growth   Cute Protagonist   Demon Lord   Demons   Determined Protagonist   Dragon Riders   Dragons   Elves   Engagement   Fantasy Creatures   Fantasy World   Friendship   Hard-Working Protagonist   Harem-seeking Protagonist   Heroes   Inferiority Complex   Kingdoms   Magic Beasts   Male Protagonist   Master-Disciple Relationship   Older Love Interests   Polygamy   R-15   Royalty   Spirits   Strong Love Interests   Strong to Stronger   Sword And Magic   Sword Wielder   Weak to Strong   World Tree   ",
	"rating": "(4.1 / 5.0, 144 votes)",
	"author": "Terabaru Rururu   寺原るるる   ",
	"year": "\nN/A",
	"ranking": "#2000   #6164   #1711   #2513   #1496   ",
	"reviewcount": "6 Reviews sorted by",
	"description": "Ernea, a boy who yearns after the Hero.\n\nAt the west side of the Dragon’s Peak is where the Dragon tribe and the Dragon men inhabit, the north side is where flying Dragons are hunted, at the south is where the Forest of Dragons is spread out & the Capital city of the kingdom which had a connection with the dragons wherein he was brought up in. His everyday life before he turns into a 15 year old and set off on a journey, he worked hard with the students of his class there\n\nA certain day where he needed to go to the forest of dragons for the sake of obtaining his daily food provisions, thereupon is where he had a chance meeting with an Ancient old Dragon.\n\nErnea studied under the Ancient old dragon & trained desperately even if he did it clumsily\n\nI want to have many brides like the hero and become happy!\n\nI want a bride with a big chest!\n\nHowever, a bride who brandishes a blunt weapon is scary\n\nErnea that grows up with his companions has gradually been dragged into the conflict of the Mazoku and the Dragon men>"
}