{
	"url": "https://www.novelupdates.com/series/omiai-shitakunakattanode-muri-nandai-na-jouken-wo-tsuketara-doukyuusei-ga-kita-ken-ni-tsuite/",
	"title": "Omiai Shitakunakattanode, Muri Nandai na Jouken wo Tsuketara Doukyuusei ga Kita Ken ni Tsuite - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/11/9fo51lu1frqi9b8yimz4j47wageu_kjp_zb_1cz_gldm.jpg",
	"noveltype": "(JP)",
	"genre": "Comedy   Drama   Romance   School Life   Slice of Life   ",
	"tags": "Adapted to Manga   Adopted Children   Arranged Marriage   Beautiful Female Lead   Calm Protagonist   Child Abuse   Clever Protagonist   Cold Love Interests   Complex Family Relationships   Couple Growth   Cute Story   Engagement   Familial Love   Family   Family Conflict   Famous Protagonist   Handsome Male Lead   Heartwarming   Love Interest Falls in Love First   Male Protagonist   Mature Protagonist   Modern Day   Multiple POV   Past Trauma   Popular Love Interests   Pretend Lovers   R-15   Smart Couple   Wealthy Characters   Younger Sisters   ",
	"rating": "(4.3 / 5.0, 161 votes)",
	"author": "Sakuragi Sakura   桜木桜   ",
	"year": "\n2020",
	"ranking": "#1420   #2412   #1130   #597   #1693   ",
	"reviewcount": "17 Reviews sorted by",
	"description": "One day, Yuzuru Takasegawa — a first-year high school student — is urged by his grandfather to go on an arranged marriage meeting, insisting that he wants to see his great-grandson before he dies.\r\n\r\nHowever, not wanting to bear the weight of a fiancee at the tender age of a freshman in high school, Yuzuru tries to avoid the arranged marriage meeting by imposing an irrational condition that, “ If she is Blonde Haired, Blue Eyed, Fair Skinned etc., only then I will think about the marriage”.\r\n\r\nBut somehow, he finds the girl who meets the conditions that Yuzuru has put out, and he reluctantly ends up going to matchmaking only once.\r\n\r\nAnd on the day of matchmaking, it was Arisa Yukishiro, a beautiful girl with reputation at school, shows up on the scene.\r\n\r\nUpon hearing her story, it seems she was also reluctantly made to go on matchmaking.\r\n\r\nTherefore, the two of them try to prevent themselves from further marriage proposals with their false “engagement”.\r\n\r\nAnd so, as they play the role of fake lovers, they find themselves in love with each other and become real lovers.>"
}