{
	"url": "https://www.novelupdates.com/series/whats-wrong-with-the-summoner-being-a-shadow/",
	"title": "What’s Wrong With the Summoner Being a Shadow - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/01/Whats-wrong-with-the-summoner-being-a-shadow.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Comedy   Drama   Fantasy   Harem   Romance   School Life   Shounen   Supernatural   ",
	"tags": "Academy   Beautiful Female Lead   Fantasy World   Game Elements   Male Protagonist   Misunderstandings   Modern Day   Summoning Magic   ",
	"rating": "(3.8 / 5.0, 34 votes)",
	"author": "Kamiya   かみや   ",
	"year": "\n2020",
	"ranking": "#6970   #4873   #5121   #4427   #6673   ",
	"reviewcount": "2 Reviews sorted by",
	"description": "It has been a long time since another world has become a familiar presence.\n\nBy turning on the switch of the mobile terminal “Gear” that is given at the same time as becoming a high school student, it has become an era where you can spend a day in a different world instead of dreaming that day.\n\nThe main character, Toru Fujima, who is a twisted shady guy, gains aptitude for summoning magic, but there are no essential monsters to summon.\n\nWhile unavoidably earning a living by collecting, he comes into contact with a group of Paripi (party people) in his class and encounters a girl who is being treated as coldly as he is. Little does Toru know that this is the beginning of everything.\n---------------------------------------------------------------------------------------------------------------\n\nIn an era where people can freely travel between other worlds and reality like a video game, Tooru Fujima is an introverted guy in high school who thinks of extroverts as his enemies, and considers a confession of love from a girl to be a punishment. 'I can only depend on myself.' \n\nWith this in mind, Tooru had decided to start making a living as a summoner in another world, but monsters are needed for summoning magic to work... And since there are none, he's been living day-to-day, making some income by harvesting medicinal herbs and such. \n\nBack in the real world, Tooru goes his own way, ignoring the advances and confessions of love from beautiful girls. But one day, he meets a penniless girl who's good at wandering the streets... And they end up living together, becoming partners, and even getting married?!\n\nSource: HobbyJapan>"
}