{
	"url": "https://www.novelupdates.com/series/back-to-the-years-when-my-father-was-in-school/",
	"title": "Back to the Years When My Father Was in School - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/10/Back-to-the-Years-When-My-Father-Was-in-School.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Drama   Mystery   Romance   School Life   ",
	"tags": "Amnesia   Arrogant Characters   Beautiful Female Lead   Black Belly   Complex Family Relationships   Female Protagonist   Handsome Male Lead   Misunderstandings   Naive Protagonist   Older Love Interests   Poor to Rich   Rich to Poor   Rivalry   Second Chance   Time Skip   Time Travel   Wealthy Characters   ",
	"rating": "(4.3 / 5.0, 38 votes)",
	"author": "春风榴火   ",
	"year": "\n2020",
	"ranking": "#2000   #2000   #6789   #10840   #8430   ",
	"reviewcount": "10 Reviews sorted by",
	"description": "Before the age of 20, Lu Yan was a squeamish rich second generation who was held by her father in the palm of his hand. It all ended when her father Lu Zhen was schemed against by his opponent and went bankrupt overnight. The man who ruined Lu Zhen’s life was Shen Kuo, the cold-blooded upstart who no one in Jiangcheng knew. \n\nThis extremely cold man not only bankrupted Lu Zhen’s company, but also abducted his daughter Lu Yan away to his mansion. \n\nBecause of an accident, Lu Yan died and was reincarnated back to her father’s youth era. She watched as her teenage father hang out with a bunch of unruly teenagers, laughing wildly and loudly. He clutched Shen Kuo’s collar and patted his face as he mocked him, “Come on, call me dad.” \n\nEveryone knows that there are two men in the seventh grade who can’t afford to be messed with. \n\nLu Zhen, a wealthy and precious son, arrogant and domineering, wicked to the bone.  \n\nAnd Shen Kuo, poor and silent, with a strong fist and muscular body. \n\nThe two are incompatible rivals. Recently, classmates discovered that a girl was following Lu Zhen and her appearance was a 9 out of 10 like him. The little girl was so cute, always following him like a little tail. He was frustrated and threw money at her, “For the last time, don’t follow me!”\n\nThe little girl finally stopped following him later on. He was not used to it until he saw his rival Shen Kuo pressing her against the wall, asking in a cold voice, “Do you like me?”\n\nShe was so scared and said sobbingly, “Like… like…” \n\nLu Zhen was about to explode, “Messing with my daughter? How about you call me your dad!” \n\nShen Kuo, “Dad.” \n\nLu Zhen, “…”>"
}