{
	"url": "https://www.novelupdates.com/series/a-villainess-pulled-out-the-sword-instead-of-the-hero/",
	"title": "A Villainess Pulled Out the Sword Instead of the Hero - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/07/A-Villainess-Pulled-Out-the-Sword-Instead-of-the-Hero.jpg",
	"noveltype": "(KR)",
	"genre": "Comedy   Fantasy   Romance   ",
	"tags": "Beautiful Female Lead   Clever Protagonist   Enemies Become Allies   Female Protagonist   Handsome Male Lead   Mythology   Transmigration   Underestimated Protagonist   Villainess Noble Girls   ",
	"rating": "(3.8 / 5.0, 6 votes)",
	"author": "단이로   ",
	"year": "\n2022",
	"ranking": "#6970   #2000   #12463   #10270   #9939   ",
	"reviewcount": "No Reviews",
	"description": "The Legendary Sword, Excalibur.\r\n\r\nThe one who draws that sword will become the Master of the continent.\r\n\r\nI became a villainess in a mythological novel.\r\n\r\nMorgana Le Fay, the villainess who was executed by the Hero after stealing the Legendary Sword and delivering it to the final Dark Villain.\r\n\r\n'I will refrain from evil deeds. I'm a good person!'\r\n\r\nSo, I tried to escape from the Dark Villain, enjoy a peaceful life, and be wise in this world.\r\n\r\nHowever, as I was checking if the sword was properly inserted into the rock, I stopped pulling it out.\r\n\r\n'Why is the Legendary Sword so easily pulled out?! What about the Oracle?'\r\n\r\nOf course, I tried to pass the Excalibur to the main character and run away, but the atmosphere became strange.\r\n\r\n'Where were you planning to go with the Sword?'\r\n\r\n'Well, I don't know. Going out to the lake ahead...?'\r\n\r\n'Yes, beyond that lake is the land of Britain.'\r\n\r\n'I have no intention of handing you over to Arthur.'\r\n\r\n'Hey, there seems to be some misunderstanding.'\r\n\r\n'I’ll bring the continent into your hands, so don’t leave and stay by my side. Morgana.' \r\nThe new king of Avalon will open the door to war.\r\n\r\n'My dear Morgana. Forgive me for daring to desire the King of Britain. I will risk my life and honor to put you in the place you deserve.'\r\nThen the main character should be the Master of the Sword.\r\n\r\n'I don't care if the other person is a woman. The marriage is already prepared. Come on, let's go to Britain and push my father away!'\r\nThe heroine, who's declared in the Oracle to marry the male protagonist, the Hero of this world.\r\n\r\n—Once you pick it up, I'll go with you until you die. All right, here comes the Master of the continent!\r\n\r\nEven this damn Excalibur!!\r\n\r\nWhy is everyone crazy? Excuse me, I don't need that continent!\r\n\r\n>"
}