{
	"url": "https://www.novelupdates.com/series/hello-sunbae/",
	"title": "Hello, Sunbae - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/08/Hello-Sunbae.jpg",
	"noveltype": "(KR)",
	"genre": "Adult   Drama   Mature   Romance   Smut   ",
	"tags": "Contracts   Cunning Protagonist   Female Protagonist   First Love   First-time Interc**rse   Flashbacks   Lovers Reunited   Male Yandere   Modern Day   Multiple POV   Poor Protagonist   Possessive Characters   R-18   Secret Relationship   Younger Love Interests   ",
	"rating": "(3.4 / 5.0, 8 votes)",
	"author": "Chyomchyom   춈춈   ",
	"year": "\n2016",
	"ranking": "#1632   #1913   #11683   #2766   #10523   ",
	"reviewcount": "No Reviews",
	"description": "Jae-hee took a sip of hot coffee. I can't sleep when caffeine goes into my body.\r\n\r\n'Have you finished drinking?'\r\n'Yes.'\r\n'Good job.'\r\n\r\nJung-hoo smiled. The sound of him putting the mug on the table was especially loud. Then he stood up and approached Jaehee while loosening his tie.\r\n\r\n'You're... now...'\r\n'I'm not going to let senior sleep tonight.'\r\n\r\nWith her eyes wide open, she looked at Jung-hoo nearing her.\r\n\r\n'What are you doing?'\r\n'Don't you usually scream? Aren't you going to scream?'\r\n'Get out of the way, don't mess with me.'\r\n\r\nWhen he touched her lips, the lips suddenly opened and Jae-hee was surprised and tried to let go of his hand. However, Jung-hoo grabbed Jae-hee's hand and pressed it against his lower lip.\r\n\r\n'I kept thinking about you.'\r\n\r\nHis moving tongue touched Jae-hee's blunt calluses on the tips of her nails slightly. The hand holding her own was a fine hand without any callus. She was suddenly bothered by her calloused hand that was being held.\r\n\r\n\r\n'What are you thinking about? I'm still speaking.'\r\n\r\nWhite teeth bit her itchy finger.\r\n\r\n\r\n'Ugh...'\r\n'Sleep with me. Sunbae just nod your head. I'll take care of the rest.'\r\n\r\nAs I lowered my head gently, I could feel his black eyes examining my actions one by one.\r\n>"
}