{
	"url": "https://www.novelupdates.com/series/since-i-became-healthy-after-my-contract-with-a-weapon-was-broken-i-decided-to-live-for-my-happiness/",
	"title": "Since I Became Healthy After My Contract With a Weapon Was Broken, I Decided To Live For My Happiness - Novel Updates",
	"image": "https://www.novelupdates.com/img/noimagefound.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Fantasy   ",
	"tags": "Abandoned Children   Adventurers   Aristocracy   Beast Companions   Fantasy World   Male Protagonist   Special Abilities   Sword And Magic   Weak to Strong   ",
	"rating": "(3.4 / 5.0, 15 votes)",
	"author": "Arashiyama Shisetsu   嵐山　紙切   ",
	"year": "\n2022",
	"ranking": "#298   #788   #5802   #260   #8222   ",
	"reviewcount": "2 Reviews sorted by",
	"description": "Differing from elves and beastmen, humans cannot use magic. Due to this peculiarity, they have mana stored inside their body. If the mana present inside is too large, they will be afflicted by an illness called Mana-Poisoning. Suffering from this disease since childhood, I was unable to perform much physical activity. My family was the Leslie Count household who hereditarily performed knightly duties. They were cold and indifferent to me. This was true even for the sword Katrina who was contracted to me. She is a tool called Servant which possesses a personality, using such tools even human beings will be able to cast magic. By binding a contract with her, I somehow managed to live this long by releasing a portion of the mana stored inside me. That was how enormous the amount of mana inside me was.\r\n\r\nOne day, the doors of my room opened, and Katrina and my father walked inside. They stood up a false claim that I had been trying to destroy her by using her violently.\r\n\r\n“Nicola, I am disinheriting you. I cannot allow someone who has violated our family’s moral principles to succeed the Leslie household.”, announced my father.\r\n\r\n“I will break my contract with you. I cannot take it any longer.”, said Katrina.\r\n\r\nI woke up somewhere faraway after having my contract broken, being disinherited and expelled from my house. I soon noticed that the symptoms of Mana-Poisoning had disappeared, and I’d become healthy. My body felt really light. I somehow knew the reason why. Due to the same reason, I was now able to do something….>"
}