{
	"url": "https://www.novelupdates.com/series/after-rebirth-i-become-popular-in-the-entertainment-industry/",
	"title": "After Rebirth, I Become Popular in the Entertainment Industry - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/06/After-Rebirth-I-Become-Popular-in-the-Entertainment-Industry.jpg",
	"noveltype": "(CN)",
	"genre": "Romance   Shounen Ai   ",
	"tags": "Artists   Broken Engagement   Calm Protagonist   Handsome Male Lead   Lovers Reunited   Second Chance   ",
	"rating": "(3.9 / 5.0, 113 votes)",
	"author": "Lin Ang Si   林盎司   ",
	"year": "\n2020",
	"ranking": "#3802   #2872   #3274   #2619   #3671   ",
	"reviewcount": "38 Reviews sorted by",
	"description": "Tang Ziyou was reborn. In his previous life, he gave everything to his fiancé, actor Gu Jiuci, but he could not get the other party’s love. In this life, Tang Ziyou decided to let go. He took off the ring on his hand, moved out of Gu Jiuci’s house, returned to the entertainment industry, and proposed to dissolve the marriage contract.\n\nGu Jiuci was born in a wealthy family, handsome, had countless suitors, but he was engaged to Tang Ziyou.\n\nA friend asked him: “How does it feel to be engaged?”\n\nGu Jiuci’s thin lips lightly opened: “Annoying.”\n\nKnowing that Tang Ziyou wanted to dissolve the marriage contract, his friend raised his glass to congratulate him: “Now you aren’t annoyed.”\n\nGu Jiuci’s face was as heavy as iron, not only irritable but also flustered.\n\n. . .\n\nGu Jiuci: “We were engaged when we were young.”\n\nTang Ziyou: “Outdated bad practices, you said, I understand.”\n\nGu Jiuci: “I am your fiancé.”\n\nTang Ziyou: “Fiancé does not equal husband, I know what you said.”\n\nGu Jiuci: “I don’t agree to dissolve the marriage contract!”\n\nTang Ziyou: “A marriage contract is just a marriage contract, and you don’t like it. I remember what you said.”\n\nGu Jiuci: …how can I beat myself to death!\n\n. . .\n\nGu Jiuci discovered that Tang Ziyou really didn’t care about him anymore. Not only did he not care about him, but he also became popular in the entertainment circle and was liked by more and more people.\n\nHis brother: “You are not the only child in our family. Marrying me is also an option.”\n\nHis friend: “Don’t harm Xiao You, I will treat him well, don’t worry.”\n\nGu Jiuci was impatient: “Who said I don’t like him, stay away from my wife!”\n\nTang Ziyou: “Don’t talk nonsense, we’re already separated.”\n\nGu Jiuci: “Never separate, never separate! I will listen to you from now on, Xiao You, so don’t dissolve your marriage contract with me ok?”\n\nTang Ziyou: “Heh.”>"
}