{
	"url": "https://www.novelupdates.com/series/the-magnates-six-year-old-niece/",
	"title": "The Magnate’s Six-year-Old Niece - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/01/The-magnates-sixyearold-niece.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Comedy   Drama   Fantasy   Martial Arts   Mature   Mystery   Romance   School Life   ",
	"tags": "Alternate World   Apocalypse   Artifacts   Caring Protagonist   Character Growth   Charismatic Protagonist   Child Protagonist   Cultivation   Cute Children   Daoism   Doting Love Interests   Famous Parents   Female Protagonist   Friendship   Handsome Male Lead   System Administrator   ",
	"rating": "(3.1 / 5.0, 10 votes)",
	"author": "凤不羁   ",
	"year": "\n2018",
	"ranking": "#2000   #2000   #10054   #11743   #10361   ",
	"reviewcount": "2 Reviews sorted by",
	"description": "After inheriting millions of yuan in debt, Si Nian Nian thought she would be a little girl trying to make money to pay off her debts, but her life suddenly turned upside down and she became the Si family's favorite princess. \r\n\r\nUncle Si: 'My Nian Nian is delicate and weak, you're not allowed to bully her!'\r\n\r\nThe people who just witnessed Si Nian Nian lift the truck with her bare hands: 'Don't worry, Third Young Master Si, we don't dare!'\r\n\r\nGrandma Si: 'My Nian Nian is so beautiful and kind-hearted that she won't even trample an ant to death; don't bully her!'\r\n\r\nThe people who just witnessed Si Nian Nian break the killer's neck with her bare hands: 'Don't worry, Old Madam Si, we won't dare!'\r\n\r\nGrandpa Si: 'My Nian Nian is frugal, she never wastes a penny, don't make her suffer.'\r\n\r\nA debtor who has long been reduced to Si Nianni's little brother: 'Old Master Si, don't worry, I don't dare!'\r\n\r\nDuring a simple task, Bu Chen Su picked up a clingy and delicate girl. \r\n\r\nFrom then on, he pampered, protected and loved her, but when he saw that the raw rice was ready to be cooked, he suddenly found that the way Si Nian Nian looked at him was getting more and more wrong.\r\n\r\nOh no! Was it possible that his identity that had been hidden for years was about to fall off?>"
}