{
	"url": "https://www.novelupdates.com/series/s/",
	"title": "S - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2015/08/s.png",
	"noveltype": "(JP)",
	"genre": "Action   Drama   Psychological   Yaoi   ",
	"tags": "Adapted to Drama CD   BDSM   Character Growth   Clubs   Conflicting Loyalties   Couple Growth   Cruel Characters   Death of Loved Ones   Detectives   Drugs   Firearms   Incest   Loner Protagonist   Manipulative Characters   Murders   Mute Character   Organized Crime   Police   Possessive Characters   Revenge   Secret Identity   Secret Organizations   Siblings Not Related by Blood   Spies   Suicides   Tragic Past   Unconditional Love   Wealthy Characters   ",
	"rating": "(3.9 / 5.0, 29 votes)",
	"author": "Aida Saki   ",
	"year": "\n2005\n",
	"ranking": "#2000   #2000   #9813   #13807   #9288   ",
	"reviewcount": "3 Reviews sorted by",
	"description": "S Vol. 1\n\nShiba is a detective in the fifth anti-organized crime division of the Tokyo Metropolitan Police, a.k.a. “Anti-Gang 5” specializing in handgun seizures. Shiba’s secret weapon is “S” (“spy”), an informant who plays a key role in Shiba’s information gathering. Shiba is training an informant who has been officially accepted into Shinjuku’s Matsukura Group within the Budoha crime syndicate. One day, Shiba awakes to an anonymous phone call. “Watch out for your S.” A tale of two men whose lust, pride and loneliness collide!\n\nS Vol. 2: A Love Bite\n\nDetective Masaki Shiiba's informant or 'S,' Keigo Munechika, has proven himself to be an excellent source of information. But the payment of sex for every lead given is taking its toll on Shiiba. But with his new assignment as back-up to a fellow undercover detective, Shiiba learns that there are far worse things than having sex with your male S--falling helplessly in love with him, for example. S volume 2 continues the drama and passion between a detective and his spy set in the highly-charged underground world of Tokyo.\n\nS Vol. 3: Split\n\nFor almost a year now, Shiiba has been using Keigo Munechika as his “S,” his spy, to get information on the gun dealings of the Yakuza world. Shiiba uses his body in exchange for Munechika's sensitive information… and only his body as far as Shiiba is concerned. Shiiba vows their relationship will not go beyond that. But when a rowdy young man with a penchant for piercing and an enigmatic Yakuza leader cross paths with the young detective, sins of the past are unearthed once more-sins that just might shatter the fragile bond between the detective and his “S.”\n\nS Vol. 4: Afterglow\n\nAt the end of S volume 3, detective Masaki Shiiba was last seen running away from the hospital room of his injured S, Keigo Munechika. Now, Shiiba has turned in his resignation, bought a gun of his own, and is bent on only one mission--to kill Takanari Godou. He vows to get the truth from Godou, even if he has to throw away his morals and life to do it. But can he do it? Can he shoot another person and commit cold-blooded murder for revenge?>"
}