{
	"url": "https://www.novelupdates.com/series/give-me-up-hold-me-tight/",
	"title": "Give Me Up, Hold Me Tight - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2018/04/pic.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Drama   Romance   ",
	"tags": "Adapted to Drama   Amnesia   Female Protagonist   Modern Day   ",
	"rating": "(3.4 / 5.0, 5 votes)",
	"author": "Jassica   Su Jingchu   苏静初   ",
	"year": "\n2016",
	"ranking": "#2000   #2000   #12224   #11077   #11400   ",
	"reviewcount": "1 Review sorted by",
	"description": "This is the novel that shares the same name as the annual fashion romance drama《Stay With Me》, starring Joe Chen, Wang Kai, and Qiao Renliang.\r\n\r\nThere are many different wedding dress designs. Princess-style, fishtail-style, strapless-style......\r\n\r\nThere are also many different kinds of love. Romantic, heart-pounding, sad......\r\n\r\nOn this Earth, the most beautiful wedding dress is the one when I marry you. That love that's the best on this Earth that you wear is that which I still tightly hold in my palm after I gave everything up.\r\n\r\n***\r\n\r\nOnce she unexpectedly drowned, part of her brain lacked oxygen for a long time, making the famous clothing designer Li Weiwei lose parts of her memory. Thus, her memories stopped at when she was 23 years old. The boyfriend who she was mutually passionately in love with in her memories had unexpectedly become her rival, and a stranger even became her fiancé. Li Weiwei wasn't convinced that she would break up with her ex-boyfriend Chen Yidu, so she tried hard to to investigate previous events. In order to protect Weiwei and get his own fiancée back, her fiancé thwarted Weiwei's investigations by every possible means, keeping watch over her surroundings. Li Weiwei recalled the past and discovered that she and the person beside her had gradually forgotten their first dream while they were busying themselves. The reason that Weiwei and Chen Yidu broke up was also because as the two of them were in the middle of the process of chasing after their occupations, they neglected their love and their bond and walked even farther down the path of grudges and misunderstandings. Chen Yidu misunderstood the relationship between Weiwei and his parent and broke up with her in the end. The 30-year-old Li Weiwei decided to change her current situation, and step by step, she untangled past misunderstandings and forgot her previous differences with her rival, not only retrieving her romance, but also regaining her first heart and her dreams.>"
}