{
	"url": "https://www.novelupdates.com/series/the-demon-king-always-thinks-im-secretly-in-love-with-him/",
	"title": "The Demon King Always Thinks I’m Secretly In Love With Him - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2018/11/demonking.png",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Comedy   Romance   Xianxia   Yaoi   ",
	"tags": "Abusive Characters   Acting   Cowardly Protagonist   Cultivation   Demon Lord   Demons   Dense Protagonist   Dishonest Protagonist   First Love   First-time Interc**rse   Forced into a Relationship   Handsome Male Lead   Hard-Working Protagonist   Love Interest Falls in Love First   Misunderstandings   Mob Protagonist   Persistent Love Interests   Possessive Characters   R*pe Victim Becomes Lover   Royalty   R*pe   Seduction   S*xual Abuse   S*xual Cultivation Technique   Slow Romance   Strong Love Interests   System Administrator   Transmigration   Transported to Another World   Tsundere   Wealthy Characters   Yandere   ",
	"rating": "(4.2 / 5.0, 541 votes)",
	"author": "Dōng Fāng Huáng Guā   Eastern Cucumber   东方黄瓜   ",
	"year": "\n2018",
	"ranking": "#391   #3448   #755   #1177   #327   ",
	"reviewcount": "104 Reviews",
	"description": "Bai Yang is the youngest son of a rich family who grew up spoiled, unambitious and having no one expect anything from him. He doesn’t really mind this though, because he’s still able to live a simple and happy life.\n\nOne day, however, his older brother got into an accident and is now comatose. Bai Yang’s father now has to consider his youngest son to take over the family business. Unfortunately for him, Bai Yang is a weak, timid, and cowardly child. How can he ever succeed?\n\nWanting to change his son’s personality, the father has Bai Yang transmigrated into the world of Wild Wind, a very famous fantasy novel. Bai Yang’s father hopes the environment of that world will shape his son to be more arrogant and domineering, as a child of a wealthy scion family ought to be.\n\nHowever, due to an error with the Main System, instead of transmigrating as the protagonist, Bai Yang ends up becoming a cannon fodder villain, Xie Zietian, from the Demon Realm! In order to safely and quickly return to his world, Bai Yang has to ensure that the protagonist, Zhou Ying, ascends to the heavens so his transmigration mission will be complete.\n\nIn order to sneak into the human realm and help Zhou Ying, Bai Yang comes up with a variety of excuses to the Demon King of Eternal Night, such as…\n\nBai Yang, in a dignified manner: “Your Majesty, that person might threaten the demon world. I went to the human world to kill him for you!” (Actually, I went there to meet the protagonist.)\n\nBai Yang, proclaiming his loyalty: “Your Majesty, hang in there. I will go to the human world to find the elixir for you!” (Actually, I went there to save the protagonist.)\n\nBai Yang, with an attitude of selfless dedication: “Your Majesty, I just want to go to the human world to further your great cause!” (Actually, I went there to see the protagonist.)\n\nThe Demon King’s face remained impassive but, in fact, the tips of his ears were red. He was thinking: I can’t believe he loves me so deeply…\n\nDemon King: “Hmph! Seeing how clingy you are, I’ll accept your love. Tell me! Whatever you need, I’ll give it to you!”\n\nBai Yang: “****! Your Majesty, I don’t love you.”\n\nDemon King: “No, you love me.”\n\nThe Demon King truly believed Bai Yang and he shared a deep mutual love until he discovered that Bai Yang was having an “affair” with a “wild human” …>"
}