{
	"url": "https://www.novelupdates.com/series/the-genius-incompetent-woman-wants-to-be-a-villainess-a-lady-who-married-in-the-place-of-her-stepsister-is-unaware-of-the-doting-dukes-love/",
	"title": "The Genius “Incompetent” Woman Wants to be a Villainess ~a Lady who Married in the place of her Stepsister is Unaware of the Doting Duke’s Love - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/06/The-Genius-Incompetent-Woman-Wants-to-be-a-Villainess-a-Lady-who-Married-in-the-place-of-her-Stepsister-is-Unaware-of-the-Doting-Dukes-L.jpeg",
	"noveltype": "(JP)",
	"genre": "Comedy   Drama   Romance   Shoujo   Slice of Life   ",
	"tags": "Doting Love Interests   European Ambience   Female Protagonist   Handsome Male Lead   Marriage of Convenience   Misunderstandings   Sibling Rivalry   Villainess Noble Girls   Younger Sisters   ",
	"rating": "(3.4 / 5.0, 15 votes)",
	"author": "Ichibu Saki   一分咲   ",
	"year": "\n2022",
	"ranking": "#1768   #1264   #6471   #1705   #7829   ",
	"reviewcount": "1 Review sorted by",
	"description": "“This is a contract marriage.” “Yes, thank you!” “…What?”\n\nAvril, a daughter who was hailed as a prodigy when she was young, was bullied for being ‘incompetent.’ For being a villainess, she’d be married to a lustful old duke in the place of her stepsister…\n\nHowever, what was waiting for her was a beautiful young man who was the exact opposite of the rumors. But of course, the way the surroundings treated Avril, whom they believed to be a villain, was unfortunate.\n\nNevertheless, Avril, who was too accustomed to being oppressed, remained calm. She obediently demonstrated her insensitivity and abilities as a ‘villainess’, and transformed her surroundings into her ally.\n\nOn the other hand, the duke quickly found out that Avril was neither incompetent nor villainous.\n\n“Avril, who dared to refer to you as ‘incompetent’ and as a ‘villain’? …I won’t forgive them.” “Uhm, that’s…?”\n\nThis is a story about a heroine who lived at her own pace even if she was unloved by her family, and was cherished and happy in her newfound world.>"
}