{
	"url": "https://www.novelupdates.com/series/maou-gakuen-no-hangyakusha/",
	"title": "Maou Gakuen no Hangyakusha - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/05/Maou-Gakuen-no-Hangyakusha.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adult   Adventure   Comedy   Drama   Ecchi   Fantasy   Harem   Mature   Mystery   Romance   School Life   Seinen   Supernatural   ",
	"tags": "Abusive Characters   Adapted to Manga   Aggressive Characters   Androgynous Characters   Arrogant Characters   Battle Academy   Battle Competition   Beautiful Female Lead   Clingy Lover   Cohabitation   Conditional Power   Cross-dressing   Demon Lord   Demons   Depictions of Cruelty   Discrimination   Early Romance   Elemental Magic   Fast Learner   Game Elements   Hated Protagonist   Hell   Hidden Abilities   Homunculus   Human-Nonhuman Relationship   Loli   Love Interest Falls in Love First   Magic   Magic Formations   Male Protagonist   Master-Servant Relationship   Modern Day   Nobles   Nudity   Obsessive Love   Otaku   Polygamy   Popular Love Interests   Power Struggle   Quiet Characters   Racism   Rivalry   Sadistic Characters   Secrets   Senpai-Kouhai Relationship   Shy Characters   Strength-based Social Hierarchy   Strong Love Interests   Sudden Strength Gain   Teamwork   Trap   Underestimated Protagonist   Weak to Strong   ",
	"rating": "(3.9 / 5.0, 181 votes)",
	"author": "Kuji Masamune   久慈マサムネ   ",
	"year": "\n2019",
	"ranking": "#6970   #4852   #2997   #3799   #1847   ",
	"reviewcount": "6 Reviews sorted by",
	"description": "Humanity is nothing but a slave for the devil race──.\r\n\r\nA normal high school student, Morioka Yuuto was chosen to be a candidate for the next devil king. He transferred to the academy for the devils, Ginsei (Silver Star) Academy where he was held in disdain by other students. 「──I swear I’ll make you the devil king. That’s why……make me your retainer」 Yuuto’s encounter with a beautiful devil, Himekami Lizel changed his life and his world. He could learn any kind of magic instantly and absorb magic power infinitely by getting skin contact with his girl retainers. That was a special power that the devil race didn’t have and was only permitted for the human Yuuto. The human who became a devil king candidate challenged the strongest devils in order to become the devil king of justice!\r\n\r\nExhilarating and fascinating. The fantasy story of climbing up in magic academy is beginning!>"
}