{
	"url": "https://www.novelupdates.com/series/imprint-of-count-wolf/",
	"title": "Imprint Of Count Wolf - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/04/Imprint-of-count-wolf.jpeg",
	"noveltype": "(KR)",
	"genre": "Adult   Drama   Romance   Smut   ",
	"tags": "Aristocracy   Arranged Marriage   Beautiful Female Lead   Different Social Status   European Ambience   Female Protagonist   First-time Interc**rse   Handsome Male Lead   Nobles   R-18   Short Story   Werebeasts   ",
	"rating": "(3.4 / 5.0, 35 votes)",
	"author": "Rabbit Duke   토끼공작   ",
	"year": "\n2020",
	"ranking": "#2000   #2000   #5612   #6262   #5243   ",
	"reviewcount": "2 Reviews sorted by",
	"description": "‘Will Count Arnulf accept it, even though I’m the one who’s coming?’\n\nLisa, an illegitimate daughter, eventually became a substitute for Eleonora, the daughter of the Duke of Aida, after an unwanted marriage with the ‘Wolf Count’ that was arranged by the King. As soon as she arrived at the castle, her poor self, who doesn’t have any support from the Duke, was married immediately off.\n\n“What happened to her? Princess of Aida?” Lisa trembled in fear, thinking that she might be caught as people frown upon seeing her appearance.\n\nAfter the ceremony, the two headed towards the wedding chamber…\n\n* * *\n\n“There is a witness in the next room.”\n\n“Ah.”\n\nLisa opened her eyes wide without even knowing.\n\n“If you accept it now, it means that you can’t file a marriage annulment later as an excuse for fraud,” the Count declared.\n\nLisa showed a frightened face. The Count’s eyes trailed from Lisa’s lips to the nape of her neck and chest. And looked down at her belly, which was rising and falling with tension. And then put his palm on it.\n\n“Ah!” A groan mixed with pleasure erupted from Lisa’s throat.\n\n“You’re like a rabbit with its neck being bitten. Am I so scary?”\n\n“No.”\n\nLisa spoke with a loud voice, as if she was going to burst forth. The Count was indeed scary, but she has nowhere to go if she leave this place\n\n“I’m here to get married.”>"
}