{
	"url": "https://www.novelupdates.com/series/the-emperors-favorite-imperial-concubine-from-the-northeast/",
	"title": "The Emperor’s Favorite Imperial Concubine From the Northeast - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/06/The-Emperors-Favorite-Imperial-Concubine-From-the-Northeast.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Fantasy   Historical   Yaoi   ",
	"tags": "Ancient Times   Carefree Protagonist   Devoted Love Interests   Doting Love Interests   Handsome Male Lead   Jealousy   Love Interest Falls in Love First   Playful Protagonist   Strong Love Interests   System Administrator   Transmigration   ",
	"rating": "(4.5 / 5.0, 25 votes)",
	"author": "One Big Goose   Yi Zhī Dàyàn   一只大雁   ",
	"year": "\n2020",
	"ranking": "#4265   #4079   #8589   #8106   #6596   ",
	"reviewcount": "3 Reviews sorted by",
	"description": "Ye Yang, a straight man from Northeast China, transmigrated into a novel about court fights, became a concubine, and was bound to a system, which could put on view the favorability score of the main characters.\r\n\r\nOn condition that the emperor’s favorability score was too high, he’d fall in love with Ye Yang. However, if his favorability score was too low, he’d be mercilessly killed. In order to protect his life and chastity, Ye Yang forced himself to create his own persona, repeatedly switching between the personality of an unrefined man from Northeast China and the first beauty of the harem.\r\n\r\nYet, things were getting worse and worse. At first, he let the favorability score of the dog emperor drop. Later, the score began increasing rapidly. Watching how the favorability score was about to skyrocket, Ye Yang panicked.\r\n\r\nHe wore a gold chain and raised a mink, silencing all of the imperial concubines of the harem. Feng Luan’s favorability score had been increased by +1.\r\n\r\nHe had a snowball fight with the dog emperor and pushed him into a snowdrift. Both of them caught a cold. Feng Luan’s favorability score had been increased by +10.\r\n\r\nThe mink he raised thought out a plan for Feng Luan to renovate the imperial study room worth of more than 10.000 taels of silver. The imperial study was so horrible that one could hardly bear to look at it.\r\n\r\nFeng Luan’s favorability score had been increased by +100.\r\n\r\nWhat’s going on! Are you still a straight man!\r\n\r\n……\r\n\r\nThe longer Ye Yang lived in degradation, the more he felt that the dog emperor was different from what he initially thought.\r\n\r\nAt his feet the ground was covered in blood and bones, but behind him was the delightful scenery of the prosperous world, and the coming of all nations.\r\n\r\nA few years later, he helped Ye Yang up the stairs and gazed into the distance. He saw a myriad of twinkling lights, bustling, bright and beautiful.\r\n\r\nAnd Feng Luan whispered in his ear.\r\n\r\n“My dear Imperial Concubine, look.”\r\n\r\n“This is our country.”>"
}