{
	"url": "https://www.novelupdates.com/series/demon-noble-girl-story-of-a-careless-demon/",
	"title": "Demon Noble Girl ~Story of a Careless Demon~ - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/05/Demon-Noble-Girl-Story-of-a-Careless-Demon_1653401919.jpg",
	"noveltype": "(JP)",
	"genre": "Adventure   Comedy   Fantasy   Psychological   Romance   Slice of Life   ",
	"tags": "Adapted to Manga   Age Progression   Beautiful Female Lead   Calm Protagonist   Charming Protagonist   Child Protagonist   Cute Protagonist   Dark   Demon Lord   Demons   Dense Protagonist   Depictions of Cruelty   Elemental Magic   Fantasy World   Female Protagonist   Heroes   Hiding True Abilities   Hiding True Identity   Humanoid Protagonist   Loyal Subordinates   Magic   Male Yandere   Master-Servant Relationship   Misunderstandings   Multiple POV   Multiple Reincarnated Individuals   Overpowered Protagonist   Protagonist Strong from the Start   Quirky Characters   R-15   Race Change   Reincarnated in Another World   Returning from Another World   Ruthless Protagonist   Saints   Time Loop   Time Paradox   Unreliable Narrator   Vampires   Yandere   ",
	"rating": "(4.5 / 5.0, 1002 votes)",
	"author": "Haru no Hi   Harunohi Biyori   春の日   春の日びより   ",
	"year": "\n2015",
	"ranking": "#1768   #704   #203   #1358   #97   ",
	"reviewcount": "90 Reviews sorted by",
	"description": "She had a dream: the world was brimming with light. Family. School. Friends. Trains. Buses. Movies. Books. In that world of light, she grew into adulthood… and at the very end, in a white room, she fell into darkness. She awoke from the dream to find that she had become a demon. In the demon world, she lived a carefree life until she encountered a powerful being.\n\nAfter such a long time spent living as a demon, before she knew it, spreading in her heart was a yearning for that world of light. She plunged herself into a summoning magic circle that had appeared. Then… when she opened her eyes once again, she had become a human baby.\n\nShe was in the Holy Kingdom. She felt fearful: while she was indeed a demon, she only had the strength of a baby. Her being a demon, if discovered, would be terrible. Was she a human or a demon? Would she be able to survive from here on out?>"
}