{
	"url": "https://www.novelupdates.com/series/spoil-you-all-your-life/",
	"title": "Spoil You All Your Life - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/04/B27C0C9E-B06C-4C95-AD54-106AAB73D23A.jpeg",
	"noveltype": "(CN)",
	"genre": "Romance   ",
	"tags": "Beautiful Female Lead   Calm Protagonist   Devoted Love Interests   Doting Love Interests   Female Protagonist   Handsome Male Lead   Hard-Working Protagonist   Love Interest Falls in Love First   Marriage   Military   Modern Day   Older Love Interests   Strong Love Interests   Wealthy Characters   ",
	"rating": "(3.3 / 5.0, 10 votes)",
	"author": "伍家格格   ",
	"year": "\nN/A",
	"ranking": "#6970   #2000   #11237   #11743   #9761   ",
	"reviewcount": "1 Review sorted by",
	"description": "Shizixian, is the most handsome army general. Compelling heroic spirit, handsome, and outstandingly talented.\n\nWhen he stands still, it’s as if a jade tree is facing the wind, peerless under the heavens. When he smiles, the sky and earth brightens, as if the sun and moon are both dazzling the world. \n\nShizixian: “Little thing, do you know the regulations for divorcing in a military marriage?”\n\nMo Zimu: “Won’t tell you.”\n\nShizexian: “Be good. Recite it, surprise me.”\n\n“Don’t play with me, this is not surprising enough… The spouse of an active serviceman who requests a divorce must obtain the consent of the serviceman, except for in circumstances of where the serviceman has committed a great wrong”\n\n[Interpretation: If both husband and wife agree to divorce, they can agree to divorce just like ordinary marriage. Otherwise, as long as the servicemen has not committed a major wrong, he will have a veto power on the divorce.]\n“So fast, I’m surprised!”\n\nThe alarm he gave her was unexpectedly enough – — —\n\nMo Zimu, a very principled person, her principle is simply- read the mood!\n\nAlluring as a fox, recklessly flashy. In her view, love as such when the couple should be harmonious, evenly matched, low demands or pithily waiting;\n\nNone of that are to her taste!\n\n“I’ve thought there were many different kinds of happiness, but I have never once dreamed of the kind of happiness you’ve given me.”\n\n“I’ve thought about many different kinds of love, but I have never dreamed of the kind of love you’ve given me”.\n\n“I’ve thought about different ways of ways dying, but I never dreamed of you…”\n\n“If I am not a powerful career women, then I want ‘Memoriable Planning’!” (TN: the company where she works as a Chief)\n\n“If there is such a great thing as a next life, you will still be my exclusive protector, okay?”\n\n“We, have a next life?”>"
}