{
	"url": "https://www.novelupdates.com/series/becoming-a-movie-queen-after-transmigrating-as-the-villains-cat/",
	"title": "Becoming a Movie Queen after Transmigrating as the Villain’s Cat - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/07/vil-cat.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Romance   Slice of Life   Yuri   ",
	"tags": "Acting   Beautiful Female Lead   Cold Love Interests   Cute Protagonist   Doting Love Interests   Human-Nonhuman Relationship   Modern Day   Non-humanoid Protagonist   Pets   Ruthless Protagonist   Selfish Protagonist   Slow Romance   Villainess Noble Girls   Wealthy Characters   ",
	"rating": "(4.5 / 5.0, 64 votes)",
	"author": "Shu Shiyi   殊十一   ",
	"year": "\n2020",
	"ranking": "#4617   #3796   #3069   #2712   #4660   ",
	"reviewcount": "8 Reviews sorted by",
	"description": "Coincidentally, Lin Sifei transmigrated to become the cat of a villainess from a novel that she read.\n\nOh, but the villainess was quite tragic. Her parents had both died when she was young, and she suffered quite a bit of humiliation. Even though she was quite lonely, her cat also ignored her. And because she was the villainess and thus offended the novel’s original heroine, she was bankrupted by one of the many boyfriends of the aforementioned heroine.\n\nAh, she was very pitiful! Lin Sifei, after wiping away her tears of pity for the villainess, decided to give her comfort and warmth, and vowed to get rid of that white lotus green tea heroine for her.\n\nWhen the heroine worked in the company, Lin Sifei immediately used her ultimate cat spying powers to find her issues and got her fired.\n\nWhen the heroine became a model, Lin Sifei immediately acted cute and used her power as a cute cat to get onto magazine covers instead of her.\n\nAnd when the heroine attempted to start a career in the showbiz, Lin Sifei went “pow”, turned back into a human, and immediately showed everyone the charms of a true movie queen.\n\n__\n\nLuo Ke had been having dreams lately, dreaming that she was wandering on the streets alone, dying alone in the pouring rain.\n\nWhen she woke up from those dreams, though, the ball of fur that was her cat near her shoulder would somehow give her warmth.\n\nAnd she slowly realized that this cat she got seemed to really like her and stick to her… and her cat seemed to understand human language.\n\nWhen her cat, suddenly, one day, became a person…\n\nLuo Ke: To be honest, I’m not all that surprised.>"
}