{
	"url": "https://www.novelupdates.com/series/adonis/",
	"title": "Adonis - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/10/cover.jpg",
	"noveltype": "(KR)",
	"genre": "Action   Drama   Fantasy   Martial Arts   Mature   Romance   ",
	"tags": "Academy   Adapted to Manhwa   Beautiful Female Lead   Calm Protagonist   Cold Protagonist   Discrimination   Dragons   Dwarfs   Elves   Enemies Become Lovers   Fantasy Creatures   Fantasy World   Female Protagonist   Goddesses   Handsome Male Lead   Hiding True Abilities   Hiding True Identity   Kingdoms   Knights   Male Yandere   Nobles   Obsessive Love   Past Plays a Big Role   Possessive Characters   Reincarnation   Royalty   Second Chance   Spirits   Strong Love Interests   Sword And Magic   Sword Wielder   Time Skip   Time Travel   Unconditional Love   Wars   Weak to Strong   Yandere   ",
	"rating": "(4.4 / 5.0, 195 votes)",
	"author": "Hyedori   혜돌이   ",
	"year": "\n2016",
	"ranking": "#604   #1340   #1608   #1175   #1277   ",
	"reviewcount": "41 Reviews sorted by",
	"description": "“You were my enemy who always defeated me, but you were also a pretty good companion.”\n\n“Shut up! What do you think will possibly change if you say that now after all this time?”\n\nHe, who was more like her than any other. That was why they were so fixated on only each other, why they were so madly obsessed about only each other.\n\nThe only difference between them was that one wholeheartedly wanted to have the other, while the other wholeheartedly wanted to defeat him.\n\nThis was the very reason why this catastrophe had happened despite that they were the other’s sole companion.\n\n“This life is over. But in the next, I won’t be your enemy, but your knight.”\n\nIf there is a next life, I will offer up my sword to you.\n\nA brightly burning flame was pathetically extinguished.\n\nAnd so, Ianna Roberstein, a duchess of the Kingdom of Roanne and the strongest swordswoman on the continent, died at the hands of the Conqueror Arhad Roygen, the emperor of the Bahamut Empire.\n\n‘But why am I alive?’>"
}