{
	"url": "https://www.novelupdates.com/series/the-corpse-ruler-confuses-the-world-all-seven-husbands-are-devils/",
	"title": "The Corpse Ruler Confuses the World, All Seven Husbands Are Devils - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2016/07/14778s1.jpg",
	"noveltype": "(CN)",
	"genre": "Adult   Drama   Harem   Josei   Mature   Romance   Supernatural   ",
	"tags": "Ancient China   Appearance Different from Actual Age   Beastkin   Cold Protagonist   Female Protagonist   Humanoid Protagonist   Immortals   Jiangshi   Matriarchy   Murders   Polyandry   Reverse Harem   Reverse R*pe   Royalty   R*pe   Ruthless Protagonist   Stoic Characters   Transmigration   Weak to Strong   ",
	"rating": "(4.2 / 5.0, 306 votes)",
	"author": "I Am A Small Dark Girl   Wo Shi Ge Xiao Hei Niu   ",
	"year": "\nN/A",
	"ranking": "#6970   #6153   #1999   #10477   #1759   ",
	"reviewcount": "24 Reviews sorted by",
	"description": "Her original self was a powerful jiangshi who had cultivated for innumerable years. However, when she attempted to unlawfully enter the world of the immortals, she was discovered by the Jade Emperor and thrown into the mortal world as punishment. Her soul then left her corpse, fusing with the body of the Motian Dynasty's sixth princess. She didn't even have a chance to fully comprehend her current circumstances before her maid unexpectedly ignored her mistress, even publicly provoking her!\n\n'What? That weak and cowardly idiot who has neither her father's love or mother's favor actually mistook her older sister as her maid?! All the royal princes in the world loathe her?'\n\n'Damn you! This old lady will let all of you understand why the flowers are so red!'\n\n'Hey! Did you hear? That cowardly sixth princess unexpectedly snatched away the man that the eldest princess favored today!'\n\n'How is that interesting news? That fourth princess who ran always ran amuck in the capital city is now confined to her bed now!'\n\nThe good-for-nothing counterattacks! The previously cowardly and incompetent sixth princess suddenly reveals her exceptional talents! She is full of radiant elegance, and unparalleled disdain!\n\nShe is driven by the desire to shed no more tears! However, if she had known what would happen later, she would have been better off acting stupid! She had calculated thousands, tens of thousands of scenarios, but had never calculated one where one day, her own prey would unexpectedly turn around, and ruthlessly bully her instead! Damn it, she still hasn't sucked any blood yet!>"
}