{
	"url": "https://www.novelupdates.com/series/survive-foolish-bottom/",
	"title": "Survive! Foolish Bottom! - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/09/Survive-Foolish-Bottom.jpg",
	"noveltype": "(KR)",
	"genre": "Comedy   Romance   Yaoi   ",
	"tags": "Appearance Changes   Determined Protagonist   Game Elements   Handsome Male Lead   Hiding True Identity   Otome Game   Shameless Protagonist   Showbiz   Singers   Straight Uke   System Administrator   Transported into a Game World   ",
	"rating": "(4.0 / 5.0, 17 votes)",
	"author": "이설린   ",
	"year": "\n2020",
	"ranking": "#3633   #3321   #9866   #3955   #10107   ",
	"reviewcount": "No Reviews",
	"description": "I grew up receiving plenty of love as the youngest member of a gangster family. The things I currently like the most are men’s passionate friendships and motorcycles. Although I’m slightly dumb, I could cover it with money, so I wasn’t dissatisfied with this world…\n\nHow had the situation become like this?\n\n“Since your fans probably long for cheerful and refreshing Parkha-ssi! Can I ask for some aegyo to take a hold of their hearts~?”\n\n“Aegyo, f- What aegyo?”\n\nIn an instant, the atmosphere turned heavy as if someone had poured cold water over it. That’s right. This was the music show stage.\n\nAnd I…\n\n‘Ah, f*ck.’\n\n『Σ(ﾟﾛﾟ;) A pro idol doesn’t say horrible words like that! (｀Д´*)o』\n\n‘I’m f*cked…’\n\n『To be reborn as a great idol, a compulsory penalty will be imposed!』\n『Automatic selection after 3 seconds ♥』\n‣ Cute aegyo ♥\n‣ Very cute aegyo ♥\n‣ Very very cute aegyo ♥\n\nI’d become the main character, idol ‘Parkha,’ of this damn game. \n\nFrom the beginning, I shouldn’t have started this kind of game. I should’ve deleted it as soon as I downloaded it. I shouldn’t have stayed up all night to clear it. I really shouldn’t have done something like request to participate in a beta test! \n\nHowever, even if I regretted it, it was too late. \n\n『Automatic selection is completed ♥ A choice has been automatically outputted!』\n\n‣ Parkha did that because he was so nervous (´ﾉω；`) I’ll show you my aegyo (*>ω>"
}