{
	"url": "https://www.novelupdates.com/series/i-wont-get-drunk-with-my-nemesis-again/",
	"title": "I Won’t Get Drunk With My Nemesis Again - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/06/I-Wont-Get-Drunk-With-My-Nemesis-Again.png",
	"noveltype": "(CN)",
	"genre": "Romance   Shounen Ai   Yaoi   ",
	"tags": "Devoted Love Interests   Doting Love Interests   Enemies Become Lovers   Handsome Male Lead   Kidnappings   Love Interest Falls in Love First   Misunderstandings   Modern Day   Older Love Interests   Popular Love Interests   Reluctant Protagonist   Showbiz   Stalkers   Strong Love Interests   ",
	"rating": "(3.9 / 5.0, 42 votes)",
	"author": "Qin Wine Hiccups   秦酒嗝儿   ",
	"year": "\n2022",
	"ranking": "#1570   #2911   #5525   #2113   #5213   ",
	"reviewcount": "8 Reviews sorted by",
	"description": "On the day Jiang Zhao won the Golden Orchid Award for Best Actor, the reporter who interviewed him offstage deliberately asked:\n\n“I heard that you and Mr. Xiao Siye, the former film star, are brothers in the Film Academy. How is the relationship between the two of you?”\n\nThe whole entertainment circle knows that Jiang Zhao and Xiao Siye are rivals, and they have been tit for tat since their debut, but there must be fan wars whenever they are in the same frame.\n\nJiang Zhao held the golden trophy and smiled faintly in front of the camera: “We’re not familiar with each other.”\n\nAfter the press conference, Jiang Zhao was walking in the empty VIP channel when someone suddenly pressed him against the wall.\n\nThe tip of his nose rubbed against the man’s bulging Adam’s apple, and he heard the hot breath falling on his ear:\n\n“The one you’ve slept with, you’re not familiar?”\n\nJiang Zhao snorted coldly:\n\n“Don’t be so naive, Xiao Siye, we’re both adults, so what if we slept together once?”\n\nNot long after, Jiang Zhao opened his eyes again after a hangover, and his body was sore.\n\nXiao Siye was also sitting next to him, and looked at him with a leisurely look:\n\n“What about when you slept together a second time?”\n\nJiang Zhao: “…”>"
}