{
	"url": "https://www.novelupdates.com/series/custom-made-demon-king/",
	"title": "Custom Made Demon King - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/08/custommadedemonkingu.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Fantasy   Harem   Martial Arts   Mystery   Sci-fi   Supernatural   Xuanhuan   ",
	"tags": "Angels   Appearance Changes   Beast Companions   Beastkin   Beasts   Calm Protagonist   Cautious Protagonist   Charismatic Protagonist   Charming Protagonist   Cheats   Confident Protagonist   Contracts   Cunning Protagonist   Dark   Demon Lord   Demons   Dragon Slayers   Dragons   Evil Gods   Evil Protagonist   Evil Religions   Evolution   Fairies   Fallen Angels   Fanfiction   Fantasy World   Game Elements   Gate to Another World   Goddesses   Godly Powers   Gods   Heaven   Hell   Hidden Abilities   Hiding True Abilities   Hiding True Identity   Humanoid Protagonist   Interdimensional Travel   Magical Space   Male Protagonist   Manipulative Characters   Monster Society   Multiple Identities   Multiple Realms   Mythical Beasts   Mythology   Overpowered Protagonist   Parallel Worlds   Parody   Pets   Priests   Proactive Protagonist   Protagonist Strong from the Start   Protagonist with Multiple Bodies   Reincarnated as a Monster   Reincarnation   Romantic Subplot   Ruthless Protagonist   Selfish Protagonist   Souls   Spirits   Strength-based Social Hierarchy   Strong to Stronger   Summoning Magic   System Administrator   Unreliable Narrator   Vampires   Wars   Weak to Strong   Werebeasts   World Hopping   World Travel   World Tree   Zombies   ",
	"rating": "(3.5 / 5.0, 71 votes)",
	"author": "Dark Old Demon   黑乎乎的老妖   ",
	"year": "\nN/A",
	"ranking": "#1380   #3041   #5458   #13805   #8056   ",
	"reviewcount": "17 Reviews sorted by",
	"description": "Roy's life was nothing special. The only thing commendable was the last few moments when he saved a mother and her child from a drunk driver.\r\n...\r\nIt's really an egg! Damn it, what kind of monster have I become? Did I fall into Hell instead of making it to Heaven??\r\nJoin Roy as he ventures through various worlds with the Custom Made Demon King System—a system that allows Roy to draw anything he can imagine and create it through exchanging souls!>"
}