{
	"url": "https://www.novelupdates.com/series/spirit-realm/",
	"title": "Spirit Realm - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2016/10/201510220959462390-1.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Fantasy   Harem   Martial Arts   Mystery   Shounen   Xuanhuan   ",
	"tags": "Adapted to Anime   Adapted to Drama   Adapted to Game   Adapted to Manhua   Arranged Marriage   Artifact Crafting   Artifacts   Beasts   Beautiful Female Lead   Betrayal   Bloodlines   Body Tempering   Cautious Protagonist   Character Growth   Crafting   Cultivation   Demi-Humans   Demons   Dragons   Elemental Magic   Evil Gods   F*llatio   Friendship   Half-human Protagonist   Handsome Male Lead   Hard-Working Protagonist   Hidden Abilities   Inscriptions   Long Separations   Lucky Protagonist   Magic Formations   Male Protagonist   Monsters   Multiple Realms   Mysterious Family Background   Mysterious Past   Personality Changes   Polygamy   Protagonist with Multiple Bodies   Romantic Subplot   Ruthless Protagonist   Secret Identity   Soul Power   Souls   Spatial Manipulation   Weak to Strong   World Travel   ",
	"rating": "(3.8 / 5.0, 813 votes)",
	"author": "Ni Cang Tian   逆蒼天   ",
	"year": "\n2014",
	"ranking": "#6970   #2000   #27   #1329   #213   ",
	"reviewcount": "89 Reviews sorted by",
	"description": "Thirty thousand years ago, the Heaven Fighting Race who called themselves “Gods” invaded Spirit Realm. Hundreds of races rose up in resistance, but ultimately suffered a crushing defeat. The human race was the first to concede, and the rest of the Hundred Races soon followed in succession.\n\nDuring the subsequent ten thousand years, all of the races were ens*aved by the Heaven Fighting Race. They were cruelly treated, and lived beneath the shadow of terror.\n\nThe Heaven Fighting Race’s march of conquest did not stop there. With Spirit Realm as the starting point, they invaded other secret dimensions, and spread war to all corners of existence. After greatly exhausting their combat strength, they were finally defeated by the Hundred Races who took advantage of this opportunity. With no other choice, they fled to the starry skies outside the realm.\n\nThirty thousand years later, in an era where the Heaven Fighting Race has already faded to become ancient legend, an amnesiac youth possessing the Heaven Fighting Race’s bloodline is being fostered in an insignificant household. Whilst struggling to live on, he silently awaits the day of the bloodline’s awakening.>"
}