{
	"url": "https://www.novelupdates.com/series/i-became-popular-after-online-dating-with-a-big-shot/",
	"title": "I Became Popular After Online Dating With A Big Shot - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/05/I-Became-Popular-After-Online-Dating-With-A-Big-Shot.jpg",
	"noveltype": "(CN)",
	"genre": "Drama   Romance   Slice of Life   Sports   Yaoi   ",
	"tags": "Abandoned Children   Abusive Characters   Black Belly   Businessmen   Cold Love Interests   Cold Protagonist   Depression   Devoted Love Interests   Doting Love Interests   e-Sports   Gamers   Living Alone   Loneliness   Misunderstandings   Modern Day   Naive Protagonist   Older Love Interests   Online Romance   Poor Protagonist   Protagonist Falls in Love First   Slow Romance   Straight Uke   Suicides   Weak to Strong   Wealthy Characters   ",
	"rating": "(4.1 / 5.0, 254 votes)",
	"author": "山柚子   ",
	"year": "\n2020",
	"ranking": "#888   #2302   #1407   #573   #1481   ",
	"reviewcount": "81 Reviews sorted by",
	"description": "On his 17th birthday, Shen Chi was kicked out by the Shen family.\n\nHe bought himself an innocent and beautiful virtual girlfriend.\n\nFrom then on, the poor little guy would always get lucky somehow.\n\nWhen he couldn’t afford a computer, he accidentally won a computer worth tens of thousands of dollars.\n\nwhen spending his birthday alone in a rented house he received an expensive adult gift.\n\nWhen the game broadcast platform delayed his wages, it was acquired the next day.\n\nUntil the double row live, he shyly introduced to the audience. “My girlfriend.”\n\nEspecially innocent ~\n\nHowever, a man’s lazy and low voice came from the microphone: “Correction, it’s  boyfriend.”\n\n*\n\nAs the future head of the Yan family, Yan Xue Xiao was still studying abroad when he ran into a kid who added the wrong number.\n\nHe wanted him to stop worrying about making a living.\n\nHe wanted to let him live with pride and recklessness.\n\nHe also wants to give the teenager the best thing.\n\nStep by step spreading bait circles into his home.\n\nThe whole world knows the news that Yan Xuexiao returned to power, and the Shen family is no exception. They gritted their teeth and bought valuable ancient and famous paintings to please him, only to find that the teenager the man was holding tenderly –\n\nIt seems to be the one they abandoned …… Shen Chi.\n\n[The young Shen Chi thought he would rot and take root in stagnant water, until he saw the moon in the sky running towards him]\nThe lonely young master was attacked by X step by step>"
}