{
	"url": "https://www.novelupdates.com/series/reincarnated-as-the-son-of-a-vicious-lord-when-i-was-having-fun-learning-magic-i-had-to-get-rid-of-my-stigma/",
	"title": "Reincarnated as the Son of a Vicious Lord! ~When I Was Having Fun Learning Magic, I Had to Get Rid of My Stigma~! - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/03/Reincarnated-as-the-son-of-a-vicious-lord-When-I-was-having-fun-learning-magic-I-had-to-get-rid-of-my-stigma.jpg",
	"noveltype": "(JP)",
	"genre": "Adventure   Fantasy   Romance   School Life   Shounen   ",
	"tags": "Academy   Adapted to Manga   Age Progression   Battle Competition   Character Growth   Cheats   Child Protagonist   Depictions of Cruelty   Elemental Magic   Fat to Fit   Female Master   Friendship   Harem-seeking Protagonist   Harsh Training   Hated Protagonist   Late Romance   Loyal Subordinates   Male Protagonist   Modern Knowledge   Nobles   Reincarnated in Another World   Saints   Strength-based Social Hierarchy   Sword And Magic   Underestimated Protagonist   ",
	"rating": "(3.0 / 5.0, 68 votes)",
	"author": "Yonezu   米津   ",
	"year": "\n2020",
	"ranking": "#1522   #646   #1878   #5638   #3580   ",
	"reviewcount": "16 Reviews sorted by",
	"description": "I am Owen Pepper, the heir of a Noble family. \n\nTo begin with, there are two kinds of people in this world. The aristocracy, winners from birth, and the rest of the losers, the cattle. I am a winner, of course. \n\nBwahahaha. Livestock, you can work hard for me today. It is the only thing you lot are good for! \n\nI have been reincarnated as a trash aristocrat. My father was a villainous lord. And his son, Owen, has been deeply influenced by his father and has grown up to be a fat, incompetent boy! \n\nIf this continues, my future is in jeopardy. … But I do not care about that!\n\n“I heard that there is magic in this world. If we are going to go to all this trouble, let us try to master magic!”\n\nAnd if you are having fun learning magic, you will soon be able to break the stigma!>"
}