{
	"url": "https://www.novelupdates.com/series/the-crown-prince-in-the-jade-pendant/",
	"title": "The Crown Prince in the Jade Pendant - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/03/The-Crown-Prince-in-the-Jade-Pendant.jpg",
	"noveltype": "(CN)",
	"genre": "Drama   Historical   Mystery   Romance   ",
	"tags": "Ancient China   Black Belly   Character Growth   Complex Family Relationships   Couple Growth   Different Social Status   Divine Protection   Doting Love Interests   Familial Love   Female Protagonist   Helpful Protagonist   Hiding True Identity   Mysterious Illness   Nobles   Politics   Power Couple   Pregnancy   Royalty   Sharp-tongued Characters   Sibling Rivalry   Smart Couple   Unlucky Protagonist   Weak to Strong   ",
	"rating": "(4.5 / 5.0, 99 votes)",
	"author": "September Flowing Fire   九月流火   ",
	"year": "\n2018",
	"ranking": "#574   #1246   #3154   #6801   #2602   ",
	"reviewcount": "21 Reviews sorted by",
	"description": "The Fifth Young Lady of the residence of Marquis Chang Xing was wrongly carried away upon birth and the daughter of a farmer became a Young Lady by accident. The real daughter of the Marquis residence lived amongst the commoners and suffered for thirteen difficult years.\r\n\r\nOn the thirteenth year, Chu Jin Yao finally returned to her biological parents’ side. However, the awkward thing was that Mother disliked her for having vulgar manners and wholeheartedly loved the previous ‘daughter’. Even Grandmother could not bear to send the granddaughter she had doted on for thirteen years back to the farming family and made the decision to allow the fake daughter to stay on and continue to be the Young Lady of a Marquis lineage.\r\n\r\nChu Jin Yao, who grew up in a poor family, was out of place in the Marquis Residence. After yet another hindrance from her Younger Tang Sister, Chu Jin Yao was shedding tears in her room when she discovered that her jade pendant could speak.\r\n\r\nHer jade pendant had a bad temperament but would heed to her complaints, help her in the residence battles and provide her guidance to oppress scums.\r\n\r\nIt wasn’t until one day when Chu Jin Yao had an encounter with the infamously violent Crown Prince.\r\n\r\n“Speaking of which, you might not believe but my jade pendant spirit looks exactly like the Crown Prince.”>"
}