{
	"url": "https://www.novelupdates.com/series/after-the-salted-fish-guide-carried-the-cub-of-the-strongest-sentinel/",
	"title": "After the Salted Fish Guide Carried the Cub of the Strongest Sentinel - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/08/After-the-Salted-Fish-Guide-Carried-the-Cub-of-the-Strongest-Sentinel.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Romance   Supernatural   Yaoi   ",
	"tags": "Aliens   Beasts   Cold Love Interests   Cold Protagonist   Devoted Love Interests   Doting Love Interests   Lazy Protagonist   Love Interest Falls in Love First   Mpreg   R*pe Victim Becomes Lover   R*pe   Smart Couple   ",
	"rating": "(3.9 / 5.0, 11 votes)",
	"author": "南冬里煜   ",
	"year": "\n2022",
	"ranking": "#2836   #2661   #10508   #6885   #8203   ",
	"reviewcount": "1 Review",
	"description": "Yan Yuqi (qī), nicknamed Xianyuqi, is a famous interstellar whistleblower to the Administration vase. Just because he took the wrong road after drinking, he even ran into the scene of the strongest sentinel’s dark energy running away, and also ushered in the first time in his life\n\nThe young SSS-level sentinel instinctively repelled all the guiding elements, and the dark energy accumulated over the years of fighting, because it has not been channeled and purified, and finally went berserk on the way to the mission late one night…\n\nLu Yuying unilaterally announced that Yan Yuqi was his Queen –\n\nOut of awe of Lu Yuying, many people were polite and polite to Yan Yuqi on the surface, but they sneered at him behind the scenes, ridiculing him for borrowing a cub to rise to the top. Will be dumped by Lu Yuying.\n\nLater, Yan Yuqi fell off his horse, and everyone found out that he possessed the blue-eyed white tiger of the SSS-level wizard spirit body that only existed in the ancient legends of interstellar! And the blue-eyed and white cat with his ordinary B-level mental body in his normal state is just a disguise for his salted fish.\n\nFor a while, the media rushed to report, and the entire interstellar was boiling.\n\nOvernight, Yan Yuqi became the longing object of countless guides and sentries:\n\n100-award winners, wealthy presidents, interstellar politicians, and members of the royal family.\n\nThe wealthy president: “Follow me, I’m rich.”\n\nInterstellar politician: “Follow me, I have the right.”\n\nRoyal family member: “Follow me, I have the right, the money, and the fame!”\n\nYan Yuqi: “…” Among the salted fish, don’t disturb.\n\nIt didn’t take long for the top 100 award winner to collapse, the president of a wealthy family to go bankrupt, the interstellar politician to fall, and members of the royal family to be beaten…\n\nThat night, as soon as Lu Yuying got home, he pushed Yan Yuqi against the corner and looked at him condescendingly. , his eyes are full of possessiveness: “I want to see, what are they fighting with me now!”>"
}