{
	"url": "https://www.novelupdates.com/series/refusing-your-ex-husbands-obsession-a-guide/",
	"title": "Refusing Your Ex-Husband’s Obsession: A Guide - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/07/Refusing-Your-ExHusbands-Obsession-A-Guide_1657865533.jpg",
	"noveltype": "(KR)",
	"genre": "Fantasy   Romance   ",
	"tags": "Aristocracy   Beautiful Female Lead   Depictions of Cruelty   Devoted Love Interests   European Ambience   Familial Love   Fantasy World   Fated Lovers   Female Protagonist   Handsome Male Lead   Love at First Sight   Lovers Reunited   Male Yandere   Marriage   Multiple Realms   Multiple Transported Individuals   Nobles   Obsessive Love   Possessive Characters   Power Couple   Protagonist Falls in Love First   R-15   Revenge   Saints   Second Chance   Special Abilities   Strong Love Interests   Transmigration   World Travel   Yandere   ",
	"rating": "(3.9 / 5.0, 34 votes)",
	"author": "Pincream   핑크림   ",
	"year": "\n2022",
	"ranking": "#2132   #668   #7090   #1750   #6329   ",
	"reviewcount": "3 Reviews",
	"description": "I sacrificed my own life to save my husband, who was my first love.\r\nI thought I could finally be free from this foolish love after I’ve died, but…\r\n\r\nWhy is it that when I opened my eyes again, I found myself in someone else’s body?\r\nEven worse, I transmigrated into a novel?\r\n\r\nAnd why is my ex-husband here, too?\r\n\r\nHe became the S-Class Esper who was obsessed with the female lead—enough that he would eventually commit treason against the Crown Prince, who was the true male lead. \r\nMore than anything else though, why did I suddenly manifest the abilities of a Guide?\r\n\r\n…Ah, whatever. I died anyway, so that should be the same as a divorce, I guess.\r\n\r\n* * *\r\n\r\n“My wife, did you think that I wouldn’t recognize your guiding?”\r\n\r\nWhy do you remember me.\r\nWhy are you looking at me like that, not the female lead? With those eyes so full of obsession and madness.\r\nYou weren’t originally this kind of man.\r\n\r\nHe approached me at a languid pace, watching closely as I was at a loss for words.\r\nHis saunter was slow and elegant, as though he was a lion approaching his prey—even so, he could not hide his thirst and hunger. No, it’s not as if he was even trying to hide it.\r\n\r\nAs he finally arrived in front of me, he raised one hand and held my chin. With his thumb, unceremoniously, he rubbed my lower lip.\r\nAt the familiar action, I felt myself shudder. He had always been rather rough whenever he received my guiding. \r\nHis delighted expression was slightly distorted.\r\n\r\n“Ha…”\r\n\r\nThe moment his skin touched mine—the moment I started guiding him—he let out a deep, drawn-out sigh. His hot, thick breath clung to my eyes and lips.\r\n\r\nI felt a warm hand touch my back, and he soon pulled me close to him forcefully. With my body pressed entirely against his, I couldn’t hide my surprise as I glanced up at him. \r\nThen, when he opened his previously closed lids, his blue eyes looked at me as though he’d been waiting.\r\n\r\nWith his lips so close to the tip of my nose, he turned his head obliquely as he crooned.\r\n\r\n“I’ve been looking for you for such a long time, Honey.”\r\n>"
}