{
	"url": "https://www.novelupdates.com/series/his-highness-secret-accountant/",
	"title": "His Highness’ Secret Accountant - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/12/His-Highness-Secret-Accountant.jpg",
	"noveltype": "(KR)",
	"genre": "Comedy   Drama   Fantasy   Harem   Romance   ",
	"tags": "Aristocracy   Beautiful Female Lead   Cautious Protagonist   Character Growth   Charismatic Protagonist   Clever Protagonist   Cold Love Interests   European Ambience   Fallen Nobility   Female Protagonist   First Love   Handsome Male Lead   Love Rivals   Love Triangles   Nobles   Obsessive Love   Possessive Characters   Revenge   Reverse Harem   Rivalry   Royalty   Secret Crush   Slow Growth at Start   Slow Romance   Smart Couple   ",
	"rating": "(3.1 / 5.0, 69 votes)",
	"author": "릴다   ",
	"year": "\n2020",
	"ranking": "#2384   #2060   #4242   #5568   #3362   ",
	"reviewcount": "4 Reviews sorted by",
	"description": "“From today onwards, the sinner’s statuses will be stripped, and his female ward will live as a low-leveled maid at the Royal Palace.”\n\nStellen Kingdom, Ayla Serdian who was the daughter of the most reputed Count.\n\nBecause of her father’s embezzlement of a national treasure, she lost her noble status overnight and became a maid at the royal palace.\n\nA man approaches her. Theon Ennedi, the grandson of the King of the Stellen Kingdom.\n\n“If you ever eavesdrop again on the royal family, you won’t come out unscathed.”\n\nHe, who was cold at first, says something unexpected.\n\n“If you tell me to stop… I won’t push it.”\n\nSoon the distance between them slowly shrunk, enough for their lips to touch. The light mint scent coining from him tickled Ayla’s nose. As Theon’s unusually rough breath caressed her forehead, her whole body tensed up, holding her gasp.\n\n“I wish you would look at me.”\n\n“…”\n\n“If you don’t like it, I will stop.”\n\nHer reason was telling her to refuse him. But under the control of Theon’s voice, asking for her permission as if taming her, the words hardly came out. “I do not… hate it.”>"
}