{
	"url": "https://www.novelupdates.com/series/i-helped-the-imprisoned-male-lead-and-he-became-obsessed/",
	"title": "I Helped The Imprisoned Male Lead And He Became Obsessed - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/03/I-Helped-The-Imprisoned-Male-Lead-And-He-Became-Obsessed_1647502129.jpg",
	"noveltype": "(KR)",
	"genre": "Fantasy   Romance   ",
	"tags": "Abandoned Children   Accelerated Growth   Beautiful Female Lead   Charismatic Protagonist   Charming Protagonist   Child Abuse   Child Protagonist   European Ambience   Female Protagonist   Handsome Male Lead   Human Experimentation   Nobles   Obsessive Love   Reincarnation   Strong Love Interests   ",
	"rating": "(4.3 / 5.0, 33 votes)",
	"author": "페로슈   ",
	"year": "\n2022",
	"ranking": "#618   #1696   #7462   #3336   #6645   ",
	"reviewcount": "1 Review sorted by",
	"description": "I was possessed into the role of an errand child who brought meals to the male lead, who was imprisoned as a laboratory test experiment. When the experiment succeeded and the male lead gained strength, the laboratory became an inferno.\n\nTherefore, I tried to run away before that, however, I felt sorry for the male lead who was suffering from cruel experiments. That's why I secretly took care of things here and there, dodging the researchers' eyes.\n\n'Come to think of it– what's your name?'\n\n'Name… I don't have anything like that.'\n\n'You give me one.'\n\n'Uh?'\n\nOne thing led to another, and I became a bit closer with the male lead.\n\n'Are you going to leave me? Don't do that.'\n\n'Ah... Bu–'\n\n'Annis, you don't care if I get really ill?\n\n'Uh... No. No, I don't like it.'\n\n'Then stay with me.'\n\nHowever, the only thing that can cure him, who is suffering from the side effects of the experiment, is the original female lead. I was trying to help him and sneak away to find his partner but…\n\n'You promised not to leave me. But, was it all a lie?'\n\nWith a burning laboratory as background, Emilian smiled with cool eyes.\n\n“A good child should keep their promise.”\n\nThe temperature of the hand touching my cheek was cold. Red pupils wrapped me as if binding me.\n\n'Aren't you going to answer me?'\n\n…What should I do.\n\nI think I missed the time to run away.>"
}