{
	"url": "https://www.novelupdates.com/series/the-richest-daughter-is-three-and-a-half-years-old/",
	"title": "The Richest Daughter is Three and a Half Years Old - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/05/The-Richest-Daughter-is-Three-and-a-Half-Years-Old.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Fantasy   School Life   Slice of Life   ",
	"tags": "Age Progression   Beautiful Female Lead   Child Protagonist   Childhood Friends   Childhood Love   Childish Protagonist   Cute Protagonist   Familial Love   Family   Female Protagonist   Game Elements   Handsome Male Lead   Love Interest Falls in Love First   Modern Day   Slow Romance   System Administrator   Wealthy Characters   ",
	"rating": "(3.9 / 5.0, 54 votes)",
	"author": "Shan MoZhu   扇墨竹   ",
	"year": "\n2020",
	"ranking": "#1536   #1514   #2803   #2114   #4071   ",
	"reviewcount": "16 Reviews sorted by",
	"description": "After the three-and-a-half year old MiaoMiao was rescued from the human traffickers, the entire very rich Wen family placed the little princess that they had nearly lost into their hearts.\n\nSo…\n\nWhen Father Wen just finished a video conference, and was just about to get ready to go inspect the company, MiaoMiao tugged the hem of his clothes, puffed up her cheeks and stared at him.\n\n“If Daddy doesn’t accompany me to the hospital, I refuse to go get the body checkup!”\n\n“Okay, okay, okay, I’ll listen to everything the little princess says.”\n\nSo as a result, during the health checkup it was discovered that Father Wen had early stage lung cancer. Due to the timely discovery, Father Wen recovered very smoothly.\n\nBrother Wen planned to take his wife and sons to a foreign country for a vacation, the tickets were all booked, but MiaoMiao wanted to be with her nephews, so they changed their destination at the last moment.\n\nBrother Wen gently patted the troublemaker MiaoMiao and said, “Wherever you go on vacation is the same, so we’ll just follow what MiaoMiao says.”\n\nOn the day of departure, the flight they were originally planned on taking crashed, with no survivors.\n\nThe Wen family looked towards their naive and innocent daughter, she is their lucky star!\n\nFrom then on, the Wen family’s MiaoMiao is the Wen family’s sky, the Wen family’s earth, and the Wen family’s truth.\n\n***\n\nMiaoMiao has an older sister called System, but no one else knows.\n\nSister System told her that as long as she gets close to her family, she can use her family’s Intimacy Values to increase her family’s wealth, charm, health, luck, and even change their tragic future.\n\nMiaoMiao worked tirelessly being a little tail to change the fate of her family. When she peacefully returned to kindergarten, she met a little chubby boy.\n\nThe kids at the kindergarten laughed at him for being fat and bullied him. MiaoMiao immediately stood in front of him to protect him.\n\n“So what if he’s a fatty, Fatty has good potential!”\n\nWhen MiaoMiao discovered the Sister System can help the little fatty lose weight, MiaoMiao chose to help him without any hesitation.\n\nWhen little fatty got skinnier, he became known as a little handsome boy, he could even fight well too. After counterattacking he grew up with MiaoMiao as childhood sweethearts.\n\nAfter growing up, MiaoMiao discovered that from early on, she has held this “good potential” in her hand.>"
}