{
	"url": "https://www.novelupdates.com/series/i-got-a-cheat-ability-in-a-different-world-and-become-extraordinary-even-in-the-real-world/",
	"title": "I Got A Cheat Ability In A Different World, And Become Extraordinary Even In The Real World (LN) - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/08/I-Got-A-Cheat-Ability-In-A-Different-World-And-Become-Extraordinary-Even-In-The-Real-World-LN.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Fantasy   Harem   Romance   School Life   Sci-fi   ",
	"tags": "Abandoned Children   Ability Steal   Academy   Accelerated Growth   Adapted to Anime   Adapted to Manga   Adventurers   Aliens   Angels   Appearance Changes   Assassins   Beast Companions   Beastkin   Beautiful Female Lead   Bullying   Caring Protagonist   Character Growth   Charming Protagonist   Cheats   Cohabitation   Cooking   Demi-Humans   Dense Protagonist   Depictions of Cruelty   Devoted Love Interests   Discrimination   Dragon Slayers   Dragons   Evil Gods   Evolution   Family Conflict   Famous Protagonist   Fantasy Creatures   Fantasy World   Fat to Fit   Game Elements   Gate to Another World   Godly Powers   Gods   Handsome Male Lead   Hard-Working Protagonist   Harsh Training   Human-Nonhuman Relationship   Human Weapon   Inferiority Complex   Inheritance   Interdimensional Travel   Jack of All Trades   Kind Love Interests   Level System   Love Interest Falls in Love First   Male Protagonist   Master-Disciple Relationship   Monster Tamer   Multiple POV   Multiple Realms   Nobles   Older Love Interests   Overpowered Protagonist   Poor to Rich   Popular Love Interests   Priestesses   Race Change   Returning from Another World   Royalty   Saints   Saving the World   Sentient Objects   Sibling Rivalry   Skill Assimilation   Skill Creation   Special Abilities   Spirit Advisor   Strong Love Interests   Strong to Stronger   Sudden Strength Gain   Sudden Wealth   Summoning Magic   Sword And Magic   Time Paradox   Time Skip   Time Travel   Transported to Another World   Ugly to Beautiful   Unique Weapon User   Unique Weapons   Weak to Strong   Wealthy Characters   Younger Love Interests   ",
	"rating": "(3.2 / 5.0, 415 votes)",
	"author": "Miku   美紅   ",
	"year": "\n2017",
	"ranking": "#88   #240   #334   #260   #357   ",
	"reviewcount": "104 Reviews sorted by",
	"description": "Tenjou Yuuya has been a bullied boy since the past.\n\nHe lives in the home of his beloved grandfather while he goes to school. As usual, he receives a harsh bullying, and he takes an extended absence from school to have some time to heal his wounds.\n\nWhile on this long time of absence, he takes the opportunity to clean his grandfather’s house and goes to a room he never went before, where his grandfather keep many different objects that he gathered from his travels around the world. While he was arranging the objects, he found a door not on a wall among the objects.\n\nOut of curiosity he opens this door, what he found on the other side was…>"
}