{
	"url": "https://www.novelupdates.com/series/reincarnated-princess-wishes-to-avoid-death/",
	"title": "Reincarnated Princess Wishes To Avoid Death - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/01/Tearmoon-Empire-Story.jpg",
	"noveltype": "(JP)",
	"genre": "Comedy   Drama   Fantasy   Romance   Shoujo   Tragedy   ",
	"tags": "Adapted to Manga   Aristocracy   Arrogant Characters   Award-winning Work   Beautiful Female Lead   Dense Protagonist   Female Protagonist   Friendship   Handsome Male Lead   Kingdom Building   Love Interest Falls in Love First   Loyal Subordinates   Maids   Misunderstandings   Reincarnation   Royalty   Schemes And Conspiracies   Second Chance   Time Travel   Wealthy Characters   ",
	"rating": "(4.4 / 5.0, 156 votes)",
	"author": "Mochitsuki Nozomu   餅月望   ",
	"year": "\n2018",
	"ranking": "#151   #134   #1672   #296   #2039   ",
	"reviewcount": "24 Reviews sorted by",
	"description": "“Why is this happening…?”\n\nMia Luna Tearmoon, Princess of the Tearmoon Empire, muttered to herself as she stood shackled on the execution platform.\n\nThe faces of the spectators surrounding her were, without exception, filled with indignation.\n\nBefore long, Mia was executed at the hands of the revolutionists, who were fed up with the heavy taxation.\n\nBut the next moment, she unexpectedly found herself lying on her bed.\n\nIt was eight years ago, when she was just a mere kid.\n\nFor a while, Mia even wondered if she was hallucinating. However, what appeared on her bedside table was a bloodstained diary that she had written herself.\n\nThat day, Mia's screams could be heard echoing throughout the palace.\n\nMia was not a vicious person by nature. She was simply incapable of understanding the pain and hunger of others, and by the time she discovered it, it was already too late to do anything.\n\nAfter she regressed back to her childhood, Mia struggled hard to trace back the events of the past with the help of her blood-stained diary and memories.\n\nWas it to save the future of a declining empire?\n\nWas it to save the soldiers who died in the civil war?\n\nWas it to save the people from famine?\n\nNo, she had only one goal.\n\nTo avert her fate of facing the guillotine (execution)!>"
}