{
	"url": "https://www.novelupdates.com/series/mighty-female-official/",
	"title": "Mighty Female Official - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2018/08/Female-officer-mighty-one.jpg",
	"noveltype": "(CN)",
	"genre": "Historical   Mystery   Romance   ",
	"tags": "Black Belly   Female Protagonist   Politics   Royalty   Schemes And Conspiracies   ",
	"rating": "(3.5 / 5.0, 19 votes)",
	"author": "断崖一支梅   ",
	"year": "\n2015",
	"ranking": "#2000   #2000   #11265   #9147   #9748   ",
	"reviewcount": "No Reviews",
	"description": "[The so-called drama]\n\nShe, GeShu Wu Luan, the first female official in the inner palace, the youngest female officer, cold, conceited, proud, unwilling accommodate half a grain of sand.\n\nAt a young age, she was given the first rank of marquis, by the royal seal!\n\nThe so-called: good fortune!\n\nA marriage, a murder case, quietly opened the doors to conspiracy!\n\nHaving the fortune of peach blossoms! Unfavorable to luck this year?\n\nWhen the long sword pierces the liquor, getting to the bottom of the truth, only to uncover a conspiracy behind a conspiracy…\n\nWaiting for glory, who was it that will forever be with her: Holding hands, together through the wind and frost, accompanying you no matter what; Deep kisses, along with deep affection, being together for a thousand reincarnations!\n\nOnly to know, the most intense inner conflict, in the end, was the purest.\n\n[Legendary male silver gate]\nHe, full of scorn, building a wall of enmity, and putting together love and hate: “GeShu Wu Luan, you gave me a hard time, remember, before this prince loses interest in you, you must not get hurt!”\n\nHe, the blackbelly demon, who would belong to who, and who is whose chess piece: “Ah Luan, you know this kiss is also my first time! If you can use a love story, in exchange for a myth that compares with you, even if the sky falls, I will be your tower!”\n\nHe, with a heavy temperament, having seen the celestial patterns, but allowing it to become a song: “Luan’er remember that when we met at the beginning of the spring night, you were dressed in a man’s robes, full of a heroic aura. At that glance, it was destined that my life, would be given by you, and destroyed by you!”>"
}