{
	"url": "https://www.novelupdates.com/series/apocalypse-summoner/",
	"title": "Apocalypse Summoner - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2016/12/apocalypse-summoner.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Comedy   Fantasy   Gender Bender   Harem   Mature   School Life   ",
	"tags": "An*l   Adultery   Androgynous Characters   Apocalypse   Arrogant Characters   Beast Companions   Beautiful Female Lead   Charming Protagonist   Dense Protagonist   Handsome Male Lead   Incest   Insects   Kingdoms   Lack of Common Sense   Male Protagonist   Military   Misunderstandings   Modern Day   Monsters   Netori   Parody   Pregnancy   Revenge   Reverse R*pe   Romantic Subplot   R*pe   Ruthless Protagonist   Second Chance   Summoning Magic   Torture   Zombies   ",
	"rating": "(3.3 / 5.0, 282 votes)",
	"author": "Minuet of Dusk   晓夜圆舞曲   ",
	"year": "\n2013",
	"ranking": "#2000   #2000   #1193   #2516   #2267   ",
	"reviewcount": "23 Reviews sorted by",
	"description": "He shall call forth the bone dragon! Summon the lich and the grim reaper! Li Jiayu, the dark summoner, has been reborn and everything returned to the moment before the outbreak of the devastating apocalypse.\r\n\r\nSpaces tremble violently and dimensional cracks connected to various worlds appear! In an instant, never-seen-before civilizations invade our homeland. Insects the size of humans and walking corpses sweep through Earth in legions. An imminent crisis is approaching humanity and billions of human lives are at risk!\r\n\r\nIn regards to Li Jiayu's uncorrupted soul, his summons shall no longer be limited to creatures which lurk in the darkness. They will also include the entities that bask in the light.\r\n\r\nUnder the lingering shadow of death, he vows to prevent a repeat of past tragedies!\r\n\r\nStruggling within the exhausting apocalyptic world, he chooses to trudge on the bloody path of slaughter.\r\n\r\nWalking hand in hand with death, he no longer lives under the cold embrace of the darkness. He shall embark on the bright path towards glory.\r\n\r\n'This is an opportunity to make a comeback... I will put everything on the line to right the wrongs and to protect the loved ones that were once lost.’>"
}