{
	"url": "https://www.novelupdates.com/series/xoxo-miss-minnie/",
	"title": "XOXO, Miss Minnie - Novel Updates",
	"image": "https://www.novelupdates.com/img/noimagefound.jpg",
	"noveltype": "(KR)",
	"genre": "Adult   Comedy   Romance   Smut   ",
	"tags": "Boss-Subordinate Relationship   Childcare   Cohabitation   Cold Protagonist   Contracts   Couple Growth   Cute Children   Cute Story   Genius Protagonist   Healers   Jealousy   Modern Day   Possessive Characters   Tsundere   Unrequited Love   ",
	"rating": "(5.0 / 5.0, 1 votes)",
	"author": "이분홍   ",
	"year": "\n2022",
	"ranking": "#5262   #6187   #13679   #5685   #12649   ",
	"reviewcount": "No Reviews",
	"description": "The sudden death of one’s older brother and his wife.\n\nAmidst this man’s quiet and boring life that resembled a black-and-white movie, the overflowing energy of a six-year-old girl came out of nowhere.\n\nThe fearless Baek Tae-joon came to collapse without mercy.\n\n[Could you become Rose’s home tutor until the end of this semester?]\nThis was what Tae-joon suggested to ‘Miss Minnie’, a kindergarten assistant teacher whom Rose clung to often.\n\n[The basic salary for about 4 months is $100,000. Including a $50,000 contract basis and a $50,000 bonus at the end of June.]\nAnd, by the way.​\n\n‘I’m finally going crazy.’\n\nThe red cheeks, the fair and translucent skin, the cherry-like lips that seemed to be coated in sticky syrup, the feeling of her soft hands, and the strangely ticklish, whispery voice grazing his ears.\n\nThe image that popped into his mind without warning hardened his lower abdomen.\n\nHe was raving for Rose’s teacher, ‘Miss Minnie’, almost all the time.\n\nBecause of her sensitive adolescent complex and college trauma, Min-hee mastered the expertise of unrequited love.\n\n“Will I never try s*x before I die? I wish there was someone who could help me practice how to seduce a man. Maybe I’ll just never have a proper relationship and die leaving only my kittens behind, hnng-”\n\n“You have a cat?”\n\n“No. Hik.”\n\nTae-joon agilely caught a gap and held onto it.\n\n“Don’t cry. You can practice seducing a man using me.”>"
}