{
	"url": "https://www.novelupdates.com/series/im-a-bastard-but-youre-worse/",
	"title": "I’m a Bastard But You’re Worse! - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/09/bastardworse_v1c.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adult   Adventure   Fantasy   Harem   Martial Arts   Mature   Romance   ",
	"tags": "Adventurers   Ancient Times   Antihero Protagonist   Aristocracy   Army   Arranged Marriage   Assassins   Breast Fetish   Broken Engagement   Charismatic Protagonist   Clever Protagonist   Cunning Protagonist   Enemies Become Lovers   Evil Gods   Fallen Nobility   Fantasy World   Genius Protagonist   Gods   Handsome Male Lead   Harem-seeking Protagonist   Immortals   Kind Love Interests   Kingdoms   Knights   Lost Civilizations   Love Interest Falls in Love First   Loyal Subordinates   Magic   Magical Technology   Maids   Male Protagonist   Mercenaries   Merchants   Mind Break   Mind Control   Multiple POV   Netori   Nobles   Older Love Interests   Or*y   Overpowered Protagonist   Perverted Protagonist   Politics   Polygamy   Pregnancy   Protagonist Strong from the Start   R-18   R*pe Victim Becomes Lover   Royalty   R*pe   Ruthless Protagonist   Schemes And Conspiracies   S*x S*aves   S*ave Harem   Strong Love Interests   Strong to Stronger   Sword Wielder   Torture   Witches   Younger Love Interests   ",
	"rating": "(3.7 / 5.0, 181 votes)",
	"author": "Leonar D   レオナールD   ",
	"year": "\n2020",
	"ranking": "#267   #182   #1077   #344   #1349   ",
	"reviewcount": "26 Reviews",
	"description": "Dyngir Maxwell, successor to the margrave of the eastern provinces of the Lamperouge kingdom, was infamous for his womanizing habits, but proved himself multiple times in conflicts with neighboring countries and a major player in domestic politics well trusted by other nobles. Everything was sailing smoothly for Dyngir, when a life-changing event occurred:\n\n'Dyngir Maxwell! I hereby declare your engagement to Selena void!!'\n\nDyngir believed the relationship with his fiancee to be idyllic, but she was actually having an affair with crown prince Sullivan. The moronic prince even dared slander the good name of the Maxwell house…\n\nIf this is your game, then I'm going to play too. You picked a fight with the wrong person!\n\n'I'm a bastard, but you're worse!!'\n\nThe series of events starting from the cancellation of an engagement eventually turned into a historic event that would shake the kingdom to its core and involve the neighboring countries too!! A heroic tale of scum versus scum, starting from a cancelled engagement!>"
}