{
	"url": "https://www.novelupdates.com/series/jin-wang-dotes-on-his-concubine/",
	"title": "Jin Wang Dotes on His Concubine - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/02/20200211155449.jpg",
	"noveltype": "(CN)",
	"genre": "Adult   Drama   Fantasy   Mature   Romance   Slice of Life   Smut   ",
	"tags": "Ancient China   Aristocracy   Beautiful Female Lead   Betrayal   Childcare   Cold Love Interests   Cute Children   Doting Love Interests   Early Romance   Familial Love   Female Protagonist   First-time Interc**rse   Handsome Male Lead   Imperial Harem   Loyal Subordinates   Multiple POV   Multiple Reincarnated Individuals   Pregnancy   Rebellion   Reincarnation   Royalty   R*pe   Second Chance   Twins   Weak Protagonist   ",
	"rating": "(4.0 / 5.0, 179 votes)",
	"author": "Jia Mian De Sheng Yan   Mask Feast   假面的盛宴   ",
	"year": "\n2017",
	"ranking": "#344   #495   #1186   #534   #1723   ",
	"reviewcount": "46 Reviews",
	"description": "Yaoniang was the concubine of Jin Wang in the last life, but she had  only been doted on for a few months before she died.\n\nAfter her rebirth, she decided to live safely and protect herself. So she would do a job well as a wet nurse and never pursue luxurious life. \n\nHowever, it never occurred to her that stern-faced Jin Wang who only did things without discussion  in her last life would  now take initiative.\n\nEveryone in the world knew that Jin Wang had a concubine which was doted by him as early as he lived in original place. After entering the royal palace, she was even more prestigious and Jin Wang only doted her in imperial harem.\n\nThere were many rumors in the folk villages about the concubine. The only thing that was well known was that before she entered the royal palace she was a widow and it was said that she also had a son.\n\nDuring the time Jin Wang became the emperor, he was diligent and managed the country well. He worked hard to improve his governance as a wise emperor. However, he was frequently crazy about the concubine, which made people criticize a lot.\n\nAnd one of the most absurd things he did was to recognize the son the concubine had as his own kid.\n\nTo this, Jin Wang personally came out to refute the rumor: \n“It’s my own son.”>"
}