{
	"url": "https://www.novelupdates.com/series/too-bad-master-died-early/",
	"title": "Too Bad Master Died Early - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/08/Too-Bad-Master-Died-Early.png",
	"noveltype": "(CN)",
	"genre": "Fantasy   Romance   Xianxia   Yaoi   ",
	"tags": "Age Regression   Amnesia   Bloodlines   Buddhism   Child Abuse   Comedic Undertone   Cultivation   Daoism   Death   Demons   Dense Protagonist   Devoted Love Interests   First-time Interc**rse   Hiding True Identity   Love Interest Falls in Love First   Male Yandere   Master-Disciple Relationship   Mystery Solving   Naive Protagonist   Persistent Love Interests   Pets   Possessive Characters   R*pe Victim Becomes Lover   Resurrection   R*pe   Shameless Protagonist   Straight Uke   Strong Love Interests   System Administrator   Transmigration   Transported to Another World   Yandere   Younger Love Interests   ",
	"rating": "(4.1 / 5.0, 83 votes)",
	"author": "Healing Fairy Water   Zhi Bing Shen Xian Shui   治病神仙水   ",
	"year": "\n2017",
	"ranking": "#1010   #901   #5677   #4601   #6481   ",
	"reviewcount": "19 Reviews sorted by",
	"description": "Although Xie Zhi’s acting career was in a slump, he still hated playing bit parts and rejected the role of a soy sauce (read: extremely minor) character in a web drama. Unexpectedly, he died and transmigrated into a novel to become the dead benefactor character who only shows up in the protagonist’s memories: Xie Zhiwei.\n\n…hold on, isn’t this the same soy sauce character he refused to act?!\n\nTo avoid repeating the same tragedy, Xie Zhiwei had no choice but to team up with the System to play (work) act (hard) at his part (death).\n\nSystem: The protagonist needs a teacher, so his shizun will be…\nXie Zhiwei: Leave it to me.\n\nSystem: The protagonist needs to level up, so his helper will be…\nXie Zhiwei: Leave it to me.\n\nSystem: The protagonist needs to blacken, so the villain will be…\nXie Zhiwei: Leave it to me.\n\nSystem: The protagonist needs to fall in love, so the heroine will be…\nXie Zhiwei: @#$^! you, let me float away ethereally.\n\nMu He: Shizun, please fly into this disciple’s arms~>"
}