{
	"url": "https://www.novelupdates.com/series/the-promotion-record-of-a-crown-princess/",
	"title": "The Promotion Record of A Crown Princess - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2016/08/e35c21ce-8c83-4fb2-9b59-1c01e562813a.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Gender Bender   Harem   Historical   Josei   Psychological   Romance   ",
	"tags": "Adapted to Drama   Ancient China   Apathetic Protagonist   Aristocracy   Beautiful Female Lead   Character Growth   Clever Protagonist   Handsome Male Lead   Identity Crisis   Imperial Harem   Love Interest Falls in Love First   Male to Female   Marriage   Marriage of Convenience   Politics   Pragmatic Protagonist   Pregnancy   Royalty   Schemes And Conspiracies   Slow Romance   Smart Couple   Transmigration   ",
	"rating": "(4.3 / 5.0, 247 votes)",
	"author": "Xian Cheng   鲜橙   ",
	"year": "\n2012",
	"ranking": "#2000   #2000   #1872   #2812   #1686   ",
	"reviewcount": "50 Reviews sorted by",
	"description": "Occupational Analysis of 'Crown Princess':\n\nNumber One: Promotion prospects are bleak, Crown Princess—Empress—Empress Dowager, the time between each is vast, and difficulty is extremely high.\n\nNumber Two: No guarantees of continuous labor, not to mention the lack of insurance, you can be dismissed at any time, furthermore you will no longer be able to start another career!\n\nNumber Three: The nature of the job is dangerous, at any time there is the danger of death, if the Crown Prince isn't able to ascend as emperor, you will fall out of luck together with him, if the crown prince ascends as emperor, you have to be careful as to not unluckily fall alone.\n\nNumber Four: Moonlighting as a sex worker, though the intensity of the job is unlikely to be very big, however, there is no power to select the service partner.\n\nTo summarize, the job of Crown Princess isn't particularly a good job, no prospects, large stress, and the manual labor is intense......\n\nOkay, in fact that was just a flood of words, a simple summary is:\n\nThis is a story about a 'woman's' struggles in the harem......\n\nAt the same time, it is also about a 'man's' sufferings in the harem......>"
}