{
	"url": "https://www.novelupdates.com/series/the-villain-loaded-my-system/",
	"title": "The Villain Loaded My System - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/06/THE-VILLAIN-LOADED-MY-SYSTEM.png",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Fantasy   Martial Arts   Romance   Sci-fi   Yaoi   ",
	"tags": "Amnesia   Carefree Protagonist   Cold Love Interests   Cold Protagonist   Confident Protagonist   Cruel Characters   Demon Lord   Doting Love Interests   Family Conflict   Fated Lovers   Forced Marriage   Jealousy   Love at First Sight   Love Interest Falls in Love First   Male Yandere   Misunderstandings   Modern Day   Possessive Characters   Protagonist Strong from the Start   Smart Couple   System Administrator   Transmigration   World Hopping   ",
	"rating": "(4.4 / 5.0, 68 votes)",
	"author": "有狐千岁   ",
	"year": "\n2021",
	"ranking": "#4265   #2638   #4331   #3355   #3223   ",
	"reviewcount": "11 Reviews sorted by",
	"description": "Gu Xiyu led a task.\n\nHe needed to go to few small worlds to solve the villains whose dangerous index exceeded the standard, so that the world can restore it’s harmony and beauty. It’s just that, the system sent to him was a bit strange. The first sentence it used to greet him was–\n\n “Who are you?”\n\nIn the beginning, Gu Xiyu thought this was a super-intelligent humanized system newly developed by the Administration. Later he felt that his system was sick. \n\nIn order to fight for sovereignty, the powerful villains will hurt the protagonist. Gu Xiyu thought he would receive an order to stop him with a knife to the villain.\n\nThe system said, “You send him a bunch of flowers and he may not deal with the protagonist when he is in a good mood.”\n\nIn order to destroy the empire, the general villain of the empire will severely wound the protagonist prince.\n\nSystem instruction: “If you act cute to him, he may accept your request and not exterminate the human race.”\n\nThe great demon of the cultivation world captures all kinds of immortal cultivation pills to increase his energy.\n\nThe system said: “In fact, there is another way for villain to progress.”\n\n“Such as?”\n\n“Practice dual cultivation with the villain.”\n\nGu Xiyu:?\n\nBecause he would be punished for refusing the order, he could only act according to the order. Surprisingly, the progress bar for the reduction of world danger actually moved. But the villain was getting more and more wrong.>"
}