{
	"url": "https://www.novelupdates.com/series/why-are-you-so-obsessed-with-rejecting-affection/",
	"title": "Why Are You So Obsessed With Rejecting Affection? - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/08/Why-Are-You-So-Obsessed-With-Rejecting-Affection.jpeg",
	"noveltype": "(KR)",
	"genre": "Drama   Fantasy   Romance   ",
	"tags": "Adopted Protagonist   Age Progression   Appearance Different from Actual Age   Aristocracy   Beautiful Female Lead   Child Protagonist   Doting Older Siblings   European Ambience   Familial Love   Family   Famous Parents   Female Protagonist   Guardian Relationship   Magic   Nobles   Overprotective Siblings   Reincarnated in Another World   Reincarnation   Royalty   Siblings   Siblings Not Related by Blood   Single Parent   Sister Complex   Wealthy Characters   ",
	"rating": "(4.2 / 5.0, 146 votes)",
	"author": "Seo Yoo Ah   서유아   ",
	"year": "\n2020",
	"ranking": "#6970   #4238   #1459   #3357   #888   ",
	"reviewcount": "24 Reviews sorted by",
	"description": "An extra sacrificed for the main character. That is Shuelina, the princess who was abandoned by her biological father and older brother.\n\n……And now, I will become the main character of this story.\n\nIt was fortunate that I was left in the orphanage, because once the imperial family finds me, I’m doomed.\n\n“Have you heard? The Grand Ducal Family of Vailot came to sponsor an orphan.”\n\nTo find a way to live, I put my heart and soul into getting into the grand duke’s villain family, but–\n\n“You are free to do whatever you want. I, the grand duke, will protect you.”\n\n“You’re not an orphan. You’re my little sister.”\n\nWhy do they like me so much?\n\nI decided to live well as a lady of the Grand Ducal Family of Vailot, however…\n\n“I’ve been looking for you for a long time, my child!”\n\nThis time, my biological father, the emperor, cares for me.\n\nWhat’s wrong with him? I don’t need those who didn’t listen to Shuelina.\n\nI refuse to accept your affection!>"
}