{
	"url": "https://www.novelupdates.com/series/why-are-the-protagonist-gong-and-shou-fighting-because-of-me/",
	"title": "Why are the Protagonist Gong and Shou Fighting Because of Me? - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/06/Why-are-the-Protagonist-Gong-and-Shou-Fighting-Because-of-Me.jpeg",
	"noveltype": "(CN)",
	"genre": "Comedy   Mecha   Romance   Sci-fi   Yaoi   ",
	"tags": "Adapted to Drama CD   Aristocracy   Arrogant Characters   Charismatic Protagonist   Charming Protagonist   Confident Protagonist   Cosmic Wars   Cute Protagonist   Dense Protagonist   Discrimination   Divorce   Domestic Affairs   Doting Love Interests   Doting Parents   Family Business   Famous Protagonist   Friendship   Handsome Male Lead   Hard-Working Protagonist   Heartwarming   Hiding True Identity   Love at First Sight   Love Interest Falls in Love First   Marriage   Military   Misunderstandings   Near-Death Experience   Omegaverse   Parallel Worlds   Playful Protagonist   Roommates   Schemes And Conspiracies   Slow Romance   Weak to Strong   Wealthy Characters   ",
	"rating": "(4.6 / 5.0, 301 votes)",
	"author": "Tian Huafang   甜画舫   ",
	"year": "\n2020",
	"ranking": "#1888   #2033   #1664   #2915   #1016   ",
	"reviewcount": "77 Reviews sorted by",
	"description": "Tang Bai was born into a wealthy family. His body was soft and slender, and he loved to act spoiled. His family searched far and wide to find him a handsome and rich prospective fiancé. However, the prospective fiancé liked independent and strong omegas and was very resistant to this business marriage.\n\nOne day, Tang Bai’s brain short circuited, causing him to believe that he lived in a book. He was the cannon fodder shou, and his prospective fiancé was the protagonist gong. The protagonist shou, Xie Ruhang, was a strong, independent omega of the new era who pretended to be an alpha. In the future, he would become a marshal and the light of the omegas.\n\nNo wonder the love-filled bento that he worked super hard to make was rejected by his prospective fiancé who didn’t even look at it. Tang Bai’s eyes reddened as he turned around. He saw that Xie Ruhang was eating the horrible tasting training meal. How could the future light of the omegas eat this kind of devil’s cruise that was fed to the pigs?\n\nTang Bai shyly said: “This was personally made by me. Us omegas need to pay attention to our diet and take care of our bodies~”\n\nXie Ruhang: ……?\n\nThe first time Xie Ruhang saw Tang Bai, he thought that even when this omega cried, he was still like the omega of his dreams. Although Tang Bai was virtuous, delicate, beautiful, and cute, he already had a prospective fiancé!\n\nXie Ruhang expressed with grief: “I won’t be the third party.”\n\nTang Bai was extremely moved, thinking that Xie Ruhang had already become good sisters with him and wouldn’t come to steal his man. There was a saying that Alphas were like clothes and good sisters were like one’s hands and feet. Don’t worry, I will definitely take good care of you! \n\nXie Ruhang: ……\n\nVery soon, Xie Ruhang heard a rumor. Tang Bai’s prospective fiancé hated Tang Bai, but he couldn’t defy the orders of his family, so he could only create trouble for Tang Bai everywhere.\n\nXie Ruhang: This is the omega of my dreams that I want to hold in the palm of my hands, and you actually don’t cherish him? tr*sh!\n\nXie Ruhang: Isn’t it just stealing a man? So sweet.\n\nTang Bai found out in horror: Why are the protagonist gong and shou fighting because of me?!\n\nTang Bai: Oh! They must have a love and hate relationship!>"
}