{
	"url": "https://www.novelupdates.com/series/women-hating-duke-feels-lust-only-for-one-aristocrat-lady/",
	"title": "Women-Hating Duke Feels Lust Only For One Aristocrat Lady - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/04/女嫌い公爵はただ一人の令嬢にのみ恋をする.jpg",
	"noveltype": "(JP)",
	"genre": "Comedy   Drama   Josei   Mature   Romance   Smut   ",
	"tags": "Aristocracy   Clever Protagonist   European Ambience   Female Protagonist   Handsome Male Lead   Kidnappings   Love Interest Falls in Love First   Maids   Misunderstandings   Nobles   Proactive Protagonist   R-18   Royalty   Schemes And Conspiracies   Shameless Protagonist   Yandere   ",
	"rating": "(3.6 / 5.0, 166 votes)",
	"author": "Minami Reiko   南玲子   ",
	"year": "\n2017",
	"ranking": "#2000   #2000   #2136   #1954   #1289   ",
	"reviewcount": "35 Reviews sorted by",
	"description": "“Don’t worry, father. I’m going to this evening party to find true love. I’m already 19…it wouldn’t be surprising for me to meet my fated person any time now..”\n\n“Julia…It takes three days by carriage to reach the royal castle. Try to stay quiet as much as possible and not make any trouble.”\n\nStay quiet, you say?!! What exactly have I done wrong?\n\nThe first groom candidate tried to marry me to obtain the rank, despite having multiple lovers. I only exposed his relationships in a public place. Well, I did gather the lovers he deceived as proof, but the fact that they beat the sh*t out of him has nothing to do with me.\n\nThe next man, who possessed the rank of the Knight, with my help realized that he was romantically interested in other men and left happily while holding hands with his male lover. I only deserve to be praised for making him realize his true love.\n\nThe last groom candidate who was a civilian officer even tried to kill me after his illegal deal with a black market merchant was revealed. I managed to escape by a hair’s breadth, but if anything, I think that’s more of a feat because if things went on, flour’s price would shoot up and many people would starve to death during the winter.\n\nWell, all of this…means that neither of those men were my fated person.>"
}