{
	"url": "https://www.novelupdates.com/series/please-save-my-child/",
	"title": "Please Save My Child - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/05/Please-Save-My-Child.jpeg",
	"noveltype": "(KR)",
	"genre": "Fantasy   Mystery   Romance   Slice of Life   ",
	"tags": "Beautiful Female Lead   Childcare   Doting Parents   European Ambience   Female Protagonist   Handsome Male Lead   Maids   Nobles   Reincarnated in Another World   Reincarnation   ",
	"rating": "(4.3 / 5.0, 44 votes)",
	"author": "Dalgongbang   달공방   ",
	"year": "\n2021",
	"ranking": "#1389   #3116   #5264   #3373   #4161   ",
	"reviewcount": "7 Reviews sorted by",
	"description": "Eugene has reincarnated into the body of “Reina,” a single mother with a daughter. Luckily, the confusing transition only lasted a short while, and she adjusted to her new world quickly. \n\nAfter she had lived for 4 years as “Reina”… \n\nShe suddenly receives a threatening message informing her that she must kidnap the Princess of the Duchy if she wishes to have her daughter back. \n\nAs she sinks into her despair, she suddenly recalls a certain novel she had read before. \n\n“…No way.”\n\nA character who was arrested and executed after being blackmailed by an unknown villain to kidnap the heroine.\n\nA character who was merely a tool in confirming the love that the heroine’s father held for his daughter. \n\nThat’s what “Reina” was destined to be. \n\n***\n\n“There are enemies who intend to kidnap Lady Estelle.”\n\n“Finally, opponents who willingly seek death.”\n\n“I-I can help you capture them.”\n\nThere was a long silence. \n\n“You will help?”\n\nReina nodded and unfolded the small piece of paper she had hidden in her apron pocket. \n\n“The person who intends to kidnap Lady Estelle wrote this letter to me.”\n\n“…!”\n\nAs soon as the duke reached out his hand to take the note, Reina quickly hid the note in her pocket. She could see the rising anger reflected in his eyes. \n\n“In exchange, I would like to make a request.”\n\nShe holds back her tears as she continues speaking. \n\n“My child…”\n\n“…”\n\n“Please save my child.” >"
}