{
	"url": "https://www.novelupdates.com/series/the-villainous-celebrity-wife-of-the-ceo/",
	"title": "The Villainous Celebrity Wife of the CEO - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/07/The-Villainous-Celebrity-Wife-of-the-CEO.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Josei   Mature   Mystery   Psychological   Romance   ",
	"tags": "Acting   Adapted to Drama   Beautiful Female Lead   Businessmen   Celebrities   Character Growth   Clever Protagonist   Cold Love Interests   Cold Protagonist   Complex Family Relationships   Confident Protagonist   Familial Love   Family   Family Business   Family Conflict   Female Protagonist   Handsome Male Lead   Hiding True Identity   Introverted Protagonist   Jealousy   Love Interest Falls in Love First   Modern Day   Multiple Identities   Naive Protagonist   Popular Love Interests   Pretend Lovers   Showbiz   Twins   Wealthy Characters   ",
	"rating": "(4.0 / 5.0, 162 votes)",
	"author": "Mò Lǐ   莫里_   ",
	"year": "\n2018",
	"ranking": "#500   #912   #1774   #1338   #1499   ",
	"reviewcount": "34 Reviews sorted by",
	"description": "The Su family has twin daughters.\r\n\r\nThey were like the sun and the moon; one sister was bright and had a carefree disposition while the other one was demure and reserved.\r\n\r\nBut it never occurred to anyone that when the twins grew up, the introverted sister would step into the entertainment circle and became a well-known flower! While the other one packed up her school bag, and aiming to become a doctor of Geology, sailed all the way across the ocean!\r\n\r\nOne day, while the other sister’s intoxicated face was exploring the wild, a manager with a group of bodyguards tied her up and brought her to a variety show!\r\n\r\n“What bedroom scene are you trying to make me do?! Let this old woman go!!!”\r\n\r\n“Su Jishi, your sister left a retirement letter and disappeared! All her endorsements, variety shows, and movie contracts add up to more than three billion dollars in liquidated damages! If she still won’t show up, then you have to take her place for the meantime!'\r\n\r\n“What?!”\r\n\r\n“By the way, she’s currently dating the vice president of XX Group and you have an appointment with him tomorrow night.”\r\n\r\nManager: “You are three centimeters taller than your sister, two degrees darker than her skin…your hair is fifty centimeters shorter, and a mole is missing from the corner of your eye. The most important thing is that you are ten pounds heavier than her! Starting today, you have to strictly follow a diet to lose weight! Are you allergic to anything or abstain from any food?\r\n\r\nWoman: “I’m not a vegetarian.”\r\n\r\nManager: “…”\r\n\r\nThe president held the woman’s face in his hands and affectionately said, “Dear, this mole on the corner of your eye was made to be kissed by me.”\r\n\r\nThe woman raised her hand to wipe off the mole: “Sorry, this mole was only painted!”>"
}