{
	"url": "https://www.novelupdates.com/series/dear-anonymous-sponsor/",
	"title": "Dear Anonymous Sponsor - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/04/Dear-Anonymous-Sponsor.jpeg",
	"noveltype": "(KR)",
	"genre": "Fantasy   Harem   Mystery   Romance   ",
	"tags": "Amnesia   Aristocracy   Beautiful Female Lead   European Ambience   Female Protagonist   Handsome Male Lead   Magic   Nobles   Reverse Harem   Royalty   Unrequited Love   ",
	"rating": "(4.0 / 5.0, 10 votes)",
	"author": "Dalseul   달슬   ",
	"year": "\n2021",
	"ranking": "#2000   #2000   #11367   #10271   #8734   ",
	"reviewcount": "No Reviews",
	"description": "Judith was a war orphan from a defeated country who concealed her identity and fled to the neutral Federal State of Baja. She has an anonymous sponsor, but doesn't know their name, age, or appearance.\n\nOn one summer day, five years after she sent her letter of gratitude to her anonymous sponsor, she received a letter from him.\n\n“Miss Judith, how about spending this summer at the Curtis mansion in Waltz?”\n\nWaltz, the capital of Baja, from where the letter was sent, Judith’s heart bloomed with happiness by receiving a letter from her sponsor. She was amazed to see the skyscrapers and the assortment of newspapers found in the metropolitan city, things she had never seen before.\n\n“Don’t trust the person who is your supporter too much, exiled girl.”\n\nAs soon as Judith steps off the train, she get entangled with a notorious gangster.\n\n“I didn’t know there were guests. That said, a lady too.”\n\nAt the sponsor’s mansion, which she had finally arrived, there was a suspicious person occupying the house instead of her sponsor.\n\n“I don’t share what comes into my hands with others.”\n\nAnd the real owner of the mansion who had returned after a while. \n\nIn the hot midsummer, a strange atmosphere spreads around her and the three men.  \n\nQuestions begin to gradually multiply.\n\n“Have you ever found it strange? About the things you erased from your memory?”\n\nOf the three men who each have secrets, a nobleman from a foreign country, a successful businessman in the military business, and the boss of a second-rate gang, who is her true sponsor?>"
}