{
	"url": "https://www.novelupdates.com/series/a-hundred-ways-to-kill-a-heartthrob/",
	"title": "A Hundred Ways To Kill A Heartthrob - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/08/AHWTKAH.jpg",
	"noveltype": "(CN)",
	"genre": "Adult   Drama   Mature   Psychological   Tragedy   Yaoi   ",
	"tags": "Acting   Ancient Times   Animal Characteristics   Apocalypse   Betrayal   Calm Protagonist   Clever Protagonist   Cold Love Interests   Cold Protagonist   Confinement   Cruel Characters   Cunning Protagonist   Death   Dense Protagonist   Depictions of Cruelty   Depression   Different Social Status   Episodic   Forced into a Relationship   Handsome Male Lead   Immortals   Kidnappings   Love Interest Falls in Love First   Love Rivals   Love Triangles   Male Yandere   Manipulative Characters   Masochistic Characters   Master-Servant Relationship   Misunderstandings   Modern Day   Mpreg   Multiple Reincarnated Individuals   Near-Death Experience   Obsessive Love   Omegaverse   Past Plays a Big Role   Past Trauma   Possessive Characters   R*pe Victim Becomes Lover   Reincarnation   Revenge   R*pe   Ruthless Protagonist   Sadistic Characters   Schemes And Conspiracies   Second Chance   Seduction   Stockholm Syndrome   Strong Love Interests   Time Loop   Time Travel   Torture   Tragic Past   Transformation Ability   Transmigration   Twisted Personality   Unrequited Love   Vampires   Voyeurism   Wealthy Characters   World Hopping   Yandere   Zombies   ",
	"rating": "(4.3 / 5.0, 132 votes)",
	"author": "东施娘   ",
	"year": "\n2019",
	"ranking": "#574   #964   #2488   #8982   #1959   ",
	"reviewcount": "51 Reviews sorted by",
	"description": "Shen Jue was punished for his misdeeds and had to go through the suffering of reincarnation. In order to break free from this cycle, he had no choice but to kill those beautiful heartthrobs, and before doing it, he had to attack and seize the other party and have the other party willingly die for him.\n\nIt’s just that, gradually, those heartthrobs who were captured have all blackened…\n\nShen Jue: Hold on, aren’t you the protagonist shou?\n\nHeartthrob *grin*: Everyone has a thing, who says that I have to be the shou?\n\n(When two shou meet, there must be a gong!)>"
}