{
	"url": "https://www.novelupdates.com/series/transmigrated-as-the-movie-stars-beloved-wife/",
	"title": "Transmigrated as the Movie Star’s Beloved Wife - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/07/Transmigrated-as-the-Movie-Stars-Beloved-Wife.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Fantasy   Romance   ",
	"tags": "Celebrities   Early Romance   Female Protagonist   Handsome Male Lead   Marriage of Convenience   Modern Day   Showbiz   Transmigration   Wealthy Characters   ",
	"rating": "(4.0 / 5.0, 23 votes)",
	"author": "时星草   ",
	"year": "\n2019",
	"ranking": "#3314   #2000   #6961   #7721   #6239   ",
	"reviewcount": "5 Reviews sorted by",
	"description": "Li Yining crossed over to a book. She transmigrated to a body where her family has a mine and a movie star husband. But for the sake of the top-stream male protagonist, the cannon fodder suppressed the female lead. In the end, she was ruined and got out of the entertainment circle, and her family went bankrupt.\n\nLi Yining said: Was the money not easy to spend or was her movie star husband not handsome enough?\n\nAfter a while, netizens suddenly discovered that the 18th-line female actress Li Yining, who always touched the porcelain movie star and flow niche, was no longer a demon. While they were worrying and panicking about their beloved idols, they found that Li Yining was on the hot search again—with the tag of #LivingGodOfWealth \n\nLi Yining: **The new perfume smells very good. Repost this on Weibo and I will draw 100 people to get a limited edition perfume worth 5,000 yuan. \n\nBlack powder:? Don’t think we will be fooled!\n\nLi Yining: In a good mood today, retweet this microblog and praise me. I will draw 1000 people, and each of them will receive 1000 yuan. \n\nBlack fans:? (It seems to be true…… Want to turn…… \n\nLi Yining: My husband has joined the group to film, and it will take half a year to go home. I am happy to draw a lottery and draw a hundred people to get a new mobile phone.\n\nMovie Star:???? I will go home tonight! >"
}