{
	"url": "https://www.novelupdates.com/series/unrepentant/",
	"title": "Unrepentant - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2016/08/Unrepentant.jpg",
	"noveltype": "(CN)",
	"genre": "Adult   Drama   Historical   Josei   Romance   Supernatural   Tragedy   ",
	"tags": "Abandoned Children   Ancient China   Childhood Friends   Childhood Love   Clever Protagonist   Couple Growth   Death of Loved Ones   Female Protagonist   Flashbacks   Ghosts   Imperial Harem   Military   Misunderstandings   Politics   Royalty   Selfless Protagonist   Short Story   Tomboyish Female Lead   Unrequited Love   ",
	"rating": "(4.4 / 5.0, 336 votes)",
	"author": "Ze Mu   则慕   ",
	"year": "\n2014",
	"ranking": "#2000   #6178   #2191   #2037   #1837   ",
	"reviewcount": "69 Reviews sorted by",
	"description": "The first time they met, he was a downtrodden prince everybody bullied whilst she was a small palace maid responsible for washing the clothes of the people in the palace.\n\nTwenty years of companionship; he is the only one capable of influencing her emotions. For him, she is willing to immerse her hands in the blood of others, to help him rule this world.\n\nEven though she wasn’t the one he loved, and she wasn’t the one he married, she insisted on remaining by his side, aiming to become the one and only woman capable of standing by his side whilst he held court and the one and only woman in his harem – even if doing so would cause her to get insulted by the entire world.\n\nHowever, that person whom she loved so much, that person for whom she committed all sorts of preposterous acts for – wanted her to die.\n\nHe said, “In this lifetime, I don’t wish to see you ever again!”\n\nShe returned to him as a spirit, yet he begged for another lifetime together.\n\n“If we have another lifetime together, I want you to love me and respect me from a very young age, and help me clear all the obstacles standing in my way. You would be forced to watch me love one, and marry another – but both of them would not be you. You must love me so crazily and so deeply that everybody knows about it, and yet you would never be able to truly receive my entire love and affection. On innumerable occasions, you would be misunderstood by me, and hurt by me. The only few tears you shed in your entire lifetime would be for me, and ultimately you would have to die for me. Even after you die, you would not be allowed to rest in peace – instead, you would transform into a spirit and return to my side… Only if you do all these, would you be able to compensate me for what I have done in this lifetime.”>"
}