{
	"url": "https://www.novelupdates.com/series/secret-private-life-of-the-villainous-grand-duke/",
	"title": "Secret Private Life of the Villainous Grand Duke - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/02/Secret-Private-Life-of-the-Villainous-Grand-Duke.jpg",
	"noveltype": "(KR)",
	"genre": "Adult   Harem   Mature   Romance   Smut   ",
	"tags": "Aristocracy   Beautiful Female Lead   European Ambience   Exhibitionism   Female Protagonist   First-time Interc**rse   Game Elements   Handsome Male Lead   Love Interest Falls in Love First   Masochistic Characters   Nobles   Otome Game   Outdoor Interc**rse   R-18   Reverse Harem   Transported into a Game World   ",
	"rating": "(3.4 / 5.0, 16 votes)",
	"author": "Dierose   디에로즈   ",
	"year": "\n2021",
	"ranking": "#6970   #6299   #10060   #8665   #8005   ",
	"reviewcount": "No Reviews",
	"description": "A dating simulation game with handsome men that was becoming a hot topic these days, Moonique’s Night.\r\n\r\nNo one succeeded in attacking the Emperor, Matthias, due to the ending of the Villainous Grand Duke. \r\n\r\nWhile trying to attack Matthias, she seduces the Villainous Grand Duke and possesses the female lead, Lily, and discovers his obscene secret… \r\n\r\n“It was a pretty good partner, but it ran away thanks to you. How are you going to take responsibility for this? Lily?” \r\n\r\n“Sorry. I never meant to spy. By chance—” \r\n\r\n'By chance…? You stumbled into the basement of someone else's mansion this morning by chance. Should I believe this?” \r\n\r\nUnusually loose shirt, rolled-up sleeves, and an untidy appearance. It wasn't the Villainous Grand Duke, Moritz she knew before. \r\n\r\n“You must be educated to be the Empress, Lily. You have to take responsibility for what you did.” \r\n\r\n\r\n* * *\r\n\r\n\r\nA dense kiss with each other's tongues coveting each other, her bottom was steadily getting wet. \r\n\r\n“Kiss, good?” \r\n\r\n“N, no… Then, let's stop here…” \r\n\r\n“What do you mean no?” \r\n\r\nGlancing at Lily with a sad expression, he grabbed one of her thighs and lifted it up. \r\n\r\n“Is it really bad? Can I check it out?” \r\n\r\n'Yes…?” \r\n\r\n“Here I will never lie.” \r\n\r\nThe man's hand reached down and brushed against the flesh of her inner thigh. It was then that Lily realized how he was trying to confirm. \r\n\r\n“If you don’t answer, I’ll check it myself.” \r\n\r\n“You, you can’t…! It, it was good. So, please…” >"
}