{
	"url": "https://www.novelupdates.com/series/you-have-the-right-to-keep-a-secret-love/",
	"title": "You Have the Right to Keep a Secret Love - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/01/You-Have-the-Right-to-Keep-a-Secret-Love.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Romance   Slice of Life   ",
	"tags": "Beautiful Female Lead   Character Growth   Co-Workers   Dense Protagonist   Devoted Love Interests   Enemies Become Lovers   Family Conflict   Female Protagonist   Handsome Male Lead   Lawyers   Love Interest Falls in Love First   Misunderstandings   Modern Day   Office Romance   Past Plays a Big Role   Unconditional Love   ",
	"rating": "(4.0 / 5.0, 13 votes)",
	"author": "Ye Fei Ran   叶斐然   ",
	"year": "\n2021",
	"ranking": "#2000   #2000   #9767   #7591   #10132   ",
	"reviewcount": "2 Reviews sorted by",
	"description": "Qi Xi is the beautiful, top ranking student of her law school. Her life could only be describe to be smooth sailing. But, the only thing that made her dissatisfied was her unpleasant rival, Gu Yan. Over the past 4 years as her classmate, Gu Yan robbed Qi Xi of countless opportunities and awards.\r\n\r\nAnd just as she was about to speak on behalf of her class as Outstanding Graduate, Qi Xi received a letter from the expressionless Gu Yan... a confession letter that could only be compared to a form of sexual harassment signed by the outstanding Gu Yan himself. \r\n\r\nQi Xi changed her graduation speech out of anger, starting with the confession letter. With a hearty and passionate speech, she called for society to respect women, and in the end she emphasized, 'Gu Yan, you might have a crush, but it is a crime to confess like this! I'm someone you can't catch up with in your life!'\r\n\r\nHowever, after finishing the speech, Qi Xi discovered a terrible fact... at the back of the confession letter was a line, 'roommate Zhang Jia Liang' put together, the true signature of the letter was, 'Written by Gu Yan's roommate Zhang Jia Liang'\r\n\r\nThe letter was not written by Gu Yan...>"
}