{
	"url": "https://www.novelupdates.com/series/ending-maker/",
	"title": "Ending Maker - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/07/Ending-Maker-cover-img.jpg",
	"noveltype": "(KR)",
	"genre": "Action   Adventure   Comedy   Fantasy   Shounen   ",
	"tags": "Adapted to Manhwa   Angels   Aristocracy   Arranged Marriage   Beautiful Female Lead   Bickering Couple   Bloodlines   Caring Protagonist   Clingy Lover   Confident Protagonist   Couple Growth   Cultivation   Cunning Protagonist   Cute Protagonist   Demons   Doting Love Interests   Dragons   Dungeons   Elemental Magic   Elves   Empires   Engagement   Evil Religions   Evolution   Fairies   Fallen Nobility   Familial Love   Famous Parents   Famous Protagonist   Fantasy Creatures   Fantasy World   Fast Learner   Fated Lovers   Fearless Protagonist   First-time Interc**rse   Gamers   Genius Protagonist   God Protagonist   Gods   Grinding   Handsome Male Lead   Heaven   Hell   Heroes   Hiding True Abilities   Hiding True Identity   Kind Love Interests   Knights   Leadership   Level System   Lost Civilizations   Magic   Magic Formations   Manipulative Characters   Marriage   Master-Servant Relationship   Misunderstandings   Monsters   Multiple POV   Multiple Protagonists   Multiple Realms   Multiple Reincarnated Individuals   Mysterious Past   Nobles   Past Plays a Big Role   Possessive Characters   Power Couple   Previous Life Talent   Proactive Protagonist   Protagonist Falls in Love First   Race Change   Reincarnated in a Game World   Rivalry   Romantic Subplot   Royalty   Saving the World   Sentient Objects   Shameless Protagonist   Siblings   Sickly Characters   Skill Books   Slow Romance   Smart Couple   Spirits   Summoning Magic   Sword And Magic   Sword Wielder   Teamwork   Thieves   Unique Weapon User   Unique Weapons   Wars   Weak to Strong   Wealthy Characters   Witches   World Travel   ",
	"rating": "(4.5 / 5.0, 817 votes)",
	"author": "Chwiryong   취룡   ",
	"year": "\n2020",
	"ranking": "#997   #3375   #184   #156   #236   ",
	"reviewcount": "153 Reviews sorted by",
	"description": "Two heroes of the game Legend of Heroes 2 who were rotten waters*.\nKang Jin-ho in the first place and Hong Yoo Hee in the second place.\nOne day, they opened their eyes and found that they had reincarnated as characters in the game…\n\n“Hey…you too?”\n“Hey…me too!”\n\nThe ending of Legend of Heroes 2 was the destruction of the human world.\n\nBut if there were two of them and they were not alone.\nIf it was also the first place and second place in the server rankings.\n\nThe path of the rotten waters begins for a perfect happy ending!\n\n*Rotten water is a Korean slang for someone who has played a certain game for a long time and mastered everything. Think of them as oldbies, veterans, or game pros.>"
}