{
	"url": "https://www.novelupdates.com/series/person-with-an-inferior-ability-returning-from-demon-world-wn/",
	"title": "Person with An Inferior Ability Returning From Demon World (WN) - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/07/MakaiKaeri_v1b.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Fantasy   Harem   Martial Arts   Romance   School Life   Seinen   Supernatural   ",
	"tags": "Alternate World   Assassins   Award-winning Work   Beautiful Female Lead   Childhood Friends   Death of Loved Ones   Demons   Elemental Magic   Fantasy World   Kidnappings   Male Protagonist   Monsters   Mysterious Past   Overpowered Protagonist   Past Plays a Big Role   Past Trauma   Polygamy   Poor Protagonist   Protagonist Strong from the Start   Returning from Another World   Secret Organizations   Secrets   Special Abilities   Spirits   Summoning Magic   Sword And Magic   Sword Wielder   Tragic Past   Underestimated Protagonist   Vampires   Witches   World Travel   ",
	"rating": "(3.1 / 5.0, 23 votes)",
	"author": "Tasuro   たすろう   ",
	"year": "\n2016",
	"ranking": "#2000   #2000   #9033   #9321   #7387   ",
	"reviewcount": "No Reviews",
	"description": "Yuto Domori (Domori Yuto)was born into the Domori family, a family of the strongest spirit swordsman who inherited the unusual abilities.\r\n\r\nBecause, he inherited spiritual and magical powers from his father and mother that contradicts each other. If only the magical side was sealed, his spiritual power simply leaked out and he was unable to use either of them, resulting in a peculiar constitution that prevented him from inheriting his powers.\r\n\r\nFor this reason, he received training in the Sendo from his grandfather (Kazura) Tenzo’s acquaintance Soni.\r\n\r\nYuto showed his natural ability in learning the Sendo. Through the process, he learned that Senki does not repel either spiritual or magical power, and was able to wield the powerful and unparalleled power of simultaneous use of spiritual and magical power…\r\n\r\nThat power came at a serious price.\r\n\r\nWhen he enters high school, his grandfather Kazura, a super free spirit, spends all his money on living expenses, he is kicked out of his home for a reckless reason because he is having a hard time making ends meet, and he enrolls in Horajin Kibayashi High School, which allows him to pay his tuition as long as he can pay in full.\r\n\r\nHe starts high school life with his childhood friend Mari, who played with Yuto in the past, and his friends Ichigo and Shizuka, but due to various misfortunes, the family’s finances are in a state of flux.\r\n\r\nUnable to find a good part-time job and unable to shake off his financial worries, Yuto decides to take the World Ability Agency’s rank certification test, a taboo in the Domori family, in order to make ends meet.>"
}