{
	"url": "https://www.novelupdates.com/series/the-tragedy-of-the-villainess/",
	"title": "The Tragedy of The Villainess - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/02/The-Tragedy-of-The-Villainess.jpg",
	"noveltype": "(KR)",
	"genre": "Drama   Fantasy   Psychological   Romance   ",
	"tags": "Abusive Characters   Affair   Aristocracy   Arrogant Characters   Beautiful Female Lead   Betrayal   Black Belly   Calm Protagonist   Caring Protagonist   Cautious Protagonist   Character Growth   Child Abuse   Clever Protagonist   Cold Love Interests   Conflicting Loyalties   Couple Growth   Demons   Depression   Doting Love Interests   European Ambience   Family Conflict   Female Protagonist   First-time Interc**rse   Handsome Male Lead   Hard-Working Protagonist   Inferiority Complex   Kingdoms   Knights   Love Interest Falls in Love First   Love Rivals   Loyal Subordinates   Manipulative Characters   Marriage   Marriage of Convenience   Mature Protagonist   Multiple Realms   Multiple Timelines   Multiple Transported Individuals   Near-Death Experience   Nobles   Obsessive Love   Past Plays a Big Role   Past Trauma   Power Couple   Reincarnated in Another World   Reincarnation   Religions   Saints   Selfless Protagonist   Slow Romance   Smart Couple   Special Abilities   Stoic Characters   Time Loop   Tragic Past   Transmigration   Transported to Another World   Tsundere   Villainess Noble Girls   ",
	"rating": "(4.2 / 5.0, 204 votes)",
	"author": "Flowing Honey   Honey Dripping   Honey Flows   꿀이흐르는   ",
	"year": "\n2021",
	"ranking": "#436   #52   #1005   #1151   #996   ",
	"reviewcount": "50 Reviews",
	"description": "Seria, a social outcast, has changed.\r\nSeria Stern, the wicked woman who made everyone tremble with fear, was now calm.\r\n\r\nIn fact, she wasn’t just changed, she was a completely different person.\r\n\r\nThe moment she realized that she had possessed the body of the villain Seria, in a romance novel, she had a hunch about the future and decided to live low.\r\n\r\nShe would avoid kidnapping and harassing the original heroine, hence preventing her death by decapitation at the hands of Kalis, the second male lead.\r\n\r\nIn order to avoid that, she had to fix her bad relationship with Kalis and even healed his injured arm.\r\n\r\nThanks to that she got engaged with him, so it’s all worked out.\r\nFinally, the original heroine returned, and her husband, Lesche, should be on good terms with her now.\r\n\r\n“I've been waiting to escort her, so…”\r\n\r\nLesche asked, resolutely cutting off Kalis' words. \r\n\r\n“Miss Seria, it would be better for you to choose. With whom would you want to go with?”\r\n\r\nSomething was strange.\r\nThe original, wasn't it perfectly fine?\r\n\r\n>"
}