{
	"url": "https://www.novelupdates.com/series/conquer-god-asura-and-1000-beauties/",
	"title": "Conquer God, Asura, and 1000 Beauties - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2017/04/Conquer-god-demon-and-1000-beauties-NEWp-copy-copy.jpg",
	"noveltype": "(ID)",
	"genre": "Action   Adventure   Comedy   Fantasy   Harem   Martial Arts   Mature   Romance   ",
	"tags": "Army Building   Artificial Intelligence   Cheats   Clan Building   Cooking   Cowardly Protagonist   Cultivation   Cunning Protagonist   Farming   Gods   Hiding True Abilities   Loyal Subordinates   Magic Formations   Male Protagonist   Pacifist Protagonist   Parody   Pill Concocting   Revenge   Shameless Protagonist   S*aves   Transmigration   Transported to Another World   ",
	"rating": "(4.2 / 5.0, 325 votes)",
	"author": "Adam Aksara   ",
	"year": "\n2016",
	"ranking": "#2000   #6296   #1718   #4027   #2506   ",
	"reviewcount": "39 Reviews sorted by",
	"description": "Jaime was a famous professor in Modern Earth. His whole life was used to capture the Book of Karma, a book which records everything in the universe, to find his true lover, Ye Xiu.\r\n\r\nDuring the course of his journey, he provoked the heaven and had to escape to another world with the Book of Karma. The Creator of all universes punished Jaime by setting him with the task to conquer the three realms! They are: the God’s (deva/deity) realm, the Demon’s (Asura/rakhsasa) realm and the human’s realm. Since he also doubted the Creator, Jaime was further penalised: now he must conquer the heart’s dungeons of 1000 beauties. He had to find a way to open their cold hearts and make them fall in love with him. All of these must be finished in 100 years.\r\n\r\nHe started his journey as nobody but slowly he conquered a sect, a city, a kingdom, a continent, and then, beautiful women. He fought with many kinds of high-leveled cultivators, demi-gods, half demon, demons and gods.\r\n\r\nJaime was born to kill gods, trample demons and be Emperor of all humans. He was also the Deity of Bullshit. He never really fights against anyone and doesn’t like blood or killing. He cheats, he tricks his enemies, he bribes people, he robs his obstacles, and does everything to win. His smart and unpredictable plans in defeating many high-leveled enemies always leave people in awe. He also made many people to worship him like a real hero.\r\n\r\nOne after another pretty women and princesses were trapped by his sweet talk and could not resist his professional art of seduction. This is his journey about aiming to be the King of the Three Realms, finding his lover and at the end, finding the origin of all creations.>"
}