{
	"url": "https://www.novelupdates.com/series/getting-outsmarted-by-the-ceo/",
	"title": "Getting Outsmarted By The CEO - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/04/Getting-Outsmarted-By-The-CEO.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Josei   Romance   School Life   Slice of Life   ",
	"tags": "Arrogant Characters   Beautiful Female Lead   Betrayal   Celebrities   Childcare   Cohabitation   College/University   Confident Protagonist   Cunning Protagonist   Cute Children   Cute Story   Devoted Love Interests   Doting Love Interests   Early Romance   Enemies Become Lovers   Family   Female Protagonist   First Love   Gamers   Handsome Male Lead   Hard-Working Protagonist   Hiding True Identity   Love at First Sight   Love Interest Falls in Love First   Marriage   Modern Day   Multiple POV   Persistent Love Interests   Pets   Popular Love Interests   Power Couple   Protagonist Strong from the Start   Secret Crush   Secret Identity   Smart Couple   Wealthy Characters   ",
	"rating": "(4.2 / 5.0, 90 votes)",
	"author": "Che Li Jiu   车厘酒   ",
	"year": "\n2019",
	"ranking": "#5262   #6195   #2572   #3461   #2966   ",
	"reviewcount": "35 Reviews sorted by",
	"description": "Ruan An An, who came from a family that had tens of billions worth in net value, returned to her alma mater to donate a building but fell in love with a college student there.\r\n\r\nThe boy wore a brilliant white shirt. His figure was slender and tall. With black hair, light-colored pupils, and a beautiful jawline, he looked incredibly handsome.\r\n\r\nRuan An An was dazzled by his charm when the two bumped into each other. The college student picked up the file Ruan An An had dropped on the ground and smiled: 'Fellow student, watch your step.'\r\n\r\nHis voice sounded as clear as spring water and the person was as handsome as jade.\r\n\r\nFor the first time in her life, Ruan An An was in love.\r\n\r\nShe created an opportunity for herself by changing her identity.\r\n\r\nAs the story goes, a sweet girl with financial difficulty who constantly strived for self-improvement quickly fell in love with another poor yet handsome male college student. The two were in tune with each other in all aspects and got married in just half a year.\r\n\r\nAlthough they were hard-pressed for money even after marriage, it did not affect their relationship.\r\n\r\nOn the night before their wedding anniversary, Ruan An An was dressed in one of her exquisite skirts at work, as usual, to attend a private meeting to meet the so-called behind-the-scenes major shareholder.\r\n\r\n'Ms. Ruan,' the secretary introduced: 'This is Gu Jue, Mr. Gu.'\r\n\r\nRuan An An stared at the man with whom she shared the same pillow in a 100 square meter apartment every night. He was impeccably attired, looking very sharp and honorable.\r\n\r\n...She almost broke her high heels.\r\n\r\n'An An,' He said as a warm smile melted into his face like snow: 'Let us move to Lin Jiang Mansion, I have built a garden for you.'\r\n\r\nRuan An An: '...'\r\n\r\nDamn you, the poor and handsome college student! It was all a set up!>"
}