{
	"url": "https://www.novelupdates.com/series/12-oclock-marionette/",
	"title": "12 O’Clock Marionette - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/12/OClock-Marionette_1640051357.jpg",
	"noveltype": "(KR)",
	"genre": "Fantasy   Romance   ",
	"tags": "European Ambience   Female Protagonist   Reincarnation   Transmigration   ",
	"rating": "(3.8 / 5.0, 10 votes)",
	"author": "과앤   ",
	"year": "\n2021",
	"ranking": "#2000   #2000   #11452   #10477   #8657   ",
	"reviewcount": "1 Review sorted by",
	"description": "“I’m blonde again this time.”\n\nIt’s already the third possession. Third time being blonde.\n\nAt this point, I have no choice but to doubt the taste of the god Pebula I serve.\n\nThe third body I recognized as soon as I opened my eyes followed with detailed personal information of Shiora is as follows.\n\n[Shiora Velvet. 20 years old.\n\nParents died in a fire.\n\nCurrently entrusted with Count Bonetti.\n\nThe remaining property is 0.\n\nTo be kicked out in 3 days ]\nIt is clear that the situation is worse than the previous two possessions\n\n~*~\n\nA book was handed down one day to her – the priest, saint, pope – only follower left of the ancient god Pebula.\n\nIn the book called , there was written a story that this world would soon be destroyed by the villain ‘Cruello White Desert’.\n\n“O ancient god Pebula, please perform a miracle.”\n\nAs soon as she finished reading the book, Pebula gave a revelation to ‘educate the villain!’\n\nShe immediately became the villain’s childhood fiancée.\n\nFirst attempt. Rehabilitation failed because she ate poison instead of the villain and died.\n\n2nd attempt. Possessing the body of a villain’s maid, but failing again.\n\nFinally, a 3rd attempt.\n\nShe woke up to the body of Shiora, who had no contact with the villain, and try to make a relationship with the villain.\n\nBut there was only one year left until Cruello destroyed the world…\n\nAbove all, after two failures, the gentle kid has already grown into a vicious villain!\n\nLike Cinderella going home at 12 o’clock, Shiora wanted to save Cruello and free herself from her duty.\n\nWill she be able to fulfill her role and become independent from fate?>"
}