{
	"url": "https://www.novelupdates.com/series/perfect-secret-love-the-bad-new-wife-is-a-little-sweet/",
	"title": "Perfect Secret Love: The Bad New Wife is a Little Sweet - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2017/08/100-points.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Comedy   Drama   Gender Bender   Martial Arts   Mystery   Psychological   Romance   School Life   Supernatural   ",
	"tags": "Abusive Characters   Adapted to Manhua   Amnesia   Beautiful Female Lead   Betrayal   Broken Engagement   Character Growth   Childcare   Cold Love Interests   Complex Family Relationships   Confinement   Couple Growth   Cross-dressing   Devoted Love Interests   Female Protagonist   Forced into a Relationship   Handsome Male Lead   Jealousy   Love Interest Falls in Love First   Male Yandere   Modern Day   Obsessive Love   Personality Changes   Possessive Characters   Power Couple   R*pe Victim Becomes Lover   Reincarnation   Revenge   R*pe   Ruthless Protagonist   Schemes And Conspiracies   Second Chance   Shameless Protagonist   Sharp-tongued Characters   Showbiz   Slow Romance   Stockholm Syndrome   Wealthy Characters   ",
	"rating": "(3.9 / 5.0, 581 votes)",
	"author": "Jiong Jiong You Yao   囧囧有妖   ",
	"year": "\n2017",
	"ranking": "#2594   #409   #259   #6416   #894   ",
	"reviewcount": "150 Reviews sorted by",
	"description": "“This guy, how heavy is his taste, he’s still able to eat?” Waking up, she looked at her reflection in the mirror, explosive hair, tattoos, and a demon-like face. Look at her for more than a second and you’ll have spicy eyes (your eyes will bleed-aka she looks really ugly).\n\nBefore her rebirth, she was in love with someone else, bent on escaping, and after having relations with him, hates him deep to his bones.\n\nAfter her rebirth, she looked at the beauty on the bed, seriously thinking, the one who left his shadow in the past, seemingly should be him?\n\nIn her past life, her mind was muddled. She tried to get rid of the outstandingly beautiful husband that she didn’t want, was victimized by slag men and cheap women, and her most trusted friend brainwashed her. In the end, she found people rebelling and friends deserting (isolated and alone).\n\nIn this lifetime, all of the evil people scheming and longing for her divorce should yield. Sorry but this young miss’s IQ is on the line!>"
}