{
	"url": "https://www.novelupdates.com/series/the-obsessive-shou-moves-on/",
	"title": "The Obsessive Shou Moves On - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/03/The-Obsessive-Shou-Moves-On.jpg",
	"noveltype": "(CN)",
	"genre": "Drama   Fantasy   Psychological   Romance   Shounen Ai   ",
	"tags": "Ancient China   Child Abuse   Corruption   Depictions of Cruelty   Family Conflict   Gore   Handsome Male Lead   Kingdoms   Love Interest Falls in Love First   Male Yandere   Manipulative Characters   Marriage   Misunderstandings   Multiple POV   Multiple Reincarnated Individuals   Obsessive Love   Past Plays a Big Role   Persistent Love Interests   Personality Changes   Politics   Possessive Characters   Royalty   Ruthless Protagonist   Second Chance   Suicides   Torture   Tragic Past   Twisted Personality   Underestimated Protagonist   ",
	"rating": "(4.1 / 5.0, 282 votes)",
	"author": "乔柚   ",
	"year": "\n2021",
	"ranking": "#987   #2230   #2107   #1288   #2067   ",
	"reviewcount": "81 Reviews sorted by",
	"description": "In his previous life, Yun Qingci loved the Emperor more than life and death. When he was alive, he made soup and clothes for him, and in politics, he helped monitor his officials, even his family.\n\nHe was solely dedicated to the emperor, and all his scheming strategies were used to gain favour. He never borrowed his power as the Lord Empress to seek employment for his relatives, and he did not show favoritism. He can be said to be strictly impartial and incorruptible, not even recognizing his own family.\n\nOutsiders were terrified of him, and relatives hated him, but Yun Qingci didn’t care. However, in the end, he was thrown into the cold palace by the only person he cared about and his whole family imprisoned.\n\nFinally, he committed suicide on that snowy day, and fell down that gilded tower.\n\nReincarnated, Yun Qingci retracted his claws, picked up the glass pieces of his heart, and conducted himself evasively in society. Acting as an escort to the Emperor for his relatives, he decided to become a proud Lord Empress that doesn’t need to be treasured or can have his status shaken.\n\nUnexpectedly, the emperor who abandoned him like a shoe, praised by countless courtiers for both his virtue and kindness, suddenly changed his temper. He became cold and harsh, paranoid and cruel.\n\nThe servants who confronted Yun Qingci, he would beat them. The imperial concubines that provoked Yun Qingci, he would punish them. A small person who framed Yun Qingci, he would kill him. When someone tries to approach Yun Qingci, he would become jealous to the extreme.\n\nSoon everyone knew that Empress Yun was the emperor’s inverse scale. He was not allowed to be looked at, touched, or even hurt.\n\nYun Qingci fairy man is speechless: So you like me not loving you, why didn’t you say that sooner.\n\nGong: ……>"
}