{
	"url": "https://www.novelupdates.com/series/someday-will-i-be-the-greatest-alchemist/",
	"title": "Someday Will I Be The Greatest Alchemist? - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/03/Someday-Greatest-Alchemist.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Fantasy   Harem   Shounen   Slice of Life   ",
	"tags": "Accelerated Growth   Adapted to Manga   Adventurers   Age Regression   Alchemy   Appearance Changes   Artifact Crafting   Artifacts   Beastkin   Beautiful Female Lead   Blacksmith   Cheats   Cooking   Crafting   Devoted Love Interests   Discrimination   Divine Protection   Drugs   Early Romance   Elemental Magic   Elves   Evil Gods   Evil Organizations   Evil Religions   Evolution   Fantasy World   Fast Learner   First-time Interc**rse   Game Elements   God-human Relationship   Goddesses   Gods   Golems   Guilds   Handsome Male Lead   Jack of All Trades   Kingdom Building   Kingdoms   Lack of Common Sense   Level System   Loli   Magic   Magic Formations   Magical Space   Male Protagonist   Monster Girls   Monster Tamer   Monsters   Multiple POV   Multiple Transported Individuals   Naive Protagonist   Nobles   Older Love Interests   Overpowered Protagonist   Personality Changes   Polygamy   Pregnancy   R-15   Religions   Royalty   Schemes And Conspiracies   S*ave Harem   S*aves   Spear Wielder   Spirits   Strong Love Interests   Summoning Magic   Sword And Magic   Sword Wielder   Transported to Another World   Younger Love Interests   ",
	"rating": "(3.5 / 5.0, 194 votes)",
	"author": "Kogitsune Maru   小狐丸   ",
	"year": "\n2017",
	"ranking": "#144   #100   #217   #148   #753   ",
	"reviewcount": "30 Reviews",
	"description": "Iruma Takumi, a 40-year old salary man, was dragged into a hero summoning just like in a template. What was his fate? The Goddess sent him and the heroes to the other world separately.\n\nWith the Goddess’ overprotective support, he landed in a different world looking handsome, rejuvenated, and quite different from a Japanese.\n\nAlthough he wanted a slow life while working in the manufacturing trade, that was not permitted by the Goddess’ special body and abilities.\n\nWould Takumi be able to live a peaceful life in a different world?>"
}