{
	"url": "https://www.novelupdates.com/series/the-monstrous-grand-dukes-fake-lady/",
	"title": "The Monstrous Grand Duke’s Fake Lady - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/12/The-Monstrous-Grand-Dukes-Fake-Lady.jpg",
	"noveltype": "(KR)",
	"genre": "Adult   Drama   Mature   Romance   Smut   ",
	"tags": "Affair   Aggressive Characters   Anti-social Protagonist   Appearance Changes   Aristocracy   Arrogant Characters   Average-looking Protagonist   Beautiful Female Lead   Broken Engagement   Caring Protagonist   Cautious Protagonist   Childcare   C*nnilingus   Cold Love Interests   Depression   Different Social Status   Doting Love Interests   Early Romance   Fantasy World   Female Protagonist   First-time Interc**rse   Handsome Male Lead   Hard-Working Protagonist   Hated Protagonist   Hiding True Identity   Loneliness   Loner Protagonist   Maids   Marriage   Misunderstandings   Mysterious Illness   Nobles   Nudity   Obsessive Love   Orphans   Poor Protagonist   Possessive Characters   Pregnancy   R-18   Royalty   R*pe   Secret Identity   Secret Relationship   Secrets   Strong Love Interests   Time Skip   ",
	"rating": "(3.3 / 5.0, 91 votes)",
	"author": "Sweetly   달달하게   ",
	"year": "\n2019",
	"ranking": "#4080   #4172   #2286   #4427   #1801   ",
	"reviewcount": "7 Reviews sorted by",
	"description": "“No! Please don't!” \r\n\r\nHe moved his hand smoothly over Vivian’s arm and swiftly swept her lips against his. \r\n\r\nCharmed by her tiny defiance, he slid his hand and stopped precisely under her curvy waist. \r\n\r\n“Ah… … !” \r\n\r\n“What's wrong? You knew it would come to this as well.” \r\n\r\nThough his words were intimidating, his touch was full of warmth. \r\n\r\nAs if his temporary blindness was just a lie, his hands were vigorously seeking out her weaknesses and began his ruthless attack on them one after another. \r\n\r\nVivian was unable to stop her moans under the hands of his lascivious and stimulating touches. \r\n\r\nOn the very same bed that she had first climbed up to nurse his health, now it was herself that had been laid flatly to be enjoyed by him. \r\n\r\nEven though she knew that the quiver she felt in her lower abdomen was wrong, she couldn’t help but to crave for his touch even more. \r\n\r\n“We are going to marry later, anyway.” \r\n\r\nHe smiled sweetly as he kissed Vivian. Alas, Vivian was silently crying inside. \r\n\r\nThe Grand Duke wasn’t aware that despite in a dream, she was never the fiancée whom he will be married to. She was merely a stranger.\r\n>"
}