{
	"url": "https://www.novelupdates.com/series/taming-the-dark-lord/",
	"title": "Taming the Dark Lord - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/11/taming-darklord2.jpg",
	"noveltype": "(CN)",
	"genre": "Fantasy   Mature   Mystery   Romance   Supernatural   ",
	"tags": "Beautiful Female Lead   Clumsy Love Interests   Dark   Dense Protagonist   Determined Protagonist   Elves   Enemies Become Lovers   European Ambience   Evil Religions   Fantasy World   Female Protagonist   God-human Relationship   Goddesses   Godly Powers   Gods   Gore   Handsome Male Lead   Love Interest Falls in Love First   Magic   Magic Beasts   Medieval   Reincarnation   Religions   Saints   Secret Identity   Transmigration   Witches   Wizards   ",
	"rating": "(4.0 / 5.0, 46 votes)",
	"author": "Hegeng Tiantian   荷梗田田   ",
	"year": "\n2020",
	"ranking": "#6970   #4061   #5082   #9501   #4388   ",
	"reviewcount": "8 Reviews sorted by",
	"description": "One day on the street, Amelia saved the life of an adorable dark elf who was already on the verge of death and was barely breathing. The little guy had a pair of scarlet eyes, pointed ears and a honey-toned skin. He also bore a rebellious personality, clearly matching his brooding appearance.\n\nA stark contrast to her, however, he was a devout follower of the God of Darkness, a firm believer at that, too. The elf was grumpy and a menace, matched with his sharp teeth which promised nothing but pain. His mouth reeked of harsh, biting words and with his sharp tongue, he had insulted her kind by referring them as ‘lackeys of the light’.\n\nSoon, Amelia had enough of it. Unable to control her rage any longer, reprimanded the elf and threatened the crouched form in front of her. “If you dare call me a ‘lackey’ again, don’t be surprised if I cut your pocket money off!”\n\nOne day, she opened a book. It’s been quite a while since she last read one. Her eyes skimmed the pages, letting herself be swept away completely.\n\n[The God of Darkness was a sinister and mysterious evil spirit. He had pale hair, dark, age-looking skin and his eyes were the most scarlet pair of orbs ever seen…]\n\nAs she stumbled on such texts, she stopped reading. She straightened her back and lifted her head from the pages, and her eyes caught sight of the dark elf across her. The elf was diligently cleaning the space, too focused on his errand that he didn’t notice Amelia staring at him.\n\n‘Pale hair, dark skin, and scarlet eyes.’ Amelia thought.\n\n[He carried a mysterious golden totem on his back, which is shaped like a blade. Evil to the extreme in appearance…]\n\nRepeating the lines from the book she just read, Amelia eyed the mark on the elf’s back.\n\n[First and foremost, the God of Darkness had a brutal personality. If you dare violate His order, He would surely bestow your life with such cruelty that your soul will be ripped apart into smithereens, making your body nothing but a hollow shell that would soon be turned into ashes under his fingertips..]\n\nRight at that second, the elf approached Amelia and arrogantly called out.\n\n “Hey lackey,” he said, his eyes drifting as if in a daze. “Where is the money you promised?”\n\nAgitated by both the elf’s approach and the book in front of her, Amelia frustratingly tore the page off its’ ream. She was upset for having bought a book that had nothing but false, misleading information. What a complete waste of money!>"
}