{
	"url": "https://www.novelupdates.com/series/demon-kings-double-life/",
	"title": "Demon King’s Double Life - Novel Updates",
	"image": "https://www.novelupdates.com/img/noimagefound.jpg",
	"noveltype": "(KR)",
	"genre": "Adult   Comedy   Fantasy   Romance   Smut   Yaoi   ",
	"tags": "Adapted to Manhwa   BDSM   Boss-Subordinate Relationship   Co-Workers   Confident Protagonist   Demon Lord   Demons   Dense Protagonist   Devoted Love Interests   Doting Love Interests   Famous Protagonist   Fantasy World   First-time Interc**rse   F*llatio   Glasses-wearing Love Interests   Handsome Male Lead   H*ndjob   Honest Protagonist   Human-Nonhuman Relationship   Kind Love Interests   Knights   Late Romance   Loyal Subordinates   Magical Technology   Manly Gay Couple   Masochistic Characters   M*sturbation   Naive Protagonist   Nudity   Part-Time Job   Prostit**es   Protagonist Strong from the Start   R-18   Sadistic Characters   Selfless Protagonist   Servants   Strong Love Interests   Toys   Younger Love Interests   ",
	"rating": "(3.9 / 5.0, 70 votes)",
	"author": "Anorisil   아노르이실   ",
	"year": "\nN/A",
	"ranking": "#4265   #2000   #4942   #3357   #4703   ",
	"reviewcount": "1 Review sorted by",
	"description": "[Knights-only membership gay club. The muscular, macho Demon King, available all day]\r\nAfter the holy war, the demon world fell into ruin when the economy collapsed. The soldiers left the Demon King, who was unable to pay their monthly salaries. And Hel, the King of the demon world, didn’t want to live relying on his two servants, and also wanted take back his soldiers with his own hands once more.\r\n\r\nBut in the 300 or so years he had lived, he never attended kindergarten, let alone received formal education. Of course, there was little he could do about it.\r\n\r\nOnly one place contacted him to come for an interview. There, he received a business card, but the Demon King Hel couldn’t read human language.\r\n\r\nHe didn’t know what was written on it, but tightly held the business card in his hand, and began his part-time job from henceforth.\r\n\r\n“These are the kind of jobs we do here.”\r\n\r\n“I see.”\r\n\r\nThe interviewer gave his card. Hel took and held it, but he couldn’t read human language. He couldn’t read it, but casually nodded his head as if he could.\r\n\r\n“Are you still going to do it?”\r\n\r\n“Yes. The money will be given as promised, right?”\r\n\r\n“If you don’t run away for a month, I’ll give you as much money as advertised.”\r\n\r\n“Good.”\r\n\r\nThe interviewer’s eyebrow suddenly rose as if surprised at Hel’s answer, but immediately went blank once more.\r\n\r\n“You may go now. You can go to work by this time tomorrow.”\r\n\r\n“Okay.”\r\n\r\nHel got up from his seat without any hesitation, and there where he sat was a single, imposing business card:\r\n\r\n[Knights-only membership gay club. From muscular macho to pretty boys, available all day]>"
}