{
	"url": "https://www.novelupdates.com/series/dont-talk-to-me/",
	"title": "Don’t Talk To Me! - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/05/dontalktome2.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Drama   Romance   School Life   Shounen Ai   Slice of Life   ",
	"tags": "Absent Parents   Abusive Characters   Adapted to Drama CD   Character Growth   Chat Rooms   Clumsy Love Interests   Cohabitation   Devoted Love Interests   Domestic Affairs   Doting Love Interests   Family   Friendship   Handsome Male Lead   Kind Love Interests   Love Interest Falls in Love First   Modern Day   Older Love Interests   Past Trauma   Slow Romance   Teachers   Teamwork   ",
	"rating": "(4.4 / 5.0, 34 votes)",
	"author": "Three Thousand Big Dreams To Narrate One's Life   三千大梦叙平生   ",
	"year": "\n2019",
	"ranking": "#2000   #2000   #6410   #5744   #4680   ",
	"reviewcount": "6 Reviews sorted by",
	"description": "Yu Sheng is born with a Crow Mouth. Nothing good he says comes true, whereas everything bad he says does.\n\nIn the last exam before summer vacation for his 2nd year of High School, “Troublemaker” Yu Sheng from the terrifying Central Third High jinxes himself into the place where the cream of the crop gathers — The Provincial Interhigh Summer Camp.\n\nBecause of his face, he was picked to be the partner of the neighbouring Province Point High School’s No. 1.\n\nThe night before their finals, the undefeatable Young Master Yu who has never blanched before speaks up. He hurtles tonnes of tr*sh-talk at the No. 1 Home Tutor who slams the door on him—\n\nYou were almost late to the exam!\n\nYou almost forgot to shade your MCQ!\n\nYou nearly got off-topic in your essay!\n\nThe invigilators were all flocking around you!\n\nYou can only score 50 points more than the city’s No. 2 at most!\n\n……\n\nLater, when he outscores the city’s No. 2 by 50 points in his Sciences, Jin Linkun faces the media who swarm him and answers simply when asked the secret to his excellent marks.\n\n“Study hard, study smart, and have a good attitude.”\n\nJin Linkun: “And also, find a little Crow Mouth to fall in love with.”>"
}