{
	"url": "https://www.novelupdates.com/series/i-became-popular-after-participating-on-a-dating-show-with-my-ex-lover/",
	"title": "I Became Popular After Participating on a Dating Show with my Ex-Lover - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/03/I-Became-Popular-After-Participating-on-a-Dating-Show-with-my-ExLover.jpeg",
	"noveltype": "(CN)",
	"genre": "Comedy   Drama   Romance   Shounen Ai   Yaoi   ",
	"tags": "Celebrities   Charismatic Protagonist   Clingy Lover   Devoted Love Interests   Doting Love Interests   Lovers Reunited   Popular Love Interests   Power Couple   Shameless Protagonist   Showbiz   Tsundere   ",
	"rating": "(4.1 / 5.0, 39 votes)",
	"author": "鲨鲨尼的情人   ",
	"year": "\n2022",
	"ranking": "#4617   #4061   #5844   #8803   #5652   ",
	"reviewcount": "3 Reviews sorted by",
	"description": "1. Down and out screenwriter, Ruan Song, had a long, five-year relationship with the popular film emperor, Ren Qinming. When their relationship was good, Ren Qinming was still obscure and unknown, and when he became popular, their relationship unexpectedly ended with a bang.\n\nRen Qinming had no way to seek reconciliation, and was depressed all day. His reserved character persona grew increasingly stable, until he found Ruan Song’s residence while drunk, and was photographed by the paparazzi.\n\nThen with a boom, the pair’s love affair became publicized.\n\nThere was an earthquake throughout the entertainment industry, the fans went crazy and they couldn’t believe it at all.\n\nOur gege is a cold, King of Hell. He doesn’t even look at beautiful women, how could he be dating! How could there be anyone in this world who can match our gege!!!\n\nIn order for the fans to confirm that Ren Qinming was single, they exposed Ren Qinming’s itinerary: In a year with 365 days, he spent 330 days with the filming crew. Do you want this kind of blessing? If it were your boyfriend, would you put up with this?\n\nRuan Song was happy to see this. That’s right, he also couldn’t stand it, so they broke up.\n\n2. But just when Ruan Song prepared to head to Weibo to clear up the fervor, an invitation letter to a dating show was sent to him, inviting him to participate on the show with Ren Qinming, and make a public display of affection.\n\nRuan Song felt it beneath himself: We already broke up, I’d have to be crazy to go.\n\nBut in the next second, he saw the remuneration given by the variety show, and then saw his destitute and unemployed self: “I’m crazy. I’ll go.”\n\n3. During the variety show, as soon as Ruan Song appeared.\nThe fans immediately changed their minds: Shock! Beautiful woman!\n\nMeanwhile, the cold King of Hell who never looks at ‘beautiful women’ — —\nRen: Wife, move a little closer to me, everyone’s watching.\nRen: Wife, smile at me, there’s a camera at this angle.\nRen: Wife, it looks like we have to kiss.\nRuan Song: ……###\n\nThen, Ren Qinming: Wife…… Your ears are red.\nRuan Song grinded his teeth and covered his mouth with one hand: I’m! Hot!\n\nThe fans crazily waved their flag: Not hot! Clingy! You just want to stick to beautiful women!\nRuan Song was completely speechless: Didn’t you say no one could match him?\n\nThe fans’ faces were completely yellow*: Teacher Ruan is exaggerating, what do the things Ren Qinming’s fans say have anything to do with us CP fans?\n\nRuan Song: ……\nWhat the hell, who would have thought I’d actually grow famous after participating on a dating show and putting on a fake show!\n\n*Yellow means having dirty thoughts!>"
}