{
	"url": "https://www.novelupdates.com/series/bringing-the-farm-to-live-in-another-world/",
	"title": "Bringing The Farm To Live In Another World - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2016/01/20200000013920144728819823137_s.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Fantasy   Harem   Martial Arts   ",
	"tags": "Alchemy   Androids   Animal Rearing   Aristocracy   Army   Army Building   Artifact Crafting   Artifacts   Average-looking Protagonist   Beastkin   Beasts   Beautiful Female Lead   Bloodlines   Body Tempering   Broken Engagement   Buddhism   Business Management   Businessmen   Cautious Protagonist   Celebrities   Cheats   Clan Building   Crafting   Cultivation   Devoted Love Interests   Domestic Affairs   Dragons   Economics   Evolution   Farming   Firearms   Forgetful Protagonist   Game Elements   Gods   Hiding True Identity   Human-Nonhuman Relationship   Immortals   Kingdom Building   Loyal Subordinates   Magical Space   Maids   Male Protagonist   Merchants   Mind Control   Monster Tamer   Multiple Realms   Necromancer   Nobles   Overpowered Protagonist   Politics   Polygamy   Power Struggle   Religions   Romantic Subplot   Ruthless Protagonist   Servants   S*aves   Souls   Special Abilities   Spirits   Sword And Magic   System Administrator   Time Skip   Transmigration   Transported to Another World   Vampires   Weak to Strong   World Travel   Zombies   ",
	"rating": "(3.6 / 5.0, 1153 votes)",
	"author": "Ming Yu   明宇   ",
	"year": "\n2011",
	"ranking": "#494   #396   #44   #446   #136   ",
	"reviewcount": "171 Reviews sorted by",
	"description": "“If he’s being badass, I’m gonna plant my own crops. If he messes with me, he will not live past next year.”\n\nHomebody Zhao Hai brought ‘QQ Farm’ along in his traversal to another world and resided within the body of a fallen noble. His fief was a black land which nothing could be planted, and more importantly, he even had a peerlessly powerful fiancee, who was actually the successor of a duchy and future Grand Duchess!\n\nEven more importantly, he is a magical and martial cripple who could not learn magic and martial arts. His crippling was very thorough.\n\n“I can’t learn magic, but I have the farm. You dare attack me? I’ll release bugs to eat up your rations and crops, and put pesticides and weed agents into your water sources to make your lands grow weeds. See if you dare to attack me. What? You wanna hire killers to assassinate me? Hehehe. I’ll hide inside the little house in my farm and see how you can attack me. When you leave, I’m gonna terminate your country’s crop productions, and then all of your people will revolt. See if you dare to kill me.”\n\nWatch how this somewhat black hearted hobo uses his QQ Farm in the world of swords and magic to become a globally known nightmarish existence.>"
}