{
	"url": "https://www.novelupdates.com/series/dressed-as-a-stand-in-for-the-white-moonlight/",
	"title": "Dressed as a Stand-in for the White Moonlight - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/02/Dressed-as-a-Standin-for-the-White-Moonlight.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Fantasy   Romance   Shounen Ai   ",
	"tags": "Black Belly   Books   Businessmen   Calm Protagonist   Childish Protagonist   Doting Love Interests   Familial Love   Family   Family Business   Handsome Male Lead   Manly Gay Couple   Marriage   Misunderstandings   Modern Day   Multiple Transported Individuals   Older Love Interests   Protagonist Falls in Love First   Smart Couple   Transmigration   Transported to Another World   ",
	"rating": "(4.1 / 5.0, 138 votes)",
	"author": "曳萝   ",
	"year": "\n2020",
	"ranking": "#965   #1606   #2564   #1554   #2557   ",
	"reviewcount": "26 Reviews sorted by",
	"description": "In the dog-blooded BL novel “Substitute”, the main character is so pitiful that he doesn’t realize until the last moment that he is just a tool used by his husband to protect the white moonlight in his heart.\n\nIn order to protect his beloved, the protagonist gong, who has made many enemies, chose a person to express his love and proposed to him.\n\nIn this book, the protagonist suffered a series of events such as a car accident, kidnapping, disfigurement, hospitalization and so on until he finally died at the hands of the White Lotus White Moonlight, and his fate can be described as very miserable.\n\nWhat’s even more tragic is that Su Yuli transmigrated into the body of this bitter protagonist. And when he transmigrated in, he had already finished the wedding with the scum gong and the scum gong’s opponents already knew of his existence.\n\nSu Yuli was very calm, he knew that he was already bound to the scum gong, at this time leaving would only make his death come faster.\n\nHe used his wits to cross-reference the book until his scumbag husband killed all his enemies.\n\nThen Su Yuli packed up his bags and ran away!\n\nSu Yuli: “The scumbag and his white moonlight are crooked. This small master also has his own happy life to live, bye-bye.”\n\nBut not a month later, the man holding the unsigned divorce papers, red-eyed cornered him: “Do you know how hard I tried to find you? You Can Run! Huh?”>"
}