{
	"url": "https://www.novelupdates.com/series/dinghai-fusheng-records/",
	"title": "Dinghai Fusheng Records - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/09/Dinghai-Fusheng-Records.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Comedy   Fantasy   Historical   Martial Arts   Romance   Shounen Ai   Xuanhuan   ",
	"tags": "Absent Parents   Adapted to Anime   Adapted to Drama CD   Adapted to Manhua   Ancient China   Bickering Couple   Caring Protagonist   Cold Love Interests   Couple Growth   Daoism   Destiny   Determined Protagonist   Devoted Love Interests   Divine Protection   Exorcism   Handsome Male Lead   Jealousy   Limited Lifespan   Loneliness   Love Interest Falls in Love First   Lucky Protagonist   Magic   Mature Protagonist   Military   Misunderstandings   Older Love Interests   Saving the World   Second Chance   Selfless Protagonist   Slow Romance   Souls   Special Abilities   Strategic Battles   Strong Love Interests   Teamwork   Tragic Past   Unconditional Love   Unreliable Narrator   Wars   ",
	"rating": "(4.5 / 5.0, 221 votes)",
	"author": "Fei Tian Ye Xiang   非天夜翔   ",
	"year": "\n2019",
	"ranking": "#3017   #2014   #1918   #2390   #719   ",
	"reviewcount": "27 Reviews sorted by",
	"description": "Immortal arts, magic weapons, magical powers, and the boundless spiritual qi between heaven and earth vanished into obscurity overnight, and all exorcists turned to mere mortals.\n\nThree hundred years later, the Five Hus traversed the pass, it was a prelude to an era of great turmoil in China. They heralded the end of the world, where thousands of drought fiends stalked the night —— the collapse of the Divine Land is imminent.\n\nFortunately, within this long, dark night where silence had fallen on all magic, a lone star still glistened brightly on the horizon.\n\nThe Heart Lamp appeared, illuminating the vast expanse around it. A sixteen-year-old young man, who will end his life on his twentieth birthday, embarked on a journey to reclaim the spiritual qi of heaven and earth that had been sealed away —— only four years remain.\n\nThe road ahead was filled with countless thistles and thorns, and it seemed improbable for him to succeed.\n\n————\n\nChen Xing: 'The important thing is that I’m the last exorcist in this world, yet the only magic I am capable of is emitting light. What can I do?”\n\nWait patiently then. When the Dinghai Pearl reappears on earth, the uncertain trajectory of everyone’s fates will be completely disrupted before converging once more.\n\nChen Xing: “Could I be partnered with a more normal Protector Martial God?”\n\nIsn’t your Protector really skilled in fighting?\n\nChen Xing: “He is good at fighting, but when he loses it he’ll hit even me……”\n\nThere’s nothing that can be done about that, you can only blame yourself for losing yourself to lust.>"
}