{
	"url": "https://www.novelupdates.com/series/the-grim-reaper-cant-be-tricked/",
	"title": "The Grim Reaper Can’t Be Tricked - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/12/The-Grim-Reaper-Cant-Be-Tricked.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Comedy   Mystery   Psychological   School Life   Shounen Ai   Supernatural   ",
	"tags": "Academy   Antihero Protagonist   College/University   Demons   Ghosts   God-human Relationship   Godly Powers   Gods   Hard-Working Protagonist   Hiding True Abilities   Lazy Protagonist   Manly Gay Couple   Money Grubber   Monsters   Mythology   Poor Protagonist   ",
	"rating": "(4.4 / 5.0, 27 votes)",
	"author": "木兮娘   ",
	"year": "\n2021",
	"ranking": "#2000   #2000   #10439   #12558   #9658   ",
	"reviewcount": "1 Review sorted by",
	"description": "That day after the depressed-looking Cen Jin had dropped out of his school, he noticed a little enrollment ad put on a streetlight post outside the school entrance. When he saw that the third-rate technical school advertised in the paper didn’t need an admission exam, he enrolled.\n\nCen Jin, who only wanted a miscellaneous diploma, found out that the usual lesson of this technical school was: teaching them how to slay a god!\n\nThere were three codes for new students to adhere:\n\n-Do not trust all the Gods.\n\n-If you encountered the mysterious (Grim Reaper) and failed to seek help, then adopt these actions: Negotiate, pounce, dominate, and kill. Do not stop until you’re on your last breath.\n\n-Please use up all your strength to convey your feelings, and pray for the gods’ favor.\n\nCen Jin had no option but to address the gods and deliver a totally committed, passionate confession in order to survive, despite his embarrassment.   \n\nUntil the first Freshmen’s Skill Competition Conference, at the critical moment of life and death, he confessed before the public, attracting the pity of 100,000 gods.\n\nOnly then did he come to know that what he had drawn was a satirical version of the freshmen codes, and the object of his confession was superior to all the 100,000 gods.\n\nStudents and instructors all around the world had simultaneously witnessed the chaotic uproar of the Freshmen’s Skill Competition Conference – that tumultuous day, 100,000 gods were inspired to come and, uniformly, cheered to the inconspicuous gloomy yellow-haired in the center of the crowd: Wife teetee!!\n\nYou wouldn’t be able to see that sort of scenario unless you leave Earth. >"
}