{
	"url": "https://www.novelupdates.com/series/i-became-the-tyrants-time-limited-wife/",
	"title": "I Became The Tyrant’s Time-limited Wife - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/02/I-Became-The-Tyrants-Limited-Time-Wife.jpeg",
	"noveltype": "(KR)",
	"genre": "Fantasy   Romance   ",
	"tags": "Aristocracy   Arranged Marriage   Beautiful Female Lead   Divorce   European Ambience   Female Protagonist   Handsome Male Lead   Love Interest Falls in Love First   Male Yandere   Marriage   Nobles   Obsessive Love   Poisons   R-15   Sickly Characters   Transmigration   Transported to Another World   Yandere   ",
	"rating": "(3.7 / 5.0, 39 votes)",
	"author": "Ansiha   안시하   ",
	"year": "\n2021",
	"ranking": "#2158   #6323   #7011   #4220   #6067   ",
	"reviewcount": "No Reviews",
	"description": "I was reincarnated as the wife of the tyrant Male lead, who was poisoned to death.\n\nThe problem was that this tyrant went completely crazy after my death and ruined the country.\n\nWe didn’t really like each other and it was a political marriage.\n\nThere are two years left.\n\n“Let’s just live and see.”\n\nIf I pass the poison, I’ll get divorced and become free!’\n\nFor two years, I took antidote from time to time and developed resistance to various poison.\n\nWhile I was doing it, I also took care of Male Lead’s health, who was in poor condition.\n\nBecause he can’t go crazy after divorce.\n\n“Your Majesty, you seem to sleep late every day. It’s good for your health to sleep early and wake up early.”\n\n“Why does it matter to you?”\n\n“Can’t you just say that you understand it just once?”\n\nAs a result, I just got a little closer to Male lead than the original.\n\n“Why don’t you ask me if I had breakfast these days?”\n\n“You’re healthy now. Do I have to?”\n\n“…….”\n\nAfter safely passing the scheduled poisoning date of the original,\n\nThere was no need to continue the political marriage, so I sent a divorce letter.\n\nI thought I only had the future left to become free!\n\n“Your Majesty? Why blood in your mouth! Blood!\n\n“…Lea. I’m sick.”\n\nMale lead, who emptied the glass, fell down.\n\nWith a smile.\n\n“Ah…” Male Lead. You didn’t drink poison on purpose, right?>"
}