{
	"url": "https://www.novelupdates.com/series/after-becoming-an-interstellar-food-blogger/",
	"title": "After Becoming an Interstellar Food Blogger - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/08/After-Becoming-an-Interstellar-Food-Blogger.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Drama   Mecha   Sci-fi   Slice of Life   Yaoi   ",
	"tags": "Calm Protagonist   Chefs   Cooking   Futuristic Setting   Handsome Male Lead   Love Interest Falls in Love First   Military   Naive Protagonist   Nobles   Outer Space   Past Plays a Big Role   Poor Protagonist   Poor to Rich   Popular Love Interests   Secret Identity   Showbiz   Smart Couple   Strong Love Interests   Transmigration   ",
	"rating": "(3.8 / 5.0, 21 votes)",
	"author": "莫凌玉   ",
	"year": "\n2022",
	"ranking": "#251   #1025   #8099   #1127   #8337   ",
	"reviewcount": "3 Reviews sorted by",
	"description": "Ye Jin once traveled to the interstellar era, and became an orphan on a barren star. The weatherproof house is almost out of whack. Ye Jin had no choice but to go back to his old business and become a food anchor, hoping to solve his urgent needs.\r\n\r\nYe Jin on the first day of the live broadcast: Today, I will live broadcast to make Chinese delicacies, fish porridge and braised fish cubes. The method is very simple and the braised fish with rice is a must.\r\n\r\nNetizen 1: Anchor, you can’t do this, I have no appetite when I look at it. Isn’t this a scam?\r\n\r\nNetizen 2: Chinese food? I’ve never heard of it before, who still eats this kind of nutritious and unpalatable food now!\r\n\r\nNetizen 3: This meaty smell is so bad and not delicious. Besides, now everyone drinks nutritional supplements, and no one will eat this kind of thing.\r\n\r\nAfter Ye Jin really made the dish, netizens were so fragrant that they scrambled to buy it, and even spent a lot of money in the live broadcast room just to get a taste of the delicious food.\r\n\r\nSince then, the craze for food making has swept the entire interstellar space, and Ye Jin’s food live broadcast room has become the spiritual heaven of the people of the empire.\r\n\r\nThen one day, many netizens discovered that there were more people in Ye Jin’s family.\r\n\r\nAll netizens: No way! Whoever dog man took away the anchor is unforgivable!\r\n\r\nFu Chen, a dog man who is an admiral of the empire: …\r\n\r\nNetizens who know the truth: QAQ Is there any help for those who scold the admiral?>"
}