{
	"url": "https://www.novelupdates.com/series/she-become-sweet-and-cuddly/",
	"title": "She Become Sweet and Cuddly - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/06/cover.jpg",
	"noveltype": "(CN)",
	"genre": "Drama   Josei   Romance   Slice of Life   ",
	"tags": "Abusive Characters   Amnesia   Beautiful Female Lead   Betrayal   Black Belly   Childcare   Complex Family Relationships   Couple Growth   Cute Children   Devoted Love Interests   Doting Love Interests   Familial Love   Family   Female Protagonist   Handsome Male Lead   Love Interest Falls in Love First   Love Rivals   Marriage   Misunderstandings   Modern Day   Mysterious Past   Past Trauma   Possessive Characters   Power Couple   Revenge   Stockholm Syndrome   Strong Love Interests   Tragic Past   Tsundere   Unconditional Love   Unreliable Narrator   Wealthy Characters   ",
	"rating": "(4.3 / 5.0, 420 votes)",
	"author": "Zǐ Qīng Yōu   紫青悠   ",
	"year": "\n2019",
	"ranking": "#3923   #3456   #1109   #1561   #735   ",
	"reviewcount": "114 Reviews sorted by",
	"description": "Lin Qingqing was still talking to her friends about taking part in the singing contest the previous night. When she woke up the next day, she came five years later and found that she had not only married an overbearing president she didn’t know at all, but also had a child with him?!!\n\nWhat kind of dog blood plot is this?\n\nIt is said that she still doesn’t like her husband and children, and the most thing she wants to do every day is divorce.\n\nLooking at the pitiful eyes of Little Meng dumpling that was looking for attention and care in front of her, the handsome and rich, carefully spoiled her, want to get close but dare not, her overbearing husband, Lin Qingqing heart felt soft, “just accept it”!\n\nAt first Lin Qingqing only wanted to be a good mother, but later she found the husband so charming that she only wanted to roll in his arms every day….\n\nYi Zeyan knew from the beginning that the woman did not love him. No matter how kind he was to her, she didn’t appreciate it. Even if she married him, she was not willing to look him in the eye. Later, she simply lost her memory and completely forgot him.\n\nHowever, he did not expect her to become different after losing her memory. She not only did not reject his approach, but even smiled at him. Later, she even stuck close to him from time to time and acted like a spoiled child to him.\n\nShe has become so sweet, how can he endure it…>"
}