{
	"url": "https://www.novelupdates.com/series/the-correct-way-of-feeding-the-sick-and-delicate-villain/",
	"title": "The Correct Way Of Feeding The Sick And Delicate Villain - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/06/The-Correct-Way-Of-Feeding-The-Sick-And-Delicate-Villain.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Drama   Fantasy   Romance   ",
	"tags": "Childcare   Clingy Lover   Cultivation   Cute Children   Demonic Cultivation Technique   Demons   Devoted Love Interests   Female Protagonist   Handsome Male Lead   Male Yandere   Playful Protagonist   System Administrator   Transmigration   Younger Love Interests   ",
	"rating": "(3.9 / 5.0, 48 votes)",
	"author": "类似瓜子   ",
	"year": "\nN/A",
	"ranking": "#1326   #1004   #4673   #2160   #4967   ",
	"reviewcount": "7 Reviews sorted by",
	"description": "Ding Yi transmigrated into an awful abusive book. Her original self was a supporting female character who the villain boiled alive in a soup cauldron to threaten the escaping female lead.\n\nThe heck?! She didn’t even have a name, being a cannon fodder!\n\nDing Yi’s face was covered with blood and tears. She looked at the scrawny little villain next to her leg.\n\n#Showing care towards people with mental illness is everyone’s responsibility#\n\n#Learn more about the Little Devil Lord’s villain development system#\n\nThe miserable Ding Yi carried the heavy burden of raising the little villain.\n\nDuring the day, she earned money to support the family. At night, she gave spiritual counselling, trying hard to fill the little villain’s heart with love.\n\nThe fine young man had just grown up. Ding Yi revealed an old mother’s kind of smile, leaving quietly and hiding her merits and reputation.\n\nShe never expected that fate still laid a dirty trick on her.\n\nDing Yi: “……??!”\n\nDon’t give the role of the female lead to me! I! Am!! Afraid!!!\n\nThe gloomy young man hugged the trembling girl. He had a wan smile and the tone of his whisper was horrifyingly tender: “Why are you running? Forming an agreement with the devil, you should know that you can’t run away no matter however many lifetimes.”\n\nDing Yi cried out.\n\nThe villain– he, he, he’s still a human-eating devil!>"
}