{
	"url": "https://www.novelupdates.com/series/harem-of-the-dora-prince/",
	"title": "Harem of the Dora Prince - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2017/08/dora-dora-prince-vol-1.png",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Comedy   Ecchi   Fantasy   Harem   Romance   Shounen   Slice of Life   ",
	"tags": "Adventurers   Arrogant Characters   Beastkin   Beautiful Female Lead   Blackmail   Brother Complex   Carefree Protagonist   Caring Protagonist   Clever Protagonist   Cousins   Demi-Humans   Dragon Riders   Dragons   Famous Protagonist   Fantasy World   Honest Protagonist   Human-Nonhuman Relationship   Incest   Indecisive Protagonist   Inheritance   Kind Love Interests   Kingdoms   Love Interest Falls in Love First   Love Rivals   Loyal Subordinates   Maids   Male Protagonist   Marriage   Multiple POV   Ninjas   Nobles   Persistent Love Interests   Polygamy   Popular Love Interests   Pragmatic Protagonist   Protagonist Strong from the Start   Royalty   Samurai   Sister Complex   Strong Love Interests   Transformation Ability   Tsundere   World Travel   Younger Love Interests   Younger Sisters   ",
	"rating": "(3.6 / 5.0, 77 votes)",
	"author": "Aisaka Takato   ",
	"year": "\n2017",
	"ranking": "#2000   #2000   #5694   #6968   #3911   ",
	"reviewcount": "No Reviews",
	"description": "“Dragon-riding” Prince Craft returned to the imperial capital after traveling around. Refraining from his coronation, he received marriage proposals from each country. \n\nAlthough Craft dislikes marriage, he established the “Bride Training Department” and he will marry the woman who remained at last. If it’s done at all, it’s fascinating! \n\nIn front of Craft who volunteered to be the lecturer and the referee of this training department, each lovely and perfect bride appeared one after another! \n\nA positive female pervert-like cousin, a glamorous beast girl, a black-haired swordsman with ponytail, a blond small breasted princess and a tanned and lively girl with big breasts. These 5 girls approach Craft! A expressionless maid and a brave loli halfsister join the tumult, too! \n\nWho does the Dora Prince choose!? How about all of them! This is the start of a harem, romantic and comedy story!!>"
}