{
	"url": "https://www.novelupdates.com/series/he-lived-like-you/",
	"title": "He Lived Like You - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/07/He-Lived-Like-You.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adult   Fantasy   Romance   Sci-fi   Yaoi   ",
	"tags": "Apocalypse   Appearance Different from Actual Age   Comedic Undertone   Handsome Male Lead   Hidden Abilities   Hiding True Identity   Human-Nonhuman Relationship   Love Interest Falls in Love First   Mercenaries   Misunderstandings   Non-humanoid Protagonist   Past Plays a Big Role   Seme Protagonist   Younger Love Interests   Zombies   ",
	"rating": "(4.6 / 5.0, 35 votes)",
	"author": "不间不界   ",
	"year": "\n2020",
	"ranking": "#3133   #414   #6872   #3379   #6949   ",
	"reviewcount": "6 Reviews sorted by",
	"description": "Living in this apocalyptic world full of zombies and monsters, the rich rely on technology and the poor rely on mutation.\n\nShen Shanwu, 13 years old in appearance but 31 years old in reality, is a mutant that can alter his own appearance. Although he looks like a child on the outside, his wisdom is not very good. One day, he was just passing by when he was suddenly forcibly adopted by a major general, whom he didn’t know where he came from.\n\nHe resisted, but when he looked up, it turned out to be an old acquaintance.\n\nThe little boy, who could only hide behind him and cry, transformed into the unsmiling, cold, and tough man in front of him. And that expression of seeing a dead beloved is really unsightly…\n\nShen Shanwu: Can you smile?\n\nJing Huan: After Shanwu died, I couldn’t smile anymore.\n\nShen Shanwu: …Who? Who do you think is dead?\n\nIt took a long time before he found out about it. He found Jiang Huan crying and holding Shen Shanwu’s nameplate in the middle of the night and told his adopted son how good Shen Shanwu was… All of this…was seen by Shen Shanwu himself!\n\nJiang Huan (raising his gun): Since you have seen my embarrassment, then I can only marry you or kill you.\n\nShen Shanwu: …\n\nShen Shanwu: Marry, marry, marry! I will recruit 800 zombies to carry you home!>"
}