{
	"url": "https://www.novelupdates.com/series/i-became-the-black-swan-mother-of-the-white-swan-princess/",
	"title": "I Became the Black Swan Mother of the White Swan Princess - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/04/blackswanwhiteswan.jpg",
	"noveltype": "(KR)",
	"genre": "Drama   Fantasy   Romance   Slice of Life   Supernatural   ",
	"tags": "Adopted Children   Animal Characteristics   Animal Rearing   Beautiful Female Lead   Calm Protagonist   Childcare   Curses   Cute Children   Doting Parents   Empires   European Ambience   Familial Love   Family   Female Protagonist   Handsome Male Lead   Kingdoms   Love Interest Falls in Love First   Magic   Mob Protagonist   Nobles   Persistent Love Interests   Royalty   Shapeshifters   Sword And Magic   Tragic Past   Transformation Ability   Transmigration   Transported to Another World   Younger Sisters   ",
	"rating": "(4.4 / 5.0, 176 votes)",
	"author": "Aperta   아페르타   ",
	"year": "\n2020",
	"ranking": "#1504   #1221   #1311   #1572   #572   ",
	"reviewcount": "31 Reviews sorted by",
	"description": "The transmigration that happened to others, it happened to me too. I’m pretty sure I’m now a supporting character… but exactly which novel is this?\n\nWhen I opened my eyes, I was a widow with stepdaughters my own age, and not only that, I turned into a black swan every night due to a dark curse! Holding back my tears, I decided to take charge of my fate…wait, why should I? Why So Serious?\n\nA duchess during the day, a queen of the lake during the night – I have the best luck to be able to leisurely float around! Life should be lived unplanned! When I had just about decided to live my life like this, a white baby swan, one that was not in my no-plan life plan, came to me.\n\n“Mommy, awe you weally my mommy?”\n\nWhat, you were a person? And even the youngest sibling of the tyrant emperor?\n\n“I’m not your mother! Can’t you tell by the different colors of our feathers?”\n\nI’m a black swan, you’re a white swan! But why is she so crazy cute. Can our mother-daughter love endure the obsession and persecution of this child’s seven brothers, including the tyrant emperor’s?>"
}