{
	"url": "https://www.novelupdates.com/series/stone-thrown-into-the-lake/",
	"title": "Stone Thrown into the Lake - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/03/Stone-Thrown-into-the-Lake.jpeg",
	"noveltype": "(KR)",
	"genre": "Drama   Fantasy   Josei   Psychological   Romance   Tragedy   ",
	"tags": "Abandoned Children   Absent Parents   Age Regression   Aristocracy   Beautiful Female Lead   Brother Complex   Character Growth   Clever Protagonist   Cold Protagonist   Complex Family Relationships   Determined Protagonist   Enemies Become Allies   European Ambience   Evil Protagonist   Family Conflict   Female Protagonist   Female to Male   Genius Protagonist   Handsome Male Lead   Hated Protagonist   Kind Love Interests   Kingdoms   Love Interest Falls in Love First   Misunderstandings   Nobles   Past Plays a Big Role   Pragmatic Protagonist   Reincarnation   Royalty   Ruthless Protagonist   Schemes And Conspiracies   Second Chance   Sibling's Care   Slow Romance   Unrequited Love   Younger Brothers   ",
	"rating": "(3.6 / 5.0, 25 votes)",
	"author": "Mongtang   몽탕   ",
	"year": "\n2018",
	"ranking": "#6970   #4098   #9879   #8980   #7380   ",
	"reviewcount": "No Reviews",
	"description": "“I am alive and living only for that child.”\n\nYvor Adela, who grew up as a work of art to shine a thoroughly ruined family. Her life was only for her brother Duran Craig.\n\nShe became a snake that twisted the king herself to give power to her beloved brother, and committed all kinds of evil deeds, which eventually led to her spectacular downfall. \n\nHer brother who she devoted all her life to, bombards her with curses, instead of pouring her with love.\n\n“I’ve never hated you more than this moment!”\n\nMeanwhile, Sidis Murka, the prince who she had no doubt hated her all his life, whispered his love to her…\n\n“Run away with me.”\n\nWhy does the brother who she believed loved her, hate her, and the prince who she believed hated her, love her. \n\nOnce again, if there is another chance…\n\nFinally sentenced to death, after sinking into a cold lake, she opened her eyes receiving a second chance.\n\nIn the past, in the spring of eighteen.>"
}