{
	"url": "https://www.novelupdates.com/series/i-got-a-brother-in-law-who-was-a-villain/",
	"title": "I Got a Brother-in-law Who Was a Villain - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/01/I-got-a-brotherinlaw-who-was-a-villain.jpg",
	"noveltype": "(KR)",
	"genre": "Fantasy   Gender Bender   Romance   ",
	"tags": "Adultery   Affair   Aristocracy   Beautiful Female Lead   Cross-dressing   Female Protagonist   Handsome Male Lead   Nobles   Reincarnation   Tomboyish Female Lead   ",
	"rating": "(4.0 / 5.0, 14 votes)",
	"author": "Seo Sumin   서수민   ",
	"year": "\n2021",
	"ranking": "#6970   #6302   #11286   #11743   #9098   ",
	"reviewcount": "No Reviews",
	"description": "According to the original story, Yvonne lived an unhappy life and died by the hands of the villain. She didn’t like that kind of life, so she lived her life the way she wanted to. As an heiress by day, and as “Franz” of the back alley in the afternoon dressed as a man.\n\nThen, the villain who will destroy the world came to visit Franz, who is Yvonne, disguised as a man. It turns out that one of her childhood friends who disguised himself as a man and had a brother-in-law under the name of “Franz” was the villain in the original story. She was afraid of the villain, so she tried to avoid it.\n\nHe doesn’t know her and persistently comes to her and tries to serve as her older brother. He didn’t know he would have the worst meeting with Yvonne Moore, not dressed as a man.\n\nThen Yvonne spent the night with the villain who hated her. He happened to find out that Yvonne is Franz. Then the man said “If I had known you were a woman sooner, I wouldn’t have gone through so much trouble trying to forget you.”\n\nThe female lead is Selena, but somehow the villain seems to like her.\n\n“I’m the only one angry at this situation! I think I’m going to die of anger!”\nWitnessing his girlfriend waking up in bed with another man, Paradis was overly angered.\n\n“…”\n“Hey, Yvonne. Why are you doing this to me?”\nSeeing Paradis’s flushed face with anger made Yvonne want to cry out loud.\n\nIt was a moment when the friendship that had been firmly maintained under the name of best friend was broken.>"
}