{
	"url": "https://www.novelupdates.com/series/peerless-battle-spirit/",
	"title": "Peerless Battle Spirit - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2017/06/peerless-battle-spirit.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Fantasy   Harem   Martial Arts   Tragedy   Xuanhuan   ",
	"tags": "Adapted to Manhua   Alchemy   Arrogant Characters   Battle Academy   Beast Companions   Betrayal   Clever Protagonist   Comedic Undertone   Confident Protagonist   Cultivation   Cunning Protagonist   Dao Comprehension   Dragons   Enemies Become Lovers   Eye Powers   Fast Cultivation   Fast Learner   Friendship   Genius Protagonist   Hiding True Abilities   Hiding True Identity   Hot-blooded Protagonist   Inheritance   Loli   Male Protagonist   Martial Spirits   Money Grubber   Multiple Realms   Older Love Interests   Pill Based Cultivation   Pill Concocting   Polygamy   Romantic Subplot   Seven Deadly Sins   Shameless Protagonist   Slow Romance   Spirit Advisor   Strength-based Social Hierarchy   Sudden Strength Gain   Underestimated Protagonist   Weak to Strong   ",
	"rating": "(3.0 / 5.0, 253 votes)",
	"author": "Supreme Villain   极品妖孽   ",
	"year": "\n2015",
	"ranking": "#3802   #4677   #280   #11527   #1766   ",
	"reviewcount": "45 Reviews sorted by",
	"description": "In the Canglan Continent, there existed a rule: only those who managed to awaken a Martial Spirit were able to pursue the path of cultivation, and a Martial Spirit’s rank was determined when it was awakened. Born in Linshui City, Qin Nan was a peerless genius who possessed great talents and was highly anticipated to become a great cultivator in the future. However, things changed when he ended up awakening the lowest-grade Martial Spirit, resulting in him being considered trash.\n\nFortunately, when Qin Nan was struck by a ray of lightning at a young age, he coincidentally obtained the atavistic Divine Battle Spirit, which was capable of ranking up, breaking the ultimate rule of the Canglan Continent. Little did he know that his Martial Spirit possessed a great secret, which would continue to be unveiled as he learns more about the story of the Divine Battle Spirit.\n\nWhat is the secret behind the Divine Battle Spirit? What is the curse of the Canglan Continent? Who exactly is the Divine God of Battle?\n\nJoin Qin Nan and his companions along their journey, battling against various opponents, outsmarting their enemies, and seeking the answers to unveil mysteries!\n\n“Master, please bring me along on your journey battling against the Nine Heavens, will you?”>"
}