{
	"url": "https://www.novelupdates.com/series/love-code-at-the-end-of-the-world/",
	"title": "Love Code at the End of the World - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/03/lovecode1b.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Harem   Horror   Romance   Sci-fi   ",
	"tags": "Adapted to Manhua   Beautiful Female Lead   Cannibalism   Character Growth   Charismatic Protagonist   Devoted Love Interests   Female Protagonist   First-time Interc**rse   Futuristic Setting   Handsome Male Lead   Hard-Working Protagonist   Hidden Abilities   Hot-blooded Protagonist   Interdimensional Travel   Love Interest Falls in Love First   Military   Polyandry   Post-apocalyptic   Power Couple   Power Struggle   Reverse Harem   Slow Romance   Special Abilities   Strategic Battles   Strong Love Interests   Stubborn Protagonist   Survival   Transported to Another World   Wars   Weak to Strong   ",
	"rating": "(3.8 / 5.0, 81 votes)",
	"author": "Strawberry Shortcake   草莓蛋糕   ",
	"year": "\nN/A",
	"ranking": "#2000   #2814   #2837   #7143   #4870   ",
	"reviewcount": "22 Reviews sorted by",
	"description": "Sixteen-year-old Luo Bing makes a playful prayer and ends up crossing time and space to land on Kansas Planet, right when Kansas Planet is experiencing the end of the world.  \r\n\r\nClueless about this alien world, Luo Bing is terrified. Fortunately, Noah City gives her sanctuary and she eventually gets a chance to explore this new world.\r\n\r\nThe end of the world is marked by extreme scarcity. Ubiquitous radiation has heavily limited the food, water and resources, and danger lies at every turn. As a result of this extreme environment, some humans have evolved and developed superpowers, while others have turned into monsters and even spirits. Humans who naturally possess an anti-radiation constitution are called radiationers. Most of the radiationers have unique superpowers, and they are referred to as metahumans.\r\n\r\nWith no clue on how to return to her own world, Luo Bing is stuck here and must survive against all odds. Armed with the combat skills she has learned from her dad and her newly developed superpowers, as well as help from the guys she has developed feelings for, can Luo Bing save this strange new world? >"
}