{
	"url": "https://www.novelupdates.com/series/heimarian-odyssey/",
	"title": "Heimarian Odyssey - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/07/Heimarian-Odyssey.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Harem   Martial Arts   Mature   Xuanhuan   ",
	"tags": "Adopted Children   Adventurers   Antihero Protagonist   Aristocracy   Army   Average-looking Protagonist   Beast Companions   Brotherhood   Calm Protagonist   Charismatic Protagonist   Cosmic Wars   Cousins   Cruel Characters   Cultivation   Demi-Humans   Depictions of Cruelty   Doting Love Interests   Doting Older Siblings   Early Romance   Empires   Family   Fanfiction   Fantasy Creatures   Fantasy World   Generals   Guilds   Incest   Kingdom Building   Knights   Loyal Subordinates   Magic   Maids   Male Protagonist   Master-Disciple Relationship   Master-Servant Relationship   Mature Protagonist   Medieval   Military   Monsters   Multiple POV   Nationalism   Nobles   Older Love Interests   Politics   Polygamy   Pragmatic Protagonist   Pregnancy   Romantic Subplot   Royalty   R*pe   Ruthless Protagonist   S*x S*aves   S*aves   Strength-based Social Hierarchy   Strong to Stronger   Wars   Wizards   ",
	"rating": "(2.8 / 5.0, 66 votes)",
	"author": "I Love Beans   我爱小豆   ",
	"year": "\nN/A",
	"ranking": "#4617   #2000   #2671   #7461   #7107   ",
	"reviewcount": "10 Reviews sorted by",
	"description": "Locke is a middling officer in the Kingdom of Faustian's army.  He happens to be at the wrong place at the wrong time, or the right place at the right time, depending on your perspective, and happens to save the kingdom's princess.  As fortune would have it, love prospers, but in a world of peasantry and nobility, a middling, peasant-born soldier has no right to love a princess.  Locke is nothing if not determined, however, and sets out to become someone worthy of loving the princess, someone her family can accept.  But that path is neither short, nor safe, as our hero will soon discover.>"
}