{
	"url": "https://www.novelupdates.com/series/how-to-live-as-the-enemy-prince/",
	"title": "How to Live as the Enemy Prince - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/10/Enemys-Prince-cover.jpg",
	"noveltype": "(KR)",
	"genre": "Adventure   Comedy   Drama   Fantasy   Mystery   Slice of Life   ",
	"tags": "Absent Parents   Appearance Different from Actual Age   Aristocracy   Bloodlines   Calm Protagonist   Cautious Protagonist   Clever Protagonist   Death   Determined Protagonist   Dragons   Elves   Empires   European Ambience   Familial Love   Family Conflict   Handsome Male Lead   Hiding True Abilities   Kingdom Building   Loyal Subordinates   Magic   Male Protagonist   Master-Disciple Relationship   Master-Servant Relationship   Mature Protagonist   Nobles   Poisons   Politics   Power Struggle   Previous Life Talent   Revenge   Royalty   Schemes And Conspiracies   Second Chance   Secret Organizations   Sibling Rivalry   Special Abilities   Strong to Stronger   Sword And Magic   Sword Wielder   Tragic Past   Transmigration   Transplanted Memories   Underestimated Protagonist   Weak to Strong   Wizards   ",
	"rating": "(4.4 / 5.0, 343 votes)",
	"author": "Cha Seo Hyeon   자서현   ",
	"year": "\n2018",
	"ranking": "#1750   #641   #1064   #2189   #402   ",
	"reviewcount": "41 Reviews sorted by",
	"description": "I could hear the hum of life in my ears. It was hard to breathe….\n\n… I raised my gaze and stared into the distance.\n\nHowever, my blurred vision could not see anything.\n\nThe light began to fade.\n\n\nThat was my last memory.\n\nWhen I opened my eyes once again, it was 10 years before that last memory took place.\n\nAnd of all the things I could have become, it was from the enemy country that drove Secretia to ruin – I became Kyris’ third prince Calian.\n\n…..\n\nBern was the proud Crown Prince of Secretia who fought and died in the war against Kyris.\n\nBut he woke up 10 years into the past – as the timid Third Prince of Kyris, Calian.>"
}