{
	"url": "https://www.novelupdates.com/series/ghostly-masked-prince-xiao-pampering-and-spoiling-the-little-adorable-consort/",
	"title": "Ghostly Masked Prince Xiao: Pampering and Spoiling the Little Adorable Consort - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2018/09/Ghostly-Masked-Prince-Xiao.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Fantasy   Historical   Romance   Shoujo   ",
	"tags": "Ancient China   Arranged Marriage   Beautiful Female Lead   Black Belly   Child Protagonist   Cold Love Interests   Couple Growth   Cunning Protagonist   Devoted Love Interests   Female Protagonist   Handsome Male Lead   Loyal Subordinates   Misunderstandings   Older Love Interests   Pregnancy   Royalty   Slow Romance   Smart Couple   Time Skip   Transmigration   ",
	"rating": "(4.4 / 5.0, 226 votes)",
	"author": "Anbu Yi Yi   安步奕奕   ",
	"year": "\n2015",
	"ranking": "#6970   #2000   #526   #7150   #954   ",
	"reviewcount": "32 Reviews sorted by",
	"description": "One imperial edict and the family’s calculation, the sweet, adorable her met the cold him that was up high. She became his little princess consort. Everyone said that Prince Ying of Western Xuan Empire was shockingly ugly, cold-blooded and ruthless. They laughed at her that she had mistakenly entered the tiger’s den with her life in danger. But she just laughed that everyone in the world couldn’t see the wider picture, and were stupid and ignorant. The ugly appearance was actually beyond gorgeous, cold-blooded was actually gentle and sweet. She only wanted to hide him away and not allow other people to peep at him. “Big Ice Cube, take off your mask and let this princess have a look!” She propped up her chin with saliva flowing down.\r\n\r\n“Want to look?” A certain person’s lips hooked into a devilishly charming smile, saying. “Then first, hand over some down payment…” This is the story of a sweet adorable female and a two-faced male’s journey to fight enemies and kill strange things, while pursuing a romantic relationship that was absolutely full of loving spoiling, hilarity and hot-blooded action.>"
}