{
	"url": "https://www.novelupdates.com/series/twin-heroes/",
	"title": "Twin Heroes - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2018/06/jdsj.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Tragedy   Wuxia   ",
	"tags": "Adapted to Anime   Adapted to Drama   Adapted to Game   Adapted to Manhua   Cunning Protagonist   Misunderstandings   Multiple Protagonists   Time Skip   Twins   ",
	"rating": "(2.9 / 5.0, 22 votes)",
	"author": "Gu Long   古龍   古龙   ",
	"year": "\n1966",
	"ranking": "#6970   #2000   #10710   #11907   #11699   ",
	"reviewcount": "No Reviews",
	"description": "Jiang Feng, a handsome young martial artist, was injured during a misadventure and ended up being saved by the sisters Yaoyue and Lianxing of the Palace of Shifting Flowers, who were considered the most powerful female martial artists in the pugilistic world. The two sisters fell in love with Jiang Feng, but he spurned them because of their arrogance. Instead, he fell in love with their servant girl, Hua Yuenu.\n\nJiang Feng and Hua Yuenu were forced to flee from the Palace after Hua became pregnant with Jiang’s child. However, they ended up being betrayed by Jiang Feng’s servant, Jiang Biehe, and attacked by bandits. During their harrowing flight, Hua Yuenu gave birth to a pair of twin boys abut ended up dying together with Jiang Feng during a bandit attack. Yaoyue and Lianxing soon caught up with the couple only to find them dead. Refusing to forgive Jiang Feng for rejecting her love, Yaoyue vowed to take her revenge by making his two sons destroy each other. To do that, they adopted one of the boys as their own child and abandoned the other.\n\nThe other boy was soon saved by Yan Nantian, Jiang Feng’s sworn brother and one of the most powerful martial artists in the pugilistic world. Unaware of the first boy’s fate, Yan Nantian pursued Jiang Biehe into the Villains’ Valley, a place populated entirely by criminals. There, he encountered five of the notorious Ten Great Villains whom he defeated easily before falling into a trap set by them. The villains ended up torturing Yan Nantian till he fell unconscious, but chose not to harm the second boy, instead deciding to raise him as their apprentice in order to groom him into the greatest villain in history.>"
}