{
	"url": "https://www.novelupdates.com/series/lets-run-away-and-go-to-the-assassins-school-the-decision-of-the-fat-daughter-with-the-annulled-engagement-assassination-diet/",
	"title": "Let’s Run Away and Go to the Assassin’s School ~ the Decision of the Fat Daughter with the Annulled Engagement! Assassination Diet! - Novel Updates",
	"image": "https://www.novelupdates.com/img/noimagefound.jpg",
	"noveltype": "(JP)",
	"genre": "Comedy   Romance   ",
	"tags": "Assassins   Broken Engagement   Fat Protagonist   Fat to Fit   Female Protagonist   Royalty   ",
	"rating": "(3.5 / 5.0, 20 votes)",
	"author": "Haruhi   Sun   陽日   ",
	"year": "\n2019",
	"ranking": "#6970   #2000   #9401   #7591   #7832   ",
	"reviewcount": "No Reviews",
	"description": "Iris, the daughter of the Duke, was the prince’s fiancé, but her appearance was that of a pig.\n\n“I love eating, drinking and sweets!! Snacks? No, that’s another meal”\n\nIris would be beautiful if she were thinner, but she was a pig of 80kg at the age of ten!\n\nBecause of that, at the prince’s 10th birthday celebration party, that night, none other than the prince himself, who was crying after seeing her, broke the engagement with her.\n\nAs expected, it was not possible for the crown prince to marry a pig, and the king approved that decision.\n\nAfter that, her parents imprisoned her for ruining the family’s name and decided to hire assassins to prevent of that happening again…\n\nWhen Iris woke up that night …\n\n“Assassins… wow, so cool!”\n\n“It’s dangerous but the shy me is bubbling of emotion”\n\nI am amazed of the skills beauty of the one who is aiming for my own life… “What are you saying…?” From that day on, Iris’s assassin study program started. First, you have to lose weight, and then refine your skills. “Who can train me? That is it! I’ll ask the knights who have recently come to my home! Not just killing skills I want to learn all the useful skills!” Iris, who learned to how to do everything, from cooking to laundry and making chores, goes to school in a lean state!>"
}