{
	"url": "https://www.novelupdates.com/series/forced-to-be-favored-by-the-whole-stars/",
	"title": "Forced To Be Favored By The Whole Stars - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/09/FTBLBTWS.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Romance   Slice of Life   Yaoi   ",
	"tags": "Animal Characteristics   Calm Protagonist   Cold Love Interests   Cute Protagonist   Dense Protagonist   Famous Protagonist   Futuristic Setting   Handsome Male Lead   Heartwarming   Love Interest Falls in Love First   Naive Protagonist   Non-humanoid Protagonist   Shapeshifters   Strong Love Interests   Transformation Ability   Transmigration   Tsundere   ",
	"rating": "(3.9 / 5.0, 69 votes)",
	"author": "雁骨   ",
	"year": "\nN/A",
	"ranking": "#2018   #1805   #2936   #4277   #3189   ",
	"reviewcount": "13 Reviews sorted by",
	"description": "Shen Tong came to the interstellar age because of an accident.\n\nBecame a grass.\n\nIn this era, cats evolved rapidly and occupied a dominant position.\n\nShen Tong, unfortunately, was a catnip _ (:з) ∠) _\n\nAnd would soon be dedicated to the famous tyrant of interstellar.\n\nThis tyrant, he was tyrannical, cruel and indifferent, with blood on his hands.\n\nAfter learning of his fate, Shen Tong decided to be honest and make grass, carry out photosynthesis properly, and give the tyrant a good bite if necessary.\n\nWhat he didn’t expect, unknowingly, was that Shen Tong had already scratched the tyrant’s own chin, braided his mane, pillowed him for naps, and even had him learn to cat-call.\n\nShen Tong: “Can I give you a bite as if nothing happened QAQ?”\n\nCaesar: “Not enough.”\n\nShen Tong: “?”\n\nA few minutes later, the hottest blogger of Star Network updated a dynamic:\n\nShen Tong V: There is a cat @Caesar\n\nHundreds of millions of fans instantly blew into a firework: \n\n[Honey, you finally remembered the password! ! No-wait a minute? Have a cat? ]\n[This means falling in love! ? ]\n[What? In love? ? ? Little mint, you are still young, and your mother forbid you to fall in love! ]\n[Wait a minute, Caesar? Is it your Majesty Caesar? ? ? ]\n[the tyrant? ? ? ]\n[Ah-ah-ah-ah-ah-ah-ah-ah-ah, mint, if you didn’t volunteer, blink your eyes! ! ! ]\nOn this day, the whole star fell out of love!>"
}