{
	"url": "https://www.novelupdates.com/series/the-rest-of-my-life-is-for-you/",
	"title": "The Rest Of My Life Is For You - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2018/10/restofmy.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Drama   Josei   Mystery   Romance   ",
	"tags": "Amnesia   Arrogant Characters   Beautiful Female Lead   Businessmen   Childcare   Clever Protagonist   Cold Love Interests   Cunning Protagonist   Cute Children   Devoted Love Interests   Female Protagonist   Handsome Male Lead   Love Interest Falls in Love First   Marriage   Misunderstandings   Modern Day   Mysterious Past   Pregnancy   Wealthy Characters   ",
	"rating": "(3.7 / 5.0, 54 votes)",
	"author": "Stupa Demon   浮屠妖   ",
	"year": "\n2017",
	"ranking": "#6970   #2000   #4772   #8532   #6588   ",
	"reviewcount": "3 Reviews sorted by",
	"description": "Yu Yuehan is the usual rich, perfect, aloof president—the richest man in City H; but one day, a female toddler suddenly appears in his life as his daughter! Despite being certain that he has never touched a woman before, DNA tests certify that the toddler is his! He soon becomes a good 'daddi' for the little toddler, Xiao Liuliu.\n\nTwo years later, for some inexplicable reason, Xiao Liuliu becomes very fond of a trial nurse, Nian Xiaomu, hired to take care of her. Nian Xiaomu has a strong personality and refuses to let anyone bully her. Constantly wary that anyone might cause harm to his daughter, Yu Yuehan keeps a constant watch over Nian Xiaomu. However, his black-bellied daughter has plans for her father up her sleeves… Over time, Nian Xiaomu reveals her charming side bit by bit; and for the first time in his life, Yu Yuehan is drawn in by this mysterious woman...\n\n'Daddi, you are so handsome!' Xiao Liuliu blushes.\n\n'Daddi, I want hugs!' Xiao Liuliu coos.\n\n'Daddi, I want a younger sister! Quick make one with Mommi.'\n\n'Daddi...'\n\nYu Yuehan says in a deadpan fashion, 'I have never slept with any woman! How can I have a daughter!?'\n\n'Did Mommi sleep with you without you realizing it?'\n\nYu Yuehan: '...'>"
}