{
	"url": "https://www.novelupdates.com/series/quickly-wear-the-face-of-the-devil/",
	"title": "Quickly Wear the Face of the Devil - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/12/Quickly-Wear-the-Face-of-the-Devil_1640588524.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adult   Adventure   Comedy   Drama   Fantasy   Romance   School Life   Sci-fi   Yaoi   ",
	"tags": "Acting   Age Progression   Alternate World   Ancient China   Apocalypse   Arranged Marriage   Arrogant Characters   Artificial Intelligence   Artists   Autism   Beasts   Calm Protagonist   Celebrities   Charismatic Protagonist   Charming Protagonist   Clever Protagonist   Confident Protagonist   Cunning Protagonist   Death of Loved Ones   Devoted Love Interests   Disabilities   Doting Love Interests   Eidetic Memory   Famous Protagonist   First-time Interc**rse   Genius Protagonist   God-human Relationship   Gods   Guardian Relationship   Hackers   Handsome Male Lead   Human-Nonhuman Relationship   Jack of All Trades   Love Interest Falls in Love First   Male Yandere   Masochistic Characters   Master-Disciple Relationship   Mob Protagonist   Models   Modern Day   Multiple Realms   Obsessive Love   Omegaverse   Outer Space   Overpowered Protagonist   Possessive Characters   Post-apocalyptic   Power Couple   Priests   Protagonist Strong from the Start   Revenge   Royalty   R*pe   Schemes And Conspiracies   Scientists   Shota   Showbiz   Soul Power   Strong Love Interests   System Administrator   Transmigration   Virtual Reality   World Hopping   Zombies   ",
	"rating": "(4.5 / 5.0, 2963 votes)",
	"author": "Casanovanic Bookworm   Feng Liu Shu Dai   風流書呆   风流书呆   ",
	"year": "\n2015",
	"ranking": "#287   #260   #158   #627   #27   ",
	"reviewcount": "666 Reviews sorted by",
	"description": "A top hacker was chosen by the Lord God to be reborn into countless worlds, always as an expendable villain.\n\nWith no free will, every world became a dead end. Each of his lives ended tragically.\n\nFinally, after wrestling control of the Villain System, this ace hacker decided to enact revenge. Even if his very bones were rotten, he’d choose to occupy the very heights of morality, if only on the surface.\n\nThus, he would change his fate as an abused slag.>"
}