{
	"url": "https://www.novelupdates.com/series/an-old-man-from-the-countryside-becomes-a-swords-saint-i-was-just-a-rural-sword-teacher-but-my-successful-students-wont-leave-me-alone/",
	"title": "An Old Man from the Countryside Becomes a Swords Saint: I Was Just a Rural Sword Teacher, But My Successful Students Won’t Leave Me Alone! - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/04/An-Old-Man-from-the-Countryside-Becomes-a-Swords-Saint-I-Was-Just-a-Rural-Sword-Teacher-But-My-Successful-Students-Wont-Leave-Me-Alone.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Fantasy   Harem   Martial Arts   Seinen   ",
	"tags": "Adapted to Manga   Dense Protagonist   Easy Going Life   Fantasy World   Male Protagonist   Master-Disciple Relationship   Misunderstandings   Multiple POV   Politics   Protagonist Strong from the Start   R-15   Strong Love Interests   Sword And Magic   Sword Wielder   Yandere   ",
	"rating": "(3.4 / 5.0, 70 votes)",
	"author": "Sagasaki Shigeru   佐賀崎しげる   ",
	"year": "\n2020",
	"ranking": "#117   #279   #1517   #351   #2728   ",
	"reviewcount": "7 Reviews sorted by",
	"description": "Beryl Gardernant is a humble sword master who runs a dojo in the Reveris Kingdom.\r\n\r\nHe had come to terms with the limits of his strength and was living a leisurely life in the countryside.\r\n\r\nHowever, his life changes drastically when Alexia, one of his former students, suddenly visits him and tells him that she has recommended Beryl to be a special instructor within the nation’s Knight Order.\r\n\r\nHe is reunited with his former students who have become big-shots such as knight captains, top-ranking adventurers, and ace magicians, and he is kicked out of his family’s dojo.\r\n\r\nTurbulent times were ahead of him.\r\n\r\nBeryl was happy that his former disciples adore him, but he is also humble about the fact that he is not very strong.\r\n\r\nHowever, while he wasn’t aware of it, he was the owner of an unparalleled talent.\r\n\r\nUnconscious of his power, Beryl is surrounded by ex-disciples who know of his strength, and gradually makes himself known to the world, all the while remaining rather unaware of all of this.>"
}