{
	"url": "https://www.novelupdates.com/series/the-demoness-is-not-evil/",
	"title": "The Demoness Is Not Evil - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2015/08/demonessisnotevil.jpg",
	"noveltype": "(CN)",
	"genre": "Josei   Martial Arts   Mature   Mystery   Romance   ",
	"tags": "Clever Protagonist   Female Protagonist   Handsome Male Lead   Love Interest Falls in Love First   Secret Identity   Short Story   ",
	"rating": "(4.4 / 5.0, 264 votes)",
	"author": "Xi Meng   ",
	"year": "\nN/A",
	"ranking": "#2642   #2137   #3503   #13810   #1814   ",
	"reviewcount": "30 Reviews sorted by",
	"description": "They say Gentleman Xiao Yao (carefree) Liu Feng is a famed righteous pugilist. He himself thought that even if he isn’t considered noble and benevolent, he is at least of honourable character.\r\n\r\nBut only when he met her, did he realise that he is very well capable of being such a lecherous man. At every little moment he is constantly wanting to take advantage of her, always trying to touch her soft slender hands. It’s hopeless, who told this lady to just be so interesting, causing his heart to helplessly be moved by her—-\r\n\r\nHer appearance looks like that of a refined lady from a well off background, but in reality she is nothing like that inside. Not only highly skilled in martial arts, her sharp tongue is also highly skilled, capable of angering people to a whole new boiling point.\r\n\r\nHer ways of doing things is also extremely bold, completely treating the principle of impropriety between men and women like an old fart. He had only jokingly invited her to sleep with him, yet she actually pats the bed beckoning him to attend to her (?) Even going to the point of shooing him out the room after eating him dry, finding him to be too obstructive on the eye, what a way to shoot down his self-esteem.\r\n\r\nAi~ to fall for such a unique girl, causing him to be filled with joy one moment, and filled with sorrow the next. Overjoyed when he has her by his side, sorrowful when she acts so elusive. If that was not enough, she didn’t even leave a single note behind and disappeared without a trace, causing him to become like an abandoned husband searching for his wife.\r\n\r\nLittle do they know that this is an important test to see if these two people can be together…..>"
}