{
	"url": "https://www.novelupdates.com/series/i-really-dont-want-to-sign-a-marriage-agreement-with-the-big-boss/",
	"title": "I Really Don’t Want to Sign a Marriage Agreement with the Big Boss - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/02/I-Really-Dont-Want-to-Sign-a-Marriage-Agreement-with-the-Big-Boss.jpeg",
	"noveltype": "(CN)",
	"genre": "Adult   Comedy   Romance   Shounen Ai   Slice of Life   ",
	"tags": "Apartment Life   Arranged Marriage   Arrogant Characters   Bickering Couple   Businessmen   Calm Protagonist   Celebrities   Childish Protagonist   Cohabitation   Doting Older Siblings   Easy Going Life   First Love   Heartwarming   Hiding True Identity   Lack of Common Sense   Lazy Protagonist   Marriage of Convenience   Modern Day   Older Love Interests   Roommates   Showbiz   Tragic Past   Tsundere   Wealthy Characters   ",
	"rating": "(3.5 / 5.0, 17 votes)",
	"author": "三千风雪   ",
	"year": "\n2021",
	"ranking": "#3567   #2000   #8582   #5687   #9015   ",
	"reviewcount": "5 Reviews sorted by",
	"description": "After three years of marriage, Sheng Mingzhi and Lu Jiayan met only a handful of times.\r\n\r\nOne is a workaholic CEO who went overseas to explore markets, and the other is a star who is full of negative news and has little attention.\r\n\r\nTheir photos are all Photoshopped, and their marriage is only maintained by a sense of faith.\r\n\r\nOne day, the frenemy husbands had to fly back to Yunjing at the same time because Grandpa Lu was celebrating his birthday. \r\n\r\nAt the birthday party, Sheng Mingzhi leaned on Lu Jiayan's brother's shoulder fondly and said, 'My husband, it's been a long time, I miss you. =3=”\r\n\r\nWhile Lu Jiayan looked at Sheng Mingzhi's sister affectionately: It's been a long time, have you had plastic surgery?\r\n\r\nThe secretary embarrassedly reminded him: “President Lu, you have mistaken the person.”\r\nThe agent covered his face in despair: “Mingzhi, that's not your husband.”\r\n\r\nIt's fxxking embarrassing!\r\n#I know your two are frenemy husbands, but I really don't know you are frenemy to this point.#\r\n#It’s ridiculous that you can’t even distinguish the gender of your love!#\r\n\r\nLu Jiayan:'Isn't plastic surgery popular in your entertainment industry? Isn't it normal for me to mistook you for someone else?'\r\n\r\nSheng Mingzhi:“Thank you! If you pay a little attention, you know that transsexuality has never been popular in the entertainment industry : )”\r\n\r\nSheng Mingzhi, as the first eye candy in the entertainment industry, has no works for three years after his debut, and he is still not famous.\r\n\r\n\r\nMingzhi’s daily life is to show off his wealth on social platforms. His anti-fans comments are as follows:\r\n“Now that the photos are taken, the borrowed Hermes shall be returned to it’s original owner.”\r\n“It's not easy to gather so many fake luxuries in one go”\r\n“Don't stand in front of someone's fancy cars to take pictures, it's embarrassing”\r\n\r\nThere's a top comment of the anti-fans.\r\nMingzhi stood in front of the $500 million yacht 'Prince' with a bright smile.\r\n\r\n“LOL! I can smell a poser from a mile away. No one really doesn't know ‘Prince’ is a wedding gift from Shengjia President Lu Jiayan to his wife?”\r\nA few months later, the comment was forwarded by the official Weibo(a platform like Twitter) account of Shengjia Group.\r\n\r\n“LOL! No one really doesn't know Mr. Sheng Mingzhi is the wife of the President?”\r\n>"
}