{
	"url": "https://www.novelupdates.com/series/happy-ending-for-the-time-limited-villainess/",
	"title": "Happy Ending for the Time-limited Villainess - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/03/Happy-Ending-for-the-Time-Limited-Villainess.jpeg",
	"noveltype": "(KR)",
	"genre": "Comedy   Drama   Fantasy   Romance   Shoujo   Supernatural   ",
	"tags": "Adapted to Manhwa   Demon Lord   European Ambience   Female Protagonist   Magic   Reincarnated in Another World   Reincarnation   Sickly Characters   Terminal Illness   Villainess Noble Girls   ",
	"rating": "(3.6 / 5.0, 28 votes)",
	"author": "Hara-Syo   하라쇼   ",
	"year": "\n2019",
	"ranking": "#2000   #2000   #9125   #10065   #5278   ",
	"reviewcount": "No Reviews",
	"description": "'Please have a happy marriage with me for just six months.'\r\n\r\n'What good does that have for me?\r\n\r\n“Of course we’ll give you the Reno family's estates and fortune.”\r\n\r\n“...Let’s say you give it all to me. You said you’ll divorce me in half a year. If that’s so, what will you do afterwards?”\r\n\r\n“...There’s something I’ve been thinking about doing. I won’t be able to use the money anyway.”\r\n\r\nClea always lied. This body will soon die. It’ll barely last half a year.\r\n\r\nAfter being in a satisfying marriage, Clea Reno wanted to close her eyes for the final time in a quiet place.\r\n\r\n#\r\n\r\nWhen I was stabbed to death, I was summoned before the Demon King and was given a six-month time limit as a villainess.\r\n\r\n“Cough-“\r\n\r\nMy body uses up one energy when taking a step, three health when talking, 300 of my health after running for ten seconds, and I throw up blood when a third of my energy is spent.\r\n\r\n“Oh my, she’s doing that again for attention.”\r\n\r\n“It’s surprising that she carries paint wherever she goes.”\r\n\r\n“Well, His Excellency Detroit did reject her coldly.”\r\n\r\nMy reputation was the worst.\r\n\r\nThe Demon King said he’ll save my body if I get married happily, but the condition is mortifying.\r\n\r\nI have to get married to the man I’ve had an unrequited crush on, Archduke of Detroit.\r\n\r\nI said I’ll do anything in order to get married, but I don’t know what a “happy marriage” is...\r\n\r\nWill I be able to survive?\r\n>"
}