{
	"url": "https://www.novelupdates.com/series/heart-stealer-young-master-bo/",
	"title": "Heart Stealer Young Master Bo - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/01/Heart-Stealer-Young-Master-Bo.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Fantasy   Romance   School Life   Shoujo   ",
	"tags": "Age Progression   Beautiful Female Lead   Character Growth   College/University   Doctors   Doting Love Interests   Doting Older Siblings   Doting Parents   Female Protagonist   Gangs   Handsome Male Lead   Hiding True Abilities   Hiding True Identity   Love Interest Falls in Love First   Multiple Identities   Music   Protagonist Strong from the Start   Strong Love Interests   Strong to Stronger   ",
	"rating": "(3.0 / 5.0, 2 votes)",
	"author": "Shui Lan'an   ",
	"year": "\nN/A",
	"ranking": "#2000   #2000   #11299   #13807   #12658   ",
	"reviewcount": "1 Review sorted by",
	"description": "'If you run away again, I will destroy the world!' \r\n\r\n'I won't run, I won't run. I'll be good!' \r\n\r\nBo Yucheng watches the vixen who intently tries to escape and gets his hands on two marriage certificates instantly. \r\n\r\n'If you dare to escape illegally again, I will use legal means to bring you back.' \r\n\r\nThe girl nods her head fervently. \r\n\r\nFrom this moment on, Young Master Bo has become addicted to pampering and protecting his wife. \r\n\r\nHowever, there are rumors that Mrs Bo is an ugly, idiotic, and stupid woman from a poor family background, making her undeserving of Young Master Bo's love and favor. \r\n\r\nHence, billions of fans from all over the world become unhappy. 'Who dares to talk bad about our goddess?' \r\n\r\nThe people from world-class medical research institute are also annoyed. 'Who is so blind to belittle the successor of our institute?' \r\n\r\nEven the First Young Master of the wealthiest family is enraged. 'I heard that someone is looking down on the daughter of the Shi Family?' \r\n\r\nEveryone is dumbfounded and shocked as they look at the girl who is placed on the pedestal in various fields. \r\n\r\nYoung Master Bo pulls his wife into his embrace immediately and smirks. 'If anyone dares to provoke my wife again... they shall just be put to death.' \r\n\r\n[A wolf in sheep's clothing VS A beautiful queen]>"
}