{
	"url": "https://www.novelupdates.com/series/become-a-villain-wife-after-transported/",
	"title": "Become a Villain Wife After Transported - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/02/Become-a-Villain-Wife-After-Transported.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Fantasy   Psychological   Romance   Slice of Life   ",
	"tags": "Beautiful Female Lead   Businessmen   Caring Protagonist   Celebrities   Character Growth   Chat Rooms   Child Abuse   Childcare   Complex Family Relationships   Confident Protagonist   Cute Children   Doting Love Interests   Doting Older Siblings   Doting Parents   Familial Love   Female Protagonist   Handsome Male Lead   Heartwarming   Marriage of Convenience   Modern Day   Multiple Reincarnated Individuals   R*pe   Showbiz   Stubborn Protagonist   System Administrator   Transmigration   Transported to Another World   Wealthy Characters   ",
	"rating": "(3.8 / 5.0, 229 votes)",
	"author": "Jin Cheng   锦橙   ",
	"year": "\n2019",
	"ranking": "#1171   #3835   #1328   #2089   #1486   ",
	"reviewcount": "66 Reviews sorted by",
	"description": "Jian Tang is a bit unlucky. She transmigrated. Her husband is an absolutely wicked villain beyond redemption in an Otome video game. \n\nIn the end, because he wanted to have the female lead by force, his family was broken up and ruined by the decent male lead, ending very miserably. \n\nBesides that, their eldest son will become the future BOSS, his second son will become the vicious male supporting character, and the youngest daughter will become a very cunning, ignorant, and incompetent cannon fodder.\n\nJiang Tang is very anxious. If she was really the villain’s wife, then according to the plot, she will die from illness after a year.\n\nJiang Tang looked at her villain husband, rubbed her little hand, and said: “Bro, let’s get divorced. Children belong to you, the property belongs to me.”\n\nThe villain husband: ???\n\nMy husband, sons, and daughter are all wicked people.\n\nIn order to stay alive, Jiang Tang made painstaking efforts to transform the children into positive and upright good young people. At the same time, she also harvested her own love.>"
}