{
	"url": "https://www.novelupdates.com/series/counterattack-of-the-cannon-fodder-chambermaid/",
	"title": "Counterattack of the Cannon Fodder Chambermaid - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/06/Counterattack-of-the-Cannon-Fodder-Chambermaid.jpg",
	"noveltype": "(CN)",
	"genre": "Drama   Fantasy   Historical   Mature   Romance   Slice of Life   ",
	"tags": "Ancient China   Beautiful Female Lead   Calm Protagonist   Childcare   Couple Growth   Different Social Status   Doting Love Interests   Female Protagonist   F*llatio   Handsome Male Lead   Imperial Harem   Love Interest Falls in Love First   Misunderstandings   Multiple Reincarnated Individuals   Older Love Interests   Politics   Power Couple   Pregnancy   R*pe Victim Becomes Lover   Reincarnation   Royalty   R*pe   Second Chance   S*ave Protagonist   Slow Romance   Twins   Weak Protagonist   ",
	"rating": "(4.3 / 5.0, 337 votes)",
	"author": "Jia Mian De Sheng Yan   Mask Feast   假面的盛宴   ",
	"year": "\n2015",
	"ranking": "#3567   #2770   #825   #343   #1161   ",
	"reviewcount": "124 Reviews sorted by",
	"description": "First of all, this is not a story where the cannon fodder chambermaid counterattacks and gives the main wife a beat-down!\r\n\r\nAs a lowly slave who had been sold a total of six times, Xiao Hua has long become apathetic to her situation.\r\n\r\nIn her past life, she was a cannon fodder chambermaid who was beaten to death. In this life, she decided to turn over a new leaf and live honestly, yet in the end still ended up being sold off.\r\n\r\nThis prince’s estate seems to have pretty good benefits? She could be released at twenty-five, and they’d arrange a place for her to live under their jurisdiction? They’d even get rid of her slave records?\r\n\r\nGreat! That’s great! Xiao Hua thus decided to stay in the Jing Prince Estate and do her job properly. It’s a shame she could never overcome the whims of fate….\r\n\r\nThe master she serves is a “mute boy”, with several influences above him watching like tigers eyeing their prey. To say she doesn’t want to be pampered is definitely a lie. This is the road to survival of a “discreet girl” who clings on to her master’s leg and is solely pampered, yet feels that he never pampers her.\r\n\r\nThe road from a cannon fodder chambermaid to a beloved imperial consort is a little long….>"
}