{
	"url": "https://www.novelupdates.com/series/junior-brother-always-wants-to-bend-me/",
	"title": "Junior Brother Always Wants to Bend Me - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/01/Junior-Brother-Always-Wants-to-Bend-Me-Reincarnation.jpg",
	"noveltype": "(CN)",
	"genre": "Romance   Xianxia   Yaoi   ",
	"tags": "Absent Parents   Abusive Characters   Ancient China   Caring Protagonist   Dao Companion   Devoted Love Interests   Hiding True Identity   Multiple Reincarnated Individuals   Past Plays a Big Role   Past Trauma   Phoenixes   Reincarnation   Schemes And Conspiracies   Seme Protagonist   Social Outcasts   Tragic Past   Unconditional Love   ",
	"rating": "(4.2 / 5.0, 20 votes)",
	"author": "Xi You Mu Mu   西柚木木   ",
	"year": "\n2019",
	"ranking": "#6970   #2000   #8123   #6190   #6685   ",
	"reviewcount": "4 Reviews sorted by",
	"description": "In this story, the gong and shou are the same soul.\r\n\r\nSu MuJin’s previous existence was extremely miserable. After being reborn, he realized he could rely on the knowledge from his previous incarnation and his natural talents in order to reach the pinnacle of life. In this new incarnation, however, he’s motherless and his sect leader father has no love for this disappointment of a son Gu Feng. Additionally, his original shell is still enduring a tough and miserable life. How can this be?\r\n\r\nSo Gu Feng brought Su MuJin home and worked every day to save the two of them from a bitter fate. Fortunately, Su MuJin is understanding and affectionate, but just as Gu Feng is certain he made the right decision . . .\r\n\r\nSu MuJin: “Shixiong, I’m yours.”\r\n\r\nGu Feng: “ . . . ” How did you turn out like this? I’m not a pervert!\r\n\r\nFrom then on, Gu Feng is subjected to a life of constant attempts to seduce him, but just as Gu Feng is gradually captivated by the little incubus Su MuJin’s beauty . . .\r\n\r\nSu MuJin: “Shixiong, I used to tempt you, how about I let you go free now?\r\n\r\nGu Feng: “ . . . ” You want to let me go? No way, not a chance! You started this, don’t think I’ll let you off without any consequences.>"
}