{
	"url": "https://www.novelupdates.com/series/boys-love-online-is-a-wreck/",
	"title": "Boy’s Love Online is a Wreck - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/04/Boys-Love-Online-is-a-Wreck.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Romance   Shounen Ai   Sports   ",
	"tags": "Celebrities   Devoted Love Interests   Doting Love Interests   Familial Love   First Love   Game Elements   Gamers   Heartwarming   Love at First Sight   Lovers Reunited   Modern Day   Protagonist Falls in Love First   Wealthy Characters   ",
	"rating": "(4.2 / 5.0, 24 votes)",
	"author": "风华如故   ",
	"year": "\n2020",
	"ranking": "#2000   #6382   #8206   #5348   #6279   ",
	"reviewcount": "4 Reviews sorted by",
	"description": "For the purpose of his live broadcast, Ji Xingchen pretended to be a cute girl to tease his team’s wild king gege in a game.\n\nIn line with his principle that as long as he slipped away fast enough he could not be deemed Aquaman, Ji Xingchen tossed the wild king gege to the back of his mind immediately after the game ended.\n\nWho would have thought, when he returned back from the toilet, that there would be a big boss in his broadcast room fiercely brushing hundreds of thousands of gifts.\n\nJi Xingchen became dumbfounded: Big boss, you. . .did you get the wrong person?\n\nThe big boss: No mistake.\n\nThe big boss: I was the Li Bai from last game.\n\nJi Xingchen: Holy shit.\n\nThis was the wild king gege he had just teased!\n\n*\n\nWhen asked about his ideal type, peak-popularity Ran Feng always remained silent.\n\nBut one day, his fans discovered that their idol had actually admitted his type was someone who could play games well.\n\nThe fans: I’m here! Load faster, King of Glory!\n\n*\n\nAt King of Glory’s Professional League finals, Ji Xingchen agreed to meet offline with a big boss from his list. \n\nJi Xingchen waited a long time for the big boss at their agreed-on location, only to meet not the boss but an old acquaintance.\n\nThe man was leaning against the corner of two walls, a cigarette indolently dangling from his lips. His slightly raised peach blossom eyes contained deep emotions.\n\nRan Feng pressed out the cigarette with his hand, and trapped Ji Xingchen between his arms.\n\nIn the lingering smoke, he softly kissed the corner of Ji Xingchen’s lips.\n\n“Don’t you remember who I am? Will you disappear this time, too?”\n\nExtremely beautiful anchor shou X deeply in love and dedicated celebrity gong.>"
}