{
	"url": "https://www.novelupdates.com/series/after-rebirth-the-tragic-omega-wins-without-lifting-a-finger/",
	"title": "After Rebirth the Tragic Omega Wins Without Lifting a Finger - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/06/After-Rebirth-the-Tragic-Omega-Wins-Without-Lifting-a-Finger.png",
	"noveltype": "(CN)",
	"genre": "Fantasy   Romance   Sci-fi   Shounen Ai   Yaoi   ",
	"tags": "Arranged Marriage   Devoted Love Interests   Doting Parents   Handsome Male Lead   Love Interest Falls in Love First   Multiple Personalities   Multiple Reincarnated Individuals   Omegaverse   Persistent Love Interests   Possessive Characters   Reincarnation   Second Chance   Yandere   ",
	"rating": "(4.0 / 5.0, 28 votes)",
	"author": "Shao Tang   勺棠   ",
	"year": "\n2021",
	"ranking": "#655   #1723   #8290   #4124   #6796   ",
	"reviewcount": "3 Reviews sorted by",
	"description": "In his previous life, An Ji seemed to have the word “unlucky” written on his forehead.\n\nHe was born into nobility, but ended up living on the streets for ten years. He found a beta boyfriend, but the scumbag tricked him into cutting out his glands. He dedicated his life to the omega cause, but ended up dying without an intact corpse.\n\nIt wasn’t until later that he found out that everyone described people like him as “beautiful, strong, and tragic.” The difference was that the beautiful, strong, and tragic characters in stories all have happy endings, but he only got death.\n\nAn Ji: “WTF.”\n\nThen he is reborn.\n\nIn this second life, An Ji expresses that he will only be beautiful and strong. As for tragic? f*ck that shit!\n\nBut can someone tell him why his previously polite fiancé suddenly changed personalities?\n\nStar history states that Emperor Rongwu had a brutal nature and outstanding ability. He ruled with an iron fist and created a prosperous world that lasted for hundreds of years after the war.\n\nEveryone thought that he was too focused on his career to spare any attention for love. Very few people knew that he was always thinking about his fiancée, the true love that he let get away because of his ridiculous notions of kindness.\n\nThe great, unmarried emperor ended his long and lonely life after choosing a successor for the throne.\n\nWhen he opens his eyes again, Li Rong has returned to his youth.\n\nThe young puppy Li Rong believes that if you love someone, you must give that person freedom.\n\nThe old dog Li Rong says that is all nonsense. If you love someone, you must possess that person at all costs.\n\nMuch later on, An Ji rubs his sore waist and thinks that his new life is still tragic to some extent.\n\nThe young puppy and the old dog come in turns. Even the strongest omega wouldn’t be able to stand it… ORZ>"
}