{
	"url": "https://www.novelupdates.com/series/can-you-afford-to-raise/",
	"title": "Can You Afford To Raise? - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/11/CAN-YOU-AFFORD.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Romance   ",
	"tags": "Artists   Beautiful Female Lead   Businessmen   Carefree Protagonist   Female Protagonist   Handsome Male Lead   Hard-Working Protagonist   Late Romance   Modern Day   Protagonist Falls in Love First   Shameless Protagonist   Unrequited Love   ",
	"rating": "(4.1 / 5.0, 52 votes)",
	"author": "Xixi   西淅   ",
	"year": "\nN/A",
	"ranking": "#3802   #4207   #4267   #5194   #4104   ",
	"reviewcount": "10 Reviews sorted by",
	"description": "Ye Yuqing found her boyfriend was cheating. After breaking up, she was dragged by her friend to a high-end club.\r\n\r\nAfter following the rules for more than twenty years, she decided to be presumptuous, and plucked up her courage to call a male server to chat!\r\n\r\nThis time there will be no feelings!\r\n\r\nThe man was leaning on the counter bar, turned his head, wore a black silk shirt with his voice extremely cold.\r\n\r\n'I can, but I am expensive.'\r\n\r\nWhen Ye Yuqing saw the person's stunning face, the dismay feeling she felt of being cheated instantly faded away!No matter how expensive it is! She's on it!\r\n\r\nFor the sake of beauty, she quit her retirement job and worked hard. Although the new boyfriend was being paid, he was gentle and handsome, and they were very happy every day.\r\n\r\nPaying for this beauty, she thinks it's worth it! even better!\r\n\r\n—\r\n\r\nA year later, Ye Yuqing's illustration became popular and won the best illustration in the industry. On the day she went to receive the award, she thought about using the bonus to buy a ring for her new boyfriend.\r\n\r\nA ring would look good on such a beautiful hand!\r\n\r\nWhen she looked up, she saw the beautiful face. The host on the side introduced me with a smile: 'Initiator of the award, President Li.'\r\n\r\nAside from the constant increase in charge fee which is extremely expensive, the new perfect boyfriend is also wealthy!? Ye Yuqing's legs were soft and she almost fell off the stage in fright.\r\n\r\nLi Che stretched out his refined hand to support her, and asked with a smile, 'What are you afraid of?'\r\n\r\nYe Yuqing:...\r\n\r\nI'm afraid I can't support you anymore, Big brother goodbye!>"
}