{
	"url": "https://www.novelupdates.com/series/there-is-no-afterlife/",
	"title": "There Is No Afterlife - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/08/21642002187430_584.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Comedy   Drama   Fantasy   Sci-fi   Shounen Ai   Slice of Life   ",
	"tags": "Abandoned Children   Accelerated Growth   Adopted Children   Aliens   Androids   Artificial Intelligence   Beastkin   Cannibalism   Chefs   Child Protagonist   Childhood Love   College/University   Cooking   Cosmic Wars   Couple Growth   Empires   Familial Love   Fast Learner   Fleet Battles   Friendship   Futuristic Setting   Generals   Genetic Modifications   Heartwarming   Hidden Abilities   Hiding True Identity   Late Romance   Military   Mpreg   Mysterious Family Background   Naive Protagonist   Non-humanoid Protagonist   Orphans   Romantic Subplot   Royalty   Slow Growth at Start   Smart Couple   Strategic Battles   Suicides   Tragic Past   Transformation Ability   Wars   ",
	"rating": "(4.4 / 5.0, 112 votes)",
	"author": "solongatime   Yuè Xià Sāng   月下桑   ",
	"year": "\n2015",
	"ranking": "#2836   #2000   #3659   #6030   #3608   ",
	"reviewcount": "20 Reviews sorted by",
	"description": "Six robots on the run after being given an order to self destruct land on an unknown planet outside the range of every other interstellar planet. Without a human master, these six elite military robots are prepared to die, that is until they meet a four year old boy, the last child of the original planet called Earth.  \n\nMu Gen lived on the forgotten planet for 16 years with his “adopted” father, five uncles and one little brother. After the robots decide it is time for Mu Gen to live with other humans, they embark on a mission to bring him into society. \n\nWith the mission to go into society, the seven robots and the 16 year old Mu Gen travel through space, dodging meteors, flying at fast speeds and soon stumble upon …\n\nA giant chicken??!\n\nYoung Olivia modelled his spaceship after a famous childhood cartoon chicken and went galavanting through space. With long blond hair, multiple piercings and an ‘I don’t care’ attitude and dinosaur heritage, Olivia is surprised to see a small spaceship attach to his MengMeng undetected. \n\nThese two talented youngsters begin their journey that will bring great changes to the world. And the first thing they want to do is….\n\nMu Gen: To become a chef!\n\nOlivia: Then I’ll be become a patissier… and open a shop with Mu Gen… ≥∇≤\n\n(Note: This is not a romance novel. It’s about the life and progress of Mu Gen and Olivia as they grow and become adults.)>"
}