{
	"url": "https://www.novelupdates.com/series/master-swindler/",
	"title": "Master Swindler - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/08/Master-Swindler.jpeg",
	"noveltype": "(CN)",
	"genre": "Comedy   Horror   Romance   Supernatural   Yaoi   ",
	"tags": "Calm Protagonist   Carefree Protagonist   Cautious Protagonist   Character Growth   Charismatic Protagonist   Childhood Friends   Clever Protagonist   Cold Protagonist   Confident Protagonist   Cunning Protagonist   Curious Protagonist   Devoted Love Interests   Dreams   Eye Powers   Fantasy World   Fat to Fit   Fearless Protagonist   Flashbacks   Genius Protagonist   Ghosts   Handsome Male Lead   Hell   Inheritance   Jack of All Trades   Long Separations   Lovers Reunited   Male Yandere   Manipulative Characters   Manly Gay Couple   Modern Day   Multiple Realms   Multiple Transported Individuals   Nightmares   Power Couple   Protagonist Strong from the Start   Revenge   Shameless Protagonist   Smart Couple   Special Abilities   Strong Love Interests   Stubborn Protagonist   Survival Game   Teamwork   Transported into a Game World   Transported to Another World   Trickster   Unlimited Flow   World Hopping   ",
	"rating": "(4.3 / 5.0, 49 votes)",
	"author": "Silver-haired Dead Fish-eye   Yin Fa Si Yu Yan   银发死鱼眼   ",
	"year": "\n2020",
	"ranking": "#6970   #2000   #5828   #8803   #4064   ",
	"reviewcount": "11 Reviews sorted by",
	"description": "Lu Qingjia, once a slag provoked someone who he shouldn’t have. With great difficulty he saved his dog life, on the premise he would never appear before the other.\n\nHe entered a horror game and unexpectedly they had a chance encounter.\n\nThe man in front, a resentful bloody ghost crawling out of a closet to his back rushing towards him to take his life.\n\nThe situation was life threatening. Naturally, he didn’t have time for hypocrisy.\n\nLu Qingjia stepped forward and pulled out the ghost slowly crawling its way and yelled: “Why the f*ck are you so slow? With your sluggish and foolish manner you won’t even be able to eat sh*t while it’s hot and you still want to eat people”. Then, he hid inside the closet and refused to come out.\n\nGhost: ……?\n\nThe next time they met, the person said towards him: “Either come out or just sleep in the well together with that water ghost in your arms.”\n\nLu Qingjia; “This isn’t a matter of self esteem, it’s just that we hit it off, I want to chat with him all night and let him feel the long-lost warmth”\n\nWater ghost: ？？？Laozi didn’t suffer!>"
}