{
	"url": "https://www.novelupdates.com/series/agreement-of-being-gay-for-30-days/",
	"title": "Agreement of Being Gay for 30 Days - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/05/Agreement-of-Being-Gay-for-Days.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Drama   Romance   School Life   Yaoi   ",
	"tags": "Adapted to Drama CD   College/University   Devoted Love Interests   Enemies Become Lovers   First-time Interc**rse   F*llatio   Handsome Male Lead   Heartwarming   Love Rivals   Lovers Reunited   Manly Gay Couple   Modern Day   Popular Love Interests   Strong Love Interests   Time Skip   ",
	"rating": "(4.1 / 5.0, 334 votes)",
	"author": "Lin Zhiluo   林知落   ",
	"year": "\n2013",
	"ranking": "#1420   #1048   #1619   #1345   #1003   ",
	"reviewcount": "57 Reviews sorted by",
	"description": "F University’s two most attractive men, Wang Guangning and Zhang Lingyi, constantly competed with each other regardless in what aspect.\n\nWhether it was appearance, talent, popularity or even the number of abdominal muscles, they always contested with each other. Even the woman they pursued was the same.\n\nYet, these two xiao cao¹ who had self-proclaimed themselves as peerless in the aspect of love were completely rejected by the same woman.\n\nHence, they decided to retaliate against society by becoming gay.\n\nThey set an agreement to be gay for thirty days and even especially downloaded the list from the internet, thus preparing themselves to follow these standards in order to become a proper gay couple.\n\nFor example:\n\nWatching a movie together…Hey, shou shou, remember to lean on my shoulder when you see a frightening scene, alright?\n\nWarming their hands together in the same pocket…Hey, don’t wear that large military jacket outside, it’s really embarrassing!\n\n***\n\nBy learning how to be gay from an unreliable guidebook for couples, two straight guys clash and end up with an unexpected outcome.\n\nTheir thirty days agreement has finished, yet can they truly return to their former lifestyles as if nothing ever happened?\n\n[1] 校草: the male counterpart of 校花. It’s used to describe the most attractive guy of the school.>"
}