{
	"url": "https://www.novelupdates.com/series/reincarnated-in-the-world-of-a-yuri-game-as-a-man-who-got-sandwiched-by-yuri/",
	"title": "Reincarnated in The World of a Yuri Game as a Man Who Got Sandwiched by Yuri - Novel Updates",
	"image": "https://www.novelupdates.com/img/noimagefound.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Comedy   Fantasy   Harem   Mystery   School Life   Supernatural   ",
	"tags": "Academy   Adventurers   Beautiful Female Lead   Brother Complex   Charismatic Protagonist   Complex Family Relationships   Dense Protagonist   Devoted Love Interests   Dungeons   Elemental Magic   Elves   Family Conflict   Forced into a Relationship   Hard-Working Protagonist   Harsh Training   Hidden Abilities   Loner Protagonist   Magic   Male Protagonist   Misunderstandings   Obsessive Love   Persistent Love Interests   Polygamy   Reincarnated in a Game World   Secrets   Shameless Protagonist   Sharp-tongued Characters   Spirits   Transmigration   Younger Sisters   ",
	"rating": "(3.9 / 5.0, 59 votes)",
	"author": "Tomato Spaghetti   とまとすぱげてぃ   ",
	"year": "\n2021",
	"ranking": "#2917   #3389   #4390   #8531   #6161   ",
	"reviewcount": "7 Reviews sorted by",
	"description": "--A man who gets sandwiched by Yuri can just go to hell.\r\n\r\nHiiro unfortunately got reincarnated in the world of the Yuri game 『Everything for the Score』,  where such words are true.\r\n\r\nAt first, for Hiiro, who loves Yuri, the world seemed like an ideal world for him, but...he gradually became aware of the reality.\r\n\r\nBecause the world he lived in was a modern Japan world where magic exists, a fantasy world where scores are everything.\r\n\r\nOn top of that, the world was a caste world where everything from behavior, accomplishments, even daily life affairs such as how to fold a futon was evaluated, and the 『Score』 given by the government is the one that determines the caste.\r\n\r\nIn such a world, Hiiro continues to be persecuted unreasonably, being given 0 points just because he is a man. Moreover, he was destined to die a horrible death because he got reincarnated as the one and only male annoyance in the game.\r\n\r\nIn order to deal with the approaching death flag, he seeks power by training his magic, and making strategy after strategy by making the best use of the game's knowledge until....Even though it is supposed to be a Yuri game, he, who was just an annoyance, somehow got surrounded by the heroines.\r\n\r\n'... are? Where is the Yuri?'\r\n\r\nThis is a story about a man who was supposed to be an annoyance until he destroyed the world of the Yuri game in another sense.>"
}