{
	"url": "https://www.novelupdates.com/series/i-just-want-to-freeload-on-your-luck/",
	"title": "I Just Want to Freeload on Your Luck - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/11/freeloadonyourluck2.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Drama   Fantasy   Romance   School Life   Slice of Life   ",
	"tags": "Arrogant Characters   Beautiful Female Lead   Calm Protagonist   Clever Protagonist   Clumsy Love Interests   Complex Family Relationships   Dense Protagonist   Determined Protagonist   Devoted Love Interests   Disfigurement   Doting Love Interests   Female Protagonist   Friendship   Handsome Male Lead   Heartwarming   Jealousy   Love Interest Falls in Love First   Misunderstandings   Modern Day   Past Plays a Big Role   Proactive Protagonist   Reincarnation   Second Chance   Shameless Protagonist   Siblings Not Related by Blood   Strong Love Interests   System Administrator   Tragic Past   Tsundere   ",
	"rating": "(4.6 / 5.0, 373 votes)",
	"author": "Ming Gui Zai Jiu   明桂载酒   ",
	"year": "\n2020",
	"ranking": "#748   #505   #943   #1493   #857   ",
	"reviewcount": "128 Reviews",
	"description": "Despite having found Mingxi, the Zhao family continued to favor the fake daughter, saying that Mingxi was not as kind nor as graceful as Zhao Yuan.\n\nMingxi didn’t mind. She continued to work hard to please her family although they would always say that she was trying to rob their attention away from Zhao Yuan.\n\nUntil she died because of a terminal illness.\n\nIt was then that she realized that Zhao Yuan was the actual lady blessed by luck while she was merely this novel’s evil supporting character with a tragic ending.\n\nZhao Mingxi who was given a second chance at life was bitterly disappointed. She no longer cared about her family. Screw her family and her fiancé. She immediately packed her bags and left home, off to complete the task given by the system named ‘Becoming Friends With Popular and Valuable Characters’.\n\nAfter she left, the house suddenly became cold and quiet.\n\nBy right they should feel at ease, but–\n\nHer parents, her indifferent elder brother, her brash younger brother, Shen Liyao who was used to her pursuits were all successively feeling… unused to it?>"
}