{
	"url": "https://www.novelupdates.com/series/a-former-child-soldier-who-uses-a-magic-sword-wants-to-live-with-an-older-sister-of-a-former-enemy-executive/",
	"title": "A Former Child Soldier Who Uses a Magic Sword Wants to Live with an Older Sister of a Former Enemy Executive - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/07/A-Former-Child-Soldier-Who-Uses-a-Magic-Sword-Wants-to-Live-with-an-Older-Sister-of-a-Former-Enemy-Executive.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Fantasy   Romance   Seinen   ",
	"tags": "Adapted to Manga   Calm Protagonist   Enemies Become Lovers   Heroes   Identity Crisis   Magic Beasts   Male Protagonist   Older Love Interests   Protagonist Strong from the Start   Strong to Stronger   Sword And Magic   Teamwork   ",
	"rating": "(3.5 / 5.0, 24 votes)",
	"author": "Hasekura Mondo   支倉文度   ",
	"year": "\n2018",
	"ranking": "#705   #1324   #7805   #1499   #8613   ",
	"reviewcount": "2 Reviews sorted by",
	"description": "---You are just a killer. \r\n\r\n\r\nSeto, a Young soldier, is distrusted by the hero because of his brutal fighting style.\r\n\r\nKicked out of the heroic party formed to defeat the Demon King, Seto wanders through the forest in a state of disappointment and hunger.\r\n\r\nBut it was here that he met Satis, the female leader of the Demon King's army!\r\n\r\nSeto immediately gets into a fighting stance, but her appearance is extremely strange. \r\n\r\nFor some reason, she was in a state of full wounds.\r\n\r\nSeto, at a loss, decides to carry her to safety for the time being.\r\n\r\nFrom there, his involvement with her leads to major changes for Seto and the party that has banished him.\r\n\r\nSeto an ex-boy soldier who was expelled from the party of heroes on his journey because of his ruthless and incomparable fighting style. \r\n\r\nThe former leader of the Demon King's army, Satis, was kicked out after a series of failures.\r\n\r\nThe two 'former' enemies decide to travel together to find a second life. \r\n\r\nSometimes they go to hot springs, sometimes they sleep in the same bed, sometimes they are attacked by demons. \r\n\r\nBut what do they find at the end of their journey when they lose their place in the world?The road story of the (former) brave boy soldier and (former) demon lord's army leader's 'rebirth'!>"
}