{
	"url": "https://www.novelupdates.com/series/absolute-resonance/",
	"title": "Absolute Resonance - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/08/Absolute-Resonance.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Comedy   Martial Arts   Romance   School Life   Xuanhuan   ",
	"tags": "Absent Parents   Abusive Characters   Academy   Adapted to Manhua   Alchemy   Aristocracy   Arrogant Characters   Battle Academy   Battle Competition   Beautiful Female Lead   Calm Protagonist   Charismatic Protagonist   Charming Protagonist   Childhood Friends   Clever Protagonist   Confident Protagonist   Cultivation   Cunning Protagonist   Dragons   Engagement   Familial Love   Fast Learner   Friendship   Handsome Male Lead   Hiding True Abilities   Kingdoms   Limited Lifespan   Love Rivals   Magic   Male Protagonist   Mysterious Family Background   Nobles   Phoenixes   Playful Protagonist   Politics   Royalty   Shameless Protagonist   Sharp-tongued Characters   Strength-based Social Hierarchy   Strong Love Interests   Sword Wielder   Tsundere   Underestimated Protagonist   Unique Cultivation Technique   Unreliable Narrator   Wars   Weak to Strong   ",
	"rating": "(3.7 / 5.0, 149 votes)",
	"author": "Heavenly Silkworm Potato   Tian Can Tu Dou   天蚕土豆   ",
	"year": "\n2021",
	"ranking": "#38   #38   #453   #43   #2672   ",
	"reviewcount": "28 Reviews",
	"description": "In the land of the Xia Kingdom, every human being is born with what is known as a ‘resonance’, either to a specific element or a powerful, mythical beast. Unfortunately, Li Luo was born with an incredibly rare condition known as a blank resonance – as the name suggests, he doesn’t have one! Normally, this would be utterly crippling, but at least he has the advantage of being the young master of the mighty House Loulan, one of the five Great Houses of Xia. Unfortunately, his parents, the powerful masters of House Loulan, have gone missing for many years, and the other Great Houses are beginning to eye their holdings quite hungrily. For that matter, plenty are also eyeing his talented, beautiful childhood friend and fiancee Jiang Qing’e, who has been leading House Loulan in his parents’ stead! Li Luo would much rather keep a low profile and wants to call off the engagement – but Jiang Qing’e has flatly refused. What’s a ‘useless young master’ to do? \n\nIs there any way he can get out of this engagement? Can he figure out a way to protect his House from the jackals circling around it? And… is a blank resonance really useless? \n\nCome and find out!>"
}