{
	"url": "https://www.novelupdates.com/series/black-haired-king/",
	"title": "Black Haired King - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/09/Kurokami-no-Ou_v01_Cover.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Drama   Fantasy   Harem   Martial Arts   Romance   Seinen   Tragedy   ",
	"tags": "Abandoned Children   Adventurers   Beast Companions   Beautiful Female Lead   Betrayal   Broken Engagement   Brother Complex   Bullying   Childhood Friends   Cross-dressing   Cute Protagonist   Dark   Death of Loved Ones   Dense Protagonist   Determined Protagonist   Discrimination   Fantasy World   Female Master   First-time Interc**rse   Hard-Working Protagonist   Harem-seeking Protagonist   Honest Protagonist   Incest   Kind Love Interests   Kingdom Building   Love Interest Falls in Love First   Male Protagonist   Marriage   Master-Disciple Relationship   Master-Servant Relationship   Military   Multiple POV   Near-Death Experience   Nobles   Older Love Interests   Polygamy   Pregnancy   Royalty   Ruthless Protagonist   Sibling Rivalry   Siblings   Sister Complex   Strong Love Interests   Strong to Stronger   Sword And Magic   Sword Wielder   Threesome   Underestimated Protagonist   Wars   Weak to Strong   Younger Love Interests   ",
	"rating": "(3.6 / 5.0, 85 votes)",
	"author": "Yama   やま   ",
	"year": "\n2016",
	"ranking": "#2000   #2000   #4804   #3638   #4257   ",
	"reviewcount": "4 Reviews sorted by",
	"description": "“If so, then I will prove to everyone that even someone with black hair can be strong!”\r\n\r\nRedius, born with black hair in a world where magical power could be determined from one’s hair colour. Incompetent just because of the colour of his hair, treated and tormented like a taboo child, got betrayed by some adventurers who he had come to know and was left on the verge of death. He was then saved by an adventurer who would soon become his mentor.\r\n\r\nTraining under his mentor, participating in the war, getting strong all the while meeting different people, this is the story of a young man’s hardships to change the world’s sense of values.>"
}