{
	"url": "https://www.novelupdates.com/series/shadow-heros-everyday-life/",
	"title": "Shadow Hero’s Everyday Life - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/06/d78m9pv1k3fs505q1d1pbq5q9e1g_rsq_1d0_1xo_1lb5k.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Drama   Fantasy   Harem   School Life   Slice of Life   ",
	"tags": "Academy   Adapted to Manga   Aristocracy   Assassins   Beautiful Female Lead   Calm Protagonist   Cold Protagonist   Demons   Dense Protagonist   Fantasy Creatures   Fantasy World   Hiding True Abilities   Hiding True Identity   Knights   Lack of Common Sense   Male Protagonist   Military   Overpowered Protagonist   Protagonist Strong from the Start   Romantic Subplot   Ruthless Protagonist   Secret Organizations   Soldiers   Spies   Strong Love Interests   Sword And Magic   Underestimated Protagonist   ",
	"rating": "(3.8 / 5.0, 73 votes)",
	"author": "Sakaishi Yuusaku   サケ   坂石遊作   ",
	"year": "\n2019",
	"ranking": "#2594   #4697   #2946   #2898   #3516   ",
	"reviewcount": "7 Reviews sorted by",
	"description": "Assassination, Escorting, Espionage, Kidnapping...\n\nTweight, the ace of the Organization, the Dark Side of the Kingdom, had taken on all kinds of dirty work in the shadows, supporting the Heroes in their quest to defeat the Demon King, all for the sake of the Kingdom.\n\nTweight was eventually monikered 'The Shadow Hero' by those who knew of his existence, a greater existence than the so-called Hero.\n\nHowever, after the defeat of the Demon King, it was decided that the Organization would be disbanded.\n\nWhile the Organization was being dismantled, Tweight's boss asked him about his aspirations for the future.\n\nTweight, who was picked up by the Organization as a child, had no experience of a normal life, so he responded that he wanted to enjoy a normal life.\n\nLater that day, at the recommendation of his boss, Tweight enrolled in the Bildarz Academy, the largest school in the kingdom. What awaited him was the normal life he had been looking for, as well as a group of friends, each of whom having their own quirks.\n\nHowever, even though the Demon King was defeated, the world was not at peace. The Demon King's Legacy. Hostile Organizations. The Pus of the Kingdom. These seeds of war are spread throughout the kingdom.\n\nThe Defeat of the Demon King.\n\nIt heralded the dawn of a volatile era, filled with all kinds of danger.\nThe normal life that he had desired could collapse at any moment if he isn’t careful.\n\nThis is the story of a somewhat awkward boy, a former member of the Darkness of the Kingdom, who fights, resists, and tries to live life to the fullest, in order to protect his everyday life.\n>"
}