{
	"url": "https://www.novelupdates.com/series/carven-jade/",
	"title": "Carven Jade - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/12/20200701233348.jpg",
	"noveltype": "(CN)",
	"genre": "Psychological   Romance   Supernatural   Xuanhuan   Yaoi   ",
	"tags": "Ancient Times   Betrayal   Bloodlines   Character Growth   Clever Protagonist   Cold Love Interests   Couple Growth   Cultivation   Dao Comprehension   Death   Death of Loved Ones   Debts   Demonic Cultivation Technique   Depictions of Cruelty   Destiny   Elemental Magic   Handsome Male Lead   Immortals   Magic Formations   Misunderstandings   Multiple Reincarnated Individuals   Mysterious Past   Power Couple   Reincarnation   Revenge   Righteous Protagonist   Rivalry   Schemes And Conspiracies   Second Chance   Secrets   Seme Protagonist   Slow Romance   Strong Love Interests   Summoning Magic   Sword And Magic   Unconditional Love   Unrequited Love   Weak to Strong   Wealthy Characters   ",
	"rating": "(4.5 / 5.0, 41 votes)",
	"author": "Mo Shu Bai   墨书白   ",
	"year": "\n2019",
	"ranking": "#2000   #3773   #6887   #12114   #4582   ",
	"reviewcount": "9 Reviews sorted by",
	"description": "Qin Yan was already a demonic cultivator when Fu Changling met him for the first time.\r\n\r\nHe had killed Fu Changling’s entire family before he placed an old jade in his palm.\r\n\r\nHe had said: Fu Changling, people are like jade. Only after they had weathered through the hundred sorrows of life and death, could they acknowledge their truest strength.\r\n\r\nWith this, their swords clashed as they spent half their lives trying to kill each other.\r\n\r\nHe had delivered Qin Yan to his trial on the Judiciary Platform to be hacked to death and watched as he cut out his love root.\r\n\r\nFu Changling died and was reborn into the year when he was seventeen.\r\n\r\nThis time, he met Qin Yan much earlier and was also informed of the truth that he hadn’t known in his past life.\r\n\r\nAnd so, with his body drenched in blood, he climbed his way before Qin Yan and told him in a hoarse voice:\r\n“Once, you’ve gone into the Golden Light Temple and suffered long nails driven through your bones; you fought ten thousand ghouls in the Ten Thousand Bone Cliffs; you waited for an entire night in a stormy rain at the Bridge of Reincarnation; you have lit the zen lanterns for ten years in the Unsullied Palace—all for my sake. Qin Yan, it was you who fell in love with me first.”\r\n\r\n“But I’ve forgotten.”\r\n\r\n“It doesn’t matter if you don’t remember, because I do.”\r\n\r\nShivering, Fu Changling took out the very same jade Qin Yan gave him back then. Stained with blood, he lifted his gaze at Qin Yan, and said word-by-word repeatedly—\r\n\r\n‘People are like jade; that needs to be carved to become a fine specimen. Only when they are chiselled and carved by knives and axes, weathered through the hundred pains of life and death, could they acknowledge their truest strength.’\r\n\r\n“Presently, Changling has truly turned into a carven jade,” Fu Changling swallowed as he spoke, “Would Shixiong be willing to start over?”\r\n\r\nThis is a path of redemption. Even if he has to walk through a field of thorns, he would give anything for that chance.\r\n\r\nCold and repressed sword cultivator shou (Qin Yan) x Suave and talkative Daoist cultivator gong (Fu Changling)>"
}