{
	"url": "https://www.novelupdates.com/series/qie-shi-tian-xia/",
	"title": "Qie Shi Tian Xia - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2015/11/whogetstheworld1.jpg",
	"noveltype": "(CN)",
	"genre": "Historical   Romance   Wuxia   ",
	"tags": "Adapted to Drama   Ancient Times   Beautiful Female Lead   Female Protagonist   Handsome Male Lead   Multiple Protagonists   Strong Love Interests   ",
	"rating": "(4.0 / 5.0, 63 votes)",
	"author": "Qing Ling Yue   倾泠月   ",
	"year": "\nN/A",
	"ranking": "#2000   #6233   #6054   #7143   #5033   ",
	"reviewcount": "5 Reviews sorted by",
	"description": "Legend has it that two experts left a half-finished chess game on the hilltop of eastern dynasty’s number one mountain called “King Mountain”. A few sentences are left on the board at a time when the eastern dynasty is experiencing turmoil, chaos and instability.\r\n\r\nA woman dressed in a simple white robe like the snowy moon, praised as having “unsurpassable grace,” also happens to be one who acts and speaks freely, wild like the wind, such a person is praised and respected by the rest of the martial arts world (wulin). How is she to be “Carefree as the Wind” in such a wrecked and chaotic time?\r\n\r\nA man who is completely opposite, dressed by the dark moon. He is graceful and honorable, kind and tolerant. This kind of person that the rest of the martial arts world (wulin) admires and submits to. In such a chaotic time where morals are loose, what kind of benignity can he accomplish?\r\n\r\nA prince, born into exaltedness. His martial arts (wugong) is matchless, he is proud and strong, ambitious, and said to have the “arrogance of a King”. In this ever chaotic world, how will he accomplish his dominancy?\r\n\r\nA noble princess who is beautiful and glamorous. With an ambitious and calculating heart, how she manoeuvres her way to reign supreme in the dangerous palace harem?\r\n\r\nA world well-known intelligent princess who is good at martial arts. How in the face of national crisis, she guards her country and people in this troubled times?\r\n\r\nA reclusive and mysterious prince who is well loved by his people. In such troubled times, will he live in seclusion or step out?\r\n\r\nHome and country, how to counterbalance?\r\nLove and hate, how to define clearly?\r\nGratitude and revenge, how to repay?\r\nBeauty and world, which is more important?\r\n\r\nIn this troubled times, there are many talented men. The chess game on the hilltop is between two people but to rule supreme in the world, only one person is needed!>"
}