{
	"url": "https://www.novelupdates.com/series/delta-in-the-darkness/",
	"title": "Delta In The Darkness - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/02/delta.jpg",
	"noveltype": "(JP)",
	"genre": "Comedy   Drama   Mystery   Psychological   ",
	"tags": "",
	"rating": "(4.7 / 5.0, 9 votes)",
	"author": "Hiroshi Mori   ",
	"year": "\n1999",
	"ranking": "#2000   #2000   #11864   #12115   #12001   ",
	"reviewcount": "1 Review sorted by",
	"description": "'The incident occurred on June 6th, between 8:00 and 9:00 in the afternoon.\r\n\r\nThe victim was strangled in her room. The room's sole door was locked from the inside. The door was on the mansion's second floor, in a position easily visible from the large banquet hall below. On the night in question, many people happened to be present in that hall. Despite this fact, not a single one of them witnessed anyone other than the victim enter or exit that door.\r\n\r\nOn the opposite side of the room was a large window, but it had also been locked from the inside. Horokusa Junpei, the detective, had been keeping watch over that window for the entire time the incident is thought to have taken place, and furthermore, his part-time assistant Takanashi Nerina had also been positioned such that he could see the window easily. They could both confidently assert that they'd seen nobody enter or exit through the window. Even so, behind the window in question, a figure other than the victim was witnessed by Takanashi Nerina. Therefore, there is practically no doubt that an unknown person was in the room, and that naturally, such a person is extremely likely to be the assailant.\r\n\r\nHowever, at a glance, this incident was unmistakably unrealistic. Despite having no entrance they should have been able to use, someone had entered the room and killed the victim, plus every possible way they could have left was locked from the inside.\r\n\r\nThat alone would be enough to classify this a bizarre murder case.\r\n\r\nBut in a further surprising development, the method of killing was precisely the same as the deaths of three other women in the past three years. Once per year, following a certain strict rule, they had continued to commit these crimes.'\r\n\r\n\r\n\r\nDo you like light-hearted mystery games like Dangan Ronpa and Phoenix Wright? Then you'll probably love the murder mysteries of Hiroshi Mori! Those games were probably inspired by Mori with their senses of comedy and casts of strange, quirky characters. Rather than just writing mysteries, Hiroshi Mori sets up his books as 'games' pitting the author against the reader, daring you to solve the mystery with the clues he gives you. If you imagine each individual novel as a super blown-up version of a single Dangan Ronpa chapter, it's really fun to 'play' them.>"
}