{
	"url": "https://www.novelupdates.com/series/sand-sculpture-demon-king-online-farming/",
	"title": "Sand Sculpture Demon King, Online Farming - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/03/Sand-Sculpture-Demon-King-Online-Farming.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Fantasy   Shounen Ai   Supernatural   ",
	"tags": "Antihero Protagonist   Aristocracy   Cooking   Cunning Protagonist   Demon Lord   Demons   Dishonest Protagonist   Enemies Become Allies   Enemies Become Lovers   European Ambience   Fallen Angels   Handsome Male Lead   Kingdom Building   Knights   Loyal Subordinates   Magic   Manipulative Characters   Modern Knowledge   Movies   Nobles   Protagonist Strong from the Start   Royalty   Schemes And Conspiracies   Slow Romance   Succubus   Transmigration   Transported to Another World   Wars   ",
	"rating": "(4.1 / 5.0, 84 votes)",
	"author": "Qíngshī Yǔ Hǎi   情诗与海   ",
	"year": "\n2019",
	"ranking": "#515   #632   #2298   #2592   #3497   ",
	"reviewcount": "17 Reviews sorted by",
	"description": "He transmigrated as the most miserable Demon King in history. Before Hill had the time to feel depressed, he heard the news that the Demon King’s Palace was surrounded by Paladins. Then he was forced to sign an unfair treaty, disempowering and humiliating the demons. Afterwards, Hill took on the responsibility of reviving the demon world.\n\nNo soldiers? It doesn’t matter, we invade them with our culture.\n\nNo weapons? It doesn’t matter, we corrupt them with delicacies.\n\nThe instigator, the Demon King Hill who was a transmigrator, smiled and counted his money in the luxurious Demon King’s palace, and his subordinates carefully asked: Your Majesty, Demon King, are we still attacking the human world?\n\nHill waved his hand and posted the latest news on the Demon Forum:\n\n“Breaking News! For the first time, the demon world is open to the human world for tourism! Movies, novels, animations, food, up-and-coming amusement parks… Do you want all of this? Go ahead, we’ve put it all out there, the Demon World welcomes you all!”\n\n——The world is in my hands.\n\nI painted the cover myself! Isn’t it super pretty?>"
}