{
	"url": "https://www.novelupdates.com/series/magical%e2%98%85explorer/",
	"title": "Magical★Explorer - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/11/rRzXiQV.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Comedy   Ecchi   Fantasy   Harem   Martial Arts   Romance   School Life   Shounen   ",
	"tags": "Adapted to Manga   Adopted Protagonist   Alternate World   Angels   Battle Academy   Beastkin   Carefree Protagonist   Cheats   Cousins   Demi-Humans   Demons   Dense Protagonist   Dungeons   Elves   Galge   Game Elements   Grinding   Hard-Working Protagonist   Harem-seeking Protagonist   Hidden Abilities   Magic   Magical Technology   Maids   Male Protagonist   Misunderstandings   Mob Protagonist   Modern Day   Monsters   Multiple POV   Perverted Protagonist   Playful Protagonist   Polygamy   Popular Love Interests   R-15   Siblings Not Related by Blood   Strong Love Interests   Sword And Magic   Transported into a Game World   Underestimated Protagonist   Unique Weapon User   Weak to Strong   ",
	"rating": "(4.0 / 5.0, 441 votes)",
	"author": "Irisu   入栖   ",
	"year": "\n2018",
	"ranking": "#2000   #2000   #371   #651   #436   ",
	"reviewcount": "59 Reviews sorted by",
	"description": "There’s a legendary Bishoujo Game that has become popular among Japanese gentlemen.\n\nIts name is “ Magical★Explorer” or Magiero for short.\n\nThe game’s protagonist has a cheat-like power with12 different beautiful heroines to flirt with, including additional 12 heroines from the DLC, a harem of 24 beauties. I have become that protagonist!………………Not. Instead, I have become the third-wheel character who always laughing like an idiot next to him.\n\nOf course I was in despair at first.\n\nOf course. If I am the protagonist I could have all 24 heroines for myself along with unparalleled cheat power. However, since I am the third-wheel there’s no heroine that would lay their eyes on me.\n\nBut now I couldn’t care less about the protagonist and his heroines. Why? Because I discovered magic. While I was using it, I have become interested in it. I want to master it. I want to become the strongest. Thus I have decided.\n\nI would abandon half my role as a protagonist’s friend to train my magic and then I would beat the hell out of that cheat who can solo the Demon King.\n\n………..I was training with that thought in mind, but somehow I keep getting closer to the heroines and furthermore, I don’t know why I keep encounter events like I am some Eroge’s protagonist.>"
}