{
	"url": "https://www.novelupdates.com/series/your-highness-please-love-me-tender/",
	"title": "Your Highness, Please Love Me Tender - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/05/王爷在上.jpg",
	"noveltype": "(CN)",
	"genre": "Historical   Romance   Yaoi   ",
	"tags": "Ancient Times   Cautious Protagonist   Clever Protagonist   Confident Protagonist   Couple Growth   Enemies Become Lovers   Fast Learner   Fearless Protagonist   Forced into a Relationship   Handsome Male Lead   Hard-Working Protagonist   Hiding True Identity   Leadership   Long-distance Relationship   Long Separations   Love Interest Falls in Love First   Lovers Reunited   Loyal Subordinates   Military   Multiple Identities   Past Plays a Big Role   Poisons   Power Couple   Power Struggle   Royalty   Schemes And Conspiracies   Secret Identity   Smart Couple   Stoic Characters   Strong Love Interests   Unconditional Love   Underestimated Protagonist   Wars   ",
	"rating": "(3.8 / 5.0, 37 votes)",
	"author": "Ten Miles of Prosperous Waters   十里晟淼   ",
	"year": "\nN/A",
	"ranking": "#2000   #2000   #8190   #5569   #6525   ",
	"reviewcount": "4 Reviews sorted by",
	"description": "“Your mission is to gain Prince Rui’s trust.”\n\n“How?”\n\n“Prince Rui is gay, now you know what to do?”\n\n“…I get it.”\n\nHe is the guard of Prince Qin who saved him and cultivated him from young to be his sharpest sword. He is first taught martial arts, then musical instruments, painting, chess, etc. to make him the best assassin.\n\nHowever, after being assigned the mission to gain Prince Rui’s trust, he gradually falls for him, the one he is supposed to kill. Adding to that entanglement is the mystery about his own origin and the truth about the famine in his childhood. So now the one who he has cherished for all these years turns out to be the very person who caused the famine?\n\nLife plays a joke on him.\n\nHowever, whatever identity Su Jie holds, he will take to heart this only person who is willing to shield swords for him and forsakes his own identity just to be with him.\n\n“Your Highness, please love me tender.”\n\n“My dear, I’m captivated, body and soul.”>"
}