{
	"url": "https://www.novelupdates.com/series/the-tang-dynastys-female-forensic-doctor/",
	"title": "The Tang Dynasty’s Female Forensic Doctor - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2015/08/FemaleForensicDoctor.jpg",
	"noveltype": "(CN)",
	"genre": "Adult   Drama   Fantasy   Historical   Mystery   Romance   ",
	"tags": "Adapted to Drama   Ancient China   Beautiful Female Lead   Childcare   Clever Protagonist   Cold Protagonist   Doctors   Female Protagonist   First-time Interc**rse   Handsome Male Lead   Investigations   Kidnappings   Love Triangles   Medical Knowledge   Mystery Solving   Politics   Pregnancy   Previous Life Talent   Schemes And Conspiracies   Transmigration   ",
	"rating": "(4.5 / 5.0, 164 votes)",
	"author": "Tụ Đường   Xiu Tang   袖唐   ",
	"year": "\n2013",
	"ranking": "#3923   #6378   #1839   #4881   #1360   ",
	"reviewcount": "24 Reviews sorted by",
	"description": "The chief female forensic investigator, Ran Yan was secretly killed by her assistant. Unexpectedly, she was reborn in the years of the Tang dynasty. After experiencing a narrow escape, she fled from Jiangnan to Chang’an. Although, Chang’an was at the beginning of its flourishing period under the Li family’s Tang dynasty, various princes were vying for the throne by using all kinds of strategies. This was the dark days of the imperial court, where one needed to walk on a tightrope as one’s life was as powerless as an ant. The Xiao family controlled a large amount of wealth so inevitably they also became involved in the conflicts.\r\n\r\nAfter arriving in Chang’an, she discovered many suspicious incidents: the original owner had unexplainable amnesia but his family was indifferent. She once again saw the orchid shaped clay inkstone, a valuable object that her mother has given her in modern times. Hence, could it be that she can time travel back? In order to survive in the Tang dynasty, she displayed her strong spirit and willpower by learning medicine from a doctor, pretended that she benefited from being sick on how to cure diseases, suffered hardship in earning money, manufactured penicillin, cured syphilis, and used her autopsy skill and experience to solve each and every murder mysteries.>"
}