{
	"url": "https://www.novelupdates.com/series/mmorpg-rebirth-of-the-legendary-guardian/",
	"title": "MMORPG: Rebirth of the Legendary Guardian - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2017/04/MMORPG-Rebirth-of-the-Legendary-Guardian.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Comedy   Ecchi   Fantasy   Harem   Mature   Sci-fi   ",
	"tags": "Arrogant Characters   Average-looking Protagonist   BDSM   Beautiful Female Lead   Determined Protagonist   Dragons   Dungeons   Famous Protagonist   F*llatio   Forced into a Relationship   Game Ranking System   Grinding   Guilds   Hard-Working Protagonist   Hiding True Identity   Late Romance   Level System   Male Protagonist   Masochistic Characters   MMORPG   Modern Day   Monsters   Necromancer   Older Love Interests   Past Plays a Big Role   Perverted Protagonist   Pets   Polygamy   Poor to Rich   Popular Love Interests   Pregnancy   Priests   Racism   Revenge   Reverse R*pe   Romantic Subplot   R*pe   Second Chance   Shameless Protagonist   Skill Books   Strong Love Interests   Teamwork   Threesome   Time Skip   Tsundere   Vampires   Virtual Reality   Wars   Weak to Strong   Wealthy Characters   ",
	"rating": "(3.0 / 5.0, 660 votes)",
	"author": "Flying Alone   孤单地飞   ",
	"year": "\n2011",
	"ranking": "#2000   #4669   #71   #26   #569   ",
	"reviewcount": "95 Reviews sorted by",
	"description": "A phoenix is a creature of legends, a wonder of the world, an imagery of life and destruction. This fabled creature signifies the rise of a hero in a virtual world where battles occur for the sake of honor and glory!\n\nZhang Yang was a professional gamer in the first and most fantastic game that revolutionized the world: God’s Miracle. A game where traditional knowledge in RPGs did not matter anymore, players would have to manually target and evade attacks, giving rise to a significant gap in skill between a professional and an amateur gamer.\n\nZhang Yang’s downfall came a little too soon. His girlfriend was snatched, his guild was harassed and disbanded, and he was even driven to commit suicide! Jumping off the top floor of a hotel, Zhang Yang seemed as though he was soaring like a phoenix. Little did he know that the end of his life also signified his rise from the ashes.>"
}