{
	"url": "https://www.novelupdates.com/series/the-weakest-invincible-end-force-rising-up-from-despair/",
	"title": "The Weakest Invincible End Force -Rising Up From Despair- - Novel Updates",
	"image": "https://www.novelupdates.com/img/noimagefound.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Drama   Fantasy   ",
	"tags": "Betrayal   Cheats   Depictions of Cruelty   Transported to Another World   ",
	"rating": "(3.9 / 5.0, 13 votes)",
	"author": "@word_edit   ",
	"year": "\n2019",
	"ranking": "#2000   #2000   #9297   #10271   #10325   ",
	"reviewcount": "1 Review sorted by",
	"description": "“The three of us will always be together!” is the catchphrase of both “Natsume Kaede,” the popular and cute childhood friend, and “Kazama Seiki,” the genius with outstanding reflexes.\n\nIn between them is the kind-hearted “Sasamori Suguru”. He had doubts about whether he should be with the two flawless people, but the two always helped Suguru out without minding such things.\n\nSuguru had no redeeming features in looks, brains, or athleticism, but Suguru’s kind nature was something everyone recognized.\n\nHowever, something suddenly happened one day. When he awakened from his sleep, a landscape he never saw before was in front of his eyes. Astonishingly, it didn’t happen to just Suguru, but the whole school.\n\nHis class had gathered together. Natsume and Kazama were in the same situation as Suguru when they woke up.\n\nThereupon, the mysterious figure, “Lukiross” appeared. According to him, this world’s name is “World End,” and that people live while using abilities called “End”.\n\nHe also explained that Suguru and the others were summoned in order to fight the opposing “Gariud”. Despite the chaos, Kazama acted as a leader and declared that everyone would cooperate and fight while Kaede and Suguru agreed with him.\n\nHowever, while all the classmates were showing off their powerful End abilities, Suguru got the worthless skill “Force”, which had unclear effects. His classmates ridiculed him. Kaede and Kazama stood in front of Suguru, as if to protect him.\n\nAt that time, Suguru believed that those two would help him out, no matter what would they were in. However, as the battle against the Gariud intensified, the two gradually began to give up on him as well when it became more apparent that he wasn’t suited for battle at all.\n\nThen, a tragedy erupted. While coldly saying “Sorry Suguru…we won’t protect you anymore,” and “How unfortunate, this wouldn’t have happened if you were at least a little bit useful,” his classmates all denounced him at once.\n\nFurthermore, Kaede, the one Suguru liked, was taken away by Seiki in front of his eyes. Suguru lost everthing. However, after realizing the true power of “Force”, he would rise in power from his position as the weakest. All to prove himself…and to survive.>"
}