{
	"url": "https://www.novelupdates.com/series/abused-female-lead-and-beautiful-villainess-quick-transmigration/",
	"title": "Abused Female Lead And Beautiful Villainess (Quick Transmigration) - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/07/20200615180618.jpg",
	"noveltype": "(CN)",
	"genre": "Adventure   Comedy   Fantasy   Romance   Supernatural   Yuri   ",
	"tags": "Ancient China   Beautiful Female Lead   Clever Protagonist   Cultivation   Devoted Love Interests   Doting Love Interests   Episodic   Fantasy Creatures   Heartwarming   Heavenly Tribulation   Hiding True Identity   Interdimensional Travel   Love at First Sight   Marriage   Modern Day   Multiple Realms   Persistent Love Interests   Power Couple   Protagonist Falls in Love First   Protagonist Strong from the Start   Reincarnation   Shameless Protagonist   Strong Love Interests   System Administrator   Transmigration   Unconditional Love   Villainess Noble Girls   Wealthy Characters   World Hopping   World Travel   ",
	"rating": "(4.3 / 5.0, 71 votes)",
	"author": "千觅荷   ",
	"year": "\n2017",
	"ranking": "#3633   #2696   #3788   #5884   #4099   ",
	"reviewcount": "9 Reviews sorted by",
	"description": "Head of Time and Space Department: Shen Wan, your task is to influence every abnormal and extreme man in the novel world, rewrite and change the original story filled with abuse into a sweet love story, and calm the readers’ grievances.\nShen Wan: No problem.\n\nTransmigrating next to a perverted President, Shen Wan: He wants to dig my kidney for the white moonlight of his heart. Sorry, this can’t be sweetened.\nLeader: If you can’t change then you can’t earn money and you can’t come back.\nBeautiful girl: This kind of person should be put in prison.\nShen Wan was later taken home by a beautiful woman, the reader said, so sweet.\n\nTransmigrating into Ancient China, Shen Wan: He wants to use my blood to detoxify the cinnabar mole of his heart, it really cannot be sweet.\nLeader: You do it.\nBeautiful Princess: When I became the Emperor, I will put the elder brother in the fief.\nShen Wan later became the Queen and the readers commented, it was really sweet.\n\nTransmigrating into Xianxia, Shen Wan: He wants to take away my spirit root and stab my heart. It can’t be sweet.\nLeader: Please ask the little sister next door.\nBeautiful Sister Nun: I cut his dog-head with the sword\nLater the witch turned into a fairy. The reader shouted, sweet ah>"
}