{
	"url": "https://www.novelupdates.com/series/first-campus-h/",
	"title": "First (Campus H) - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/05/First-Campus-H.jpg",
	"noveltype": "(CN)",
	"genre": "Romance   School Life   Slice of Life   Smut   ",
	"tags": "Beautiful Female Lead   Collection of Short Stories   College/University   Early Romance   First Love   First-time Interc**rse   Handsome Male Lead   Modern Day   Multiple POV   Multiple Protagonists   Possessive Characters   ",
	"rating": "(3.3 / 5.0, 24 votes)",
	"author": "微微一笑很拉风   ",
	"year": "\n2019",
	"ranking": "#2094   #1757   #7599   #3253   #8695   ",
	"reviewcount": "1 Review sorted by",
	"description": "Xu Qing started out as a dud in junior high school, but finally got into a key high school by relying on the tutoring of her multiple school boyfriends.\n\nWhen she got to high school, she decided to do what she had done to succeed in junior high.\n\nIf she conquered all the top three students in her school year, then she would be number one in the school year.\n\nBut she hadn’t even touched the hands of the second and third in the school year, and yet the first in the school year has left her lying on her back.\n\nThe Second Story: Promise\n\nAfter a narrow encounter on the rooftop of the school, Xu Nuo, a high-cold girl, and Pei Yan, a ruffian school grass, start a black-and-white routine.\n\nThe Third Story: Rather\n\nA soft-hearted girl, Xu Wan, and a cold-hearted senior, Qiao Ning, ran into each other three times in one day by chance, and from then on her life will never be peaceful again.\n\nThe Fourth Story: Charming\n\nThe bride-to-be leaves with someone else, and the groom-to-be points to the little bridesmaid who is eating the cake: I’ll take her.\n\nThe bridesmaid: 〒﹏〒\n\nFifth Story: The Gold Master\n\nThe impoverished girl was raised by her gold master classmate, and she had been submissive for many years. But overnight, the wind and water turned, and the gold master had been expelled from the house. The girl was about to sing happily, but she was rubbed on the bed by the former golden master, who said, “Even if there is no money left, your father is still your father!>"
}