{
	"url": "https://www.novelupdates.com/series/sign-in-becoming-a-great-spell-deity-starting-from-the-magic-academy/",
	"title": "Sign In: Becoming A Great Spell Deity Starting From The Magic Academy - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/03/Sign-In-Becoming-A-Great-Spell-Deity-Starting-From-The-Magic-Academy.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adult   Fantasy   Harem   Mature   ",
	"tags": "Calm Protagonist   Cheats   Dwarfs   Elves   Empires   Fast Cultivation   Hidden Abilities   Low-key Protagonist   Magic   Male Protagonist   Naive Protagonist   Overpowered Protagonist   Secret Identity   S*xual Cultivation Technique   System Administrator   Weak to Strong   ",
	"rating": "(2.4 / 5.0, 36 votes)",
	"author": "Dr.Boom   ",
	"year": "\nN/A",
	"ranking": "#2000   #2000   #6832   #13810   #11121   ",
	"reviewcount": "10 Reviews sorted by",
	"description": "'Crossing over to a fantasy world of magic and battle auras, Lei Luo accidentally crossed over to the Xiluo Magic Academy and became a librarian. \r\n\r\n \r\n\r\nAt the same time, he obtained a Sign-in System. He would receive various rewards if he signed in at different locations. \r\n\r\n \r\n\r\nSigned in at the library and obtained [Top-grade Meditation Technique] from the treasure chest! Signed in on the Magic Guide Book and obtained [Magic Increase] from the treasure chest! Signed in on the Magic Stone Tablet and obtained [Forbidden Magic] from the treasure chest! \r\n\r\n \r\n\r\n... Lei Luo unintentionally activated something that would completely turn his life around \r\n\r\n \r\n\r\nHe started signing in from the Magic Academy and slowly advanced from a Magic Apprentice to become the most powerful person in the Magic Academy. He led the Magic Knights that shocked the world to eliminate noble factions and fight against the invasion of the demon tribe. Changing the world began with him. \r\n\r\n \r\n\r\nFrom a desolate small town to the lord of the world, he reignited the glory of an empire that had been down and out for a century.' \r\n\r\n>"
}