{
	"url": "https://www.novelupdates.com/series/the-devils-evolution-catalog/",
	"title": "The Devil’s Evolution Catalog - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2017/08/devilevo.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Fantasy   Harem   Supernatural   Tragedy   Xuanhuan   ",
	"tags": "Androgynous Characters   Army   Army Building   Betrayal   Caring Protagonist   Demi-Humans   Demon Lord   Demons   Depictions of Cruelty   Determined Protagonist   Dragons   Dwarfs   Elemental Magic   Elves   Evolution   Fallen Angels   Fantasy World   Genderless Protagonist   Gore   Humanoid Protagonist   Loli   Loyal Subordinates   Male Protagonist   Monsters   Multiple POV   Personality Changes   Perverted Protagonist   Race Change   Reincarnated as a Monster   Reincarnated in Another World   Romantic Subplot   R*pe   Seven Deadly Sins   Succubus   Sword And Magic   Weak Protagonist   ",
	"rating": "(3.5 / 5.0, 369 votes)",
	"author": "The Sole Survivor   Wéiyī Shēnghuán Zhě   唯一生还者   ",
	"year": "\n2016",
	"ranking": "#3017   #4744   #576   #6793   #1039   ",
	"reviewcount": "47 Reviews sorted by",
	"description": "Mo Ke, a good-for-nothing loli-loving shut-in virgin, found himself in the unlikely role of a hero one day when he decided to take an uncharacteristic stroll outside of his lair on Valentine’s Day.  Under the glaring headlights of an oncoming truck, he dove into the middle of the road to save the love of his life, a random loli, and his nemesis, a random pretty boy, in the process heroically sacrificing himself for the two brats.\n\nHe passed away into the darkness only to find himself reincarnated into a different world with the knowledge that he did something productive for once. A world of swords, magic, devils, elves, a host of other fantastical races, and of course, humans.\n\nJoin Mo Ke as he embarks on a journey born of jealousy, desperation, determination, and s*upidity, to evolve, find his lost pee-pee, finally return home and destroy the world with an army of devils???>"
}