{
	"url": "https://www.novelupdates.com/series/the-transmigrators-cultivation/",
	"title": "The Transmigrator’s Cultivation - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/07/TransmigratorCultivation3.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adult   Adventure   Martial Arts   Romance   Xianxia   Yaoi   ",
	"tags": "Beast Companions   Calm Protagonist   Caring Protagonist   Cold Love Interests   Couple Growth   Cultivation   Dao Companion   Dao Comprehension   Destiny   Heavenly Tribulation   Herbalist   Immortals   Marriage   Mature Protagonist   Pets   Protagonist Falls in Love First   Reincarnated in Another World   Resurrection   Saving the World   S*xual Cultivation Technique   Slow Romance   Strength-based Social Hierarchy   Strong Love Interests   Sword Wielder   Weak to Strong   ",
	"rating": "(4.4 / 5.0, 32 votes)",
	"author": "Fallen Clothing Becomes Fire   Yiluo Chenghuo   衣落成火   ",
	"year": "\n2012",
	"ranking": "#2566   #2000   #6601   #7585   #5558   ",
	"reviewcount": "8 Reviews sorted by",
	"description": "Within the Immortal Realm, there were nine thousand major realms, with three thousand at the top, three thousand in the middle, and three thousand at the bottom, along with countless minor realms.\r\n\r\nIn Xu Ziqing's previous life, he was sickly. In this life, he originally thought about passing his days freely amongst the scenery in between the mountains and rivers, but unexpectedly, the year he turned thirteen years old, in just a single morning, his life became a fantasy.\r\n\r\nIf your body had Spiritual Roots, then you had to set foot on the path to immortality. If you were unwilling to do so, you would become a rock under someone else's foot. Thus, he could only push forward against the currents trying to push him backward, repeatedly overcoming the obstacles in his way.\r\n\r\nUnder the Tianzun, all were insects. Xu Ziqing's life was like dust, but he wanted to hold fast to his sense of self, following his heart to pursue his Path, turning his body into one like a kunpeng's, quickly advancing, and traveling everywhere underneath the nine skies!>"
}