{
	"url": "https://www.novelupdates.com/series/the-world-of-the-pirate-consort/",
	"title": "The World of the Pirate Consort - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2017/02/20200000013920144734996928282_s.jpg",
	"noveltype": "(CN)",
	"genre": "Historical   Josei   Mature   Romance   ",
	"tags": "Abusive Characters   Alternate World   Ancient China   Arranged Marriage   Calm Protagonist   Cross-dressing   Cruel Characters   Female Protagonist   Handsome Male Lead   Misunderstandings   Pirates   Strong Love Interests   ",
	"rating": "(3.8 / 5.0, 50 votes)",
	"author": "Yue Chu Yun   月出云   ",
	"year": "\n2010",
	"ranking": "#6970   #2000   #5941   #4974   #5574   ",
	"reviewcount": "4 Reviews sorted by",
	"description": "She is a daughter of a marquis. People only know her as the timid and cowardly young maiden, unaware that her other identity is the imperial capital’s famous, who awes the world, “slender gentleman“ is her.\n\nShe was promised a marriage 10 years ago and painstakingly waited 4 years for her groom. The morning her supposed partner returned to imperial court, he’s holding another woman.\n\nIn a single evening, from primary spouse she was demoted to secondary spouse.\n\nFor love, she supports and assists him. Together they share trials and tribulations, flying side by side. Who would expect all he did was for another woman?\n\nHe was born in the top chain of power, yet he grew up inside the darkness, enduring among conspiracies. Maturing from a weak youngster to a war-god.\n\nFor the woman he has once loved, he met her on the battlefield [1]. Every move fierce. He helplessly watched her ripping apart her sleeve, falling into bottomless cliff with a smile….he was hurt to the core. After this imperial ancestral temple and jiang hu, sky and sea, are we never to meet?\n\nComing out of prince’s manor, visiting vast sea, walking on the grassland and dealing with maritime power struggle.\n\nThe world is in chaos, love came in troubled times. Palace. Jiang Hu. Power. Mutiny. Naval battle. Four years of silent endurance. She, commanding thousands of pirates, returned, swirling the imperial court and jiang hu.\n\nOnly, you have once said you have been waiting for a person — a person who you admire, who you adore, a woman who could stand side by side with you.\n\nNow, have you regretted?\n\n[1]兵戎相见 – bing rong xian jian referring to using force or war to solve problems>"
}