{
	"url": "https://www.novelupdates.com/series/a-terminally-ill-villainess-refuses-to-be-adopted/",
	"title": "A Terminally Ill Villainess Refuses To Be Adopted - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/02/A-Terminally-Ill-Villainess-Refuses-To-Be-Adopted.jpg",
	"noveltype": "(KR)",
	"genre": "Fantasy   Romance   ",
	"tags": "Beautiful Female Lead   Child Protagonist   Childcare   Childhood Love   European Ambience   Female Protagonist   Handsome Male Lead   Love Interest Falls in Love First   Male Yandere   Sickly Characters   Transmigration   Villainess Noble Girls   Weak Protagonist   ",
	"rating": "(3.8 / 5.0, 55 votes)",
	"author": "Seogwijo   서귀조   ",
	"year": "\n2020",
	"ranking": "#1683   #1798   #4907   #579   #3911   ",
	"reviewcount": "2 Reviews sorted by",
	"description": "When the villain was young, she became Extra #1 who deceived him and sold him as a slave.\r\nThis girl, who was suffering from an incurable disease, tried to buy painkillers by selling him, but later dies miserably by the villain’s hand.\r\n\r\nFortunately, he had not been sold yet, so let’s kick the slave traders first.\r\n\r\nEven as a 12-year-old orphan, I took great care of a 12-year-old villain.\r\nEven though he was young, he was wary of me until the time of parting came, perhaps because he was the villain.\r\nFortunately, I was able to get a promise not to be killed.\r\n\r\nAnd the day the villain family came to take him back finally came.\r\n\r\n“……Are you telling me to go away?”\r\n“If there is a place to return to, you have to go. Stay healthy and don't die easily. Understand?'\r\n\r\nAfter somehow sending away the villain who kept staring at me persistently, I turned around and vomited blood.\r\n\r\n\r\nThis annoying incurable disease.\r\nWell, it’s okay because I know how to fix it.\r\n\r\nI would be able to start a new life if I could heal my illness and leave here.\r\nBut.\r\n\r\n'You……”\r\n\r\n……There was something strange about the villain's prickly face that was looking at me.\r\n>"
}