{
	"url": "https://www.novelupdates.com/series/strategy-to-capture-that-scum-gong/",
	"title": "Strategy to Capture that Scum Gong - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2018/12/Strategy-to-Attack-That-Scum-Gong.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Comedy   Drama   Mature   Romance   Tragedy   Yaoi   ",
	"tags": "Abusive Characters   Acting   Ancient China   Artificial Intelligence   Betrayal   Blackmail   Calm Protagonist   Charismatic Protagonist   Clever Protagonist   Cold Protagonist   Cunning Protagonist   Death of Loved Ones   Depictions of Cruelty   Devoted Love Interests   Elves   Episodic   Evil Gods   Famous Parents   Futuristic Setting   Gore   Handsome Male Lead   Immortals   Interdimensional Travel   Love Interest Falls in Love First   Lovers Reunited   Male Yandere   Manipulative Characters   Masochistic Characters   Misunderstandings   Modern Day   Multiple Realms   Obsessive Love   Organized Crime   Playful Protagonist   Possessive Characters   Prostit**es   Revenge   R*pe   Sadistic Characters   S*xual Abuse   Shameless Protagonist   Siblings Not Related by Blood   Stockholm Syndrome   Strong Love Interests   Student-Teacher Relationship   Suicides   System Administrator   Teachers   Torture   Tragic Past   Unrequited Love   World Hopping   Yandere   ",
	"rating": "(4.2 / 5.0, 469 votes)",
	"author": "Tức Mặc Dao   即墨遥   ",
	"year": "\n2017",
	"ranking": "#582   #724   #585   #728   #494   ",
	"reviewcount": "160 Reviews sorted by",
	"description": "As a true over-bearing president scum gong, when Xie He for the nth time rejected his admirer, he heard a sentence in his head: “Congratulations on achieving the “rejects 100 hosts” accomplishment; as an award you will soon bind to the “Scum Gong and Cheap Shou” system, entering other worlds to complete capture missions.\n\nAs a scum gong, Xie He expresses that it is very easy to hide one’s true colors, but…\n\n“I Heard My Boyfriend’s Brother Secretly Loves Me,”\n\n“Teacher Love Me One More Time,”\n\n“Raising Youth Manual,”\n\n“Your Majesty, This Servant Obeys,”\n\n“The Tyrant Lord’s Substitute Lover,”\n\n“Captive of the Empire,”\n\n“Disciple’s Cultivation Furnace”…\n\nXie He: Wait a minute. These words sound really strange… and why is my role the ‘cheap shou’?\n\nSystem: Fighting poison with poison. Using scum to overcome scum. I’ll be relying on you to abuse the scum gong! Remember to not OOC~\n\nXie He: Hehe.\n\nLater…\n\nXie He: Hm? You say all the scum gong love me? Sorry, I only love myself.>"
}