{
	"url": "https://www.novelupdates.com/series/banished-to-another-world/",
	"title": "Banished to Another World - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2018/02/Banished-to-Another-World.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Fantasy   Mature   Romance   Supernatural   Yaoi   ",
	"tags": "Aggressive Characters   Alternate World   Ancient Times   Antihero Protagonist   Arrogant Characters   Beasts   Black Belly   Calm Protagonist   Cannibalism   Clan Building   Comedic Undertone   Conditional Power   Confident Protagonist   Couple Growth   Cruel Characters   Cunning Protagonist   Cute Children   Devoted Love Interests   Doctors   Enemies Become Lovers   Fantasy Creatures   Fantasy World   Farming   Hard-Working Protagonist   Hiding True Abilities   Kingdom Building   Love Interest Falls in Love First   Manly Gay Couple   Master-Servant Relationship   Medical Knowledge   Modern Knowledge   Mpreg   Power Couple   Previous Life Talent   Proactive Protagonist   R*pe Victim Becomes Lover   Reversible Couple   R*pe   S*ave Protagonist   S*aves   Slow Romance   Smart Couple   Special Abilities   Strength-based Social Hierarchy   Strong Love Interests   System Administrator   Time Skip   Transmigration   Transported to Another World   Tribal Society   Weak to Strong   ",
	"rating": "(4.1 / 5.0, 409 votes)",
	"author": "Yi Ren Bei   易人北   ",
	"year": "\n2014",
	"ranking": "#2731   #3376   #628   #4924   #561   ",
	"reviewcount": "96 Reviews sorted by",
	"description": "A miracle doctor was exiled to an alternate savage world and forced to change his scummy ways!\n\nYan Mo's soul was transferred to another world after he had thoroughly offended God. He quickly understood how cruel the world he was in was. \n\nThe reason he was hit unconscious by a primitive man and brought back to his home was to be that man’s winter food reserves. The tribe he was in was a super spartan primitive tribe, and the people here only respected two things: Combat power and fighting ability! The former was the fighting power in battles, the latter was…\n\n……\n\nExamine illness? Chinese medicine? Drink those bitter sandy things? The hell is that? Are you trying to murder our tribe’s warrior? Die!\n\nPlant wheat? Raise pigs and chickens? We are warriors, not s*aves! Die!\n\nTeaching the women to make clothes and cook? Make them soap and perfume? F*ck, he’s actually seducing our women! Die!\n\nYou’re a messenger of God? Here to lead us to a better life? Very well. We’ll give you one day, conquer all of our enemies, make them into sl*ves and bring them back. If you can’t, you’re dead!\n\nYan Mo: “……”>"
}