{
	"url": "https://www.novelupdates.com/series/things-to-do-during-the-day/",
	"title": "Things to Do During the Day - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/01/Things-to-Do-During-the-Day.jpg",
	"noveltype": "(KR)",
	"genre": "Adult   Fantasy   Mature   Romance   Smut   ",
	"tags": "Aristocracy   Confident Protagonist   Corruption   Cute Story   Demons   European Ambience   Female Protagonist   Heaven   Knights   Multiple Reincarnated Individuals   Nobles   Priests   Royalty   Short Story   ",
	"rating": "(4.1 / 5.0, 47 votes)",
	"author": "백설홍   ",
	"year": "\n2020",
	"ranking": "#4265   #3287   #6429   #5243   #5508   ",
	"reviewcount": "5 Reviews sorted by",
	"description": "‘Ariel is being strange.’\r\n\r\nThree months after Ariel and Arsion’s wedding, Arsion felt confused about the sudden change in Ariel’s behavior.\r\n\r\nShe would suddenly appear with a whip at night, and would speak lewd words that she had never put in her mouth before…\r\n\r\nOf course, Arsion loved Ariel even more because even though she was being odd, everything she did was all adorable.\r\n\r\nMeanwhile, when Arsion left for a territorial inspection, a suspicious man came to the capital to meet Ariel…….\r\n\r\n* * *\r\n\r\n“……Riel?”\r\n\r\nSion muttered at Ariel’s blurry appearance. No way. Ariel can’t be here.\r\n\r\n‘I miss you so much that I seem to be fantasizing you here with me.‘\r\n\r\nIt’s serious. Arsion didn’t know if he would see this fantasy for two weeks.\r\n\r\nThough Arsion thought so, he reached out to Ariel. Soft cheeks cupped in his full hands. Her eyes were slanted when he touched them. Small red and cute lips. How can one even have such a beautiful fantasy.\r\n\r\nArsion felt his throat burning. Now he was hungry for Ariel. He wanted to soothe this thirst by licking her all over with full suggestions. Arsion, therefore, pulled away Ariel’s clothes away without hesitation.\r\n\r\n“Sion!”\r\n\r\nAriel’s surprised voice was so vivid. It was like the real Ariel.\r\n\r\nSo Arsion moved his hands more busily. A skillful hand quickly untied her clothes and he smiled as soon as Ariel’s white chest was revealed under the bright sunlight.\r\n\r\nIt’s good to have this fantasy.\r\n\r\n‘I’ve always wanted to do this with you.’\r\n\r\nArsion wanted to do what they do at night during the day.>"
}