{
	"url": "https://www.novelupdates.com/series/to-rule-in-a-turbulent-world/",
	"title": "To Rule in a Turbulent World - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/03/s27284887.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Drama   Historical   Mature   Romance   Slice of Life   Smut   Yaoi   ",
	"tags": "Adapted to Manhua   Ancient China   Bisexual Protagonist   Brotherhood   Business Management   Character Growth   Charismatic Protagonist   Clever Protagonist   Couple Growth   Court Official   Devoted Love Interests   Different Social Status   Early Romance   Economics   Empires   Farming   First-time Interc**rse   Generals   Master-Servant Relationship   Merchants   Older Love Interests   Politics   Power Couple   Proactive Protagonist   Shameless Protagonist   S*aves   Strong Love Interests   Torture   Unconditional Love   Wars   ",
	"rating": "(4.7 / 5.0, 193 votes)",
	"author": "Fei Tian Ye Xiang   非天夜翔   顧雪柔   ",
	"year": "\n2014",
	"ranking": "#3567   #2000   #3106   #9146   #1265   ",
	"reviewcount": "32 Reviews sorted by",
	"description": "“At the end of the song the man is drunk, so much like the tears by Poyang River. Ten thousand miles of easterly winds; the country is broken, the mountains and rivers reflect only red.”\n\n~A line from Shorthand Tablature of Magnolia Blossoms by Zhu Dunru\n\n—\n\nAt sixteen years of age, You Miao lived a life of luxury. Yet with rapid changes in family circumstances, the once little young master now only has his deceased mother’s barren estate and a loyal Quanrong sIave left. The dilemma and distress of starting everything from scratch becomes the greatest trial of his life.\n\nAs the imperial state exam approaches, You Miao enters the imperial capital for his tests. However, all of a sudden the tribes of the north invade, causing an exodus to the south. The Hans flee southward in great numbers with the uprising of war everywhere. The country is at the cusp of ruin and homes are lost…\n\nAlong with his band of sworn brothers, You Miao finally returns to Jiangnan in the midst of displacement, and using all of his strength, he supports this broken, half sliced nation.\n\nThe good days don’t last long, and the imperial court now in the south faces both internal and external enemies. The court is in turmoil, the government officials in dissension, but as tides rise and fall, the most beautiful moonlight of the great desert is yet to come.>"
}