{
	"url": "https://www.novelupdates.com/series/the-little-sweet-cutie-always-think-that-he-is-a-stand-in/",
	"title": "The Little Sweet Cutie Always Think That He Is a Stand-in - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/04/The-Little-Sweet-Cutie-always-think-that-he-is-a-standin.jpeg",
	"noveltype": "(CN)",
	"genre": "Romance   Slice of Life   Yaoi   ",
	"tags": "Character Growth   Child Abuse   Clingy Lover   Comedic Undertone   Cute Protagonist   Cute Story   Doting Love Interests   Familial Love   Heartwarming   Misunderstandings   Modern Day   Mpreg   Mysterious Family Background   Older Love Interests   Past Trauma   Protagonist Falls in Love First   Tragic Past   Wealthy Characters   ",
	"rating": "(3.6 / 5.0, 38 votes)",
	"author": "椋裎   ",
	"year": "\nN/A",
	"ranking": "#1263   #1366   #5051   #1425   #4925   ",
	"reviewcount": "6 Reviews sorted by",
	"description": "Lin Ran is a little fool who has been raised abroad. He was brought back to his country by his elder brother because of the sudden death of their parents and then temporarily handed over to be in care of Song Zhixu. Lin Ran is very obedient, he can wash the dishes, do the laundry and mop the floor every day as well as very carefully try to please and curry favor with Song Zhixu, afraid that even Song Zhixu also doesn’t want him anymore, then like that, he would really have nowhere to go.\r\n\r\n*Song Zhixu recently brought home a little fool. The little fool blinked his innocent eyes and wore his white shirt, showing off his two slender white legs all day long, dangling in front of him all day long, tickling his heart. But again, this was a little fool that his friend had entrusted to him and to be under his care, so he always kept ahold of his feelings.\r\n\r\nIt was only on a misty night, with the influence of alcohol that he finally couldn’t hold back and ‘bullied’ him. The little fool was pregnant and still had to do chores for him with his big belly. Shedding tears if he didn’t allow him to do so, therefore Song Zhixu could only go along with him.\r\n\r\nWhen Lin Ran was cleaning, he found a metal box under the bed, full of his big brother’s things and the pictures of his big brother and Song Zhixu. Although he was stupid, he understood when he saw his face in the mirror which resembled his big brother. Lin Ran held his stomach and cried for a long time before he finally packed his bags up and ran away from home.\r\n\r\nUntil the time when Song Zhixu rushed back home from work, Lin Ran who usually waited obediently for him to come home, that little fool with such a big belly, how could he just disappear like this?>"
}