{
	"url": "https://www.novelupdates.com/series/di-wang-gong-lue/",
	"title": "Di Wang Gong Lue - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/12/215193.jpg",
	"noveltype": "(CN)",
	"genre": "Historical   Romance   Yaoi   ",
	"tags": "Adapted to Anime   Adapted to Drama CD   Adapted to Manhua   Ancient China   Childhood Friends   Devoted Love Interests   Handsome Male Lead   Long Separations   Power Couple   Royalty   Slow Romance   Unconditional Love   ",
	"rating": "(4.4 / 5.0, 103 votes)",
	"author": "Yu Xiao Lanshan   语笑阑珊   ",
	"year": "\n2015",
	"ranking": "#4617   #2000   #3550   #6620   #1188   ",
	"reviewcount": "12 Reviews sorted by",
	"description": "As part of the imperial family, every move by Chu Yuan in this game of chess is made with apprehension, fearing that with a moment of inattentiveness, the whole match will be lost in a single move.\n\nAscending to the throne at eighteen, not half a year passes before civil strife erupts in Yun Nan. Though the thoughts of the old guard at the imperial court are not exactly identical, they are all waiting to see how the new emperor will put an end to this.\n\nUnexpectedly, before this side could make a move, a few thousand miles away, the King of Xi Nan, Duan Bai Yue, had already personally commanded troops to attack in all directions; not half a year had passed when peace was restored.\n\nSparse moonlight shines into the palace; Chu Yuan stamped the wax seal himself, and had a secret letter sent urgently to Yun Nan 800 miles away — this time, what must we(1) give in exchange?\n\nBrush marks passed through the back of the paper; it almost can be seen, when writing this line, how angry the young emperor was.\n\nDuan Bai Yue spread out a piece of paper unhurriedly, replying with only one word.\n\nYou.\n\n(1): Chu Yuan is using the royal ‘we’ here.\n\nNote on the story: This is a character focused story, please don’t expect too much court intrigue.\n\nIt’s a slow burn story about two people in love and the things they are willing to do for each other.\n------\n\nThe Emperor's Strategy is the fourth book in Yu Xiao Lan Shan’s Jianghu/Strategy series. Each book is standalone, but there are character cameos and mentions that don’t disrupt the flow of the main story of each book.>"
}