{
	"url": "https://www.novelupdates.com/series/the-failed-swordsman-who-became-the-strongest-after-spamming-the-100-million-years-button/",
	"title": "The Failed Swordsman Who Became the Strongest After Spamming the 100 Million Years Button - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/10/dropoutv1c.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Ecchi   Fantasy   Martial Arts   Mystery   Romance   School Life   Shounen   ",
	"tags": "Adapted to Drama CD   Adapted to Manga   Aggressive Characters   Arrogant Characters   Battle Academy   Battle Competition   Beautiful Female Lead   Bullying   Dense Protagonist   Determined Protagonist   Famous Protagonist   Fantasy Creatures   Fantasy World   Handsome Male Lead   Hard-Working Protagonist   Harsh Training   Hidden Abilities   Love Interest Falls in Love First   Magical Space   Male Protagonist   Multiple Personalities   Mysterious Family Background   Naive Protagonist   Personality Changes   Popular Love Interests   Protagonist Strong from the Start   Royalty   Sealed Power   Soul Power   Stoic Characters   Strong Love Interests   Strong to Stronger   Sudden Strength Gain   Sword And Magic   Sword Wielder   Underestimated Protagonist   ",
	"rating": "(2.5 / 5.0, 329 votes)",
	"author": "Tsukishima Shuuichi   月島 秀一   ",
	"year": "\n2019",
	"ranking": "#4265   #6153   #458   #2126   #1082   ",
	"reviewcount": "56 Reviews sorted by",
	"description": "There was a mysterious old man who approached the failed swordsman with the “100 million years button”. A magic button which can achieve the same effect as training for 100 million years if you push it.\n\nThe failed swordsman who pushed the button had his doubts, but immediately felt tremendous power rising in his body. So he pushed the button many times.\n\nHowever it was a cursed button. The moment it was pushed, he was confined to the 100 million years prison of time. The first 100 years were devoted solely to training. After 1000 years he had forgotten why he swung his sword. He stopped thinking completely after 10,000 years had passed. After 100 million years he became crippled and finally managed to return to the real world. At the same time losing all his memories from the past 100 million years, the only thing that remained were his sword techniques. “I can become stronger just by pressing the button!” or so he thought and pushed the button many times after that. Foolishly trapping himself in that 100 million years of hell each time.\n\nAs he continued this loop, he began to think “If I destroy this world, will I get out of here?” A few billion years later, he finally escaped from the loop.\n\nThis is the story of a failed swordsman trying to make a name for himself in the world.>"
}