{
	"url": "https://www.novelupdates.com/series/meow-meow-meow/",
	"title": "Meow Meow Meow - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2015/06/mmm.png",
	"noveltype": "(CN)",
	"genre": "Adventure   Comedy   Fantasy   Romance   Shoujo   Supernatural   Tragedy   Xianxia   ",
	"tags": "Beautiful Female Lead   Character Growth   Cultivation   Cute Story   Death of Loved Ones   Demon Lord   Demons   Dense Protagonist   Devoted Love Interests   Doting Love Interests   Female Protagonist   Gods   Handsome Male Lead   Heaven   Identity Crisis   Love Interest Falls in Love First   Master-Disciple Relationship   Misunderstandings   Mythology   Naive Protagonist   Non-humanoid Protagonist   Pregnancy   Reincarnation   Shapeshifters   Slow Romance   Strong Love Interests   Suicides   Time Skip   Time Travel   Transformation Ability   Transmigration   ",
	"rating": "(4.3 / 5.0, 358 votes)",
	"author": "Ju Hua San Li   橘花散里   ",
	"year": "\n2009\n",
	"ranking": "#5262   #2743   #1661   #1711   #698   ",
	"reviewcount": "57 Reviews sorted by",
	"description": "A two year old ordinary cat travels through time to become a thousand year old demon cat, Hua Miao Miao.\n\nLittle Miao Miao doesn’t understand the complications of life, still acting like an ordinary cat.\n\nUnexpectedly, Hua Miao Miao meets Bi Qing Shen Jun, a warrior god who looks like her previous owner, and is tricked by him to go to the heavens to become his disciple.\n\nUnder the tutelage of Shifu Bi Qing Shen Jun, after going through numerous painful challenges, little Miao Miao finally understands what it means to be a “cat.”\n\n\nCan’t undress in front of other people, except Shifu.\nCan’t elope with other men, except Shifu.\nCan’t hug or kiss other people, except Shifu.\nCan’t accept roses from Xiao Tian Quan, except given by Shifu.\nCan’t go to Underwater Third Dragon Prince’s palace to eat fish, except cooked by Shifu.\n\n\nUh…… what else?\n\nNot allowed to go to a brothel to earn money? Not allowed to cause chaos or accept proposals?\n\nMeow~ I don’t remember…… Shifu, don’t be angry.\n\nAll right, I’ll remember clearly in the future, please don’t eat me!>"
}