{
	"url": "https://www.novelupdates.com/series/bestial-blade/",
	"title": "Bestial Blade - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/03/bestialblade1.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Fantasy   Martial Arts   Mature   Romance   Shounen Ai   Supernatural   ",
	"tags": "Abandoned Children   Adapted to Drama CD   Age Progression   Alternate World   Animal Characteristics   Beastkin   Beasts   Betrayal   Bloodlines   Calm Protagonist   Character Growth   Child Protagonist   Confident Protagonist   Couple Growth   Determined Protagonist   Discrimination   Genius Protagonist   Hard-Working Protagonist   Introverted Protagonist   Kingdom Building   Mysterious Illness   Mythical Beasts   Orphans   Power Couple   Quirky Characters   Sickly Characters   Slow Romance   Strength-based Social Hierarchy   Strong Love Interests   Tragic Past   Tribal Society   Underestimated Protagonist   Weak to Strong   Werebeasts   ",
	"rating": "(4.2 / 5.0, 69 votes)",
	"author": "Priest   ",
	"year": "\n2012",
	"ranking": "#2000   #2000   #4500   #3538   #3236   ",
	"reviewcount": "6 Reviews sorted by",
	"description": "In a world where strength is power and where one’s worth is decided by birth, Chang An goes against the odds by learning the way of the saber.\n\nHe was born as a frail and sickly sub-beast, falling ill when exposed to even a little gust of wind, yet from a young age, he has always yearned to be strong like the beastman warriors. Everyone tells him that it’s impossible, and he himself nearly resigned to it as well. However, upon experiencing the death of a loved one, he learns that only by being strong can one be a master of their fate.\n\nOn the other hand, Hua Yi, the son of a Chief, is a beastman with silver marks. He is gifted with immense power and could rule over others if he so pleases. However, he finds himself to be different from the other beastmen. He has no desire to conquer, and inside he is softhearted. He would’ve liked to keep living a simple and carefree life, but after a betrayal from a family member, he is forced to grow up.\n\nThese two once innocent children are brought together by fate. Together, they navigate a cruel beastman world, and along the way, they learn more about life and themselves.>"
}