{
	"url": "https://www.novelupdates.com/series/omake-no-tensei-sha/",
	"title": "Omake no Tensei-sha - Novel Updates",
	"image": "https://www.novelupdates.com/img/noimagefound.jpg",
	"noveltype": "(JP)",
	"genre": "Adventure   Comedy   Fantasy   Tragedy   ",
	"tags": "Abandoned Children   Anti-social Protagonist   Antihero Protagonist   Apathetic Protagonist   Appearance Changes   Awkward Protagonist   Brainwashing   Bullying   Calm Protagonist   Carefree Protagonist   Child Abuse   Child Protagonist   Cruel Characters   Demon Lord   Discrimination   Fantasy World   Female Protagonist   Genius Protagonist   Hated Protagonist   Heroes   Loner Protagonist   Magic   Misunderstandings   Quiet Characters   Racism   Reincarnated in Another World   Stoic Characters   Survival   Sword And Magic   Unlucky Protagonist   Weak to Strong   ",
	"rating": "(4.7 / 5.0, 52 votes)",
	"author": "Murasaki Murabe   むらべ　むらさき   ",
	"year": "\n2020",
	"ranking": "#128   #208   #5058   #1018   #6539   ",
	"reviewcount": "7 Reviews sorted by",
	"description": "Aihara Runa was a person who had been living in hell of misfortune. One day she found herself in a strange stage, apparently her soul was reaped without permission and sold at an auction to gods from another world along with her 28 classmates. But there was a trouble, it seems that Aihara’s soul was extremely smelly and stinky. Instead of getting a buyer, she was thrown away and with her soul in danger of disappearing. \n\n   However, when her soul was about disappear, she met an unnamed goddess who claimed herself as a god’s vessel. The goddess said that she can help Aihara to get reincarnated but with one condition, that is to bring her along and get reincarnated together. Aihara who was about disappeared accepted the goddess' condition and got reincarnated successfully as Emmy. But apparently, the hard life still continued even after reincarnated too….\n\nIf there’s no food, then let’s get some bugs!!! Let’s just enjoy this hard life together with the reliable partner [Omake-sama] inside my head and have fun instead.\n\n   As Emmy managed to survive while watching and getting involved in the events of another cheat reincarnations, she grew into an irregular. This is a story about Emmy, a soul who managed to survive from disposal by gods. However, she doesn’t know that her reincarnation did not list in fate's archive and unconsciously broke the gods’ scenario one after another.>"
}