{
	"url": "https://www.novelupdates.com/series/80-years-of-signing-in-at-the-cold-palace-i-am-unrivalled/",
	"title": "80 Years Of Signing-In At The Cold Palace, I Am Unrivalled - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/09/Years-Of-SigningIn-At-The-Cold-Palace-I-Am-Unrivalled.png",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Xuanhuan   ",
	"tags": "Arrogant Characters   Beast Companions   Calm Protagonist   Cultivation   Dao Comprehension   Death of Loved Ones   Demons   Dense Protagonist   Empires   Fast Cultivation   Game Elements   Handsome Male Lead   Human-Nonhuman Relationship   Lack of Common Sense   Lucky Protagonist   Male Protagonist   Monsters   Overpowered Protagonist   Strong to Stronger   Time Skip   Transmigration   Weak to Strong   ",
	"rating": "(2.9 / 5.0, 36 votes)",
	"author": "Girls Are Cute   妹子好可爱   ",
	"year": "\n2020",
	"ranking": "#6970   #2000   #6424   #13807   #11137   ",
	"reviewcount": "13 Reviews sorted by",
	"description": "Lin Jiufeng transmigrates to become the Yuhua God Dynasty’s Crown Prince but is dethroned, banished to the Cold Palace, and imprisoned there because he had released the holy maiden of their rival country.\r\nLin Jiufeng isn't dejected. He has brought a sign-in system with him when he transmigrated and he would receive rewards when he signs in at different places.\r\nBefore the Cold Palace’s gates, he signs in and receives the Ultimate Heaven Slashing Sword Skill!\r\nIn the Great Council Hall, he signs in and receives the Heaven Patching Technique!\r\nIn the Empress Dowager’s palace, he signs in and receives the God of War Totem!\r\n…\r\nLiu Jiufeng imagines that he can quietly sign in like this until he becomes invincible. Yet who would have imagined that the Heavenly Concubine whom he secretly released would rise in rebellion and seize power after she returns to her country?\r\nAfter she succeeds, her first priority is to attack the Yuhua God Dynasty to rescue Lin Jiufeng.\r\nWhen Liu Jiufeng hears of this news, he's puzzled. “Do I need you to rescue me?”>"
}