{
	"url": "https://www.novelupdates.com/series/sick-beauty-rebirth/",
	"title": "Sick Beauty [Rebirth] - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/05/Sick-Beauty-Rebirth.jpeg",
	"noveltype": "(CN)",
	"genre": "Psychological   Romance   Xianxia   Yaoi   ",
	"tags": "Betrayal   Black Belly   Cold Protagonist   Cultivation   Dao Companion   Demon Lord   Demons   Depression   Devoted Love Interests   Doting Love Interests   Enemies Become Lovers   Genius Protagonist   Love Interest Falls in Love First   Male Yandere   Master-Disciple Relationship   Multiple Personalities   Multiple Reincarnated Individuals   Past Plays a Big Role   Persistent Love Interests   Possessive Characters   Reincarnation   R*pe   Second Chance   Sickly Characters   Time Skip   Tragic Past   Twins   Weak to Strong   Yandere   Younger Love Interests   ",
	"rating": "(4.3 / 5.0, 123 votes)",
	"author": "夜雨行舟   ",
	"year": "\n2020",
	"ranking": "#256   #348   #1974   #654   #1542   ",
	"reviewcount": "32 Reviews",
	"description": "In his previous life, Ye Yunlan’s appearance was destroyed by a fire. For years, he was misunderstood by the world and his reputation was notorious. Once reborn, he returned to three hundred years ago. He escapes from the fire. This time, his face was healthy, but his roots have been damaged while saving people, breaking his cultivation and leaving him suffering from sickness. But, Ye Yunlan didn’t care. In his previous life, he wandered for a long time, so in this life he just wanted to live a peaceful life. However, he soon discovered that his former Senior Brother who abolished his golden core, his Sect Master who imprisoned him for a hundred years, his Daoist companion who gave him away to the Demon Venerable, those who hated him and disliked him… all of a sudden, they began to treat him nicely and courteously. Not only did they send elixirs and magic weapons but they also sent themselves. Ye Yunlan: This is unnecessary. \r\n\r\nShen Shu can not forget that scene. In the sky full of fire, that person flew over like a white gull, picked him up and protected the young him within his arms. The flames that hit that man’s back and the blood that dripped down his cheeks fell on the tip of his heart, more scorching than the fire. Later, he bowed his head and called that person “Master”, but when the other party frowned and coughed, he couldn’t help holding the pale hand of that person, and forcefully wiping the blood from his lips. Everyone scolded him for falling into the demonic path and betraying his Sect, but he didn’t listen. He just stared at the man as if looking at the moon. Indulged in beauty, trapped by thirst. The newly promoted No. 1 beauty in the cultivation world at the apex of everyone’s heart, something that can only be longed for.>"
}