{
	"url": "https://www.novelupdates.com/series/rise/",
	"title": "Rise - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/08/rise-cover.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Comedy   Slice of Life   Sports   ",
	"tags": "Absent Parents   Arrogant Characters   Based on a Video Game   Battle Competition   Carefree Protagonist   Chat Rooms   Childhood Friends   Childish Protagonist   Clubs   Confident Protagonist   Cunning Protagonist   Determined Protagonist   e-Sports   Friendship   Gamers   Genius Protagonist   Handsome Male Lead   Hard-Working Protagonist   Hiding True Identity   Leadership   Love Interest Falls in Love First   Male Protagonist   Modern Day   Naive Protagonist   Overpowered Protagonist   Past Plays a Big Role   Past Trauma   Protagonist Strong from the Start   Romantic Subplot   Shameless Protagonist   Strategist   Teamwork   ",
	"rating": "(4.3 / 5.0, 119 votes)",
	"author": "RoboBlitz   ",
	"year": "\n2016",
	"ranking": "#6970   #6228   #1726   #10658   #6677   ",
	"reviewcount": "35 Reviews sorted by",
	"description": "Su Xue, a woman in her mid 20s, is struggling both in paying rent and finding her path in life. Her latest stint has her trying to become a popular League of Legends streamer, though to poor results. One day, she is interrupted in the middle of a livestream by a surprise visit from her landlady. She is informed that she will be having a new roommate. The landlady’s nephew, Lin Feng, a 18 year old boy who has just transferred over to Shanghai for his last year of high school.\n\nThough initially opposed to it, Su Xue reluctantly agrees to the arrangement. She learns that the two share a common interest—League of Legends—and that he’s really amazing at the game. Lin Feng also reveals to her he wishes to become the best professional League of Legends player in the world. \n\nThe next day. Lin Feng attends his first day of school as a transfer student at High School 13. He meets Ouyang and Yang Fan, and the trio find a common passion in League of Legends. Lin Feng is then introduced to Ren Rou, the president of the esports club with a fiery personality, and Tang Bingyao, a quiet bookworm with a love for money and a surprising talent for the game.\n\nA little about Lin Feng’s past is revealed. He was a once pro player, the youngest in history and a contender for the best player in the world. Until the finals of the Season 1 World Championship. There, he lost to his arch-rival, an equally brilliant Korean youth. That was the peak of his career, and also the turning point in his life. He stepped down from his team and disappeared from competitive play altogether. Now, after a four year long hiatus, he aims to make a comeback\n\nOver the next couple of weeks, Lin Feng learns about the upcoming Shanghai 16 School Tournament, and that his school’s esports club had performed especially poorly the previous year. He agrees to coach the club’s team and help them win the first place trophy this year. And so, he starts the members of the club out on an intense training bootcamp.\n\nMeanwhile, the Season 5 League of Legends World Championship is taking place at around the same time. Tian Tian, one of Lin Feng’s former teammates and best friend, is on one of the Chinese teams playing at Worlds. After a poor showing, he is on the verge of a mental breakdown. Lin Feng witnesses everything in a viewing party with the esports club members and becomes worried.\n\nOn the day of the Shanghai 16 School tournament, Lin Feng reunites with Tian Tian on the phone. He tells Tian Tian he’s going to return to the professional scene, that he’s making a new team and plans to invite him. But Tian Tian has to vow not to give up at Worlds and keep winning. Tian Tian agrees, and Lin Feng promises he’ll fight alongside him. Lin Feng then heads into his match with renewed resolve, to climb from the bottom all the way back to the top, and overcome the rival that defeated him so many years ago.>"
}