{
	"url": "https://www.novelupdates.com/series/sealing-sword/",
	"title": "Sealing Sword - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/05/sealingsword3.jpg",
	"noveltype": "(CN)",
	"genre": "Adventure   Drama   Historical   Martial Arts   Wuxia   Yaoi   ",
	"tags": "Buddhism   Caring Protagonist   Character Growth   Complex Family Relationships   Conflicting Loyalties   Daoism   Death of Loved Ones   Flashbacks   Handsome Male Lead   Interconnected Storylines   Long Separations   Master-Disciple Relationship   Obsessive Love   Past Plays a Big Role   Past Trauma   Poisons   Revenge   Tragic Past   ",
	"rating": "(4.2 / 5.0, 6 votes)",
	"author": "Qing Shan Huang Zhong   青山荒冢   ",
	"year": "\nN/A",
	"ranking": "#2000   #2000   #12327   #7474   #12435   ",
	"reviewcount": "1 Review sorted by",
	"description": "Can jianghu wanderers ever refrain from messing around?\n\nThe turbulence of the world fostered us, whose existence upon joining jianghu going by as quick as a blink.*\n\n'In this world where war erupts throughout, jianghu is a cycle of vengeance and retribution. You either persist, or you perish.'\n\nMany years ago, a young Chu Xiwei who recently joined the sect was chilled to the bone by those words he happened to have heard.\n\nSeeing that his young disciple was scared quite enough, Ye Fusheng leisurely sipped his tea, 'What I just said is pure nonsense.'\n\nEvery young chivalrous individuals joining jianghu would happen upon one martial art scroll or another. Ye Fusheng was so often tricked by this preconception in his younger years that when he got older, he decided to hoard other people's scrolls.\n\nBut jianghu didn't work as simply as that.\n\nIt was a society of using one's might to carve one's path, of competing for artifacts and debating one's skills.\n\nLegends would never fade with the withering time, just as hatred would not disappear in a peaceful age.\n\nAs the golden time passed, all splendor would be reduced to dust. With it, Glimpse of Grace** was sealed away from the world.\n\nNotes:\n* From an unnamed poem, by an unknown poet (rumored to be authored by Li Bai).\n** The sword name is 惊鸿掠影, which in context of the story can also be separated into its short title: 惊鸿 – Jing Hong, and the name of an organization 掠影 – Lue Ying.>"
}