{
	"url": "https://www.novelupdates.com/series/demon-kings-repayment/",
	"title": "Demon King’s Repayment - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/11/repayment4.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Fantasy   Romance   Supernatural   ",
	"tags": "Adopted Protagonist   Adventurers   Animal Characteristics   Artifact Crafting   Artifacts   Astrologers   Calm Protagonist   Character Growth   Daoism   Demon Lord   Demons   Devoted Love Interests   Eye Powers   Fairies   Fast Learner   Female Protagonist   Feng Shui   Fox Spirits   Gate to Another World   Ghosts   Hunters   Love Interest Falls in Love First   Magic   Magic Formations   Near-Death Experience   Necromancer   Saving the World   Seeing Things Other Humans Can't   Shikigami   Souls   Spirit Users   Spirits   Strategic Battles   Strong Love Interests   Summoning Magic   Teachers   Tragic Past   Transformation Ability   Transmigration   Transported to Another World   Wizards   ",
	"rating": "(4.6 / 5.0, 46 votes)",
	"author": "Gong Xinwen   龚心文   ",
	"year": "\n2019",
	"ranking": "#2053   #1276   #4924   #3492   #5156   ",
	"reviewcount": "14 Reviews sorted by",
	"description": "The demon king, who was betrayed by his relatives, was taken to the lair of human beings. His heart was full of humiliation and resentment towards humans.\r\n\r\n'Despicable human beings, how can I be their servant? I am the great demon.'\r\n\r\n'Shameless human being, how dare you touch my tail? When I regain my power, I will tear you to pieces.'\r\n\r\nSurprisingly, the woman took him in for several days, fed him fragrant food, brushed his hair, bandaged his wounds, and brought him back to the mountains. The human released his restraint, touched his ear, and told him, 'Go. I’m setting you free.'\r\n\r\nYuan Xiang had just completed her Taoism studies and entered the Demon Forest.\r\n\r\nShe wanted to capture a little demon as an apostle.\r\n\r\nA wolf demon was injured by the attack of other demons. He was lying on the ground with blood stains all over his body. Yuan Xiang couldn't bear it. So she took him home, tended his wounds, and took good care of him. The wolf demon was untamable and often growled at her everyday, extremely vicious. Then she let him go.\r\n\r\nThereafter, at times when Yuan Xiang returned from outside, she would find some strange gifts by her door.\r\n\r\nThe demon king, who was hiding secretly, was tickled with hate: That woman made a binding contract with a demon cat! Besides that beautiful face, the cat is useless! She actually touched that fox’s tail. It can't be better compared to mine. My tail is the best!>"
}