{
	"url": "https://www.novelupdates.com/series/the-villains-contract-lover/",
	"title": "The Villain’s Contract Lover - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/03/VCL-cover.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Drama   Josei   Romance   Supernatural   ",
	"tags": "Abusive Characters   Acting   Beautiful Female Lead   Businessmen   Celebrities   Clever Protagonist   Cohabitation   Contracts   Cultivation   Cute Protagonist   Devoted Love Interests   Female Protagonist   Half-human Protagonist   Handsome Male Lead   Heartwarming   Love Interest Falls in Love First   Male Yandere   Modern Day   Pretend Lovers   Shapeshifters   Showbiz   Transformation Ability   Transmigration   Wealthy Characters   ",
	"rating": "(3.8 / 5.0, 230 votes)",
	"author": "萌堂   ",
	"year": "\n2019",
	"ranking": "#2566   #4765   #735   #237   #1243   ",
	"reviewcount": "45 Reviews sorted by",
	"description": "Little fox demon WanWan died during transcending and ended up transmigrating into a CEO novel. She became Xu WanZhi, the boss villain's contract lover.\r\n\r\nIn the book, the boss villain, Mu ZhenYu, was bankrupted by the male lead before the end of the contract.\r\n \r\nSeeing that her $50 million dollars had disappeared into thin air, Xu WanZhi juggled the award-winning film emperor and Mu ZhenYu's brother, giving Mu ZhenYu the reputation of having a girlfriend who was cheating on him left and right.\r\n \r\nNobody had expected the boss villain to turn the table, revive his company, and become an unreachable billionaire. And the first thing he did after turning the situation around? 'Taking care' of Xu WanZhi.\r\n \r\nWanWan transmigrated to the perfect moment to turn things around; when Xu WanZhi was on Mu ZhenYu's brother's bed, and Mu ZhenYu, enraged and bankrupt, was on his way to catch her in his brother's bed.\r\n \r\nWow. That was exciting!\r\n \r\nIn order to save herself, WanWan swore that she'd take good care of the boss man.\r\n \r\nConquering the 'heroes' behind their keyboards; walking over the male and female leads, face slapping, you name it!\r\n \r\nWhen the contract was up, she wanted to skidaddle out of there. She told him, 'I can't renew the contract with you. My fans don't like me having a boyfriend.”\r\n \r\nHe pulled her into his arms. 'Okay, so you can't have a boyfriend, how about a husband?'>"
}