{
	"url": "https://www.novelupdates.com/series/the-clumsy-cold-blooded-prince-who-lost-his-life-due-to-his-brothers-scheming-became-the-wise-king-after-fighting-in-his-second-life-for-the-clumsy-marchioness/",
	"title": "The Clumsy Cold-Blooded Prince, Who Lost His Life Due to His Brother’s Scheming, Became the Wise King After Fighting in His Second Life for the Clumsy Marchioness - Novel Updates",
	"image": "https://www.novelupdates.com/img/noimagefound.jpg",
	"noveltype": "(JP)",
	"genre": "Comedy   Drama   Fantasy   Romance   School Life   Tragedy   ",
	"tags": "Clumsy Love Interests   Complex Family Relationships   Devoted Love Interests   European Ambience   Family Conflict   Love at First Sight   Love Interest Falls in Love First   Male Protagonist   Nobles   Royalty   Schemes And Conspiracies   Second Chance   Sibling Rivalry   Younger Brothers   ",
	"rating": "(3.8 / 5.0, 37 votes)",
	"author": "Sanbon   サンボン   ",
	"year": "\n2022",
	"ranking": "#3710   #4097   #3820   #2548   #6961   ",
	"reviewcount": "5 Reviews sorted by",
	"description": "Dietrich, who was born as the first prince of the newly emerging kingdom of Estline, lost his feelings due to his mother's mistreatment and was called a 'cold-blooded prince' by those around him. He was ridiculed.\r\n\r\nWhen Dietrich was thirteen years old, he met a girl.\r\n\r\nIt is 'Marguerite,' the daughter of the Marquise of Friedenreich and Dietrich's fiancée.\r\n\r\nAt first, Dietrich does not like Marguerite, but she is devoted to him despite her clumsiness, and Dietrich gradually forgives her.\r\n\r\nWhen they were both seventeen years old, the king died.\r\n\r\nIn the midst of the unrest in the country, Dietrich is crowned the new king, and at the same time, he asks Marguerite to break her engagement.\r\n\r\nIn this way, he wants to prevent any misfortune from befalling her.\r\n\r\nLater, Dietrich is overthrown from the throne by his brother 'Oscar'.\r\n\r\nThereupon, he was sentenced to death.\r\n\r\nWhen Dietrich is on the guillotine and about to die, he sees Marguerite in the crowd, praying desperately.\r\n\r\nDietrich dies, murmuring words of apology and gratitude to her.\r\n\r\nBut...\r\n\r\nWhen he opens his eyes again, he is somehow transported back to the day of his engagement to Marguerite.\r\n\r\nDietrich makes a vow.\r\n\r\n'This time I will make her happy.'\r\n\r\nThis is the story of a man struggling to make his fiancée happy in a world where he has returned from death and is finally called the wise king.\r\n>"
}