{
	"url": "https://www.novelupdates.com/series/cannon-fodder-cheat-system/",
	"title": "Cannon Fodder Cheat System - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/04/cover-Juzi-Zhou-Cannon-Fodder-Cheat-System.png",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Comedy   Drama   Fantasy   Romance   Xuanhuan   Yaoi   ",
	"tags": "Amnesia   Ancient Times   Apocalypse   Artificial Intelligence   Artists   Black Belly   Calm Protagonist   Celebrities   Charismatic Protagonist   Cheats   Cooking   Cultivation   Cunning Protagonist   Devoted Love Interests   Doting Love Interests   Episodic   Famous Protagonist   Futuristic Setting   Gamers   Genius Protagonist   Gods   Handsome Male Lead   Immortals   Interdimensional Travel   Jack of All Trades   Love Interest Falls in Love First   Lovers Reunited   Models   Modern Day   Mpreg   Multiple Realms   Multiple Reincarnated Individuals   Mysterious Past   Overpowered Protagonist   Politics   Possessive Characters   Post-apocalyptic   Power Couple   Protagonist Strong from the Start   R*pe Victim Becomes Lover   Revenge   Royalty   R*pe   Showbiz   Strong Love Interests   System Administrator   Transmigration   Unconditional Love   Virtual Reality   Wealthy Characters   World Hopping   Zombies   ",
	"rating": "(4.0 / 5.0, 391 votes)",
	"author": "Tangerine Boat   橘子舟   ",
	"year": "\n2017",
	"ranking": "#219   #148   #378   #413   #393   ",
	"reviewcount": "99 Reviews sorted by",
	"description": "At first, when he learned that he was forced to go to many different routine worlds and be reborn into all kinds of cannon fodder, he was against it.\n\nBecause while villains usually all only have a moment of satisfaction, the endings of cannon fodder are also frequently quite miserable.\n\nBut the man who gave him the system told him that this system not only has all types of powerful functions, but he can also break the routine lives of the cannon fodder. If he achieves this satisfactorily for each world, he can even become a god.\n\nHe’s already experienced over a thousand reincarnations, but hasn’t yet been a god. Since it sounds pretty great, why not just try it out.\n\nFrom that moment on, he began the irreversible path of tyrannically oppressing people, while conveniently tearing open those white moonlights and so-called righteous people’s hypocritical masks.\n\nHis goal: wearing the villain’s role to walk other people’s righteous paths, leaving them no path to follow.>"
}