{
	"url": "https://www.novelupdates.com/series/where-winter-is-warm-where-summer-is-cool-season/",
	"title": "Where Winter is Warm Where Summer is Cool (Season) - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/05/Where-Winter-is-Warm-Where-Summer-is-Cool-Season_26260_1558407599.jpg",
	"noveltype": "(CN)",
	"genre": "Drama   Romance   Slice of Life   Tragedy   ",
	"tags": "Adapted to Drama   Caring Protagonist   Family Business   Family Conflict   Female Protagonist   Handsome Male Lead   Introverted Protagonist   Living Abroad   Living Alone   Love Interest Falls in Love First   Love Triangles   Modern Day   Past Trauma   Persistent Love Interests   ",
	"rating": "(4.0 / 5.0, 16 votes)",
	"author": "Celine Gu Xi Jue   顧西爵   顾西爵   ",
	"year": "\n2012",
	"ranking": "#6970   #4775   #8746   #4969   #8780   ",
	"reviewcount": "1 Review sorted by",
	"description": "Everyone has that perfect somebody, always worth spending time with no matter what. For even on the gloomiest, rainiest of days, the sun always comes out, in the end, to cast its rays on a beautiful rainbow. \n\nJian Anjie was sure that Xi Xichen was the greatest mismatch that God had handed her. His cold temperament and personality lending a leering, arrogant appearance. She cannot stand being around him, and yet life seems determined to keep their fates entwined. \n\nWhat she doesn’t know is that this cold front that Xichen portrays is a wall he’s built to hide a sensitive and childlike interior deep inside himself. This is why, on that fated day, she rejects his confession of love to her outright. \n\nBut Xichen is adamant and pours out to her a shocking revelation.\n\n“My love for you is forever. I would never do anything to harm you or force you into something you don’t want. You are the love of my life, and I am willing to wait until the winds of change open your heart up to me. I will wait forever.” \n\nThese words start a twinge of something in Anjie’s heart, but will it be enough?\n\n“Whether through a distance that spans the world, or the intimate space between two pillows, my love will find you again. I will nestle it into my heart so that I may find warmth on the coldest winter day, and a wonderful cool on the hottest summer one.”>"
}