{
	"url": "https://www.novelupdates.com/series/number-one-lazy-merchant-of-the-beast-world/",
	"title": "Number One Lazy Merchant of the Beast World - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/05/flmbw.png",
	"noveltype": "(CN)",
	"genre": "Fantasy   Romance   Sci-fi   Yaoi   ",
	"tags": "Abandoned Children   Androids   Animal Characteristics   Appearance Different from Actual Age   Artificial Intelligence   Beastkin   Comedic Undertone   Crafting   Cute Children   Cute Protagonist   Cute Story   Doting Love Interests   Futuristic Setting   Generals   Love Interest Falls in Love First   Non-humanoid Protagonist   Outer Space   Possessive Characters   Previous Life Talent   Reincarnated in Another World   Reincarnation   Sculptors   Shapeshifters   Store Owner   Strong Love Interests   Transmigration   Underestimated Protagonist   Weak Protagonist   Werebeasts   ",
	"rating": "(4.4 / 5.0, 750 votes)",
	"author": "Metasequoia   shuǐshān   水杉   ",
	"year": "\n2018",
	"ranking": "#1860   #1613   #592   #148   #216   ",
	"reviewcount": "143 Reviews sorted by",
	"description": "After transmigrating into a beast world, Rong Mingshi discovered that the people of this world experienced widespread mania. For example, when their emotions were abnormally agitated, they would become destructive beasts. If their emotions were abnormally low, they would shrink into their young beast form.\n\nThere is a type of energy stone that can cure this but it must be hand-carved into the animal form corresponding to the beastman. The more realistic the shape, the better the healing effect and the higher the repeated utilization rate.\n\nIn his previous life, Rong Mingshi’s ancestors started as craftsmen who grew their business and became wealthy.\n\nThen a small store suddenly popped up on the Star Network, selling several small sculptures made with superb skill. The effect of the energy stone to soothe emotions could be felt through the screen and stirred up a sensation in the entire empire. However, this store owner was super lazy…>"
}