{
	"url": "https://www.novelupdates.com/series/my-senior-is-always-salivating-after-me/",
	"title": "My Senior Is Always Salivating After Me! - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/02/drool.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Slice of Life   Xianxia   Yaoi   ",
	"tags": "Ancient Times   Animal Characteristics   Clever Protagonist   Clingy Lover   Cold Love Interests   Cultivation   Cunning Protagonist   Cute Protagonist   Demi-Humans   Demons   Devoted Love Interests   Doting Love Interests   Guardian Relationship   Half-human Protagonist   Handsome Male Lead   Love Interest Falls in Love First   Male Yandere   Naive Protagonist   Older Love Interests   Pets   Playful Protagonist   Possessive Characters   Senpai-Kouhai Relationship   Shameless Protagonist   Special Abilities   Strong Love Interests   Time Skip   Transformation Ability   Transmigration   Transported to Another World   Weak to Strong   Yandere   ",
	"rating": "(4.5 / 5.0, 158 votes)",
	"author": "Toothless   WuYaZi   无牙子   ",
	"year": "\n2018",
	"ranking": "#5262   #4873   #1635   #4881   #759   ",
	"reviewcount": "24 Reviews sorted by",
	"description": "Lin SuCi transmigrated into a book, and became a kitten who had just cultivated into becoming human.\n\nWhen he was still young, he was picked up by a good man to be become his apprentice, but he did not expect his master to let his senior — the number one villain in the book — raise him?\n\nThis villain senior was too scary, when he had nothing to do he would put him on a plate and stare at him. Let’s not mention cuddling, embracing, stroking and pinching him all day long, he even had a hundred ways to bite a cat!\n\nLin SuCi covered his butt and had a tearful epiphany, Senior wants to eat me up!\n\nHaving tried to run away with his short legs and getting caught for the nth time, Lin SuCi, his paws covering his face, had to accept his fate.\n\nWasn’t it to just be the boss villain’s favored younger brother? Take your hand off my tail, fine, I’ll take on this role!>"
}