{
	"url": "https://www.novelupdates.com/series/demon-wangs-golden-favorite-fei/",
	"title": "Demon Wang’s Golden Favorite Fei - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2017/01/t019a2a8cb92e3a747b.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Comedy   Drama   Josei   Martial Arts   Mature   Romance   ",
	"tags": "Ancient China   Appearance Changes   Arranged Marriage   Assassins   Beautiful Female Lead   Broken Engagement   Cross-dressing   Cunning Protagonist   Devoted Love Interests   Doctors   Doting Love Interests   Female Protagonist   Genius Protagonist   Handsome Male Lead   Hiding True Identity   Love Interest Falls in Love First   Loyal Subordinates   Misunderstandings   Money Grubber   Multiple Identities   Multiple Reincarnated Individuals   Poisons   Politics   Possessive Characters   Power Couple   Pregnancy   Protagonist Strong from the Start   Revenge   R*pe   Schemes And Conspiracies   Strong Love Interests   Transmigration   Underestimated Protagonist   ",
	"rating": "(4.0 / 5.0, 834 votes)",
	"author": "La Mi Tu   蜡米兔   ",
	"year": "\n2016",
	"ranking": "#2686   #2460   #279   #462   #219   ",
	"reviewcount": "137 Reviews sorted by",
	"description": "“Miss, since you came back, every three days there will be someone who start a rumor to slander you……”\n\n“Some say you are ugly and really ill and will not live till eighteen…….”\n\n“Some say your personality is vulgar, even rural women are not as wild…..”\n\n“There are also people who mentioned the theft of that year. They told it like it has a nose and eyes, like they personally have witnessed Miss steal the glowing pearl……”\n\nA time traveler, she became the ancient version of Cinderella. Not only did her younger sister steal her fiancé, she is also sent to ChongXi by her father for other people…..\n\nWhat a joke! It has always been her that slaughters people, when is it their turn to be arrogant?! \n\nBeat her? Alright! A needle and you will no longer be able to lift your right hand!\n\nCurse her? Deal! A kick and you’ll fall into the lake as food for carp!\n\nAssassination? Good! Making it so you won’t be able to see tomorrow’s sun!\n\nWhat? Want her to marry that Demon Wang whose eight wives died on the wedding night? No problem! She is the Demoness of the white and black world. She’d like to see who between the two of them is more evil, who is more vicious.\n\nOnly after marrying into WangFu did she find out this Demon Wang is different from the rumors. Not only are there different kinds of poisons in his body, he needs medication every day, and every night when it’s full moon, he’ll endure unbearable pain. That man’s weak appearance actually made her to let her guard down and feel pity. She vowed, the one who made him like this, she’ll pay him thousand, no, ten thousand times back! It’s just that this man, he doesn’t seem the same like he is on the surface……>"
}