{
	"url": "https://www.novelupdates.com/series/im-a-cool-salted-fish-in-the-entertainment-industry/",
	"title": "I’m A Cool Salted Fish In The Entertainment Industry - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/01/Im-A-Cool-Salted-Fish-In-The-Entertainment-Industry.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Fantasy   Romance   Slice of Life   ",
	"tags": "Acting   Alternate World   Beautiful Female Lead   Carefree Protagonist   Celebrities   Cute Protagonist   Dreams   Easy Going Life   Famous Protagonist   Female Protagonist   Glasses-wearing Love Interests   Handsome Male Lead   Lazy Protagonist   Modern Day   Showbiz   Singers   Slow Romance   Transmigration   ",
	"rating": "(4.2 / 5.0, 93 votes)",
	"author": "Big Brother Drink Ice   大哥喝冰阔落   ",
	"year": "\n2020",
	"ranking": "#2425   #2251   #2254   #1559   #2348   ",
	"reviewcount": "19 Reviews sorted by",
	"description": "You Qiuqiu transmigrated into a book and became a cool female N number in the entertainment circle. The position is the supporting role that has no name.\n\nIn this world where people are struggling to get to the top and become a frequent visitor of hot search, looking at everyone around her who is full of ambitions, You Qiuqiu has no fluctuations in her heart and just wants to be a salted fish.\n\nBut even if she is a salted fish, in order to become a salted fish with a high quality of life, she is being forced to do business for money.\n\nYou Qiuqiu: Paralyzed Salted fish jpg.\n\nSo the audience saw this scene –\n\nYou Qiuqiu sits in the shady place with her little stick in the variety show while cheering for the guests who have a hard time playing the game with their hideous faces.\n\nOther female stars show off their eighteen martial arts in the live broadcast room to sing and dance. The worst thing was to remove makeup from the live broadcast. You Qiuqiu took out five takeaways.\n\nToday I’m going to show you a live broadcast of fried chicken, kebabs, ice cream, crayfish, and doughnuts.\n\nAudience: “…”\n\nWhen You Qiuqiu was photographed at the awards ceremony, a handsome man and beautiful woman were sitting dignified around her, but she was sleeping with her mouth open.\n\nYou Qiuqiu thinks she is most likely demand to cool down.\n\nShe just took a nap! How could she be photographed! So angry!\n\nThen…let’s calm down. The salted fish didn’t want to waste too much brain cells. When she was forced to do business, she still has some money. There are two apartments in the city center, enough to be a charter wife.\n\nWho knows, she is on fire.\n\nFrequent searchers and ranked among the top.\n\nThousands of fans are crying and shouting, Qiuqiu, you are the cutest cub in the world, completely different from those coquettish bastards outside. MaMa (BaBa) loves you!\n\nYou Qiuqiu:???\n\nGive it a go. The salted fish becomes a koi?>"
}