{
	"url": "https://www.novelupdates.com/series/raising-a-fox-consort-the-cold-demonic-wangs-sweet-love/",
	"title": "Raising a Fox Consort: The Cold Demonic Wang’s Sweet Love - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/02/Raising-a-Fox-Consort.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Romance   Shoujo   Supernatural   Xuanhuan   ",
	"tags": "Ancient China   Beasts   Beautiful Female Lead   Cold Love Interests   Fantasy World   Female Protagonist   Fox Spirits   Handsome Male Lead   Jealousy   Misunderstandings   Nobles   Pets   Royalty   Slow Romance   Strong Love Interests   Transmigration   ",
	"rating": "(3.9 / 5.0, 43 votes)",
	"author": "Zui Meng Fanchen   醉梦凡尘   ",
	"year": "\nN/A",
	"ranking": "#2000   #2000   #4562   #4636   #4762   ",
	"reviewcount": "5 Reviews sorted by",
	"description": "Rumor has it that the fourth Wangye in Xuan Lang Empire was handsome and couldn’t be compared to anyone else. He held impressive contributions, gaining the favor of the Emperor. No one else had that honor within the present royal court.\r\n\r\nRumor has it that the fourth Wangye’s methods were cruel and murdered people within the blink of an eye, leading people to be scared out of their wits!\r\n\r\nRumor has it that the fourth Wangye was cold-hearted, placing no one in his eyes.\r\n\r\nHowever, the truth was —\r\n\r\n“No good. Fourth Wangye, the Firefox and the nineteenth Wangye are in a fight and ruined the library collections!”\r\n\r\n“No harm, just put things back in order, then it’s fine!”\r\n\r\n“Not good. Fourth Wangye, the Firefox secretly ate the millennium Seven Colors Fruit that the Emperor had rewarded!”\r\n\r\n“No harm, as long as it likes to eat it then it’s fine!”\r\n\r\nEveryone within the fourth WangFu knew that the Firefox was their Wangye’s treasure.\r\n\r\nHowever, when the Firefox transformed into a person—\r\n\r\nHeaven ah! Look at the pair of lily-white hands. Su JiuJiu was completely stunned and worried. Didn’t she cross over as a fox? How come she had transformed back into a person now?! Then, is she a person or a transvestite?!>"
}