{
	"url": "https://www.novelupdates.com/series/the-crown-prince-is-actually-a-princess/",
	"title": "The Crown Prince is Actually a Princess! - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/03/The-Crown-Prince-is-Actually-a-Princess.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Drama   Gender Bender   Josei   Martial Arts   Mystery   Romance   Slice of Life   ",
	"tags": "Adapted to Manhua   Ancient China   Assassins   Beautiful Female Lead   Charming Protagonist   Clever Protagonist   Crime   Cross-dressing   Curses   Detectives   Empires   Female Protagonist   Handsome Male Lead   Hidden Abilities   Imperial Harem   Jack of All Trades   Kingdoms   Mysterious Past   Mystery Solving   Royalty   R*pe   Schemes And Conspiracies   Secret Identity   Unconditional Love   ",
	"rating": "(3.7 / 5.0, 34 votes)",
	"author": "Duānmù Yáo   端木摇   ",
	"year": "\n2019",
	"ranking": "#2000   #2000   #6479   #7467   #6923   ",
	"reviewcount": "3 Reviews sorted by",
	"description": "For 18 years she disguised herself as a man, and what a man: the Crown Prince of the Yan Kingdom.\n\n Now in order to kill her greatest enemy, the current Prince Regent, she ended up in his hands.\n\n Will she be able to keep her secret identity and succeed in killing him? Or will love bloom from hatred?\n\n“His Royal Highness is Pregnant!” tells the story of Prince Murong Ci, the Crown Prince of the East Palace of the Great Yan State, who disguised herself as a man for eighteen years and protected herself as a “Straw Prince” and cultivated power in secret.\n\n Her opponent, Murong Yu, the auxiliary Prince Regent, who was given the Emperor’s surname by the Emperor of Yan, had great martial skills and power, cruel and vicious, strategizing, and eyeing the Emperor’s power.\n\n In order to regain the real power of the Murong clan, Murong Ci meticulously planned the assassination of the Regent, but she ended up beginning a strange relationship between them… \n\na strange love. She grew from being the “Straw Prince” to being the Emperor, he grew from being a domineering Prince Regent to a Wife-loving Demon.>"
}