{
	"url": "https://www.novelupdates.com/series/shadow-queen/",
	"title": "Shadow Queen - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/06/49829.jpg",
	"noveltype": "(KR)",
	"genre": "Drama   Fantasy   Josei   Psychological   Romance   School Life   Tragedy   ",
	"tags": "Academy   Acting   Adapted to Manhwa   Adopted Protagonist   Age Regression   Antihero Protagonist   Aristocracy   Arrogant Characters   Assassins   Beautiful Female Lead   Black Belly   Cautious Protagonist   Clever Protagonist   Complex Family Relationships   Confident Protagonist   Contracts   Cruel Characters   Cunning Protagonist   Dark   Depictions of Cruelty   Depression   Determined Protagonist   European Ambience   Female Protagonist   Hard-Working Protagonist   Hidden Abilities   Hiding True Abilities   Hiding True Identity   Kingdoms   Knights   Late Romance   Maids   Manipulative Characters   Murders   Nobles   Past Plays a Big Role   Past Trauma   Proactive Protagonist   Protagonist Strong from the Start   Reincarnation   Revenge   Royalty   Schemes And Conspiracies   Second Chance   Shy Characters   Spies   Strong to Stronger   Torture   Tragic Past   Villainess Noble Girls   Wealthy Characters   ",
	"rating": "(4.0 / 5.0, 99 votes)",
	"author": "Hayol   하율   ",
	"year": "\n2018",
	"ranking": "#1888   #4193   #3930   #4427   #1830   ",
	"reviewcount": "12 Reviews",
	"description": "“Could you become my daughter?”\n\nThanks to the Grand Duke Friedrich’s proposition, Elena became his fake daughter. Yet after marrying the Crown Prince, having his child, and acquiring land to oversee herself, the ‘late’ Duke’s daughter, Lady Veronica, appeared before her. \n\nAll along, she had been nothing but a mere puppet for the real thing.  Elena’s son is thus taken from her, and she is murdered.\n\nIn a twist of events however, she ends up returning to the past.\n\n“I will crush each and every one of you.”\n\nShe would never live the life of a puppet again.\n\nAnd so begins Elena’s second life, swearing vengeance on her enemies.>"
}