{
	"url": "https://www.novelupdates.com/series/the-husband-was-the-long-aotian/",
	"title": "The Husband was the Long Aotian - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/01/The-Husband-was-the-Long-Aotian.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Drama   Romance   Xianxia   ",
	"tags": "Adapted to Manhua   Ancient Times   Bickering Couple   Carefree Protagonist   Couple Growth   Cunning Protagonist   Female Protagonist   Handsome Male Lead   Harsh Training   Strong Love Interests   Sword Wielder   System Administrator   Transmigration   Weak to Strong   ",
	"rating": "(4.3 / 5.0, 26 votes)",
	"author": "Mo Shu Bai   墨书白   ",
	"year": "\n2021",
	"ranking": "#1874   #1856   #8239   #3535   #7815   ",
	"reviewcount": "4 Reviews sorted by",
	"description": "Before all this, Qin Wanwan was the happiest Second Generation Immortal in the Immortal Realm.\n\nShe was a salted fish, a waste. Her parents bribed various outstanding figures who had fame and prestige to fabricate her achievement so she could live peacefully in Immortal Realm.\n\nUntil one day, Jian Xingzhi, who had fought with people all over the world, came over to fight her out of admiration of her strength. She was pressed to the ground and he stepped on her face. With a slash of his sword, she transmigrated from the Immortal Realm to the novel “Strongest Mary Sue” and became the vicious Supporting Female, Qin Wan.\n\nJust as she became Qin Wan, she was also pressed to the ground. Though, it’s now on a Judgment Stage. People nearby shouted to kill her because she harmed the Female Lead. \n\nHenceforth, she swore she would have her revenge on Jian Xingzhi. \n\nLater, she befriended a fellow transmigrator and learned under him.\n\nQin Wanwan, “Are you also a transmigrator?”\n\nJian Xingzhi, “Mn.”\n\nQin Wanwan, “Then, what is your name, and what did you do before?”\n\nJian Xingzhi, “My Daoist name is Sui Heng. My given name is Jian Xingzhi. My heart and soul are dedicated to cultivating the way of the Sword. I have no interest in worldly affairs. Jianghu people call me Long Aotian.”\n\nQin Wanwan, “……”\n\nShe knew.\n\nShe knew by heart who this st*pid as*hole was.>"
}