{
	"url": "https://www.novelupdates.com/series/the-student-guardians-are-obsessed-with-me/",
	"title": "The Student Guardians Are Obsessed With Me - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/06/The-Student-Guardians-Are-Obsessed-With-Me.jpg",
	"noveltype": "(KR)",
	"genre": "Fantasy   Harem   Romance   ",
	"tags": "Dense Protagonist   Empires   European Ambience   Fantasy World   Female Protagonist   Nobles   Reincarnated in Another World   Reverse Harem   ",
	"rating": "(3.4 / 5.0, 12 votes)",
	"author": "유월사일   ",
	"year": "\n2021",
	"ranking": "#4617   #4180   #10278   #6342   #9079   ",
	"reviewcount": "No Reviews",
	"description": "Death from overworked after working as an entrance exam cram school instructor. When I opened my eyes, I reincarnated as a wealthy count’s daughter.\r\nIn this life, I was going to not work, and live a comfortable life, however!\r\nI came to teach my twin older brother too well. Inquiries about entrance exam counseling are pouring in.\r\n\r\n***\r\n\r\n“Teacher, what is your ideal type?”\r\n“About that… I surely like a good-looking, rich, and kind person.”\r\n'That’s great. My uncle is exactly like that.”\r\n\r\nThe students who are trying to dig up something when there is just spare time are also a bit suspicious, but the more strange thing is their guardians.\r\n\r\n“You have no awareness too much about how pretty you are. That's why the one who’s always uneasy is surely me.'\r\n\r\nDoesn't the childhood friend who always not crossed the ambiguous line suddenly changed his attitude 180 degrees,\r\n\r\n“The student guardian’s face-to-face talk was an excuse. I came here because I wanted to see you, so just sit down.”\r\n\r\nThe Duke, who was like an ice sculpture, got his cheeks blushed, and,\r\n\r\n“The Lady is fun. I keep getting greedy, but surely what I’m saying is that I don’t know whether this is a really good sign.”\r\n\r\nWhat was even worse, I became tangled up with the Imperial Crown Prince, whose face had never been seen.\r\n\r\nSomehow, I became a teacher, and when I came to my senses, I became a CEO. Now that I’ve become like this, I tried to work hard earning money, but the student’s guardians won't let me go.\r\n\r\n“I’m sorry, but because I’m going to focus only on my work for the time being.”\r\n\r\nI'm busy to death because of work, yet I'm in trouble because a reverse harem that wasn’t even in my destiny suddenly unfolds.\r\n\r\n>"
}