{
	"url": "https://www.novelupdates.com/series/master-fus-ace-wife/",
	"title": "Master Fu’s Ace Wife - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/03/Master-Fus-Ace-Wife.jpg",
	"noveltype": "(CN)",
	"genre": "Romance   ",
	"tags": "Abandoned Children   Beautiful Female Lead   Complex Family Relationships   Female Protagonist   Genius Protagonist   Hackers   Handsome Male Lead   Modern Day   Mysterious Family Background   Overpowered Protagonist   Power Couple   Secret Identity   ",
	"rating": "(3.3 / 5.0, 7 votes)",
	"author": "悠哉依然   ",
	"year": "\nN/A",
	"ranking": "#2000   #2000   #9398   #6262   #9854   ",
	"reviewcount": "3 Reviews sorted by",
	"description": "The young daughter of the Mu family in Ningzhou City who had been missing for 15 years had been found. When Xiao Qianjin was brought back, rumors say that she had a rather ugly appearance.\n\nThe moment Wenli was brought back to the Mu family, she received warnings from all directions.\n\nMadam Mu: Remember your identity. Don’t ever think to compete with your elder sister, you are no match for her.\n\nEldest Young Master Mu: I only have Nuanxi as my younger sister.\n\nYoungest Young Master Mu: Bumpkin, it is embarrassing to say that you are my sister.\n\nAll the newspapers and magazines are mocking her. All the children of the Mu family are excellent, but the newly found daughter is really hard to describe.\n\nTwo months after Wenli packed her bags and moved out of the Mu family, the World Technology Competition was held in Ningzhou City and the street where she lived are filled with luxury cars.\n\nPeople who once satirized her were in an uproar. Who said that this girl is raised in a poor backwater village? Which poor village can provide such a buddha?\n\nDuring the two months, news broke out and a picture of the Nan family’s adopted son and the Mu family’s newly found daughter are cuddling together and is very intimate with each other.\n\nEveryone mocked her saying that she wanted to fly up the branch and become a Phoenix, but she hooked up with the wrong person.\n\nWho does not know that the adopted son of the Nan family is a dragged oil bottle that is good for nothing?\n\nAt the Nan family’s banquet, the head of the Nan family personally opened a car door and the person who got off the car had a delicate face and billowing lips, fascinating all women.\n\nA girl in a luxurious dress also got out of the car and is half-hugged by him. \n\n“Let’s go, dragged oil bottle…”\n\nNote: Dragged oil bottle is a derogatory phrase that refers to unwanted children by either stepmothers/stepfathers.>"
}