{
	"url": "https://www.novelupdates.com/series/tianbao-fuyao-lu/",
	"title": "Tianbao Fuyao Lu - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/01/E9B769BB-4584-4BD8-8563-A8E0217DEB7F.jpeg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Comedy   Fantasy   Smut   Xuanhuan   Yaoi   ",
	"tags": "Adapted to Anime   Adapted to Drama CD   Adapted to Manhua   Ancient China   Exorcism   First-time Interc**rse   Half-human Protagonist   Handsome Male Lead   Magic Beasts   Misunderstandings   Naive Protagonist   Older Love Interests   Past Plays a Big Role   Protagonist Strong from the Start   Slow Romance   Strong Love Interests   Unconditional Love   ",
	"rating": "(4.2 / 5.0, 167 votes)",
	"author": "Fei Tian Ye Xiang   非天夜翔   ",
	"year": "\n2017",
	"ranking": "#5262   #6298   #3742   #3540   #1295   ",
	"reviewcount": "10 Reviews sorted by",
	"description": "The phoenix led tens of thousands of birds as they flew over from the end of the horizon. Behind them, clouds akin to a sea of fire billowed as they swept by Chang’an. A golden winged roc perched on top of Xingqing Palace, its pupils reflecting the common people of the bustling Divine Land. Within the silence, dynasties rise and fall, while tides ebb and flow.\r\n\r\nLi Jinglong slowly dragged his body riddled with wounds, releasing a resplendent light from his hand as he kept approaching Hong Jun.\r\n\r\n“The living… are passing travelers…”\r\n\r\nHis low voice resounded through the world, and within an instant, the black fog that enveloped the earth receded before the light.\r\n\r\n“The dead… return home without turning back.”\r\n\r\nThat light is the blazing sun that illuminates the world, stars that twinkle in the night sky, an eternal heart lamp that pierces through the darkness.\r\n\r\n“The world…is a temporary inn. Since time immemorial, countless people have bewailed their short, bitter lives…”\r\n\r\nLi Jinglong closed his eyes and pressed one hand against Hong Jun’s forehead. A white light diffused with a whoosh, covering the battlefield littered with mountains of corpses and seas of blood. Within the shadow of that lamp, the debauchery in Pingkang, the parasol trees of the Exorcism Department bathing in the midsummer sun, the sand and swirling snow in the vast expanse beyond the Great Wall, Ah Tai’s clear singing voice, Mo Rigen and Lu Xu picking leaves in the early morning, Qiu Yongsi’s flying brush strokes that transforms into immortal poems in Li Bai’s cup–\r\n\r\nA young nobleman of Chang’an strolled through its eastern downtown,\r\n\r\nRiding a white horse with a silver saddle as he beamed.\r\n\r\nWhile traversing through Chang’an, flowers kept falling, where on earth is he going?\r\n\r\nSmiling, he enters a tavern where a foreign entertainer performs.\r\n\r\n(Last four lines are from a poem written by Li Bai used to ridicule hedonistic sons from rich families for their extravagant lifestyles.)\r\n\r\nA gong who has bad luck wherever he goes x a shou that can suck away the luck of the people around him>"
}