{
	"url": "https://www.novelupdates.com/series/sign-in-buddhas-palm/",
	"title": "Sign-in Buddha’s Palm - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/03/Signin-Buddhas-Palm.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Martial Arts   Slice of Life   Xuanhuan   ",
	"tags": "Accelerated Growth   Age Progression   Apathetic Protagonist   Appearance Different from Actual Age   Buddhism   Calm Protagonist   Cautious Protagonist   Cheats   Clever Protagonist   Cultivation   Demons   Empires   Fast Cultivation   Game Elements   Gate to Another World   Heavenly Tribulation   Hiding True Abilities   Hiding True Identity   Lazy Protagonist   Loner Protagonist   Low-key Protagonist   Male Protagonist   Overpowered Protagonist   Possession   Ruthless Protagonist   Secret Identity   Selfish Protagonist   Strong to Stronger   System Administrator   Time Skip   Transmigration   Underestimated Protagonist   ",
	"rating": "(3.8 / 5.0, 216 votes)",
	"author": "Back To The Beginning   回到原初   ",
	"year": "\n2020",
	"ranking": "#3567   #3422   #399   #1274   #3113   ",
	"reviewcount": "55 Reviews sorted by",
	"description": "Su Qin crosses into a world where martial artists run rampant, where Buddhist monks from the Yuan Dynasty dominate the world. Nine Yang’s successor’s fist conquered the mountains and rivers, and Xiao Li’s Flying Knife smashed through the void.\n\nBecause Su Qin had no martial arts qualifications, he could only become a sweeping monk in the Shaolin Temple. At this time, the ‘Sign-In System’ was activated.\n\nSign-in in front of Buddha’s Golden Body, gets [Tathagata’s Divine Palm].\n\nSign-in in front of the Arhat Hall, gets [Indestructible Vajra Divine Art].\n\nSign in at the back mountain of Shaolin Temple, gets [Demon and Buddha Golden Body].\n\nThe Shaolin Temple was riddled with treasures, and you can sign in everywhere.\n\nSu Qin decided that he would never leave the mountain without signing in to everything in the Shaolin Temple. And so, he signed-in in the Shaolin Temple for twenty whole years!\n\nTwenty years later, the Shaolin Temple got mixed in the battle between the Righteous and Evil.\n\nThe Demons were fierce and powerful, they blatantly invaded the Shaolin Temple and were pushing forth with great force, but that is until they met Su Qin who was sweeping the floor…>"
}