{
	"url": "https://www.novelupdates.com/series/im-in-a-shuraba-every-time-i-open-my-eyes/",
	"title": "I’m in a Shuraba Every Time I Open My Eyes - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/09/shurabaeverytime2.jpg",
	"noveltype": "(CN)",
	"genre": "Fantasy   Harem   Mature   Psychological   Romance   ",
	"tags": "Acting   Androgynous Characters   Beautiful Female Lead   Black Belly   Cross-dressing   Female Protagonist   Hard-Working Protagonist   Hiding True Identity   Lack of Common Sense   Male Yandere   Manipulative Characters   Modern Day   Multiple Personalities   Obsessive Love   Possessive Characters   Psychopaths   Reverse Harem   Schemes And Conspiracies   System Administrator   Wealthy Characters   World Hopping   Younger Love Interests   ",
	"rating": "(4.0 / 5.0, 48 votes)",
	"author": "Xiao Wu Jun   小吾君   ",
	"year": "\n2016",
	"ranking": "#6970   #6367   #5790   #9148   #5670   ",
	"reviewcount": "13 Reviews sorted by",
	"description": "Bai Xiyue opened her eyes to see a high-end restaurant with an elegant ambience and panoramic view.\n\nSystem: You're currently on a date. The person opposite you is your boyfriend No. 1, but No. 2 and No. 3 are about to arrive on the battleground. Please refrain from triggering a shuraba!\n\nThe F*ck???\nBai Xiyue: What happens if it's triggered?\n\nSystem: Blackening, imprisonment, [bleep], dismemberment, do you understand?\n\nBai Xiyue took a deep breath then escaped to the bathroom after performing a convoluted operation to avoid No. 2 and No. 3.\n\nSystem: Your task is to break up with the four targets without triggering their blackening condition.\n\nBai Xiyue: Four? And the other one?\n\nSystem: The crossdresser next door.\n\nBai Xiyue looked at the toilet door panel and began to lose her head.\n\n#Trying to break up every day\n#What is it like to pedal N boats?\n#A Yandere happy ending can't be done\n#Dramatic battle for survival\n\nNote: Shuraba (Scene of Carnage/Mayhem)- a Japanese term used to describe a scenario where an individual gets caught up in a volatile situation involving multiple love interests. >"
}