{
	"url": "https://www.novelupdates.com/series/the-grand-princess/",
	"title": "The Grand Princess - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/08/The-Grand-Princess.jpg",
	"noveltype": "(CN)",
	"genre": "Drama   Fantasy   Historical   Mature   Psychological   Romance   ",
	"tags": "Ancient China   Arranged Marriage   Beautiful Female Lead   Betrayal   Bickering Couple   Complex Family Relationships   Enemies Become Lovers   Female Protagonist   Inferiority Complex   Multiple Reincarnated Individuals   Politics   Power Couple   Pregnancy   Reincarnation   Royalty   Schemes And Conspiracies   Second Chance   Smart Couple   Unreliable Narrator   ",
	"rating": "(4.6 / 5.0, 149 votes)",
	"author": "Mo Shu Bai   墨书白   ",
	"year": "\n2020",
	"ranking": "#1160   #2038   #2566   #3447   #1894   ",
	"reviewcount": "42 Reviews sorted by",
	"description": "Li Rong and Pei Wenxuan married at the age of 18.\r\n\r\nLi Rong used Pei Wenxuan’s family background to avoid disaster, and Pei Wenxuan used Li Rong’s identity as Princess to establish himself.\r\n\r\nThey married for political reasons, without the slightest bit of affection.\r\n\r\nLater on, she lost herself in the midst of wine, song and dance. As for him, he had a home yet did not bother coming home because he already had someone in his heart…\r\n\r\nHusband and wife for 30 years, yet nothing between them but power.\r\n\r\nIn the end, it was hardly surprising that someone turned them against each other, leading them to die under each other’s schemes.\r\n\r\nHowever, when they woke up, they had actually returned to the year when they were 18 years old, returning to the most difficult time in their lives.\r\n\r\nSo Pei Wenxuan went to look for Li Rong.\r\n\r\n“Does Your Highness feel that we should go through this marriage again?”\r\n\r\n“Let’s do it…”\r\n\r\n“Then this humble one must get rid of your ‘Guest Official’ first.”\r\n\r\n“Do you think I’ll let your sweetheart off?!”\r\n\r\nAfter a long wordless silence, Pei Wenxuan spoke again: “How about we bear with one another for the time being? In two years, when we each have power in our hands, you and I will divorce. From then on, if there are grievances, settle those grievances, if there are grudges, settle those grudges. What does the Princess think?”\r\n\r\nLi Rong hesitated for a moment, and then said: “Fine, go ahead with it first…”\r\n\r\nLater, Pei Wenxuan and Li Rong secured the power to control the Imperial Court. Seeing Li Rong write up the divorce letter at home, Pei Wenxuan looked left and right, considering the situation from all angles, then finally walked into the study. “The children are already this old, how about we keep living like this for a while?”>"
}