{
	"url": "https://www.novelupdates.com/series/advent-of-the-archmage/",
	"title": "Advent of the Archmage - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2016/09/180-2.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Fantasy   Harem   Supernatural   Tragedy   ",
	"tags": "Alchemy   Artifact Crafting   Automatons   Average-looking Protagonist   Beautiful Female Lead   Calm Protagonist   Cautious Protagonist   Cheats   Clever Protagonist   Crafting   Demi-Humans   Demons   Determined Protagonist   Dragons   Eidetic Memory   Elves   Enlightenment   Friendship   Game Elements   Genius Protagonist   Gods   Hard-Working Protagonist   Kingdom Building   Love Interest Falls in Love First   Lucky Protagonist   Magic   Male Protagonist   Medieval   Modern Knowledge   Monsters   Necromancer   Nobles   Polygamy   Righteous Protagonist   Romantic Subplot   Royalty   Schemes And Conspiracies   Souls   Strategist   Strong Love Interests   Sword And Magic   System Administrator   Transmigration   Transported into a Game World   Wars   Weak to Strong   Wizards   ",
	"rating": "(3.8 / 5.0, 432 votes)",
	"author": "Mo Xiang   墨乡   墨鄉   ",
	"year": "\n2016",
	"ranking": "#2000   #2000   #366   #290   #722   ",
	"reviewcount": "58 Reviews sorted by",
	"description": "Link was the top Archmage in the entire server. He had just defeated the strongest boss, the Lord of The Deep, Nozama with his party. However, instead of going back to town, he was transported to a secret location with pixelated CG. \n\nIt sort of felt like a vacuum, and within it came a glorious and commanding voice that calls himself the God of Light. \n\n“Link, would you be willing to be the saviour who will pull the World of Firuman out from the churning abyss?” \n\nWhat a huge mission! If it was in the real world, Link would have rejected it immediately. However, he was bent on being the hero in game.\n\n“Bring it on!” Link answered confidently. \n\n“Then, best of luck.” \n\nAnd so began Link’s journey of magic, friendship, betrayal, love and despair in the ever changing World of Firuman.>"
}