{
	"url": "https://www.novelupdates.com/series/nonlinear-love/",
	"title": "Nonlinear Love - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/02/Nonlinear-Love.jpeg",
	"noveltype": "(CN)",
	"genre": "Comedy   Romance   School Life   Slice of Life   Yaoi   ",
	"tags": "Bickering Couple   Calm Protagonist   Caring Protagonist   Cautious Protagonist   Clever Protagonist   Cold Protagonist   Couple Growth   Destiny   Doting Love Interests   Family Business   Fast Learner   Fated Lovers   Friendship   Handsome Male Lead   Protagonist Strong from the Start   Single Parent   Strong Love Interests   Time Travel   ",
	"rating": "(3.8 / 5.0, 22 votes)",
	"author": "傅云见   ",
	"year": "\n2021",
	"ranking": "#2000   #2000   #10461   #8526   #9150   ",
	"reviewcount": "No Reviews",
	"description": "Su Lian’s lover, Chi Wang, died at the age of 25 because of lung cancer. When he was in sorrow, Su Lian met a master who told him to travel back to the past, solved the mistake, and changed the ending.\n\nBack in high school, Su Lian had another watch in his hand. He only needed to move the pointer, and he would be able to travel through times. The first time Su Lian met Chi Wang was when he stood outside the school with his schoolbag, his expression also became complicated.\n\nHis perfect and calm boyfriend didn’t have a bad habit…\n\nHe was a good student of good character. Even the teacher spoke highly of him, and he got a lot of admiration from other students…\n\nHe also became the newly rich man in the business world after starting the business for three years.\n\nAt this moment, Chi Wang was hanging around, still wearing the uniform. He squatted on the wall with an unrestrained face and then jumped down.\n\nSu Lain’s heart was filled with bitter hatred, thus he couldn’t help kicking the man.\n\n…\n\nChi Wang felt the new transfer student was crazy. He was annoyed. Hence, he complained this to his brothers, “Supervising Laozi* to go to bed early, get up early, study hard, and do morning exercise? That’s fine. However, even my private’s life also needed to be managed by him. Does his family live in the Pacific Ocean**???”\n\nLater, Chi Wang’s brothers were stunned upon seeing their boss gradually subdued by the heartless transfer student.\n\nThose brothers: “Master Wang, do you remember your previous resistance?”\n\nChi Wang replied casually, “I enjoy it quite much now.”\n\n*T/N: It means “I, your father” which used in anger, out of contempt, or arrogantly.\n\n**T/N: It’s an Internet slang word that describes a place or a person that likes to restrain others and always sets up unexplainable rules.>"
}