{
	"url": "https://www.novelupdates.com/series/quick-transmigration-after-villain-reaches-full-level/",
	"title": "Quick Transmigration: After Villain Reaches Full Level - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/06/Quick-Transmigration-After-Villain-Reaches-Full-Level.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Fantasy   Mature   Romance   Sci-fi   Supernatural   ",
	"tags": "Ancient China   Antihero Protagonist   Arrogant Characters   Beautiful Female Lead   Calm Protagonist   Carefree Protagonist   Clever Protagonist   Confident Protagonist   Cultivation   Female Protagonist   Interdimensional Travel   Love Interest Falls in Love First   Magic   Persistent Love Interests   Power Couple   Protagonist Strong from the Start   Reincarnation   System Administrator   Transmigration   World Hopping   ",
	"rating": "(4.6 / 5.0, 8 votes)",
	"author": "Mo Ling   墨泠   ",
	"year": "\n2021",
	"ranking": "#2000   #2000   #11603   #12115   #11390   ",
	"reviewcount": "1 Review sorted by",
	"description": "Hua Wu has been a villain in the Space-Time Alliance for many years, laying a foundation for the success of countless protagonists. Seeing that she was about to save enough points for retirement, she was forced to continue working as a guarantor to pay off her debts because her bad friends owed huge amounts of points and ran away.\n\nWork is work, but no one told her that she has to change department!\n\nWhen Hua Wu, who has outstanding achievements and was selected as the best villain every year, turned into a heroine… Everyone just wants her to retire as soon as possible.\n\nAlliance: You are a heroine now, please control your behavior and don’t rob the villains of their jobs.\n\nHua Wu is full of apologies: Sorry, I’m used to being a villain. I will pay attention next time.\n\nThe Alliance watches her say sorry while pressing people on the ground and falls into silence.\n\nAlliance: Do the villain’s work, so that the villain has no work to do, very good.\n\nHua Wu: You can consider me a villain.\n\nVillain: Goodbye!\n\nHua Wu politely says ‘goodbye’ and give a big gift package – if you don’t do it, then die.>"
}