{
	"url": "https://www.novelupdates.com/series/douluo-dalu-2-the-unrivaled-tang-sect/",
	"title": "Unrivaled Tang Sect - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2017/03/eyJ1cmwiOiJodHRwczovL2Nkbi5kaXNjb3JkYXBwLmNvbS9hdHRhY2htZW50cy8yNjAzMjI5MTgxMTcwMTU1NTIvMjg5MTY5MjcyMDIwNzk1MzkyL0hZSC5qcGVnIn0.jpeg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Fantasy   Martial Arts   Mystery   School Life   Shounen   Xuanhuan   ",
	"tags": "Adapted to Anime   Adapted to Manhua   Battle Academy   Battle Competition   Beasts   Beautiful Female Lead   Cultivation   Devoted Love Interests   Evil Organizations   Genius Protagonist   Godly Powers   Gods   Handsome Male Lead   Hard-Working Protagonist   Hiding True Abilities   Magical Technology   Male Protagonist   Martial Spirits   Necromancer   Revenge   Romantic Subplot   Slow Romance   Soul Power   Spirit Advisor   Teamwork   Wars   Weak to Strong   ",
	"rating": "(3.9 / 5.0, 353 votes)",
	"author": "Tang Jia San Shao   唐家三少   ",
	"year": "\n2012",
	"ranking": "#5262   #2000   #192   #471   #896   ",
	"reviewcount": "36 Reviews sorted by",
	"description": "The legend of the continent, the battle that brought fame; the Sacred Phoenix Lady, the Windfire Meteor Godrealm saber-art; the pair that ascend and fuse, the golden sun and the blue moon, the fury of the crashing thunder. There is no magic, no battle qi, nor any martial arts in this land. However, there are martial spirits. Ten thousand years have passed since the founding of the Tang Sect on the Douluo continent, and it has declined. A new, proud generation of heaven’s chosen has been born. Can the new generation of Shrek’s Seven Devils rally the Tang Sect and once more compose the song of the Unrivaled Tang Sect?\n\nA million-year-old spirit beast, a sacred deathgod that holds the sun, the moon, and the stars in his hands, and a brand new spirit tool system which caused the fall of the Tang sect. One miracle shall occur after another.\n\nCan the Tang Sect’s hidden weapons rally the winds, and can the glory of the Tang Sect ascend once more? All of this will be continued in the second installment of Douluo Dalu—The Unrivaled Tang Sect!>"
}