{
	"url": "https://www.novelupdates.com/series/the-rich-second-generation-villains-father/",
	"title": "The Rich Second Generation Villain’s Father - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/06/The-Rich-Second-Generation-Villains-Father.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Fantasy   Harem   Martial Arts   ",
	"tags": "Adultery   Alternate World   Antihero Protagonist   Appearance Changes   Arrogant Characters   Businessmen   Charming Protagonist   Cold Protagonist   Cultivation   Cunning Protagonist   Evil Protagonist   Genius Protagonist   Handsome Male Lead   Harem-seeking Protagonist   Jack of All Trades   Level System   Loyal Subordinates   Maids   Male Protagonist   Manipulative Characters   Medical Knowledge   Modern Day   Multiple Transported Individuals   Netori   Parody   Playboys   Polygamy   Proactive Protagonist   Ruthless Protagonist   Selfish Protagonist   Servants   System Administrator   Transmigration   Weak to Strong   Wealthy Characters   Younger Love Interests   ",
	"rating": "(3.6 / 5.0, 75 votes)",
	"author": "火影之光   ",
	"year": "\nN/A",
	"ranking": "#272   #380   #2308   #494   #4849   ",
	"reviewcount": "8 Reviews sorted by",
	"description": "Transmigrating into a parallel world; becoming a billionaire that everyone looks up to. Qing Tian, who had thought he could finally live a life of wealth, suddenly finds that this world seems just a little strange… His son, a junior studying in college was beaten by a stranger who had just arrived in the city? Does this kid want to slap my son across his face during the student union?    \n\n   【Ding! the Ultimate Villain System is awakened】\n\n   【Reward for successfully educating my son: Divine Toxic Medicine】   \n\n   【Reward for successfully changing the plot trend: God-level car skills】   \n\n   【Reward for successfully capturing the female lead: plus…】…\n\nAs the father of a villainous rich kid, not only should he educate his son, but he should also do whatever he can to deal with the protagonist…>"
}