{
	"url": "https://www.novelupdates.com/series/i-am-the-commander-of-the-second-male-leads-knights/",
	"title": "I Am The Commander Of The Second Male Lead’s Knights - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/11/Im_The_Grand_Master_Of_The_Order_Belonging_To_Deuteragonist.jpg",
	"noveltype": "(KR)",
	"genre": "Action   Drama   Fantasy   Harem   Romance   Tragedy   ",
	"tags": "Abusive Characters   Aristocracy   Beautiful Female Lead   Boss-Subordinate Relationship   Caring Protagonist   Child Abuse   Childhood Friends   Dense Protagonist   Depictions of Cruelty   Determined Protagonist   Devoted Love Interests   European Ambience   Family Conflict   Female Protagonist   Handsome Male Lead   Knights   Love Interest Falls in Love First   Nobles   Past Trauma   Power Couple   Reincarnation   Spirit Users   Sword And Magic   Sword Wielder   Tragic Past   Transmigration   Transported to Another World   ",
	"rating": "(4.1 / 5.0, 89 votes)",
	"author": "Siya   시야   ",
	"year": "\n2020",
	"ranking": "#2114   #2483   #2993   #3520   #2190   ",
	"reviewcount": "15 Reviews sorted by",
	"description": "To meet once again.\n\nNina found herself reincarnated in the world of a novel she had read by chance. \nBesides that, the place to where she was sold after losing her family was the house of Adrian, the Second Male Lead. \n\nWhen he finally meets the heroine, you would think that he’s destined to walk a flowery path, but only for a very short time.\n\n’You can’t just leave the second male lead lose out on all those sweet stuff!’ \n\nFor Adrian, who is only 9 years old, his childhood is filled with thorns. \n\nNow that it has come to this, Nina will twist the original story for Adrian. \n\nAdrian’s voice was cold. \n\n“Young Master?”\n“Why did you do that?” \n“Are you angry?”\n“You’re asking if I’m angry?” \n\nNina flinched and straightened herself up.\n\nIt was dark and Nina couldn’t see his face well.\n\n“Don’t talk like that. Like it’s nothing, like it’s no big deal to you.” \n\nPerhaps she twisted the story a little too much.\n>"
}