{
	"url": "https://www.novelupdates.com/series/dressed-as-a-full-level-bosss-palm-pet/",
	"title": "Dressed as A Full-level Boss’s Palm Pet - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/01/Dressed-as-A-Fulllevel-Bosss-Palm-Pet.jpg",
	"noveltype": "(CN)",
	"genre": "Drama   Fantasy   Mature   Romance   Slice of Life   ",
	"tags": "Beautiful Female Lead   Childcare   Childish Protagonist   Couple Growth   Doting Love Interests   Doting Older Siblings   Doting Parents   Familial Love   Female Protagonist   Handsome Male Lead   Multiple Reincarnated Individuals   Poor to Rich   Reincarnation   ",
	"rating": "(2.6 / 5.0, 9 votes)",
	"author": "Mu Xia Yi   慕夏衣   ",
	"year": "\n2021",
	"ranking": "#2000   #2000   #9869   #9888   #11445   ",
	"reviewcount": "4 Reviews sorted by",
	"description": "Regarding Bai Taotao in Ruyi Village, everyone has nothing to say except for envy, jealousy and hatred:\n\n——She is obviously a fool, but looks like a fairy!\n\n——The younger generations in the village love her.\n\n——She was so spoiled by the whole family that she can barely walk.\n\n——The returnee [1] gao fushuai [2] just likes her, but she does not want to marry!\n\nBai Taotao, the person in question, was irritated because she had unexpectedly failed to overcome the catastrophe, was struck by lightning, and her soul was pierced into a fool's body.\n\nThis dreadful place is so desolate and impoverished that she can't even eat a full meal. Fortunately, the family took pity on this little fool who knew nothing about hunger and couldn't even speak clearly. They worked together to make her white and tender, even though they didn't want to attract countless covetous eyes.\n\nAt that time, a young, educated youth in a white shirt carrying a heavy iron plow walked past her.\n\nBai Taotao's watery apricot eyes widened. This man is brimming with spiritual energy and has the ability to cure her s*upidity!\n\nShe chased after the male youth, tugging at the corner of the youth's clothes, taking a deep breath of the wonderfully fragrant and rich aura, and prettily [3] said: “Brother Blacksmith… good, delicious!\n\nEducated youth Song Zhi: ? ? ?\n\nIt’s obvious that the white, tender, and watery little beauty in front of him looks more delicious, right?\n\nLater, people in the village became more jealous of Bai Taotao. She became smarter and more beautiful.\n\nThe people who wanted to harm her and those who had harmed her were all miserable. Bai Taotao and her entire family prospered.\n\nTwenty years later, Song Zhi became a well-known scientist, was even recorded in textbooks, and praised as an outstanding figure.\n\nForty years later, Song Zhi said on a TV program: “Thanks to my wife, otherwise I wouldn’t be what I am today, and all my honors today belong to her.”\n\nLater, according to the villagers who came back from visiting relatives, Song Zhi would boil water to soak Bai Taotao’s feet every night. Not only did he really rub her feet seriously and dry them carefully with a towel, but he also personally applied a fragrant moisturizer to her. Finally, he would pick up a bottle of bright and beautiful nail polish and patiently paint her toenails.>"
}