{
	"url": "https://www.novelupdates.com/series/i-married-an-exasperating-eunuch/",
	"title": "I Married an Exasperating Eunuch - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/07/exasperatingeunuch1.jpg",
	"noveltype": "(CN)",
	"genre": "Fantasy   Romance   ",
	"tags": "Adapted to Manhua   Ancient China   Character Growth   Clever Protagonist   Comedic Undertone   Court Official   Cunning Protagonist   Eunuch   Fearless Protagonist   Female Protagonist   Inferiority Complex   Loyal Subordinates   Politics   Royalty   Shameless Protagonist   Slow Romance   Stubborn Protagonist   Transmigration   ",
	"rating": "(4.2 / 5.0, 99 votes)",
	"author": "Ling Luo Cheng Ni   零落成泥   ",
	"year": "\n2018",
	"ranking": "#3802   #3375   #2984   #4721   #3808   ",
	"reviewcount": "30 Reviews sorted by",
	"description": "Chen Hui had traveled through the passage of time, but – when she woke up, there wasn’t even a single female servant surrounding her who exclaimed her return to consciousness.\n\n Instead, the only person standing in front of her was an exasperating eunuch who pinned her with a malicious glare whilst remarking sarcastically, “Since Lady Chen despises and shuns lowly eunuchs such as myself, I won’t force myself upon you. \n\nBut, if you’re hoping for me to release and return you back to your family, then my only advice is for you to give up all such hopes! You will never be able to leave my household for the rest of your life, so you have little choice but to stay here till you die!”\n\nChen Hui: …\n\nIt turns out, that Chen Hui had time travelled, and awoken in the body of a lady who had attempted to commit suicide (by ramming her head against the pillar) to display her staunch refusal to marry an exasperating eunuch. \n\nHowever, in order to fill her belly full and keep her body warm, Chen Hui had no choice but to continuously think of different ways and means to approach the exasperating eunuch, to get to know more about the exasperating eunuch, to please and bootlick the exasperating eunuch, and to seduce… No, wait, forget about seducing that exasperating eunuch.\n\nThe eunuch Li Youde had spent his entire life being a callous, deceitful, and sly person. Never in his wildest dreams did he think that all he could think about during his most desperate hour was – how the mischievous, pampered, trouble-making enchantress at home would be able to continue living a worry-free and comfortable life without him by her side.>"
}