{
	"url": "https://www.novelupdates.com/series/the-charm-of-soul-pets/",
	"title": "The Charm of Soul Pets - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2016/08/The-Charm-of-Soul-Pets-1.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Drama   Fantasy   Mature   Seinen   Xuanhuan   ",
	"tags": "Adapted to Manhua   Apathetic Protagonist   Arrogant Characters   Artifacts   Beast Companions   Beasts   Beautiful Female Lead   Betrayal   Bloodlines   Calm Protagonist   Cautious Protagonist   Character Growth   Cold Protagonist   Confident Protagonist   Cultivation   Cunning Protagonist   Depictions of Cruelty   Determined Protagonist   Evolution   Famous Protagonist   Fast Cultivation   Half-human Protagonist   Handsome Male Lead   Hiding True Abilities   Hiding True Identity   Kidnappings   Late Romance   Long Separations   Male Protagonist   Monster Tamer   Mysterious Family Background   Pets   Proactive Protagonist   Romantic Subplot   R*pe   Ruthless Protagonist   Soul Power   Souls   Strategic Battles   Strength-based Social Hierarchy   Summoning Magic   Survival   Time Skip   Underestimated Protagonist   Weak to Strong   ",
	"rating": "(4.1 / 5.0, 681 votes)",
	"author": "Fish’s Sky   鱼的天空   ",
	"year": "\n2013",
	"ranking": "#6970   #2000   #48   #2313   #253   ",
	"reviewcount": "102 Reviews",
	"description": "Many islands dotted the vast oceans of this world. However, some of the islands were a lot more sinister than the rest. Those islands, known as Nightmare Islands, were true nightmares to all but the strongest and most fortunate. Children were kidnapped and thrown on these isolated islands by the Nightmare Palace, forced to sign soul pacts with evil soul pets: Nightmares. These devils slowly devoured the souls of their trainers to grow stronger. If the children did not cultivate fast enough, their souls will be devoured whole, leaving only an empty husk behind.\n\nChu Mu, the protagonist, was an heir to the Chu Clan, but due to a plotted murder, he was thrown on the island, sentencing him to almost certain death. Dancing on the edge of life and death, he struggled to survive with a small Moonlight Fox he captured. When he finally escaped the devilish foremen on his island, he couldn’t help but let a breath out. But little does he know, the experience was only a beginning to a fated journey with his little Moonlight Fox…>"
}