{
	"url": "https://www.novelupdates.com/series/the-record-of-unusual-creatures/",
	"title": "The Record of Unusual Creatures - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2017/11/The-Record-of-Unusual-Creatures.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Comedy   Fantasy   Mystery   Sci-fi   Slice of Life   Supernatural   ",
	"tags": "Adapted to Anime   Adapted to Manhua   Adopted Children   Aliens   Apartment Life   Army   Artificial Intelligence   Automatons   Average-looking Protagonist   Caring Protagonist   Character Growth   Childcare   Demi-Humans   Demons   Dragons   Dreams   Dwarfs   Elves   Fantasy Creatures   Fleet Battles   Genetic Modifications   Ghosts   God-human Relationship   Goddesses   Gods   Hunters   Interdimensional Travel   Investigations   Late Romance   Leadership   Legends   Lost Civilizations   Magic   Magical Technology   Male Protagonist   Mind Control   Modern Day   Mutated Creatures   Mystery Solving   Mythical Beasts   Mythology   Outer Space   Priests   Proactive Protagonist   Prophecies   Quirky Characters   Religions   Saving the World   Secret Organizations   Sentient Objects   Special Abilities   Spirits   Succubus   Sudden Strength Gain   Sword And Magic   Sword Wielder   Teamwork   Technological Gap   Vampires   Wars   Weak to Strong   Werebeasts   Wizards   World Hopping   World Travel   World Tree   ",
	"rating": "(3.9 / 5.0, 195 votes)",
	"author": "Yuan Tong   远瞳   ",
	"year": "\n2014",
	"ranking": "#6970   #2000   #1480   #5635   #2836   ",
	"reviewcount": "31 Reviews sorted by",
	"description": "Hao Ren (literally means 'good man'), as his Chinese name suggested, is a good man, and his ideal was to live a restful, comfortable life as a landlord. At least that was his plan before a couple of abnormal creatures rented his house.\n\nA remote, outdated big apartment, a bunch of rather abnormal non-human creatures, and a labor contract from the 'god', the three factors combined lead him to be the busiest landlord and most supernatural 'babysitter'. The story of the most complicated, erratic and abnormal landlord and tenants started from here.\n\n'Ever since I put my fingerprint on the labor contract, I knew I was roped into something terrible...'\n\nAs a person who is down-to-earth as well as a good Samaritan, Hao Ren desires to live the rest of his life as a benevolent landlord. Stumbling into a curious yet mysterious lady, he began his journey of 'collecting' abnormal and supernatural tenants.\n\nHis life only became more chaotic when he receives a labor contract from 'God'. Discover the many races, myths and worlds that lie beyond what humans define as normal! This bizarre fantasy full of fun is sure to bring you on a crazy rollercoaster of emotions!>"
}