{
	"url": "https://www.novelupdates.com/series/after-being-betrayed-the-immortal-master-ran-away-with-the-demon-venerable/",
	"title": "After Being Betrayed, The Immortal Master Ran Away With The Demon Venerable - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/09/After-Being-Betrayed-The-Immortal-Master-Ran-Away-With-The-Demon-Venerable.jpg",
	"noveltype": "(CN)",
	"genre": "Adventure   Romance   Xuanhuan   Yaoi   ",
	"tags": "Ancient Times   Animal Characteristics   Appearance Different from Actual Age   Betrayal   Calm Protagonist   Cold Protagonist   Cultivation   Demon Lord   Demons   Love Interest Falls in Love First   Master-Disciple Relationship   Misunderstandings   Obsessive Love   Past Plays a Big Role   Persistent Love Interests   Poisons   Power Couple   Strong Love Interests   Younger Love Interests   ",
	"rating": "(4.1 / 5.0, 20 votes)",
	"author": "何所往   ",
	"year": "\n2021",
	"ranking": "#898   #461   #8955   #1920   #7504   ",
	"reviewcount": "2 Reviews sorted by",
	"description": "As Mingguang Sect’s esteemed Immortal Master, Yi Ning had never experienced much heartbreak and suffering. He had always expected his life to be smooth-sailing, and was only waiting to ascend before marrying his disciple with whom he shared mutual affection.\n\nHowever, he had never expected that on a rainy night, his disciple brought back a childhood friend.\n\nThey were close and intimate, to the point… of sharing a bed.\n\nStanding before the bed where they were entwined, Yi Ning’s heart was as cold as sunken ice. He had wanted to end it all cleanly and straightforwardly, yet had never expected that his disciple not only wanted his childhood friend, but wanted his Shizun too.\n\nHis disciple shattered his spiritual core and laid down a hex, throwing him into the main hall to await nightfall to consummate their relationship.\n\nJust as he had fallen into despair and wanted to end his life, he unexpectedly discovered a strange book. The book detailed his life, and the him it described, from beginning to end, was nothing more than a tool used to satisfy his disciple’s desire to conquer, lowly and wretched as a cultivation furnace.\n\nYi Ning’s head spun, and his heart gave birth to a strong hatred. He dragged his wrecked body to the back of the mountain and released the Demon Venerable Yan Xuan, who he had personally sealed nine years ago.\n\nIn return for undoing the seal, Yan Xuan would aid him in escaping.\n\nAfter the man heard the reason why, he leaned against the wall and smiled with a hint of mockery. Yi Ning had thought he was going to ridicule him for having deserved it, being betrayed by an ingrate who bit the hand that fed him.\n\nYet, what he never expected was for Yan Xuan to reach out and tug him into his embrace, and the words that left his mouth were instead:\n\n“You fool, I’ll help you take revenge.”\n\nAfter this, he killed all those who wronged him, and cradled him close to his heart.\n\nHe wants to shatter your cultivation and mangle your limbs, to turn you into a bird in a cage, free for him to humiliate.\n\nYet, with this lowly and dirty heart of mine, I want to pull you from the swamp and cut down the heavens for you.>"
}