{
	"url": "https://www.novelupdates.com/series/surprise-the-supposed-talent-show-was-actually/",
	"title": "Surprise! The Supposed Talent Show Was Actually–?! - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/08/0070h8Dply1g5hv27tk3aj308c0boq5s.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Comedy   Mystery   Psychological   Sci-fi   Shounen Ai   ",
	"tags": "Battle Competition   Bisexual Protagonist   Celebrities   Character Growth   Charming Protagonist   Clever Protagonist   Cute Protagonist   Determined Protagonist   Doting Love Interests   Fated Lovers   Futuristic Setting   Game Elements   Genetic Modifications   Handsome Male Lead   Hard-Working Protagonist   Human Experimentation   Interdimensional Travel   Late Romance   Marriage   Military   Misunderstandings   Mysterious Past   Mystery Solving   Mythology   Outer Space   Pets   Popular Love Interests   Possessive Characters   Power Couple   Scientists   Secret Organizations   Secrets   Showbiz   Slow Romance   Smart Couple   Strategic Battles   Strong Love Interests   Survival Game   Teamwork   Thriller   Transplanted Memories   Unlimited Flow   Weak to Strong   Wealthy Characters   ",
	"rating": "(4.6 / 5.0, 512 votes)",
	"author": "Yan Baibai   晏白白   ",
	"year": "\n2018",
	"ranking": "#2773   #2285   #605   #1101   #531   ",
	"reviewcount": "126 Reviews sorted by",
	"description": "Wu Jin, as a trainee from a certain entertainment company, had a peerless, stunning face. He was qualified to debut as a lead performer even if he just sat there and did nothing.\n\nAfter signing up for a certain talent show, the shining path to stardom beckoned to him––\n\nWu Jin: Hold on, why is this show different from what we agreed on? Wasn’t it supposed to be about jumping around, dancing, and singing songs? Why do you have to send me out into the wilderness…\n\nProgram Producer: You’re a once-in-a-century high appearance value competitor! We’re relying on you to save the program’s ratings!\n\nWu Jin: … I seem to be on the wrong show. Wait a minute, this isn’t an idol show, it’s a fighting survival reality show ahhh!!\n\nTen months later, the little cutie who had been thrown into the show––\n\nTurned into a human weapon.\n\nPowering up through various instances, slight entertainment circle elements.\n\nExtremely overpowered gong x little cutie who grows to become an overpowered shou.>"
}