{
	"url": "https://www.novelupdates.com/series/my-one-and-only-love/",
	"title": "My One And Only Love - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/11/Exclusive-Memory.jpg",
	"noveltype": "N/A",
	"genre": "Comedy   Romance   School Life   Slice of Life   ",
	"tags": "Adapted to Drama   Average-looking Protagonist   Character Growth   College/University   Death of Loved Ones   Engineer   Female Protagonist   Handsome Male Lead   Heartwarming   Love Interest Falls in Love First   Modern Day   Older Love Interests   Orphans   Secret Crush   Student-Teacher Relationship   Teachers   ",
	"rating": "(4.5 / 5.0, 15 votes)",
	"author": "Mu Fu Sheng   木浮生   ",
	"year": "\n2011",
	"ranking": "#2000   #2000   #9405   #7990   #9450   ",
	"reviewcount": "5 Reviews sorted by",
	"description": "There is or not someone in your life, where every glance, every smile, every sentence, every word from him are all so special.\n\nHe used to be your teacher.\n\nHe used to be your idol.\n\nHe is also held in high esteem by his colleagues.\n\nBut one day, this person’s identity is only, your man.\n\nIf you fall in love with a person, how much courage do you need to confess to him?\n\nIf he is your teacher, how much perseverance and persistence must you also have?\n\nXue Tong is a third year student in English Language in University A. She was caught by the ‘adorable’ and youthful teacher Mu Cheng He while looking for her cheat sheet on the floor in the exam room. Then he becomes her substitute teacher in her elective subject Russian language. Her hatred for him increases when he requires her to study with him after class.\n\nShe slowly discovers he is a very charismatic and knowledgeable teacher. Thus, gradually, from anger, revenge and hatred, Xue Tong starts to develop a crush on her teacher. But she doesn’t dare to speak out for fear of prejudice.\n\nShe graduated but the love is still hidden in theirs hearts. No one told anyone, just quietly together, helping and comforting each other.>"
}