{
	"url": "https://www.novelupdates.com/series/im-the-white-pig-nobleman-but-with-the-memories-of-my-previous-life-ill-raise-my-little-brother/",
	"title": "I’m the White Pig Nobleman, but With the Memories of My Previous Life, I’ll Raise My Little Brother - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/05/baxrf2e746okalyret2w1nu4jyxm_6h8_o5_xu_5ytq.jpg",
	"noveltype": "(JP)",
	"genre": "Comedy   Fantasy   ",
	"tags": "Absent Parents   Adapted to Manga   Aristocracy   Child Protagonist   Fat to Fit   Gods   Magic   Male Protagonist   Reincarnation   Siblings   Singers   Transmigration   ",
	"rating": "(4.1 / 5.0, 19 votes)",
	"author": "Yashiro   やしろ   ",
	"year": "\n2018",
	"ranking": "#2000   #2000   #8436   #11074   #8051   ",
	"reviewcount": "3 Reviews sorted by",
	"description": "In a world where Western and Asian cultures mix together, the only son of Count Kikunoi from the Kiryuu Empire, is Houchou. His life was already over at the age of 5.\n\nHe, who was born in a corner of the country, has zero allies or useful skills in addition to being overweight.\n\nWhat’s more, it seems that his brother Regulus, who suddenly appeared on his life and was presented for the Count as his brother, will kill him in the future for his right to succeed….\n\nHis only weapons, are the abilities of “cooking and sewing”, that he suddenly acquired along with the memories of his previous life as sprouted Japanese.\n\nIn the midst of all this, Houchou ends up raising his younger brother, but – “My brother is super cute, mmmh?”\n\n–And now he’s acting like an idiot!\n\nHandmade educational toys for his cute little brother and delicious chawanmushi (steamed egg custard)\n\n“With the help of my previous life’s skills and my power as a housekeeper, I’ve been able to improve the rough life of the people living in my territory!”\n\n“Just a small step, and we’ll lead our people and even the country to a better life.”\n\nA fantasy of two young brothers managing their territory!>"
}