{
	"url": "https://www.novelupdates.com/series/the-healer-demands-payment/",
	"title": "The Healer Demands Payment! - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/05/healer.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Romance   Xianxia   ",
	"tags": "Animal Characteristics   Beast Companions   Beautiful Female Lead   Calm Protagonist   Caring Protagonist   Clever Protagonist   Cold Protagonist   Cultivation   Demons   Dense Protagonist   Determined Protagonist   Female Protagonist   Handsome Male Lead   Healers   Hiding True Abilities   Master-Disciple Relationship   Medical Knowledge   Misunderstandings   Multiple Reincarnated Individuals   Past Plays a Big Role   Past Trauma   Pill Based Cultivation   Pill Concocting   Polite Protagonist   Poor to Rich   Possessive Characters   Reincarnation   Second Chance   Slow Growth at Start   ",
	"rating": "(4.2 / 5.0, 189 votes)",
	"author": "Tang Shan Yue   糖山月   ",
	"year": "\n2019",
	"ranking": "#460   #373   #504   #745   #1012   ",
	"reviewcount": "59 Reviews sorted by",
	"description": "In the past, there was a small cannon fodder who wholeheartedly dedicated herself to the medicinal path.\n\nOnly after dying once did she learned that even if she was brilliant, she could only be an insignificant side character used to emphasize the female lead’s limelight. Any relationship with the male lead and other supporting male characters would bring her bad luck.\n\nWhen going out to collect some medicinal herbs in Qingfeng Valley, she kindly rescued a male side character. The man woke up and saw the female lead and became eternally grateful to her instead. He thought that the monster that hurt him was brought by the small cannon fodder so she was punished.\n\nThe cycle repeated and eventually everyone she saved blindly loved the righteous female lead. Ultimately she was killed by one of the men who was entangled with the female lead.\n\n……\n\nSo after her rebirth, she began to firmly adhere to the principle of ‘pay me first, then I’ll cure you’.\n\nMale cannon fodders who love the female lead, charge them triple fee!\n\nMale side characters who ambiguously entangled with the female lead, charge them 10 times!\n\nMale lead, the most important one, charged him 100 times!\n\nShe single heartedly insisted on using money to distance herself from those men and drew a clear boundary between them. But her ability was too high, that the male lead and side characters from all over the world always came to her for help…\n\nShe finally became the richest person in cultivation world!>"
}