{
	"url": "https://www.novelupdates.com/series/sweet-husband-pampers-his-wife/",
	"title": "Sweet Husband Pampers His Wife - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/07/1974s.jpg",
	"noveltype": "(CN)",
	"genre": "Drama   Josei   Romance   Slice of Life   Tragedy   ",
	"tags": "Amnesia   Beautiful Female Lead   Betrayal   Calm Protagonist   Caring Protagonist   Character Growth   Charismatic Protagonist   Charming Protagonist   Coming of Age   Couple Growth   Cruel Characters   Death of Loved Ones   Depression   Determined Protagonist   Devoted Love Interests   Doting Love Interests   Early Romance   Familial Love   Family   Flashbacks   Handsome Male Lead   Heartwarming   Kind Love Interests   Male Protagonist   Marriage   Modern Day   Multiple Reincarnated Individuals   Past Plays a Big Role   Past Trauma   Personality Changes   Second Chance   Unconditional Love   ",
	"rating": "(3.1 / 5.0, 127 votes)",
	"author": "Mo Yue   沫曰   ",
	"year": "\n2018",
	"ranking": "#6970   #2000   #2702   #4032   #2412   ",
	"reviewcount": "26 Reviews sorted by",
	"description": "Can love find a second chance?\r\n\r\nMo Lixin had three medical operations in her previous life.\r\n\r\nThe first time, she gave birth to his child, but he thought it was some other man's child. The second time, she had a coronary heart disease, but he never knew. The third time, she needed to replace her liver. but she never breathed again.\r\n\r\nShe laid down to rest, never to awake.\r\n\r\nHe remembers her sweet face in particular.\r\n\r\nOnly when death comes near does one realize a love lost through the seasons of time.\r\n\r\nI realize that you are the source of my happiness. I have hurt you… caused you pain… in the next life, I hope to make up for my mistakes… I will guard your happiness… make you laugh… forever… I’m in love with you…\r\n\r\nGiven a second chance, Ji Nanfeng vowed to never let her suffer. He vowed, forever and always. For her, he’d trod through hell and fire to keep her safe.>"
}