{
	"url": "https://www.novelupdates.com/series/the-villainess-that-was-once-a-vrmmo-player/",
	"title": "The Villainess That Was Once A VRMMO player - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/01/The-Villainess-That-Was-Once-A-VRMMO-player_1643646223.png",
	"noveltype": "(JP)",
	"genre": "Adventure   Comedy   Fantasy   Romance   Shoujo   ",
	"tags": "Abandoned Children   Age Progression   Beautiful Female Lead   Cheats   Child Abuse   Death   Depictions of Cruelty   Discrimination   Elemental Magic   Fantasy Creatures   Female Protagonist   Gods   Half-human Protagonist   Protagonist Strong from the Start   Racism   Reincarnated in a Game World   Reincarnation   Romantic Subplot   Ruthless Protagonist   Special Abilities   Sudden Strength Gain   Villainess Noble Girls   Weak to Strong   ",
	"rating": "(3.7 / 5.0, 88 votes)",
	"author": "Haru no Hi   Harunohi Biyori   春の日   春の日びより   ",
	"year": "\n2017",
	"ranking": "#98   #57   #1123   #52   #3217   ",
	"reviewcount": "13 Reviews sorted by",
	"description": "A young girl, who was neglected by her family, accidentally died while protecting a [Child of God] who would save the world. She was offered to be reincarnated into a world identical to the VRMMORPG that she was familiar with by a mysterious entity. That mysterious entity used its power to empower her soul by transforming her previous effort and passion spent in developing and leveling up her game characters into her own powers instead.\n\nHowever, when she turned three years old, she discovered that the world she was reincarnated into was not the least bit similar to the VRMMORPG world. Furthermore, she was compounded by the revelation that she had become a ‘villainess’ who had raised plenty of death flags.\n\n“God, this is not the world you promised me!?”\n\nA flurry of death flags looms over her from an early age. She is now pitted against a powerful heroine, one endowed with beauty, and blessed with mysterious powers. With the help of her wits and bravery – or rather with the power of her VRMMO character – the girl was able to fend off perverted assailants, weather unknown dangers and defy the tragic fate of the game’s Villainess.\n\nWhy did that entity reincarnate her into that body? Why did she have to face the trials that the villainess would have to go through? With more questions than answers, what will happen to our said reincarnated VRMMO player?>"
}