{
	"url": "https://www.novelupdates.com/series/saving-the-black-immortal-venerable/",
	"title": "Saving The Black Immortal Venerable - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/09/Saving-The-Black-Immortal-Venerable_1631234941.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Martial Arts   Romance   Supernatural   Xianxia   ",
	"tags": "Beautiful Female Lead   Betrayal   Bickering Couple   Calm Protagonist   Cold Love Interests   Couple Growth   Cultivation   Demonic Cultivation Technique   Dense Protagonist   Devoted Love Interests   Female Protagonist   Handsome Male Lead   Hard-Working Protagonist   Love Interest Falls in Love First   Multiple Reincarnated Individuals   Multiple Transported Individuals   Mysterious Past   Older Love Interests   Past Plays a Big Role   Secret Identity   Slow Romance   Strong Love Interests   Tragic Past   Weak to Strong   ",
	"rating": "(4.4 / 5.0, 45 votes)",
	"author": "September Flowing Fire   九月流火   ",
	"year": "\n2021",
	"ranking": "#3567   #2413   #6225   #6513   #6198   ",
	"reviewcount": "11 Reviews sorted by",
	"description": "Mu Yun Gui was the white moonlight of the male lead in a cultivation-based book.\n\nMu Yun Gui herself didn't know that she was a short-lived white moonlight, until one day, a junior sister who was the eldest lady from a prominent family came into her life and turned her life upside down.\n\nHer childhood sweetheart slowly got estranged from her and became close to the junior sister. In the end, he even abandoned her to save that junior sister.\n\nWhen Mu Yun Gui plunged into the deep sea, she saw a triumphant smile on the junior sister. \n\nAt that time, she knew that the junior sister was a girl from a different world, and this world was a book. The cause of her cultivation stagnation was that the girl had robbed her luck. \n\nAfter the fall, Mu Yun Gui opened her eyes and found that she was not dead, but fell into an underground cave. \n\nIn the cave, there was a ten-thousand-year-old ice block with a person inside it. Mu Yun Gi thought that this person also like her fell into the forbidden area, and out of good intentions, she unlocked the seal.\n\nJiang Shao Cai was sealed in an ice block for ten thousand years. \n\nSuddenly one day, he was awakened by a girl. The girl was embarrassed, but still smiled at him and said, “Did you fall too? It’s okay, I will save you.”\n\nThe girl didn’t know that the boy she saved was a legendary genius from ten thousand years ago, who was abandoned by the immortal world and fell into the dark.>"
}