{
	"url": "https://www.novelupdates.com/series/a-love-so-beautiful/",
	"title": "A Love So Beautiful - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2017/12/s28330054.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Josei   Romance   School Life   Slice of Life   ",
	"tags": "Adapted to Drama   Awkward Protagonist   Childhood Love   Cold Love Interests   Doctors   Handsome Male Lead   Lovers Reunited   Modern Day   Protagonist Falls in Love First   ",
	"rating": "(4.2 / 5.0, 132 votes)",
	"author": "Zhao Qian Qian   赵乾乾   ",
	"year": "\n2015",
	"ranking": "#1326   #919   #2666   #2733   #2218   ",
	"reviewcount": "27 Reviews sorted by",
	"description": "Television and novels label us boys and girls who are friends, and live awfully close together since young as “childhood sweethearts”, moreover, they generally divide it into two categories:\r\n\r\nOne, the “in love with each other” type. Two people who are close together like siblings, poking honeycombs and getting stung by bees together, stealing sweet potatoes and getting beaten together. By the time the two would look back, only then would they realize that the friendship from long ago has slowly blossomed into love.\r\n\r\nThe other one is the “sees and hates each other” type. Two people who opposes the other with equal intensity, already itching to rush ahead to bite the other when spotted from a distance. When they get the chance, they’d pull the tire valve of each other’s bikes. But later on, when the two would grow up, they would suddenly realize — ah! this is true love.\r\n\r\nUnfortunately, Jiang Chen and I are neither of the above mentioned. In a very long time, me and him were simply just neighbors who live across each other. Him playing his piano daily, me watching Chibi Maruko-chan with gusto. Occasionally, when I forget the content in our homework, I would press the doorbell of their house. He would always mock me, and impatiently ask why I didn’t remember.\r\n\r\nProbably, because I’m seeking out a favor, so I never bickered with him. Of course, it might also be because I don’t like to argue with people since young. I’m someone calm and collected, a little bit extraordinarily.>"
}