{
	"url": "https://www.novelupdates.com/series/my-wife-is-a-beautiful-ceo/",
	"title": "My Wife is a Beautiful CEO - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2016/10/tmp_24750-Ruoxi1921997025.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Drama   Ecchi   Harem   Martial Arts   Mature   Romance   Xuanhuan   ",
	"tags": "An*l   Abandoned Children   Aliens   Arrogant Characters   Artifacts   Assassins   Average-looking Protagonist   Beautiful Female Lead   Bickering Couple   Calm Protagonist   Carefree Protagonist   C*nnilingus   Cold Love Interests   Complex Family Relationships   Confident Protagonist   Cultivation   Cunning Protagonist   Eidetic Memory   First-time Interc**rse   F*llatio   Gangs   God-human Relationship   God Protagonist   Godly Powers   Heavenly Tribulation   Hiding True Abilities   Hiding True Identity   Lazy Protagonist   Male Protagonist   Marriage of Convenience   Modern Day   Mysterious Past   Mythology   Nationalism   Older Love Interests   Organized Crime   Overpowered Protagonist   Perverted Protagonist   Polygamy   Protagonist Strong from the Start   Racism   R*pe Victim Becomes Lover   R*pe   Ruthless Protagonist   Secret Organizations   Shameless Protagonist   Sibling Rivalry   Strong to Stronger   Threesome   Tragic Past   Tsundere   Wealthy Characters   ",
	"rating": "(4.0 / 5.0, 1367 votes)",
	"author": "Cabbage Flatbread   霉干菜烧饼   ",
	"year": "\n2011",
	"ranking": "#327   #519   #46   #736   #161   ",
	"reviewcount": "144 Reviews sorted by",
	"description": "\n\nYang Chen, a graduate from Harvard who is fluent in English, French, Italian, and German to list a few. He is also capable of fighting and a number of practical skills. Yet he chose to go on the streets to sell fried mutton skewers for a living.\n\nLin Ruoxi is the CEO of a multibillion-dollar company—Yu Lei International. This company is one of the leaders in the cosmetic and fashion industry. Despite being only 20 years old, her ice-cold demeanor and beauty are well-known and unrivaled in Zhonghai City.\n\nDue to a wild night consisting of a lot of liquor, fate has brought them together to become husband and wife.\n\nAnd with that, the story begins!>"
}