{
	"url": "https://www.novelupdates.com/series/when-i-became-a-girl-an-unexpected-love-quarrel-occurred/",
	"title": "When I Became a Girl, an Unexpected Love Quarrel Occurred! - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/05/When-I-Became-a-Girl-an-Unexpected-Love-Quarrel-Occurred.jpg",
	"noveltype": "(JP)",
	"genre": "Comedy   Ecchi   Gender Bender   Harem   Mystery   Romance   School Life   Yuri   ",
	"tags": "Absent Parents   Alternate World   Average-looking Protagonist   Beautiful Female Lead   Caring Protagonist   Complex Family Relationships   Doting Older Siblings   Famous Protagonist   Female Protagonist   Love Interest Falls in Love First   Male to Female   Modern Day   Older Love Interests   Parallel Worlds   R-15   Siblings   Sibling's Care   Sister Complex   Twins   Younger Sisters   ",
	"rating": "(3.8 / 5.0, 112 votes)",
	"author": "Sakurada Familia   Sakurada Kazoku   桜田家族   ",
	"year": "\n2018",
	"ranking": "#3017   #2000   #1772   #8371   #3231   ",
	"reviewcount": "7 Reviews sorted by",
	"description": "I woke up to my twin younger sister lying besides me. She was a famous beauty in out school, unlike the ordinary me. Though the true personality of this perfect girl was somebody who was especially a selfish, although she only ever showed it to me. Although we never got along it was really weird to see her be anywhere close to me. She then opened her eyes, smiled at me and said.\n'Good morning, Onee-chan.'\nEh?\nI was suppose to be an Onii-chan and somehow became a Onee-chan.\n\nI was a plain older brother and now I became a plain older sister. I would have preferred if I somehow got transformed into a woman, I would at least be beautiful, but I guess life isn't that convenient.\nAnyhow, my sister is considered one of the two most beautiful girls in school, and now she is always fighting with the other most beautiful girl. The reason? It's over me. I don't know why but for some reason I am in the middle of this. So hold on me, I won't be defeated. But if anybody could help, please save me.>"
}