{
	"url": "https://www.novelupdates.com/series/to-you-whom-i-dont-love-that-much/",
	"title": "To You Whom I Don’t Love That Much - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/08/To-You-Whom-I-Dont-Love-That-Much_1629326916.jpg",
	"noveltype": "(KR)",
	"genre": "Drama   Fantasy   Josei   Romance   ",
	"tags": "Adapted to Manhwa   Aristocracy   Cute Protagonist   Cute Story   Devoted Love Interests   Early Romance   European Ambience   Female Protagonist   Handsome Male Lead   Medieval   Nobles   Pirates   Royalty   Transmigration   ",
	"rating": "(3.7 / 5.0, 7 votes)",
	"author": "서담연   ",
	"year": "\n2021",
	"ranking": "#2000   #2000   #12839   #8531   #9773   ",
	"reviewcount": "No Reviews",
	"description": "\n\nRosetta, was a famous pirate in the eastern Strait of Bilbron. After eating a poison due to the betrayal of a subordinate that she trusted, when she opened her eyes again.\n\nShe found herself in the body of a person named Leah. The forbidden jade of one of the Three Duke’s families in the Empire.\n\nLight brown hair, turquoise eyes, a pale white face, and a slender body with no muscles at all!\n\n‘Seriously, am I going to die? A canary in a cage would be healthier than this!’\n\nNo matter how much the Duke’s family love this person, it is clear that if they found out about the possession. It is certain that she will be declared as a witch and burned at stake. Either that, or be imprisoned in a monastery until the real princess returns back to this body.\n\nSo, she begins the role of a princess.\n\n‘Damn it, why is this etiquette so complicated and how come there’s so many clothes to wear! And what, I need to see and meet different influential families to look for a potential engagement partner?’\n\nIn the midst of reluctantly agreeing to all that was set for her. Admiral Cadrier, who chased after Rosetta when she was still a pirate, shows up.\n\n‘Wow, how come the nerd,tall and ignorant guy who always claims that he knows it all, had a change of appearance which I couldn’t recognize at first.’\n\nBut this dog , no retriever… suddenly became a bit…..\n\n“Miss.”\n\nCadrier whispered with a polite and observant gaze.\n\n“Can you try calling me ‘bastard’.”>"
}