{
	"url": "https://www.novelupdates.com/series/stunning-edge/",
	"title": "Stunning Edge - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2016/02/SE-1.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Comedy   Fantasy   Harem   Josei   Martial Arts   Shoujo   Xuanhuan   ",
	"tags": "Aristocracy   Artifacts   Beast Companions   Beautiful Female Lead   Betrayal   Cold Protagonist   Cultivation   Cunning Protagonist   Death of Loved Ones   Devoted Love Interests   Female Protagonist   Gods   Handsome Male Lead   Hard-Working Protagonist   Knights   Love Interest Falls in Love First   Loyal Subordinates   Magic   Magic Beasts   Nobles   Pets   Politics   Power Couple   Reverse Harem   Romantic Subplot   Ruthless Protagonist   Schemes And Conspiracies   Slow Romance   Special Abilities   Summoning Magic   Transmigration   Weak to Strong   ",
	"rating": "(4.4 / 5.0, 1121 votes)",
	"author": "Wú Yì Bǎo Bao   无意宝宝   ",
	"year": "\n2010",
	"ranking": "#4617   #1718   #417   #798   #248   ",
	"reviewcount": "128 Reviews sorted by",
	"description": "When a cold and crafty girl travels into the body of a foolish, man-crazy,  young female aristocrat, what will happen?\n\nA young girl, Claire, falls off a horse while chasing his Royal Highness, the second prince, and falls unconscious. But when she finally opens her eyes, her gaze is ice cold.\n\nSoon after, she shines a blinding light that astounds the whole kingdom.\n\nIn a world where power is based on magic and power, how would an airhead like her survive?\n\nBut, she soon stuns everyone by mastering both magic and Dou Qi, paving a new path for herself.\n\nHis Royal Highness, the second prince, was forced by the Emperor to go visit her but was told she was busy.\n\nWhen he saw the “busy” miss drinking tea leisurely, ignoring him, the second prince’s handsome face twitched.\n\nHer personal knight, Jean, had always looked down at her with disgust. But as he and many others watched her shine in glory and power, they couldn’t help but ask themselves, ‘Is this really the girl they knew?’>"
}