{
	"url": "https://www.novelupdates.com/series/i-became-the-male-leads-sister/",
	"title": "I Became the Male Lead’s Sister - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/07/EcI4tJhU8AMOCXg.jpg",
	"noveltype": "(KR)",
	"genre": "Comedy   Drama   Fantasy   Romance   Shoujo   ",
	"tags": "Beautiful Female Lead   Calm Protagonist   Clever Protagonist   Devoted Love Interests   Doting Love Interests   European Ambience   Female Protagonist   Handsome Male Lead   Love Interest Falls in Love First   Magic   Nobles   Royalty   Sickly Characters   Strong Love Interests   Sword And Magic   Terminal Illness   Transmigration   Weak Protagonist   Wealthy Characters   ",
	"rating": "(4.2 / 5.0, 32 votes)",
	"author": "Dried Tangerine   ",
	"year": "\n2020",
	"ranking": "#5262   #4713   #7519   #7585   #3161   ",
	"reviewcount": "2 Reviews sorted by",
	"description": "Evangeline, who was reincarnated as the male lead’s younger sister, only had one year left to live. \n\nWhile her love-struck brother pathetically followed the heroine to the ends of the earth, she decides to follow the novel's plot and find her fated lover.\n\nThe only clue Evangeline was given was that he was blonde. With a plan in mind, she snuck out of the mansion in anticipation of finding him. But somehow, things began to move strangely. Instead of her fated one, she kept running into a suspicious brown-haired man who was devilishly handsome.\n\n“If it is my first time, will you take responsibility?” he said.\n\nHe was too handsome to be a supporting character. Was he the emperor? Or a crook? There’s no way the author would give such beauty of a face to a supporting character of a novel. He’s definitely the other male lead… the emperor.\n\n“Are you the emperor?” Evangeline asked confidently.\n\n“No?”\n\nAh, then never mind… but why was he so dazzling? Agonizing in such thought, she was swept away by him.\n\n“Wait, I don’t think I can. This feels weird.”\n\n“Does it feel weird in a good way or a bad way?”\n\n“In a good way! But still, stop. It’s weird.”\n\n“Why do you keep denying it when you feel good? Can’t you just continue to feel good?”\n\nNot only is this man getting in the way of my plans, but troublesome problems, in general, are holding me back...\n\nShe wasn’t interested in magic, nor men, and nor did she want to recover her lost memories. All she wants is to just… die comfortably!>"
}