{
	"url": "https://www.novelupdates.com/series/dungeon-defense/",
	"title": "Dungeon Defense - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2016/07/Dungeon-Defense.jpg",
	"noveltype": "(KR)",
	"genre": "Action   Drama   Ecchi   Fantasy   Harem   Horror   Mature   Mystery   Psychological   Romance   Seinen   ",
	"tags": "Antihero Protagonist   Army Building   Arrogant Characters   Betrayal   Calm Protagonist   Cold Love Interests   Comedic Undertone   Confident Protagonist   Cruel Characters   Cunning Protagonist   Dark   Demon Lord   Demons   Depictions of Cruelty   Discrimination   Dungeon Master   Enemies Become Allies   Genius Protagonist   Handsome Male Lead   Humanoid Protagonist   Kuudere   Lazy Protagonist   Loli   Low-key Protagonist   Loyal Subordinates   Magic   Male Protagonist   Manipulative Characters   Mob Protagonist   Multiple POV   Neet   Nobles   Perverted Protagonist   Politics   Poor to Rich   Psychopaths   Revenge   Reverse R*pe   Royalty   R*pe   Ruthless Protagonist   Schemes And Conspiracies   Selfish Protagonist   S*x Friends   S*aves   Special Abilities   Strategic Battles   Strategist   Succubus   Time Skip   Torture   Transmigration   Transported into a Game World   Twisted Personality   Underestimated Protagonist   Unreliable Narrator   Vampires   Wars   Weak Protagonist   Witches   Yandere   ",
	"rating": "(4.5 / 5.0, 2877 votes)",
	"author": "Yoo Heonhwa   유헌화   ",
	"year": "\n2016",
	"ranking": "#1714   #3231   #325   #836   #11   ",
	"reviewcount": "310 Reviews",
	"description": "Do you know how this world ends?\r\n\r\nBecome the hero and defeat the 72 Demon Lords. The game that was boasted as the absolute hardest strategy game, 『Dungeon Attack』.\r\n\r\nI used to be the ‘hero’ that had accomplished everything in this game, but after answering a suspicious survey, I found myself in the game as the weakest Demon Lord, 「Dantalian」.\r\n\r\nWith only my eloquent tongue and my memories of conquest as a hero—.\r\n\r\nIn order to survive as Dantalian. I shall tear this world apart.>"
}