{
	"url": "https://www.novelupdates.com/series/global-demon-king-starting-as-the-abyssal-dragon/",
	"title": "Global Demon King: Starting as the Abyssal Dragon - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/04/Global-Demon-King-Starting-as-the-Abyssal-Dragon.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Fantasy   Martial Arts   Sci-fi   Supernatural   ",
	"tags": "Army Building   Beastkin   Bloodlines   Chat Rooms   Clan Building   Cunning Protagonist   Demi-Humans   Demon Lord   Demons   Dragons   Dwarfs   Elves   Evil Gods   Fairies   Fantasy World   Farming   Game Elements   Game Ranking System   Goblins   God Protagonist   Handsome Male Lead   Heroes   Kingdom Building   Level System   Loyal Subordinates   Lucky Protagonist   Male Protagonist   Monsters   Multiple Transported Individuals   Non-humanoid Protagonist   Orcs   Overpowered Protagonist   Protagonist Strong from the Start   Ruthless Protagonist   S*aves   Strength-based Social Hierarchy   Strong to Stronger   Time Manipulation   Transmigration   Transported to Another World   Wars   ",
	"rating": "(4.3 / 5.0, 131 votes)",
	"author": "小魔鱼   ",
	"year": "\n2021",
	"ranking": "#234   #1270   #2992   #291   #6423   ",
	"reviewcount": "5 Reviews sorted by",
	"description": "Humans across the world ended up joining a “Demon Kings and Heroes game”.\n\nSeveral billion people were set down upon another world to act as “Demon Kings” and “Heroes”.  Everyone has to chose their starting races from the start.\n\nZhang Nu was set in the Demon King camp.\n\nHe discovered that he could see hidden information that no one else could.\n[Slime Demon King].  Low grade demon king bloodline…  Not recommended!\n[Kobold Demon King].  Low grade demon king bloodline…  Not recommended!\n[Dark Elf Demon King].  Mid grade demon king bloodline…  Can be selected!\n[Bloody Giant Demon King].  High grade demon king bloodline…  Recommended!\n[Abyssal Dragon Demon King].  Strongest starting bloodline…  Extremely recommended!>"
}