{
	"url": "https://www.novelupdates.com/series/villainess-with-a-cat-changing-system/",
	"title": "Villainess With a Cat Changing System - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/05/102046s.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Drama   Fantasy   Romance   Yuri   ",
	"tags": "Acting   Animal Characteristics   Beautiful Female Lead   Business Management   Celebrities   Character Growth   Clingy Lover   Confident Protagonist   Couple Growth   Dense Protagonist   Different Social Status   Doting Older Siblings   Enemies Become Lovers   Female Protagonist   Game Ranking System   Hard-Working Protagonist   Hot-blooded Protagonist   Jealousy   Kind Love Interests   Love Interest Falls in Love First   Love Rivals   Modern Day   Money Grubber   Past Trauma   Persistent Love Interests   Pets   Phobias   Popular Love Interests   Selfish Protagonist   Straight Uke   Transmigration   Tsundere   Villainess Noble Girls   Younger Sisters   ",
	"rating": "(4.3 / 5.0, 88 votes)",
	"author": "笑蓝   ",
	"year": "\n2020",
	"ranking": "#4617   #3770   #4031   #6511   #3739   ",
	"reviewcount": "16 Reviews sorted by",
	"description": "Huo Yu, a second rich generation with Doraphobia, suddenly became a small kitty cat, and the bound system told her that she was cursed because of her persecution to the Heroine, and that the happiness value of the Heroine is needed to be exchanged for the length of time to became human.\n\nThe Heroine of this world is Lin Shuwei, her tortured rival.\n\nHuo Yu, who had not thought of a countermeasure, was picked up by Lin Shuwei and became her cat.\n\n***\n\nLin Shuwei always thought that President Xiao Huo hated herself, until one day she found that Xiao Huo not only personally saved her from bullying, but also hired an army to fight against the haters, and become the number one of her fans.\n\nXiao Huo who will always open her alt account to tear the haters, and will send many praises to her every day to give her warmth, is her own loyal fan!\n\nLin Shuwei observed her silently and found that Xiao Huo became cuter and cuter and more and more like her cat.\n\n***\n\nHuo Yu and Lin Shuwei, the new film star, have been voted the best CP of the year after a variety show.\n\nHuo Yu was cold-faced when she was asked about her relationship with Lin Shuwei: Working relationship, not familiar!\n\nHowever, that night Huo Yu sent a Weibo:\n\nLove relationship, thank you for your concern @LinShuwei\n\nNetizens who loved to eat gua zi are forced to eat gua zi, and CP fans are very happy.\n\nAt this time, Huo Yu narrowed her eyes and tried to improve Lin Shuwei’s happiness in her arms.>"
}