{
	"url": "https://www.novelupdates.com/series/the-rotten-lady-rosa-wants-to-watch-over-love-from-the-shadows/",
	"title": "The Rotten Lady Rosa Wants to Watch Over Love from the Shadows - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/08/322002001208.jpg",
	"noveltype": "(JP)",
	"genre": "Comedy   Fantasy   Romance   Shoujo   ",
	"tags": "Adapted to Manga   Adopted Children   Aristocracy   Beautiful Female Lead   Cautious Protagonist   Charismatic Protagonist   Childcare   Cunning Protagonist   Delusions   Discrimination   European Ambience   Familial Love   Family   Family Conflict   Fast Learner   Female Protagonist   Fujoshi   Hard-Working Protagonist   Harsh Training   Loli   Magic   Misunderstandings   Money Grubber   Nobles   Quirky Characters   Racism   Religions   Royalty   Shota   Shoujo-Ai Subplot   Shounen-Ai Subplot   Thieves   Transmigration   Younger Brothers   ",
	"rating": "(4.2 / 5.0, 29 votes)",
	"author": "中村 颯希   ",
	"year": "\n2020",
	"ranking": "#2053   #3762   #6492   #3849   #5864   ",
	"reviewcount": "2 Reviews sorted by",
	"description": "The daughter of the Earl, Rosa, was known for her beauty and compassion. But in reality, she was a rotten lady who pursued her 'moe' by making delusions of 'rose love', the romance between men.\r\n\r\nHer dream was to become a nun and write down a 'bible', spreading the rose love throughout the continent.\r\n\r\nAs the preparation of entering the priesthood, she donated to the monastery (as a bribe), strived to improve literacy (to prepare for her missionary work), and made humus for her territory (as the symbol of rottenness). One day, she met her half-brother, Bernard, a fourteen years old boy.\r\n\r\nConcluding that Bernard was the ideal 'uke', a talented person that only appeared once every a thousand years, Rose devoted herself to 'Bell-tan's Harem Plan'. However, her rotten behavior was mistaken for noble deeds. The princes, princesses, and even the foreign princes started to get involved, and she began to spread her influence all over the country...?\r\n\r\nThis was the story of Rosa von Langheim, nicknamed the 'Rose Angel' as the symbol of her nobility and charity, who was the most rotten lady of all.>"
}