{
	"url": "https://www.novelupdates.com/series/the-noble-womans-guide-on-how-to-tease-ones-husband/",
	"title": "The Noble Woman’s Guide On How to Tease One’s Husband - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/05/77d9ef96gw1f83uvpozd0j205k07st9c.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adult   Drama   Historical   Josei   Martial Arts   Mature   Romance   ",
	"tags": "Ancient China   Beautiful Female Lead   Childhood Love   Clever Protagonist   Cold Love Interests   Confident Protagonist   Couple Growth   Cunning Protagonist   Determined Protagonist   Doting Love Interests   Familial Love   Female Protagonist   First Love   Handsome Male Lead   Heartwarming   Loyal Subordinates   Male Yandere   Older Love Interests   Past Plays a Big Role   Past Trauma   Politics   Power Couple   Power Struggle   Pregnancy   Proactive Protagonist   Protagonist Falls in Love First   Revenge   Royalty   R*pe   Schemes And Conspiracies   Selfish Protagonist   Shameless Protagonist   Siblings   Strong Love Interests   Tragic Past   Twins   Unconditional Love   ",
	"rating": "(4.4 / 5.0, 213 votes)",
	"author": "Yi Guang   漪光   ",
	"year": "\n2019",
	"ranking": "#803   #698   #2060   #1042   #1270   ",
	"reviewcount": "58 Reviews sorted by",
	"description": "The first time they met, all the other noble women scurried away in an attempt to distance themselves from him as much as possible. Only Ye Huaiyang remained rooted to the spot, unable to tear her gaze away from Chu Jinglan.\n\nThe third time they met, he threatened to take her life away; and yet, she fearlessly shifted herself closer to him; easily succeeding in planting a kiss fully on his lips before sighing in satisfaction – she is now happy; and can die without regrets.\n\nThe fifth time they met, the two of them were forced to hide in the bookshelf. Grabbing the opportunity to cop a feel, she managed to tease him till he felt as though his entire body was ablazed.\n\nSubsequently, the two of them were finally wed to each other. He wanted to overthrow the Emperor and claim his rightful place, so she accompanied him on his treacherous journey without complaint, diligently removing every obstacle in his way. And when the critical moment finally arrived, Ye Huaiyang set in place the biggest trap she had ever set in her entire life; and bravely marched to her solitary death.\n\nChu Jinglan, who had always been calm and restrained, angrily grabbed hold of her – “What did you take me for? Did you think you could just decide to stop teasing me so abruptly after all you’ve done?”>"
}