{
	"url": "https://www.novelupdates.com/series/mist/",
	"title": "Mist - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/10/Mist.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adult   Comedy   Mature   Mystery   Romance   Sci-fi   Yaoi   ",
	"tags": "Adapted to Drama CD   Adapted to Manhua   Arrogant Characters   Calm Protagonist   Cannibalism   Clever Protagonist   Co-Workers   Cold Protagonist   Death   Death of Loved Ones   Devoted Love Interests   Discrimination   Eidetic Memory   First-time Interc**rse   Futuristic Setting   Genius Protagonist   Gore   Handsome Male Lead   Love Interest Falls in Love First   Multiple Timelines   Mutated Creatures   Near-Death Experience   Parallel Worlds   Power Couple   Protagonist Strong from the Start   Slow Romance   Smart Couple   Strong Love Interests   Suicides   Survival   Teamwork   Thriller   Time Loop   Time Paradox   Time Travel   Unlimited Flow   Zombies   ",
	"rating": "(4.8 / 5.0, 776 votes)",
	"author": "Wei Feng Ji Xu   微风几许   ",
	"year": "\n2020",
	"ranking": "#931   #1711   #1072   #475   #712   ",
	"reviewcount": "184 Reviews sorted by",
	"description": "Hyperthymesia. Those with this condition can remember every detail of their lives from something as significant as the world’s turning point to something as small and as insignificant as a minor fleeting thought. They cannot forget and their thirst for knowledge allows them to be considered genius in some senses.\n\nLegend has it that Ji Yushi was this kind of genius.\n\nIn addition, it was said that he was gay and very beautiful.\n\nAs soon as the news that he was going to support Tianqiong’s seventh squad broke out, it sent everyone buzzing.\n\nEveryone knew that the captain of the seventh squad, Song Qinglan, was a hoodlum and deeply homophobic.\n\nHe not only relied on his super-powerful abilities to become the dark horse on the battlefield in less than two years, but he also hates it when those at the top forced a flower vase* into his squad.\n\nSure enough, Song Qinglan announced in front of everyone, “Useful? Us brothers are going out there working ourselves to the bone, we don’t need a little genius who can only speedread quantum waves!”\n\nLater.\n\nThe squad was forced into a dire situation during their mission.\n\nThat beautiful little genius calmly continued, every gunfire hitting the mark, his fighting power peaking.\n\nSong Qinglan begged in front of everyone, “Adviser Ji, stay.”\n\nIn the end, he added, “I’ll work myself to the bone for you.”\n\n*****\n\nJi Yushi had a secret.\n\nHe would often be awake at night, suffering from memory overload and recurring nightmares.\n\nThere was only one thing that could let him fall asleep peacefully.\n\nAnd that was Song Qinglan.\n\n*Flower vase: Someone who only looks pretty but can’t amount to much>"
}