{
	"url": "https://www.novelupdates.com/series/kami-sama-ga-miteita/",
	"title": "Kami-sama ga Miteita - Novel Updates",
	"image": "https://www.novelupdates.com/img/noimagefound.jpg",
	"noveltype": "(JP)",
	"genre": "Romance   School Life   Slice of Life   ",
	"tags": "Oneshot   ",
	"rating": "(2.9 / 5.0, 7 votes)",
	"author": "Yasukiyo Kotobuki   寿　安清   ",
	"year": "\n2017",
	"ranking": "#2000   #2000   #11498   #9888   #12446   ",
	"reviewcount": "No Reviews",
	"description": "If, that was exist anywhere, choice that never been chosen.\r\n\r\nHistory is made up from series of elected choices, but sometimes there are cases where the choice are rarely deviates.\r\n\r\nThere is no coincidence in this world, everything is inevitable. Probabilistic future prediction is possible for us, but it is still not absolute.\r\n\r\nEven in the establishment of the decimal point, what should occur always occurs. It is impossible to predict a complete future.\r\n\r\nEven more, it is impossible to ignore events, such as time slips from the past to the future. In the first place the reality is only the present.\r\n\r\nThe past is a record, and the future is uncertain. That’s the truth.\r\n\r\nIf you keep sleeping for a long time, you may be able to go to the future, but it is impossible to return from the present to the past that changed. Everything is just a single route carved as a record of events.\r\n\r\n“What if you make a time machine?” you say? Such thing is decided to wander around the dimension space.\r\n\r\nIf you are lucky you may transfer to another dimension, but that is not the world the Traveler want. It is a world different from my jurisdiction.\r\n\r\nThe story was slightly off. Then if, the moment called [If] will surely happens.\r\n\r\nIt chooses before the person itself notices it, and goes to that future. It’s often to be called “the moment your life changed”? That is exactly the case.\r\n\r\nEven now things that are called [if] are going to happen. Shall I take a look?\r\n\r\nLet me see…….>"
}