{
	"url": "https://www.novelupdates.com/series/reborn-as-a-cripple/",
	"title": "Reborn as a Cripple - Novel Updates",
	"image": "https://www.novelupdates.com/img/noimagefound.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Comedy   Ecchi   Fantasy   Harem   Romance   ",
	"tags": "Aristocracy   Male Protagonist   Transported into a Game World   Weak to Strong   ",
	"rating": "(3.2 / 5.0, 14 votes)",
	"author": "Hametsu   破滅   ",
	"year": "\n2021",
	"ranking": "#2000   #2000   #7957   #11907   #9915   ",
	"reviewcount": "1 Review sorted by",
	"description": "[Job Recruitment Online] aka [JRO]\r\n\r\nFind and master your own job from over 1,000 jobs! That’s the catchphrase of the game. The protagonist, who abandoned his real-life job hunting and devoted his entire life to the game, died of a blood clot due to lack of exercise and sleep caused by playing games for an average of 20 hours a day.\r\n\r\nWhen I woke up, a man and a woman who I had seen from somewhere before were right before my eyes.\r\n\r\nWho are they? When I took a closer look at them, I realized that they had the same appearance and name as the NPCs who were frequently involved in the storyline as a marquess of martial arts in [JRO].\r\n\r\nCould it be that I reincarnated in the game’s world?!\r\n\r\nThe protagonist, who was born as “Heid-Dukehardt” the eldest son of a martial arts marquess family, wants to play this game even after reincarnation! Consequently, I’m going to abolish leveling at the pace of my previous life.\r\n\r\nI was just doing things as I liked, but before I knew it, I was being praised as the “Child Prodigy of the Marquess Family”.\r\n\r\nHowever, on the day of Heid’s coming of age, he was given the title of [Farmer], which was the weakest profession in this world.\r\n\r\nHe was supposed to be the prodigious child of the marquess family, but when he got a weak profession, he became a disappointment and was exiled from his house for being a disgrace to the family.\r\n\r\n“What? Isn’t it common sense among the [JRO] fanatics that [Farmers] are the strongest?”\r\n\r\nThis is the story of Heid whose profession, [Farmer], which was thought to be the weakest, decides to use his knowledge of strategies from [JRO] to become the strongest and change this world’s common sense.>"
}