{
	"url": "https://www.novelupdates.com/series/golden-age-of-phoenix-tyrants-first-class-virtuous-imperial-concubine/",
	"title": "Golden Age Of Phoenix: Tyrant’s First Class Virtuous Imperial Concubine - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2018/04/download-1.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Drama   Historical   Josei   Psychological   Romance   Shoujo   Tragedy   ",
	"tags": "Ancient China   Apathetic Protagonist   Aristocracy   Army   Arranged Marriage   Arrogant Characters   Beautiful Female Lead   Betrayal   Bodyguards   Calm Protagonist   Caring Protagonist   Cautious Protagonist   Character Growth   Cold Love Interests   Complex Family Relationships   Conditional Power   Conflicting Loyalties   Couple Growth   Court Official   Death of Loved Ones   Determined Protagonist   Devoted Love Interests   Different Social Status   Emotionally Weak Protagonist   Engagement   Fallen Nobility   Familial Love   Family   Family Conflict   Female Protagonist   First Love   Forced into a Relationship   Friendship   Generals   Handsome Male Lead   Honest Protagonist   Imperial Harem   Late Romance   Manipulative Characters   Marriage   Marriage of Convenience   Military   Naive Protagonist   Near-Death Experience   Nightmares   Nobles   Personality Changes   Philosophical   Phoenixes   Poetry   Poisons   Politics   Poor Protagonist   Popular Love Interests   Power Struggle   Quiet Characters   Quirky Characters   Royalty   Sadistic Characters   Schemes And Conspiracies   Secrets   Strong Love Interests   Tragic Past   Twisted Personality   Wars   Weak Protagonist   Wealthy Characters   ",
	"rating": "(3.6 / 5.0, 61 votes)",
	"author": "Leng Qing Shan   冷青衫   ",
	"year": "\n2017",
	"ranking": "#2000   #4726   #3397   #7242   #4505   ",
	"reviewcount": "11 Reviews sorted by",
	"description": "\nIn the midst of darkness, the city was seized by enemies under the blanket of the night. She was on the verge of becoming the sovereign king's imperial concubine, however, he was soon to bring about blood and slaughter. \n\nHe is ruthless, murderous, yet gentle and a reserved tyrant.\n\nShe is weak, helpless, but a lonely woman with a strong heart.\n\nShe wants nothing but to escape, yet somehow... she's deeply attracted to him. He's cold-hearted, but she provoked tenderness in him. He dares not believe in these gentle feelings. Jiang Shan is like a game and the world is like a chess. \n\nIn front of him, can she walk away?>"
}