{
	"url": "https://www.novelupdates.com/series/tender-pampering-is-the-best-strategy/",
	"title": "Tender Pampering is the Best Strategy - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/10/Tender-Pampering-is-the-Best-Strategy.jpg",
	"noveltype": "(CN)",
	"genre": "Drama   Fantasy   Historical   Romance   ",
	"tags": "Ancient China   Couple Growth   Devoted Love Interests   Female Protagonist   Nobles   Reincarnation   ",
	"rating": "(3.3 / 5.0, 7 votes)",
	"author": "Ye Jianxing   叶见星   ",
	"year": "\n2020",
	"ranking": "#2000   #2000   #10499   #12437   #10780   ",
	"reviewcount": "3 Reviews sorted by",
	"description": "In the last life, Shen Shu had been forced to fulfill a marriage alliance, she was sent afar, to be married to the Huns. And after a few years of more clashes between the two, she-who-was-unloved ended up as a forgotten pawn.\n\nEverything she knew was balanced on the edge of destruction, when she suddenly witnessed how the so-called cold-blooded and heartless man, the one with unrivaled military power in his hands, died on the battlefield for her.\n\nThe day she was reborn, just so happened to be the night before she was to be sent to fulfill the marriage alliance,\n\nAs she haphazardly stumbled her way out of her palace chambers, somehow, she fell straight into Pei Yunqian’s embrace.\n\nThe man’s expression was overcome by momentary confusion, as the young lady in his arms stared at him, the light from her eyes was like water, gently teasing his soul, “I don’t want to go and fulfill the marriage alliance, General, are you willing to marry me?”\n\nThe whole world knew that in order to avoid being sent to fulfill the political marriage Princess Lingan chose to be married beneath her station, to a treacherous court official. Pei Yunqian’s moods were unstable, he was also sinister and ruthless. Many estimated that before long, the fragrance would diminish, the jade would perish, and the Princess would soon expire.\n\nUnbeknownst to them, in both lifetimes, that cold-blooded heartless man had treasured her like his life, and this life, he was even more dedicated to cutting away all the obstacles in her path, seeking to give her a life of tender pampering.\n\nPei Yunqian was born cold-blooded, he cut men down without feeling anything, everyone was afraid of him, but Shen Shu loved him.>"
}