{
	"url": "https://www.novelupdates.com/series/ancient-god/",
	"title": "Ancient God - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/08/Ancient-God.jpg",
	"noveltype": "(CN)",
	"genre": "Adventure   Drama   Fantasy   Romance   Xianxia   ",
	"tags": "Adapted to Drama   Amnesia   Appearance Changes   Appearance Different from Actual Age   Average-looking Protagonist   Beasts   Betrayal   Broken Engagement   Calm Protagonist   Character Growth   Charismatic Protagonist   Clever Protagonist   Cultivation   Death of Loved Ones   Demonic Cultivation Technique   Demons   Determined Protagonist   Devoted Love Interests   Evil Gods   Fantasy World   Fated Lovers   Female Protagonist   Friendship   God Protagonist   Gods   Handsome Male Lead   Heavenly Tribulation   Immortals   Lazy Protagonist   Long Separations   Love Interest Falls in Love First   Love Rivals   Lovers Reunited   Magic   Magic Beasts   Magic Formations   Marriage   Monsters   Multiple Realms   Near-Death Experience   Overpowered Protagonist   Phoenixes   Schemes And Conspiracies   Secret Identity   Strong Love Interests   Sword And Magic   Unconditional Love   Underestimated Protagonist   Wars   Weak to Strong   ",
	"rating": "(4.7 / 5.0, 45 votes)",
	"author": "Xing Ling   星零   ",
	"year": "\n2011",
	"ranking": "#2000   #3112   #5831   #11073   #6089   ",
	"reviewcount": "9 Reviews sorted by",
	"description": "When a mortal encounters difficulties and separation in life, he can resort to praying to the god and to the Buddha – but what if one is an immortal?\n\nShe lost the memories she had of the three hundred years before the Catastrophe of Chaos occurred, which caused her to forget the love that was buried deep in her heart.\n\nBut she will never forget how this person quietly stayed by her side for sixty thousand years. She will never forget the thousands of years he spent in the Northern Sea, frozen in time. She will never forget how he stood on Qinglong Terrace, enduring the pain of having his bones crushed and body burnt. She will never forget how he chose to shatter his spirit into a million pieces, turning himself into ash, just so she could live.\n\nNow, in the desolation of the Nine provinces and the loneliness of the Three Realms, she was the only figure standing on Gan Kun Platform.\n\nIn this lifetime, she is able to stand in front of all the immortals and gods. She is able to stand in front of the innumerable people and spirits living in the Nine provinces and Eight Lands. She is able to stand in front of her deceased father, God Qing Tian. But she couldn’t stand straight and prove herself worthy in front of one person.\n\nShe owes him so much more than one hundred and thirty thousand years. She is indebted to him for more than three lifetimes.\n\nThis time, she would be the one waiting for him to return. Even if millions of years pass, she would never, ever leave.>"
}