{
	"url": "https://www.novelupdates.com/series/i-was-given-the-slave-release-skill-in-an-undeveloped-land-and-was-helped-by-the-girls-i-freed/",
	"title": "I Was Given the «S*ave Release» Skill in An Undeveloped Land and Was Helped By The Girls I Freed - Novel Updates",
	"image": "https://www.novelupdates.com/img/noimagefound.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Comedy   Ecchi   Fantasy   Harem   Shounen   Slice of Life   ",
	"tags": "Adventurers   Demi-Humans   Elves   Fantasy World   Guilds   Kingdom Building   Male Protagonist   Monsters   Polygamy   Pregnancy   S*ave Harem   S*aves   Special Abilities   Summoning Magic   ",
	"rating": "(2.3 / 5.0, 6 votes)",
	"author": "向原 行人   ",
	"year": "\n2020",
	"ranking": "#2000   #6165   #12103   #5147   #10216   ",
	"reviewcount": "No Reviews",
	"description": "I, Alex, became an S-class adventurer with my childhood friends by playing the role of tank and attracting enemies with my great physical strength so that my friends could beat them. It’s a job called ‘Paladin’ that specializes in protecting allies, but probably because everyone is protected by me, they only improved their attack skills without learning defense and evasion skills.\n\nNot knowing that they were protected by my skills, they dismissed me because I had no attack power…!? But without me your defense is like paper!\n\nAfter this turbulent day I went to the adventurer’s guild to take a leisurely quest to relax alone. I was asked to develop a remote land as a pioneer. Others had tried in the past, but the monsters that appeared were so strong that all the farmers had escaped, so the vast land would be given as a reward to anyone who succeeded.\n\nWhen I went there, I found that there were no villages or even houses around me, and it was in the countryside where the demons lived. There I found a monster I had never seen, and when I defeated it I acquired the skill of “s*ave release”.\n\nIf you use this skill, you can summon a member of the opposite s*x who is ens*aved somewhere in the world to your side. I immediately activated it and a beautiful elf girl appeared!\n\nAfter that, I released a girl with architectural skills, a foreign princess who was a prisoner, and others, and before I knew it a new country was formed and I was treated as a king…>"
}