{
	"url": "https://www.novelupdates.com/series/sect-master-and-psycho/",
	"title": "Sect Master and Psycho - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/07/Sect-Master-and-Psycho.jpg",
	"noveltype": "(CN)",
	"genre": "Drama   Mature   Romance   Smut   Wuxia   Yaoi   ",
	"tags": "Adapted to Drama CD   Adopted Children   Amnesia   Ancient China   Caring Protagonist   Cold Love Interests   Comedic Undertone   Death of Loved Ones   Determined Protagonist   Doting Love Interests   Enemies Become Lovers   Handsome Male Lead   Hiding True Identity   Inferiority Complex   Loneliness   Lovers Reunited   Loyal Subordinates   Manly Gay Couple   Mismatched Couple   Misunderstandings   Mysterious Illness   Protagonist Falls in Love First   R*pe Victim Becomes Lover   R*pe   Secret Identity   Secrets   S*xual Cultivation Technique   Straight Seme   Straight Uke   Strong Love Interests   Tragic Past   Unconditional Love   Unrequited Love   ",
	"rating": "(4.4 / 5.0, 295 votes)",
	"author": "Bian Xiang   边想   邊想   ",
	"year": "\n2015",
	"ranking": "#2000   #2872   #2220   #1089   #1293   ",
	"reviewcount": "57 Reviews sorted by",
	"description": "In miserable times, drinking water could even satiate hunger. Thankfully, Han Qingyan didn’t die when he fell off the cliff, but was instead forced like a woman and expected to birth a child!\n\nYou psycho! Look carefully! I’m a man!!! Even if I am topped every day, I can’t produce an egg!\n\nUnfortunately, no matter how angry or helpless he felt, he couldn’t deny it. With his Demon Sect Master’s position usurped, the only one whom he had was Psycho. It was the warmth of a lifetime that he would never forget. Even if he recovered and forgot everything that had happened, even if he had everything and no longer cared for a stranger like him, he would still sacrifice his all for him….... \n\nThe righteous and the evil had always been at odds. He had been plotting everything. Just for this one person, this relationship, and his heart.>"
}