{
	"url": "https://www.novelupdates.com/series/seeing-my-wife-is-not-easy/",
	"title": "Seeing My Wife Is Not Easy - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/02/Seeing-My-Wife-Is-Not-Easy.jpeg",
	"noveltype": "(CN)",
	"genre": "Comedy   Fantasy   Gender Bender   Romance   ",
	"tags": "Acting   Body Swap   Cunning Protagonist   Female Protagonist   Love Interest Falls in Love First   Modern Day   Revenge   Wealthy Characters   ",
	"rating": "(2.9 / 5.0, 11 votes)",
	"author": "漪兰甘棠   ",
	"year": "\nN/A",
	"ranking": "#2000   #6382   #12200   #7366   #11700   ",
	"reviewcount": "No Reviews",
	"description": "He was obviously a person with high status in the city but was called Scarface Rakshasa with everyone avoiding him out of fear, the bloody scar on his brow bone the most wanton proof. She was the number one actress in the film industry who had won both the big awards, dazzling like a pearl, and also a scandal-ridden “scumbag”.  In her most glorious years, she was reduced down to a third-rate body double on set. The interior of the limousine was full of flames, and in the raging flames, a scar that could not be more striking fell into Shi You’s eyes, and her tragic fate was officially reversed! \n\nI heard that Master Xi after the car accident has become cunning, surprising everyone. I heard that the actress past her prime had become arrogant and gloomy, and even kicked the “golden boy and girl” in the circle directly on the set. At the Xi Family banquet, past-her-prime actress Shi You appeared impressively at the event, pointed to the eldest young master who was about to run away, and said with a sneer, “What I want is you!” \n\nEvil person matched with a violent woman, causing people to clap their hands in praise; but gradually the evil person turns into a celestial being and the violent woman turns into a noblewoman. Only Shi You and that man knew that she and the young master had actually exchanged bodies. But it’s okay, she could use this man’s body to complete her “revenge” plan. Scarcely did she realize, this matter of exploitation, it was really impossible to make a conclusion so quickly.>"
}