{
	"url": "https://www.novelupdates.com/series/step-mother-has-given-up/",
	"title": "Step-Mother has Given Up - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/11/StepMother-has-Given-Up.jpeg",
	"noveltype": "(CN)",
	"genre": "Drama   Romance   Supernatural   Tragedy   ",
	"tags": "Ancient China   Beautiful Female Lead   Female Protagonist   Late Romance   Pregnancy   Reincarnation   Second Chance   ",
	"rating": "(2.9 / 5.0, 15 votes)",
	"author": "寧靜夜空   ",
	"year": "\n2020",
	"ranking": "#6970   #2000   #9910   #10840   #10473   ",
	"reviewcount": "3 Reviews sorted by",
	"description": "Shen Yan Mo was reborn. Reborn to the time when she was thrown to the village.\n\nBefore she was reborn, she was the first daughter whose parents died and was not favored. She married the Marquis of Wuchang as a stepmother, and the old lady of the Marquis was afraid that she would give birth to the first son and neglect the first son of the original Marquis Wuchang’s wife, so she was wary of Shen Yan Mo.\n\nThe marquis was afraid that Shen Yan Mo was a black-hearted stepmother who was cold-hearted and indifferent. The marquis did not consummate the marriage with Shen Yan Mo and went to war, leaving Shen Yan Mo alone in the Marquis Manor to be looked upon with disdain.\n\nA year later the marquis returned triumphantly. He drunkenly pulled Shen Yan Mo to consummate the marriage, and the father of several children was like a young brat. Afterward, he disliked her and threw her to the village to fend for herself and she died during childbirth.\n\nAfter being reborn, Shen Yan Mo got a divorce letter and set up her own business, keeping away from the rights and wrongs of the marquis. She did not want to be a stepmother anymore, so she focused on raising her own children, which was much better than fighting in the inner courtyards.\n\nAfter many years, Shen Yan Mo found out that it was someone else with whom she consummated the marriage, and that person wanted to marry her.\n\nSorry, she does not want to marry.\n\nHer ex-husband regrets the divorce and wants to get back together.\n\nGo away.>"
}