{
	"url": "https://www.novelupdates.com/series/i-was-reincarnated-as-a-villainess-but-since-i-have-become-the-beautiful-woman-of-my-dreams-thats-plus-minus-zero/",
	"title": "I Was Reincarnated as a Villainess, but Since I Have Become the Beautiful Woman of My Dreams, That’s Plus-Minus Zero - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/09/I-Was-Reincarnated-as-a-Villainess-but-Since-I-Have-Become-the-Beautiful-Woman-of-My-Dreams-Thats-PlusMinus-Zero.jpg",
	"noveltype": "(JP)",
	"genre": "Adventure   Comedy   Drama   Fantasy   Romance   Shoujo   Slice of Life   ",
	"tags": "Adapted to Manga   Aristocracy   Beautiful Female Lead   Broken Engagement   Female Protagonist   Love Interest Falls in Love First   Magic   Otome Game   Reincarnation   Shameless Protagonist   Villainess Noble Girls   ",
	"rating": "(3.9 / 5.0, 70 votes)",
	"author": "Hidamari   ひだまり   ",
	"year": "\n2020",
	"ranking": "#4080   #3461   #2132   #3676   #2404   ",
	"reviewcount": "8 Reviews sorted by",
	"description": "I was reincarnated as a villainess, but since I have become the beautiful woman of my dreams, that’s plus-minus zero.\n\nEh? I’m reincarnated as a villainess?\n\nIt suddenly came to me on the morning of my graduation, while I changed to my uniform in my room at the age of 15.\n\nIt fell like a revelation, the memory of a sword and magic otome game I played in a previous life in Japan. Now, I am the Duke’s daughter, Alisha Ophaniel Stuart.\n\nFrom birth, I have been engaged to the first prince of this country, and my future as a queen is already decided.\n\nIn the game, I appeared as the evil fiancée of the First Prince Melchizedek, the crown prince, who also a capture target for the Heroine.\n\nMy role was a template villainess who becomes jealous of the Heroine and bullied her. Then, I will be condemned at my graduation party.\n\nI had blonde hair and blue eyes, though my facial features are not bad, I’m a little chubby,\n\nI put on fancy makeup and styled my hair in vertical rolls; my dress was in bad taste no matter how you look at them, and together with my haughty demeanor, they give people the impression that I am a vile girl.\n\nDespair fell onto me— Wait.\n\nI thought I was chubby, but this is just hidden big tits.\n\ne? My face also cute?\n\nThis Alisha is a top-notch woman in every aspect.\n\nIf it like this, go ahead, you guys can flirt to your heart content.\n\nBecause my big breast is the best.\n\nBut, what should I do after I get banished?>"
}