{
	"url": "https://www.novelupdates.com/series/dragon-prince-yuan/",
	"title": "Dragon Prince Yuan - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2018/08/8955s.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Martial Arts   Shounen   Xuanhuan   ",
	"tags": "Academy   Adapted to Manhua   Ancient China   Aristocracy   Arrogant Characters   Battle Academy   Beautiful Female Lead   Books   Bookworm   Caring Protagonist   Charismatic Protagonist   Charming Protagonist   Childhood Friends   Cultivation   Destiny   Enemies Become Allies   Familial Love   Fantasy World   Handsome Male Lead   Male Protagonist   Mature Protagonist   Multiple Realms   Romantic Subplot   Royalty   Schemes And Conspiracies   Sickly Characters   Strength-based Social Hierarchy   Weak to Strong   ",
	"rating": "(3.2 / 5.0, 145 votes)",
	"author": "Heavenly Silkworm Potato   Tian Can Tu Dou   天蚕土豆   ",
	"year": "\n2017",
	"ranking": "#2000   #2000   #285   #673   #2780   ",
	"reviewcount": "28 Reviews sorted by",
	"description": "The heavens and earth are furnaces, every living things are charcoal, and the Yin and Yang are fuel. The battle for destiny, fate, and luck between the Serpent and Sacred Saint Dragon arises. When all is said and done, will the Serpent emerge victorious or will the Sacred Saint Dragon rise up above all sentient beings?\n\nThe world revolves around the Yin and Yang, a single breath can move mountains and seas, and turn the heavens upside down. Those who wield strength has the right to possess the Yin and Yang of the Universe.\n\nZhou Yuan holds a pen while the dragon dances. Chaos surrounds the world, lightning blankets the sky. In this world, will the serpent swallow the dragon, or will the dragon rise?\n\n—\n\nDestiny stolen at birth, the prince of the once mighty Great Zhou Empire, Zhou Yuan, has been plagued by a fatal poison till fate draws him to mysterious domain where he meets a beautiful girl in green, a bizarre dog-like creature and an unfathomable old man in black.\n\nJoin Zhou Yuan as he thrust into the whirlpool of destiny while he seeks the pinnacle of cultivation.>"
}