{
	"url": "https://www.novelupdates.com/series/can-we-become-a-family/",
	"title": "Can We Become a Family? - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/10/Can-We-Become-a-Family.jpg",
	"noveltype": "(KR)",
	"genre": "Drama   Fantasy   Psychological   Romance   Shoujo   Supernatural   Tragedy   ",
	"tags": "Abandoned Children   Abusive Characters   Adapted to Manhwa   Adopted Protagonist   Aristocracy   Beautiful Female Lead   Bullying   Child Abuse   Child Protagonist   Cold Protagonist   Complex Family Relationships   Cute Children   Death   Depictions of Cruelty   Destiny   Different Social Status   European Ambience   Family Conflict   Female Protagonist   Hidden Abilities   Hiding True Abilities   Inferiority Complex   Loner Protagonist   Magic   Mind Control   Multiple Timelines   Murders   Nobles   Past Trauma   Revenge   Royalty   Second Chance   Sibling Rivalry   Siblings   Siblings Not Related by Blood   Time Manipulation   Torture   Tragic Past   ",
	"rating": "(4.3 / 5.0, 86 votes)",
	"author": "Han Yi Rim   한이림   ",
	"year": "\n2020",
	"ranking": "#5262   #4703   #2512   #2664   #1805   ",
	"reviewcount": "18 Reviews sorted by",
	"description": "‘Navia Agnes,’ adopted to marry the Crown Prince on behalf of the Duke of Agnes’ ill daughter.\n\n“I want to be a real family.”\n\nNavia, who had been hung up on her family’s affection, does her best to become an empress while being abused, but the moment Vivian, the duke’s biological daughter, is cured, her family abandons her.\n\nNo, it would be fair to say that they abandoned her every time.\n\n“How much longer do I have to try? To be your family.”\n\nNavia took off her blood-soaked gloves.\n\nThen on her right wrist, an invisible number that wasn’t visible to others was revealed.\n\n1\n\nLooking down at the numbers, she calmly confessed.\n\n“Now, I’m going to stop playing with family games.”\n\nAt that moment, the number on the wrist changed.\n\n0\n\nLike that, a life that started again.\n\n“If you touch me, you’ve to pay the price.”\n\nWill she be able to take revenge on the Duke of Agnes and find a temporary family to protect her until she reaches adulthood?>"
}