{
	"url": "https://www.novelupdates.com/series/after-i-livestreamed-raising-cubs-i-became-the-wealthiest-in-interstellar/",
	"title": "After I Livestreamed Raising Cubs I became the Wealthiest in Interstellar - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/04/After-I-Livestreamed-Raising-Cubs-I-became-the-Wealthiest-in-Interstellar.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Fantasy   Romance   Sci-fi   Shounen Ai   Slice of Life   ",
	"tags": "Artificial Intelligence   Beast Companions   Beasts   Caring Protagonist   Celebrities   Cooking   Cute Protagonist   Cute Story   Domestic Affairs   Doting Love Interests   Famous Protagonist   Friendship   Futuristic Setting   Handsome Male Lead   Hard-Working Protagonist   Heartwarming   Military   Music   Naive Protagonist   Outer Space   Pets   Poor to Rich   Reincarnated in Another World   Reincarnation   Royalty   Secret Identity   Sentimental Protagonist   Slow Romance   Soldiers   Special Abilities   Strong Love Interests   System Administrator   Transmigration   Wealthy Characters   ",
	"rating": "(4.2 / 5.0, 95 votes)",
	"author": "Mulan Bamboo   木兰竹   ",
	"year": "\n2020",
	"ranking": "#730   #626   #1926   #927   #2013   ",
	"reviewcount": "21 Reviews sorted by",
	"description": "Carrying a spirit beast rearing system, Mingyou transmigrated. In nineteen years, he never saw a single “spirit beast” with sufficient stats, until he came to a rundown animal care facility to work.\n\nMingyou hugged the huge black cat while crying tears: “Psychic powers drained to exhaustion, powers in disorder, malnutrition, and how many old wounds all over?! Who’s the evil scum that abused you!! I’ll raise you, and I won’t let you get harmed again!”\n\nPrince of the Kingdom — Former Grand Marshal — Hero of Interstellar Space — Dark Shadow Liger — Arthur had a bunch of question marks floating over his head: “Is this guy sick in the head?”\n\n——\n\nThrough livestreaming his cub rearing skills, Mingyou sold off countless spirit beast nutrition supplements, and became the top wealthiest man in interstellar space.\n\nOne day, the king urged his fully recovered younger brother to return to work in the military.\n\nArthur-cat rolled over on the special order cat bed worth tens of millions, and lazily said: “As the cat of the wealthiest person, acting cute is my livelihood, why do I need to work?”\n\nBeside him lay his former subordinates, all nodding their furry heads, fully agreeing: “That’s right that’s right!”\n\n——\n\nMingyou later found out that the group of beast cubs at the brink of death he raised up actually used to be heroes who had all established illustrious achievements on the battlefield against the Zerg.\n\nThe war has ended. Interstellar space has returned to peace. And the heroes have removed their armor to return home.>"
}