{
	"url": "https://www.novelupdates.com/series/close-up-encounter-with-my-brothers-friend/",
	"title": "Close-up Encounter with My Brother’s Friend - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/07/Closeup-Encounter-with-My-Brothers-Friend.png",
	"noveltype": "(KR)",
	"genre": "Adult   Comedy   Romance   Slice of Life   Smut   ",
	"tags": "Childhood Friends   Cute Protagonist   Female Protagonist   Handsome Male Lead   Modern Day   Overprotective Siblings   Pilots   S*x Friends   Short Story   ",
	"rating": "(4.4 / 5.0, 20 votes)",
	"author": "Another   또다른   ",
	"year": "\n2021",
	"ranking": "#1583   #1815   #8549   #1960   #9150   ",
	"reviewcount": "1 Review sorted by",
	"description": "'N-No. I don't think this is it...'\r\n\r\nWhen the time came for her to experience her first time, Daon was in complete shock.\r\nThis was because her boyfriend's thing was incredibly small.\r\nAll the romantic fantasies she had dreamed of came shattering down in no time.\r\n\r\nAfter breaking up, she only wallowed in her despair for a brief moment.\r\nHer older brother's friend, whom she had known since she was young, began to catch her eye.\r\n\r\n'......!'\r\n\r\nShe could see an outline of something long and thick on his right thigh.\r\nIt looks like her ideal preference remains intact.\r\nBa-dump. Ba-dump. Daon's heart began to beat faster.\r\n\r\nLove bloomed out of trivial things, but it also cracked due to trivial matters.\r\n\r\n'What does the fact that the bastard has a small thing have to do with you kissing me?'\r\n'You're big, Oppa!'\r\n'How could you possibly know that?'\r\n'I saw it!'\r\n\r\n...Damn it.\r\n\r\n'You should have hidden it better, Oppa...'\r\n\r\nDaon continued to sneak glances at him with a carefree expression.\r\nWhenever their eyes met, she'd start giggling. He could hardly believe this was happening.\r\n\r\n'Sleep with me just once.'\r\n\r\n...This was ridiculous. Seriously.\r\n\r\n'I won't beat around the bush. If you sleep with me just once, I think I can continue living on those memories alone.'>"
}