{
	"url": "https://www.novelupdates.com/series/for-older-brother-i-will-seduce-the-male-lead/",
	"title": "For Older Brother, I Will Seduce the Male Lead - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/12/For-Older-Brother-I-Will-Seduce-the-Male-Lead.jpg",
	"noveltype": "(KR)",
	"genre": "Drama   Fantasy   Romance   ",
	"tags": "Adapted to Manhwa   Aristocracy   Brainwashing   Character Growth   Child Protagonist   Childcare   Dense Protagonist   Empires   European Ambience   Familial Love   Fantasy World   Female Protagonist   Misunderstandings   Mob Protagonist   Multiple POV   Nobles   Obsessive Love   Transmigration   ",
	"rating": "(3.9 / 5.0, 36 votes)",
	"author": "Sheep   양과람   ",
	"year": "\n2021",
	"ranking": "#6970   #4702   #7552   #9500   #6004   ",
	"reviewcount": "2 Reviews sorted by",
	"description": "She possessed into an obsessive tragedy novel that had neither any hopes nor dreams.\n\nMore precisely, after having an unrequited love with the female lead who had a contract marriage with the male lead, and ending in his death. She possessed Raphine, the youngest little sister of the second male lead!\n\nTo think it was such a miserable ending for my favorite character and kind eldest brother. No way, never!\n\nIn order to prevent the female lead’s contract marriage, Raphine decided to brainwash the Imperial Crown Prince Zerkan, the male protagonist of the novel. So that when he needs a contract marriage, he’ll remember her!\n\n“Older Brother Zerkan! Will you marry me?”\n\n“If you’re thankful, you have to marry me next time.”\n\n“You need a political marriage, you know. At that time, have a contract marriage with me…”\n\nAnd when the brainwashing finally succeeded, Raphine cheered inside.\n\n“Yeah. For sure, I’ll marry you.”\n\nWith a look in his eyes which she couldn’t even imagine at all.\n\n***\n\nYeah, she really didn’t know at that time things would become like this.\n\n“You said you wanted to marry me, and it wasn’t long ago when you pestered me at all times…”\n\n“….”\n\n“And now, you're running away?”>"
}