{
	"url": "https://www.novelupdates.com/series/plague-doctor/",
	"title": "Plague Doctor - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/05/plaguedoctor4.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Horror   Mature   Mystery   Psychological   Seinen   Supernatural   ",
	"tags": "Adapted to Manhua   Calm Protagonist   Clever Protagonist   Comedic Undertone   Dark   Death of Loved Ones   Doctors   Evil Organizations   Evil Religions   Gore   Handsome Male Lead   Hidden Abilities   Hospital   Investigations   Magic   Male Protagonist   Military   Modern Day   Mutated Creatures   Mutations   Mysterious Family Background   Mysterious Past   Mystery Solving   Nightmares   Parasites   Past Plays a Big Role   Past Trauma   Righteous Protagonist   Romantic Subplot   Secret Organizations   Secrets   Special Abilities   System Administrator   Terminal Illness   Thriller   ",
	"rating": "(4.2 / 5.0, 65 votes)",
	"author": "Wallee The Robot   机器人瓦力   ",
	"year": "\n2019",
	"ranking": "#2000   #2000   #5830   #7472   #8354   ",
	"reviewcount": "18 Reviews sorted by",
	"description": "The once-bustling and noisy streets were now filled with an eerie blanket of silence.\r\n\r\nHoarse and frenzied whispers lingered high above the heavens, and an indescribable ancient giant lurked in the shadows of the bottomless ocean.\r\n\r\nA mysterious plague had outbroken, and natural disasters wrought the Earth. Global pandemic and catastrophes had the panicked masses seeking illusory shelters from the devastation, day and night.\r\n\r\nA bloody shower poured over the land as the streaks of lightning tore across the sky, illuminating the ill-intentioned gathering of ravens above. Nevermore, nevermore, quoth the ravens.\r\n\r\n“We can see that this malformed creature has twelve pairs of ribs like humans, but also has a “transverse bone” that humans do not possess…”\r\n\r\nIn the medical school, Gu Jun continued bringing down his scalpel, illustrating the abnormal thoracic structure of the malformed cadaver on the dissection table to the surrounding students.\r\n\r\nOminous and treacherous times had descended! Truth and logic had crumbled, order warped into a frenzy. Humanity can only forge ahead through the power of intelligence and wisdom.>"
}