{
	"url": "https://www.novelupdates.com/series/the-red-eyes/",
	"title": "The Red Eyes - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/09/the-red-eyes.png",
	"noveltype": "(CN)",
	"genre": "Horror   Supernatural   ",
	"tags": "",
	"rating": "(4.3 / 5.0, 3 votes)",
	"author": "Chen Yu   晨羽   ",
	"year": "\nN/A",
	"ranking": "#2000   #2000   #13372   #11075   #12804   ",
	"reviewcount": "No Reviews",
	"description": "Everyone has an unspeakable secret about her,\r\n\r\nit’s only she herself that doesn’t know…\r\n\r\n「Are you all that afraid that my memories will return?」\r\n\r\nHer frighteningly bewitching blood-red eyes, staring unwaveringly.\r\n\r\n「No matter how cruel reality is, I will never let you face it alone, I swear.」\r\n\r\nXiao Yutang has experienced the same recurring dreams more than once, in the dream was a blurred face of a stranger\r\n\r\nShe always wakes up crying, opening her eyes to the screams of the people around her, and later noticing that the windows were either cracked or the glass cups shattered.\r\n\r\nAround that time, she receives consecutive letters from her long lost elementary school friend Jiang Wanqian, requesting to meet up with her.\r\n\r\nShe notices a subtle coincidence——\r\n\r\nThose queer dreams always appear on the night of receiving those letters.\r\n\r\nThere are many other strange things happening to Xiao Yutang, such as her high fever of unknown origin. \r\n\r\nShe has to check her temperature regularly every day, as soon as it reaches 39 degrees,\r\n\r\nShe must immediately go to the school doctor, Kang Xurong, to take an unidentified red pill.\r\n\r\nDespite the doubts in her heart, she trusts that Kang Xurong will not harm her, because during the days where her life is no better than dead, Kang Xurong was the only person by her side.\r\n\r\nXiao Yutang does not have any interest in Jiang Wanqian’s letters in the first place, but when she notices Kang Xurong becoming upset because of her indifference, she changes her mind, and agrees to  meet up with the other party.\r\n\r\nShe doesn’t want Kang Xurong to be disappointed in herself; she wants Kang Xurong to always smile at her.\r\n\r\nHowever, after meeting Jiang Wanqian, a series of difficult and bizarre mysteries unravels.\r\n\r\nEspecially when Jiang Wanqian repeatedly claims that Xiao Yutang had changed her face,\r\n\r\nRight now, she is wearing someone else’s face……>"
}