{
	"url": "https://www.novelupdates.com/series/rose-dust/",
	"title": "Rose Dust - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/01/Rose-Dust.jpg",
	"noveltype": "(CN)",
	"genre": "Drama   Romance   ",
	"tags": "College/University   Female Protagonist   Modern Day   Music   Rivalry   ",
	"rating": "(3.0 / 5.0, 2 votes)",
	"author": "水阡墨   ",
	"year": "\nN/A",
	"ranking": "#2000   #2000   #13482   #11742   #13089   ",
	"reviewcount": "No Reviews",
	"description": "Ye Jiegeng was an ordinary girl living in a single-parent household. After the death of her mother, she followed her father to W City to open a flower shop and studied at C University. She was smart, kind, and a little clumsy. Despite all her hard work, she always ranked second in the entire department.\r\n\r\nFor the sake of surpassing Anyang Chunyuan, the first in the entire department, she gave it her all, but ended up developing some inexplicable jealousy and admiration for this boy. \r\n\r\nLater, she learned that Anyang Chunyuan lived far away from his family and stayed alone in W City. She accidentally met him at her flower shop, where she sent his feverish self back to the rental house, further shortening the distance between the two. \r\n\r\nChunyuan is a person who is indifferent and distant but courteous, even so, the tenderness and inadvertent pain lurking in his heart slowly attracted Jiegeng to approach. It’s just that Chunyuan’s strong sense of distance made Jiegeng feel inferior and small. \r\n\r\nJust as she wanted to leave, the news broke that Anyang Chunyuan was the illegitimate child of a celebrity. All kinds of criticism made him exhausted physically and mentally. \r\n\r\nOnce again, Jiegeng showered him with her kindness but found that her mother’s death had a lot to do with him. Chunyuan was panicked by Jiegeng’s distancing herself from him when the news of his mother’s serious illness suddenly arrived from another city. \r\n\r\nWill he be able to forgive his mother for everything she did, and will he be able to get his sister’s forgiveness?>"
}