{
	"url": "https://www.novelupdates.com/series/from-the-day-i-was-ridiculed-as-a-window-editor-and-cheated-on-by-my-wife-i-lived-with-the-twin-jks/",
	"title": "From the Day I Was Ridiculed as a Window Editor and Cheated on by My Wife, I Lived With The Twin JKs - Novel Updates",
	"image": "https://www.novelupdates.com/img/noimagefound.jpg",
	"noveltype": "(JP)",
	"genre": "Comedy   Ecchi   Harem   Romance   Seinen   Slice of Life   ",
	"tags": "Absent Parents   Beautiful Female Lead   Betrayal   Books   Caring Protagonist   Childhood Love   Clumsy Love Interests   Co-Workers   Cohabitation   Dense Protagonist   Doting Love Interests   Editors   First Love   Hard-Working Protagonist   Inferiority Complex   Kind Love Interests   Love Interest Falls in Love First   Love Rivals   Male Protagonist   Mature Protagonist   Misunderstandings   Modern Day   Multiple POV   Parent Complex   Past Plays a Big Role   R-15   Shy Characters   Stoic Characters   Strong Love Interests   Unconditional Love   Unrequited Love   Wealthy Characters   Younger Love Interests   ",
	"rating": "(3.5 / 5.0, 60 votes)",
	"author": "Ibarakino   茨木野   ",
	"year": "\n2021",
	"ranking": "#4617   #4066   #2948   #4312   #5824   ",
	"reviewcount": "5 Reviews sorted by",
	"description": "I’m Mitsuhiko Okaya, 29 years old.\n\nI’m an editor at a publishing company.\n\nThe day I witnessed my wife cheating on me, twin JKs suddenly came to my house.\n\n“Uncle, if you let me stay tonight, you can do …… naughty things ♡”\n\n“That …… please …… you’re the only person I can rely on …….”\n\nAkari, a blonde gal, and Nanako, a neat, black-haired girl, a pair of high school girls I’ve never met, but they look vaguely familiar.\n\nAfter my wife cheated on me, I moved to a new publishing company and started a strange life together with these two high school girls.\n\nAkari, the younger sister, who aggressively seduces me, and Nanako, the older sister, who is reserved but actually very naughty.\n\nThe two of them heal me, and together we heal my wounded heart. ……\n\nOne day, my ex-wife apologizes to me. In addition, the person she cheated on me with and my old boss came to me on their knees.\n\nShe said that she realized that I was actually competent at my previous publishing company and came to apologize.\n\nBut it was too late. I’m enjoying my new life with the beautiful JKs and my white workplace.>"
}