{
	"url": "https://www.novelupdates.com/series/seven-days-escape-game/",
	"title": "Seven Days Escape Game - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/08/7daysescape.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Horror   Psychological   Romance   Supernatural   Yaoi   ",
	"tags": "Alternate World   Amnesia   Cross-dressing   Death   Fantasy World   Ghosts   Gore   Handsome Male Lead   Multiple Protagonists   Power Couple   Survival Game   Teamwork   Unlimited Flow   ",
	"rating": "(4.0 / 5.0, 26 votes)",
	"author": "月下归   ",
	"year": "\n2019",
	"ranking": "#4617   #6372   #8090   #10063   #5574   ",
	"reviewcount": "3 Reviews sorted by",
	"description": "Humanity was inexplicably involved in a supernatural escape game.\r\n\r\nTo others, the escape game opened the door to a new world.\r\n\r\nTo BoYe, the escape game opened the door to a new coquettish wardrobe.\r\n\r\nIn the campus copy, everyone only saw the long-haired female ghost Sadako, but BoYe only saw the JK uniform on the female ghost.\r\n\r\nHe decided: 'Bring a set back for my boyfriend to wear.'\r\n\r\nIn the hospital copy, everyone avoided the NPC nurse as if she was a venomous snake, but BoYe stared at the nurse's white uniform for a very long time.\r\n\r\nHe decided: 'Bring a set back for my boyfriend to wear.'\r\n\r\nBoyfriend Tang Zhi: 'Are you done being shameless? I'm not wearing it.'\r\n\r\nThe husband and wife worked hard together to turn every round of the game into a uniform temptation.\r\n\r\nWhen forming teams, GuMeng met three fresh and refined men: A pair of extremely capable husbands and a fool who was always joking around.\r\n\r\nIn the campus copy, GuMeng became roommates with a fool who had an unknown background.\r\n\r\nIn the night when the sky was dark and winds were harsh, the male suddenly said, 'Don't use your phone to look at supernatural photos after turning the lights off.'\r\n\r\nGuMeng was so frightened and thought he had triggered a death trap. He hurriedly turned his phone off.\r\n\r\nHe looked towards the male. 'W-Why?'\r\n\r\n'Because......' The male's gaze was solemn, and he finally said, 'Playing your phone in the dark is bad for your vision.'\r\n\r\n'......Stop fooling around.'>"
}