{
	"url": "https://www.novelupdates.com/series/supernatural-movie-actor-app/",
	"title": "Supernatural Movie Actor App - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/04/movieactorapp1.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Horror   Mystery   Romance   Shounen Ai   Supernatural   ",
	"tags": "Acting   Arrogant Characters   Calm Protagonist   Charismatic Protagonist   Clever Protagonist   Comedic Undertone   Confident Protagonist   Cunning Protagonist   Death   Determined Protagonist   Devoted Love Interests   Doting Love Interests   Game Elements   Genius Protagonist   Ghosts   Glasses-wearing Protagonist   Gore   Handsome Male Lead   Hard-Working Protagonist   Kidnappings   Loyal Subordinates   Lucky Protagonist   Manly Gay Couple   Modern Day   Movies   Multiple Personalities   Mystery Solving   Narcissistic Protagonist   Obsessive Love   Parallel Worlds   Power Couple   Pragmatic Protagonist   Previous Life Talent   Priests   Protagonist Strong from the Start   Second Chance   Sharing A Body   Sibling Rivalry   Strong Love Interests   Survival Game   Transmigration   Unlimited Flow   World Hopping   Zombies   ",
	"rating": "(4.7 / 5.0, 661 votes)",
	"author": "戏子祭酒   浪棠   ",
	"year": "\n2020",
	"ranking": "#1082   #1544   #670   #417   #587   ",
	"reviewcount": "148 Reviews sorted by",
	"description": "Xie Chi is a patient with multiple personality disorder. On the surface, he is educated and gentle but the secondary personality is cold, ruthless, and powerful, with explosive strength.\n\nXie Chi can never fall in love with others because the secondary personality is his boyfriend.\n\nXie Chi’s only dream is to one day embrace his lover.\n\nIn order to realize his dream, Xie Chi willingly binded with the Horror Movie Actor App. The app regularly releases horror movie notices such as Spirit in Red Clothes, Zombie Lovers, 1552 Haunted House, etc…\n\nSelected actors will be placed in a real horror environment to survive.\n\nOn the first day of filming, the first male lead with a dirty personality blocked Xie Chi in the corner. “Follow me and I’ll help you be the second male lead.”\n\nXie Chi smiled softly and shook his head. “That isn’t enough.”\n\nThe first male lead was dumbfounded.\n\nXie Chi smiled slightly. “Brother, help me beat him up.”\n\nThe secondary personality gave a cold smile to the first male lead.\n\nEnd of the shoot, the first male lead: Xie Chi.\n\nOthers: Struggling to survive.\n\nXie Chi: Defy the natural order to change fate.\n\nA combination of absolute wisdom and absolute force.\n\nStarting from the 18th tier, Xie Chi will eventually become… the horror movie emperor.>"
}