{
	"url": "https://www.novelupdates.com/series/the-path-of-the-cannon-fodders-counterattack/",
	"title": "The Path of the Cannon Fodder’s Counterattack - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/09/The-Path-of-the-Cannon-Fodders-Counterattack.jpg",
	"noveltype": "(CN)",
	"genre": "Adult   Comedy   Drama   Fantasy   Historical   Mature   Romance   Smut   Yaoi   ",
	"tags": "Ancient China   Ancient Times   Bisexual Protagonist   Cautious Protagonist   Cowardly Protagonist   Cute Protagonist   Dense Protagonist   Dishonest Protagonist   Doting Love Interests   Drugs   Eunuch   Handsome Male Lead   Jealousy   Manipulative Characters   Multiple Reincarnated Individuals   Past Plays a Big Role   Possessive Characters   Previous Life Talent   R*pe Victim Becomes Lover   Revenge   Royalty   R*pe   Schemes And Conspiracies   Second Chance   Strong Love Interests   Transmigration   Transported to Another World   Weak Protagonist   ",
	"rating": "(4.1 / 5.0, 773 votes)",
	"author": "Mao Niao   毛鸟   ",
	"year": "\n2016",
	"ranking": "#1037   #3751   #716   #1466   #292   ",
	"reviewcount": "165 Reviews sorted by",
	"description": "Ling Xiao was secretly in love with a girl named Mo Qi; because of an accident, they both crossed into the ancient times.\n\nMo Qi who was preinstalled with the Mary Sue halo, in these ancient times, walked to the summit with a golden finger.\n\nHowever, Ling Xiao continued to be exploited by Mo Qi.\n\nAfter he no longer had any values to exploit, he soon became a pitiful cannon fodder.\n\nThe heavens decided to take pity on Ling Xiao.\n\nAnd gave Ling Xiao an opportunity for rebirth.\n\nAfter rebirth, he vowed that all his enemies would repay him with a debt of blood!\n\nHowever, why have all these enemies of his, fallen into the mode of cutting their heads open?\n\n“Hey, are you really that unremarkable person who used to follow behind Mo Qi?”\n\n“So this dance was originally danced by you, sigh……”\n\n“You are obviously a man, yet you move me so much.”\n\n“Enough! Since you have taken the initiative to provoke me, then you must concentrate on me!”\n\nLing Xiao expressed: If you want to counterattack, then counterattack. As long as your golden finger is bigger than Mo Qi’s.\n\nBut how did Mo Qi’s Mary Sue halo end up in his body! He is still a straight man who likes beauties! He definitely, definitely doesn’t want to turn bent!>"
}