{
	"url": "https://www.novelupdates.com/series/love-advice-from-a-childhood-friend/",
	"title": "Love Advice From A Childhood Friend - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/06/Love-Advice-From-A-Childhood-Friend.jpg",
	"noveltype": "(JP)",
	"genre": "Comedy   Romance   School Life   Slice of Life   ",
	"tags": "Beautiful Female Lead   Childhood Friends   Dense Protagonist   Friendship   Handsome Male Lead   Male Protagonist   Popular Love Interests   Shy Characters   ",
	"rating": "(3.6 / 5.0, 61 votes)",
	"author": "Kennoji   ケンノジ   ",
	"year": "\n2021",
	"ranking": "#3802   #2000   #4892   #5350   #4866   ",
	"reviewcount": "2 Reviews sorted by",
	"description": "“I’ve found someone I like.”\n\nIn his second year of high school, the main character, Ryunosuke, was asked for advice by his childhood friend, Hinagata Shiori, who sat next to him in class.\n\nWhy does Takamine’s beautiful childhood friend look down on herself?\n\nDespite his doubts, the protagonist, who has never been in love before, tries to answer his childhood friend’s earnest question.\n\nWouldn’t she prefer asking someone more dependable? But his childhood friend shakes her head, saying that she prefers Ryunosuke.\n\nWhen he asked her about it, she said that the person she likes has similar characteristics to him.\n\n(Isn’t that me?). But he was too embarrassed to ask her, fearing that he might be wrong.\n\n“He’s good-looking, from my point of view.'\n\n(Oh, no.)\n\n“He doesn’t have many friends. He’s also a bit of a nerd.”\n\n(You mean me?)\n\n“But he’s refreshing.”\n\n(That’s not me.)\n\n“He’s a guy I’ve known for a long time who lives in my neighborhood.”\n\n(That’s me, right?)\n\nWithout knowing for sure, Ryunosuke gives Shiori some advice even though he doesn’t know what to do with her.\n\nBut what he doesn’t realize is that his advice is being put into practice.\n\nAs he counsels her, he becomes aware of her as a girl, and before he knows it, he begins to like her without even realizing it.>"
}