{
	"url": "https://www.novelupdates.com/series/the-cheat-plant-mage-hides-to-live-a-slow-life-%ef%bd%9e-ive-been-banished-from-the-court-and-want-to-raise-a-world-tree-but-my-territory-is-too-strong%ef%bd%9e/",
	"title": "The Cheat Plant Mage Hides to Live a Slow Life!! ～ I’ve Been Banished from the Court and Want to Raise a World Tree but my Territory is too Strong～ - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/04/The-Cheat-Plant-Mage-Hides-to-Live-a-Slow-Life-Ive-Been-Banished-from-the-Court-and-Want-to-Raise-a-World-Tree-but-my-Territory-is-too-Strong.jpg",
	"noveltype": "(JP)",
	"genre": "Adventure   Fantasy   Harem   Romance   Slice of Life   Supernatural   ",
	"tags": "Adventurers   Beastkin   Beautiful Female Lead   Cheats   Demi-Humans   Dense Protagonist   Empires   Farming   Heartwarming   Magic   Male Protagonist   Monster Tamer   Nobles   Reincarnated in Another World   Spirit Advisor   Sword And Magic   World Tree   ",
	"rating": "(3.1 / 5.0, 38 votes)",
	"author": "Ameko Kaeruta   蛙田あめこ   ",
	"year": "\n2022",
	"ranking": "#3633   #1488   #3151   #3762   #5478   ",
	"reviewcount": "1 Review sorted by",
	"description": "In his previous life, Riito lived as a corporate s*ave and was reborn in another world.\n\nAfter his reincarnation, he ended the war and was praised as a hero by using his “plant magic” skills.\n\nHowever, his peaceful life is short-lived after he was framed by a colleague who is jealous of him and was banished from the country.\n\nAlthough he is exiled, Riito, who has long been longing for a slow life, is overjoyed inside.\n\nHe decided to build his own ideal village.\n\nHe quickly bought a deserted plot of land and tried to build a village by using his plant magic leisurely, but the land he acquires seems to be inhabited by flower girls…!?\n\nThe village becomes more and more lively as not only the flower girls but also a lady from the empire and some cat girls visit him who unconsciously showed his cheat.\n\nFurthermore, it turns out that the seed that Riito has been secretly growing was actually an extraordinary existence…!?>"
}