{
	"url": "https://www.novelupdates.com/series/an-s-rank-adventurer-me-along-with-those-girls-who-are-slaves-form-a-slaves-only-harem-guild/",
	"title": "An S Rank Adventurer Me Along With Those Girls Who Are S*aves, Form A S*aves Only Harem Guild - Novel Updates",
	"image": "https://www.novelupdates.com/img/noimagefound.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adult   Drama   Fantasy   Harem   Romance   ",
	"tags": "Adapted to Manga   Adventurers   Betrayal   Cheats   Depictions of Cruelty   Dragons   Early Romance   First-time Interc**rse   F*llatio   Goblins   Guilds   Harem-seeking Protagonist   Kind Love Interests   Loli   Love at First Sight   Male Protagonist   Masochistic Characters   Master-Servant Relationship   Multiple POV   Polygamy   Protagonist Strong from the Start   R-18   Revenge   Sadistic Characters   S*ave Harem   S*aves   Strong Love Interests   Sword And Magic   Twins   Younger Love Interests   ",
	"rating": "(3.2 / 5.0, 151 votes)",
	"author": "Hiiragisaki   柊咲   ",
	"year": "\n2018",
	"ranking": "#1899   #1353   #1210   #4565   #1072   ",
	"reviewcount": "12 Reviews sorted by",
	"description": "An S Rank Adventurer that’s feared by everybody, Egil, had only done monster subjugations alone the whole time since becoming an Adventurer.\n\nBut one day, Egil was brought along by an acquaintance to a slave auction.\n\nSomething like a slaveーーwas what Egil had thought but, when he fell in love at first sight with a virgin slave called Eleanor, he knocked down with all the gold he earned from quests without any hesitation.\n\nBut she has a secret. It is that she holds a strong resentment towards her childhood friend Adventurer who sold her off to a slave trader and she has set her heart on revenge. Egil who learned of that, vowed to lend a hand in that revenge.\n\nNot all slaves are badーー.\n\nAfterwards, those girls who are slaves gather around Egil and ended up being together with him.\n\nThis is a tale of the world’s strongest S Rank Adventurer, Egil, forming a harem guild with those girls who are slaves and travelling the world.>"
}