{
	"url": "https://www.novelupdates.com/series/bursting-after-he-transmigrated-into-the-cannon-fodder-omega/",
	"title": "Bursting After He Transmigrated into the Cannon Fodder Omega - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/07/Bursting-After-He-Transmigrated-into-the-Cannon-Fodder-Omega.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Comedy   Drama   Fantasy   Mecha   Romance   Sci-fi   Yaoi   ",
	"tags": "Battle Competition   Broken Engagement   Character Growth   Cold Love Interests   Devoted Love Interests   Empires   Family Conflict   Futuristic Setting   Genius Protagonist   Handsome Male Lead   Hard-Working Protagonist   Hiding True Abilities   Hiding True Identity   Kuudere   Late Romance   Love Interest Falls in Love First   Military   Misunderstandings   Omegaverse   Overpowered Protagonist   Power Couple   Previous Life Talent   Royalty   Schemes And Conspiracies   Shameless Protagonist   Slow Romance   Smart Couple   Strong Love Interests   Strong to Stronger   Tragic Past   Transmigration   Unique Weapons   Weak to Strong   Wealthy Characters   ",
	"rating": "(4.4 / 5.0, 424 votes)",
	"author": "宿寒屿   ",
	"year": "\n2020",
	"ranking": "#197   #285   #789   #386   #761   ",
	"reviewcount": "101 Reviews sorted by",
	"description": "Yun Xingze transmigrated into an ABO novel and became the cannon fodder omega. The family business is declining and his fiancé doesn’t like him. According to the original plot, with his love-filled brain, he dedicated everything to the male lead Chi Yu, but ended up losing the marriage, finally cutting off his glands and died of infection.\n\nThe former mecha genius Yun Xingze said: I am very busy and will not play with you.\n\nAfter tearing apart the script, he was obsessed with mechas, ready to realize his past life’s dream.\n\nDelicate and frail omegas have always been unsuitable for piloting mecha armor. However, in this year’s XingHai Military Academy’s mecha contest, a new omega student named Yun Xingze appeared, driving a pitiful second-hand armor. Everyone thought he was provoked by the broken engagement and ready to watch a joke, but they were shocked when Yun Xingze suppressed a group of alphas with his mecha!\n\nEveryone: ??? Is this reasonable?!\n\nSomething more shocking is yet to come-\n\nYun Xingze broke the winning streak in the Mecha Contest!\n\nThe mecha designed by Yun Xingze was sold at a high price at the auction!\n\nThe mecha technology created by Yun Xingze is desired by all-interstellar mecha companies!\n\nThe whole interstellar wants to hold his thigh!\n\n——–\n\nAfter the dissolution of their marriage contract, Chi Yu waited for Yun Xingze to regret it, but the one who regretted it was himself. Fortunately, there is a rule in the Empire: AOs with high pheromone matching must be together.\n\nYun Xingze is destined to become his fiancee.\n\nHowever, at the engagement banquet, before Chi Yu had time to propose, Yun Xingze sneered and severed his glands. As described in the original book, the pheromone floated in the air, and like a rose, withered quickly.\n\nChi Yu was shocked and heartbroken, but before he could do anything, another tall figure hugged Yun Xingze and rushed out of the banquet.\n\nEveryone showed a surprised expression.\n\nEven Yun Xingze looked at the person holding him in surprise-\n\nHe was the villain, Luo Wenchuan. In the original book, the second prince of the Star Empire was tall and handsome, but cold and unkind.\n\nBut at this moment, his eyes were red with anxiety.>"
}