{
	"url": "https://www.novelupdates.com/series/hazure-skill-kage-ga-usui-o-motsu-guild-shokuin-ga-jitsuha-densetsu-no-ansatsusha/",
	"title": "Hazure Skill “Kage ga Usui” o Motsu Guild Shokuin ga, Jitsuha Densetsu no Ansatsusha - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2019/07/39471.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Comedy   Fantasy   Harem   Mature   Romance   ",
	"tags": "Adapted to Manga   Assassins   Beautiful Female Lead   Calm Protagonist   Childcare   Clingy Lover   Cohabitation   Couple Growth   Demon Lord   Depictions of Cruelty   Devoted Love Interests   Early Romance   Elves   Enemies Become Lovers   Evil Organizations   Fearless Protagonist   First-time Interc**rse   Friendship   Glasses-wearing Protagonist   Guilds   Handsome Male Lead   Heartwarming   Hiding True Identity   Human-Nonhuman Relationship   Jack of All Trades   Kind Love Interests   Lack of Common Sense   Loli   Love Interest Falls in Love First   Loyal Subordinates   Magic   Male Protagonist   Overpowered Protagonist   Perverted Protagonist   Polygamy   Proactive Protagonist   Quiet Characters   Quirky Characters   R-15   Ruthless Protagonist   Schemes And Conspiracies   Shameless Protagonist   Strong Love Interests   Threesome   Torture   Vampires   Zombies   ",
	"rating": "(3.6 / 5.0, 94 votes)",
	"author": "Hayol(하율)   Kennoji   ",
	"year": "\n2018",
	"ranking": "#5262   #3809   #993   #769   #1193   ",
	"reviewcount": "9 Reviews sorted by",
	"description": "Roland is an assassin who, one day, breaks from his team and single-handedly “kills” the demon king.\n\nAfter returning to the kingdom, the king graciously promises Roland whatever he wants for his heroics. Conflicted in his desires – he hasn’t thought of anything outside of killing for years – he remembers that one of his teammates told him what she plans to do after evil is defeated:\n\nLive a slow life.\n\nAnd so Roland, with his ability to blend perfectly into the crowd and the disguised demon king Laila at his side, decides to live a – say it with me – slow life.>"
}