{
	"url": "https://www.novelupdates.com/series/into-the-world-of-medicine/",
	"title": "Into the World of Medicine - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2017/02/Into-the-World-of-Medicine.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Fantasy   Josei   Martial Arts   Romance   Xuanhuan   ",
	"tags": "Beast Companions   Beautiful Female Lead   Broken Engagement   Calm Protagonist   Clever Protagonist   Cultivation   Doctors   Doting Love Interests   Fast Cultivation   Female Protagonist   Handsome Male Lead   Love Interest Falls in Love First   Magical Space   Medical Knowledge   Pill Concocting   Slow Romance   Special Abilities   Strong Love Interests   Transmigration   Transported to Another World   Ugly to Beautiful   Underestimated Protagonist   Weak to Strong   ",
	"rating": "(4.3 / 5.0, 346 votes)",
	"author": "Xia Ri Fenmo   夏日粉末   ",
	"year": "\nN/A",
	"ranking": "#5262   #2000   #511   #9890   #1086   ",
	"reviewcount": "28 Reviews",
	"description": "Rong Qingyan is a 21st century successor of a medicinal family, proficent in medical knowledge. But in the end, she has died in the hands of her relatives. Murong Qingyan is Sheng Hong Continent’s Murong family’s legitimate miss. But even though she is a legitimate daughter, she is the Murong family’s shame because her appearance is ugly and her meridians are blocked, making her a trash that cannot cultivate.\n\nAfter she transmigrated, she became her.\n\nWhen she reopened her eyes, the originally unable to cultivate trash let everyone stumble in shock. Flipping over clouds, going against the heavens and changing fate, letting those that originally looked down on her regret it deeply.\n\nContracting magical beasts, concocting immortal pills. Meeting gods, killing gods; meeting Buddhas, killing Buddhas; swearing to let all those that looked down on her see her in a new light.\n\nWhen the trash turned into a universally shocking prodigy, when the ugly appearance was shed off, she was no longer the original her. In the whole course of events, whose heart did she actually steal?\n\nHer ex fiancé regretted it deeply, but to no avail. The family that looked down on her is now immensly remorseful, yet they can’t change anything anymore.\n\nWhen she stood at the peak of the world, he was always by her side protecting and guarding her, letting her be able to freely soar in the sky.\n\nHe said: “In my life, I wish for nothing else. I only wish to love you forever.”\n\nShe said: ”If it is what you desire.”>"
}