{
	"url": "https://www.novelupdates.com/series/i-couldnt-confess-to-the-girl-i-liked-so-i-compromised-with-the-most-beautiful-girl-in-my-grade-and-all-i-got-was-a-shuraba/",
	"title": "I Couldn’t Confess to the Girl I Liked, so I Compromised With the Most Beautiful Girl in My Grade, and All I Got Was a Shuraba - Novel Updates",
	"image": "https://www.novelupdates.com/img/noimagefound.jpg",
	"noveltype": "(JP)",
	"genre": "Comedy   Drama   Harem   Psychological   Romance   School Life   ",
	"tags": "Beautiful Female Lead   Dense Protagonist   Jealousy   Love Interest Falls in Love First   Male Protagonist   Misunderstandings   Modern Day   Multiple POV   Possessive Characters   Tsundere   Yandere   ",
	"rating": "(3.0 / 5.0, 34 votes)",
	"author": "MTY   ",
	"year": "\n2022",
	"ranking": "#831   #2276   #4427   #690   #7579   ",
	"reviewcount": "5 Reviews sorted by",
	"description": "Komiya Youta is an ordinary high school boy with everything but an ordinary family environment.\n\nWhen Youta enters high school, his father offers him the condition of living alone. \n\n[To have a girlfriend by your seventeenth birthday.]\n\nIf he break the promise, living alone ends immediately  and his Father said he is going to be engaged to a shut-in daughter.\n\nYouta thought he had a year to spare, but from the first day of school, he had a one-sided love affair that persisted until he entered his second year.\n\nThen, ten days before the limit came.\n\nA beautiful girl who is called the goddess of the school appears in front of Youta.\n\n“Will you go out with me?”\n\nWith that one sentence, Youta gave up his one-sided love and became a boyfriend with the most beautiful girl in his grade. ……\n\n“I might really stab you in the back if I saw you talking happily to another girl.”\n\nShe was cool, but unexpectedly jealous.\n\nYouta’s involvement with girls has suddenly increased since he started dating.\n\nThe drama (Shuraba) unfolds with all kinds of girls and girlfriends, including the girl he had a crush on, the prince’s girl, his fiancée, friend gal, her sister-in-law, and others.\n\nYouta may not know, but he is actually disrupting the flags.\n\nBehind the scene, the girls are fighting over him.>"
}