{
	"url": "https://www.novelupdates.com/series/the-villainess-enjoys-a-carefree-married-life-in-a-former-enemy-country-in-her-seventh-loop/",
	"title": "The Villainess Enjoys a Carefree Married Life in a Former Enemy Country in Her Seventh Loop - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/12/httpsncode.syosetu.comn1784ga.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Fantasy   Josei   Romance   Slice of Life   ",
	"tags": "Adapted to Manga   Aristocracy   Beautiful Female Lead   Broken Engagement   Charismatic Protagonist   Charming Protagonist   Clever Protagonist   Cold Love Interests   Confident Protagonist   Cunning Protagonist   Devoted Love Interests   European Ambience   Fearless Protagonist   Female Protagonist   Handsome Male Lead   Hard-Working Protagonist   Kind Love Interests   Knights   Love Interest Falls in Love First   Nobles   Popular Love Interests   Power Couple   Previous Life Talent   Proactive Protagonist   Protagonist Strong from the Start   Quirky Characters   Royalty   Second Chance   Smart Couple   Strong Love Interests   Sword Wielder   Time Loop   Time Travel   Tomboyish Female Lead   Villainess Noble Girls   ",
	"rating": "(4.1 / 5.0, 215 votes)",
	"author": "Amekawa Touko   雨川透子   ",
	"year": "\n2020",
	"ranking": "#4080   #4806   #564   #5957   #319   ",
	"reviewcount": "36 Reviews sorted by",
	"description": "“Rishe Ilmgard Wertsner! I’m breaking off my engagement with you!”\r\n\r\n“Okay, I understand.”\r\n\r\n“Huh.”\r\n\r\nThe Duke’s daughter, Rishe left the evening party without delay.\r\n\r\nIn fact, for Rishe, this engagement has been terminated for the seventh time. That’s where her new life starts, after having enjoyed the way of life of a pharmacist and a dressed up knight, she lost her life at the age of 20 and has gone back to the scene where her engagement was broken off.\r\n\r\nNormally, this could have broken Rishe’s heart, but her mentality became strong.\r\n\r\nHer past six lives have been busy and fulfilling, she wants to live longer this time around.\r\n\r\nIf possible, she wants to live a life of leisure and squander money…\r\n\r\nTo commence her 7th life, Rishe has set up such a diagonal goal.\r\n\r\nHowever, in this life, she will be married to the Crown Prince of a militant nation, who killed her in her past life.\r\n\r\n…It’s probably better. It doesn’t matter if it’s a former rival country. In her seventh lifetime, she’ll enjoy loafing off at a castle!!\r\n\r\nAgainst all her determination, she inadvertently demonstrated the skills she had cultivated in her past lives and garnered attention as a brilliant Crown Princess.>"
}