{
	"url": "https://www.novelupdates.com/series/not-obedient/",
	"title": "Not Obedient - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/02/Not-Obedient.jpeg",
	"noveltype": "(CN)",
	"genre": "Comedy   Romance   Yaoi   ",
	"tags": "Blind Dates   Child Abuse   College/University   Cross-dressing   Devoted Love Interests   Doting Love Interests   Handsome Male Lead   Kind Love Interests   Misunderstandings   Modern Day   Multiple POV   Older Love Interests   Showbiz   Teachers   Tragic Past   Writers   ",
	"rating": "(3.6 / 5.0, 65 votes)",
	"author": "快递小咕   ",
	"year": "\n2021",
	"ranking": "#3017   #2646   #6596   #4004   #7180   ",
	"reviewcount": "5 Reviews sorted by",
	"description": "What should I do if I meet a high school class teacher on a blind date in women’s clothes, urgent!\n\nPretending to be a woman and a Zuojing* Shou x gentle and tolerant older man\n\nLian Yin is young and handsome, has a slender figure, proficient in makeup, and can fake his voice. In women’s clothing, he is flawless.\n\nSubstituting a Jiejie on her blind date, the opposite was an overconfident older man with an old-fashioned personality.\n\nBefore meeting, the older man sent a message—— \n\nOld man: I have to have a hot meal every day I come home after marriage.\n\nLian Yin: I won’t do it!\n\nOld man: In the photos of your memories, you’re dressed too cold, your skirt must be past your knees.\n\nLian Yin: It’s none of your business.\n\nOld man: I will give you living expenses every month and I will control the rest of the income.\n\nLian Yin: Claw! \n\nAfter meeting- \n\nThe older man was graceful and elegant: Hello, my name is Lang Zhuoyu.\n\nLian Yin suddenly picked up his bag and covered his face, shouting in his heart: Why does this guy have the same name as my high school classroom teacher? He even looks similar too?\n\nFollowing that, Lang Zhuoyu said lightly: I used to be a teacher, you look like my former student. Lian Yin: …Is it too late for me to live on another planet now?\n\nThe older man said that on purpose. \n\n* person who is very pretentious and loves to torment the people around him>"
}