{
	"url": "https://www.novelupdates.com/series/unlimited-fafnir/",
	"title": "Unlimited Fafnir - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/06/juuomujinnofafnir_v.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Comedy   Ecchi   Fantasy   Harem   Romance   School Life   Sci-fi   Shounen   Supernatural   ",
	"tags": "Adapted to Anime   Adapted to Manga   All-Girls School   Amnesia   Assassins   Battle Academy   Beautiful Female Lead   Calm Protagonist   Caring Protagonist   Charismatic Protagonist   Charming Protagonist   Childhood Friends   Childhood Love   Childhood Promise   Clever Protagonist   Cohabitation   Confident Protagonist   Cross-dressing   Determined Protagonist   Devoted Love Interests   Dragon Slayers   Dragons   Famous Protagonist   Fearless Protagonist   Firearms   Genius Protagonist   Godly Powers   Gods   Handsome Male Lead   Hard-Working Protagonist   Loli   Love Interest Falls in Love First   Magic   Male Protagonist   Marriage   Modern Day   Monsters   Older Love Interests   Overpowered Protagonist   Polygamy   Protagonist Strong from the Start   R-15   Royalty   Ruthless Protagonist   Saving the World   Siblings Not Related by Blood   Strong Love Interests   Strong to Stronger   Transformation Ability   Tsundere   Unique Weapons   Vampires   Younger Love Interests   ",
	"rating": "(4.0 / 5.0, 63 votes)",
	"author": "Tsukasa   ツカサ   ",
	"year": "\n2013\r\n",
	"ranking": "#6970   #6218   #6679   #5745   #4042   ",
	"reviewcount": "3 Reviews sorted by",
	"description": "With the sudden appearance of the monsters that came to be called dragons, the world had completely changed. Before long, supernatural girls with the power of the dragons, called “D”, were born within the human race. The secret existence of the only male “D”, the boy Mononobe Yuu, was forcefully thrown into the school where the girls of “D” gathered – Midgard, where he saw the naked body of one of the students, Iris.\r\n\r\nFurthermore, upon meeting his long lost sister Mitsuki, Yuu seems to have been enrolled into this school…!? “When there’s really no other choice, Iris, I will—kill you.” “Can I really… believe you?” The curtains open as the “one and only story” about the boy who was supposed to become the strongest assassin and the poorly performing girl unfolds—! Unlimited School Battle Action!\r\n\r\n—–\r\n\r\nA 3 chapter prequel side story was released alongside some of the anime blu-rays titled ‘Unlimited Fafnir Gaiden – Brynhildr Valkyries’ focusing on the Brynhildr class prior to the start of the main series.>"
}