{
	"url": "https://www.novelupdates.com/series/after-being-fancied-by-a-necromancer/",
	"title": "After Being Fancied by a Necromancer - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/06/After-Being-Fancied-by-the-Necromancer.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Fantasy   Shounen Ai   Yaoi   ",
	"tags": "Academy   Aristocracy   Black Belly   Cute Protagonist   European Ambience   Fantasy World   Fast Learner   Handsome Male Lead   Hiding True Identity   Love at First Sight   Love Interest Falls in Love First   Magic   Male Yandere   Misunderstandings   Necromancer   Obsessive Love   Orphans   Servants   Slow Romance   Transmigration   Wizards   World Travel   ",
	"rating": "(4.5 / 5.0, 18 votes)",
	"author": "一口西多士   ",
	"year": "\n2021",
	"ranking": "#2000   #2000   #9435   #7461   #8898   ",
	"reviewcount": "1 Review sorted by",
	"description": "Cyril was a Harry Potter book fan. He unexpectedly obtained a chatterbox system that said it would take him to experience the desired Wizarding World.\n\nHe rubbed his hands together gleefully. Was there such a good thing?\n\nHowever, once the system was finished, he found that this Wizarding World didn’t seem quite right?\n\nCyril (eyes shaking: Forest monster? Brass steam train? Gloomy wizard’s tower? Wizarding academy of the fittest? This wasn’t right!\n\nSystem (forcing itself to be calm): Magic creatures! The appearance doesn’t matter! The architecture isn’t the key! It is still a wizarding academy! There isn’t anything wrong with it! Not bad, not bad!\n\nCyril struggled to make it through the Blackheart Wizard Academy. Fortunately, there was the gentle and courteous chief gentleman to cling to. This was until he found that the handsome chief seemed to be plotting against him…\n\nMy god! This seemed to the other identity of the crazy great magician and necromancer?\n\n***\n\nAccording to legends, the dark, paranoid, crazy and perverted great necromancer rubbed the white and delicate neck of the beautiful young man in his arms and whispered, “My dear, I heard that you have been very close to the commander of the Holy Light Knights recently?\n\nCyril denied it three consecutive times with an innocent face, “I’m not! I didn’t! Who is talking nonsense?”>"
}