{
	"url": "https://www.novelupdates.com/series/kenkyo-kenjitsu-o-motto-ni-ikite-orimasu/",
	"title": "Kenkyo, Kenjitsu o Motto ni Ikite Orimasu - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2015/12/image.jpeg",
	"noveltype": "(JP)",
	"genre": "Comedy   School Life   Shoujo   Slice of Life   ",
	"tags": "Academy   Acting   Age Progression   Brother Complex   Bullying   Calm Protagonist   Caring Protagonist   Child Protagonist   Coming of Age   Cowardly Protagonist   Cute Protagonist   Dense Protagonist   Discrimination   Doting Older Siblings   Easy Going Life   Familial Love   Family Business   Female Protagonist   Friendship   Handsome Male Lead   Hard-Working Protagonist   Late Romance   Lazy Protagonist   Misunderstandings   Mob Protagonist   Modern Day   Multiple POV   Quirky Characters   Reincarnated in Another World   Secretive Protagonist   Siblings   Sister Complex   Slow Romance   Stubborn Protagonist   Unreliable Narrator   Unrequited Love   Villainess Noble Girls   Wealthy Characters   ",
	"rating": "(4.6 / 5.0, 1482 votes)",
	"author": "Hiyoko no kēki   ひよこのケーキ   ",
	"year": "\n2013\r\n",
	"ranking": "#3802   #963   #155   #760   #59   ",
	"reviewcount": "270 Reviews sorted by",
	"description": "It was something that happened while I was waiting for the day of the primary school entrance exam. I realised that I had become one of the characters of a shoujo manga that I loved reading in my old life, ‘You Are My Dolce’.\n\nThe role I was assigned was a character who bullied the commoner protagonist and tried to get in the way of her love with a rich boy nicknamed Emperor; a typical villainess rich girl, Kisshouin Reika.\n\nAt the end of the story, Reika suffered the Emperor’s retribution and even her family fell into ruin. With the villain gone, the protagonist and the Emperor overcame their trials and became a couple. And they lived happily ever after.\n\nWait, that’s terrible for meee! The manga ended there, but I have to continue living my life after my family is ruined!\n\nThe protagonist can enjoy her romance or love or whatever on her own. I’ll erase my presence so that I don’t anger the Emperor.\n\nEh-? The story isn’t progressing well because there’s no villain, you say? But I’m busy saving up money and studying so that I can live well after the collapse.>"
}