{
	"url": "https://www.novelupdates.com/series/konoha-hypocrite/",
	"title": "Konoha Hypocrite - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/01/Konoha-Hypocrite.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Fantasy   Martial Arts   Mature   Psychological   ",
	"tags": "Ability Steal   Acting   Betrayal   Bloodlines   Buddhism   Cold Protagonist   Cruel Characters   Cunning Protagonist   Depictions of Cruelty   Dishonest Protagonist   Evil Protagonist   Eye Powers   Fanfiction   Genius Protagonist   Gods   Handsome Male Lead   Hypnotism   Male Protagonist   Manipulative Characters   Mature Protagonist   Overpowered Protagonist   Power Struggle   Reincarnation   Ruthless Protagonist   Samurai   System Administrator   Transmigration   Weak to Strong   ",
	"rating": "(4.1 / 5.0, 68 votes)",
	"author": "锋任怨   ",
	"year": "\n2021",
	"ranking": "#1046   #2096   #4150   #5009   #8631   ",
	"reviewcount": "14 Reviews sorted by",
	"description": "Crossing to the Naruto World, Uchiha Tonan obtained the ‘Legacy Inheritance System’. As long as the people who acknowledged him died, he could inherit all abilities of the deceased.\n\nTherefore…\n\n“Konoha’s higher-ups mistreated the Uchihas. So, I’ve decided to lead the clan to launch a coup d’état after three years.”\n\n“Ding! Gained Uchiha clan’s acknowledgment.”\n\nTwo years later.\n\n“Tonan, this is the evidence of the Uchiha clan’s betrayal. When all is said and done, it’s your clan. So, I want to hear your opinion.”\n\n“I’ll always stand on the village’s side.”\n\nOn that fateful night, Tonan stood on the Hokage Rock, coldly watching the Uchihas’ annihilation.\n\nHe spread his hands, being grateful to his clansmen’s gifts.\n\nThe next day.\n\n“Lord Hokage, I shed blood for Konoha and became the village’s sword. And this was how you treated the meritorious clan.”\n\n“Tonan, didn’t you agree to it!?”\n\n“I don’t know what you are talking about. The fury of clan extermination is irreconcilable. Today, I will destroy the Sarutobi and Shimura clans to appease my clan members’ souls in heaven.”\n\nA high-leveled hunter often puts on a disguise to lower the prey’s guard.>"
}