{
	"url": "https://www.novelupdates.com/series/online-dating-girlfriend-turn-into-brother/",
	"title": "Online Dating Girlfriend Turn Into Brother! - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/11/Online-Dating-Girlfriend-Turn-Into-Brother.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Romance   School Life   Shounen Ai   Slice of Life   Yaoi   ",
	"tags": "College/University   Doting Love Interests   Gamers   Online Romance   Younger Love Interests   ",
	"rating": "(3.8 / 5.0, 43 votes)",
	"author": "Zhé Shān   折杉   ",
	"year": "\n2019",
	"ranking": "#6970   #2000   #5850   #3078   #6245   ",
	"reviewcount": "12 Reviews sorted by",
	"description": "Online dating has risks, you need to be cautious when meeting!\n\nSince receiving 99 roses, Lin Dongyang knew that this matter couldn’t be done well.\n\n“Senior sister… I like you”\n\nLin Dongyang was so frightened that he was confessed affectionately by the junior brother who he had never met. The reason: He was also a man, but the other party didn’t know!\n\nSince then, Lin Dongyang has brainwashed the junior brother every day, popularized  ‘top ten dangers of online dating’, and instructed the junior brother to give priority to his studies and be the socialist successors! Don’t keep thinking about falling in love!\n\nAs a result, the other party not only sent 99 roses, but also sent a super expensive dress and a woman’s bag!!\n\nYou think it’s over? No! It’s just the beginning.\n\nWhen the junior brother asked him to meet, Lin Dongyang’s palms were sweating and his blood pressure was soaring, so he almost fainted. As he was unable to hold up, he confessed: “Actually… I’m a man, I’m sorry…”\n\nThere was silence on the other side’s WeChat for five minutes. Five minutes later, there was a ‘ding-dong’, and the junior brother said: Come and meet ba, brother\n\nLin Dongyang, who was called brother, felt a burst of weakness. He secretly poked and thought: He won’t want to hammer me, right! Guilty conscience MAX>"
}