{
	"url": "https://www.novelupdates.com/series/cant-save-the-world-by-pretending-to-be-dead/",
	"title": "Can’t Save the World by Pretending to be Dead - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/07/Cant-Save-the-World-by-Pretending-to-be-Dead.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Horror   Shounen Ai   Supernatural   Xuanhuan   ",
	"tags": "Adapted to Drama CD   Awkward Protagonist   Calm Protagonist   Depictions of Cruelty   Ghosts   Gods   Gore   Handsome Male Lead   Introverted Protagonist   Modern Day   Murders   Mysterious Past   Orphans   Romantic Subplot   Seeing Things Other Humans Can't   ",
	"rating": "(4.4 / 5.0, 28 votes)",
	"author": "Mo Chen Huan   莫晨欢   ",
	"year": "\n2020",
	"ranking": "#2000   #2000   #6426   #6620   #5351   ",
	"reviewcount": "6 Reviews sorted by",
	"description": "Lian Xi was born with yin-yang eyes. Since he was a child, from day to night, he would be begged by ghosts to do things for them.\n\nHelping ghosts fulfill their long cherished wishes would result in a reward. However, prior to finishing the task, no one would know if the reward would result in a blessing or a curse.\n\nOnce Lian Xi completes helping a ghost with something, the little ghost would start to glow with light.\n\nIf it was a gold light, that meant a blessing. If it was a red light, that meant a curse.\n\nIf it was a blessing he could win the lotto. If it was a curse he could step into dog sh*t every time he walked out of the door.\n\nAfter finding bugs in his takeout for three days in a row, Lian Xi came to realize: “Only by pretending to be dead can I save my world!”\n\nOriginally he thought that he could live his life peacefully by pretending to be dead, but who knew that more and more ghosts started appearing around him. Not only them, but more and more strange people too. Until suddenly one day, a pure golden light passed by in front of him. Lian Xi’s mouth fell open, dumfounded, and then he reached out and grabbed it!\n\nGold Light / Lie Chen: ???\n\nLian Xi (*Organizing his breathing*): Hello, may I ask, do you have any long cherished wishes? A good deed results in good karma. I’m not interested in money falling from the sky, the most important thing is I’m kind and like to help people. I’m a modern-day Lei Feng and a current-day red-scarfer. I want to help you solve your heart’s problems so you can happily enter reincarnation and return to being a good person~~ \n\nAt the same time, in the underworld’s Manor of Hell-\n\n“Oh my Lord! The King of Hell has gone missing! The River of Forgetfulness has stopped flowing!”\n\nBelieving himself to be the Black Reaper, black-tongued, amnesiac King of Hell Gong x Suddenly turned into the Whiter Reaper cold exterior warm interior pretending to be dead Shou.>"
}