{
	"url": "https://www.novelupdates.com/series/i-got-a-cheat-ability-in-a-different-world-and-became-extraordinary-even-in-the-real-world/",
	"title": "I Got a Cheat Ability in a Different World, and Became Extraordinary Even in the Real World (WN) - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/01/musousuruv1c.jpg",
	"noveltype": "(JP)",
	"genre": "Adventure   Comedy   Fantasy   Harem   School Life   Shounen   ",
	"tags": "Abandoned Children   Ability Steal   Absent Parents   Academy   Accelerated Growth   Adapted to Manga   Adventurers   Anti-Magic   Appearance Changes   Artifact Crafting   Artifacts   Beast Companions   Beastkin   Beautiful Female Lead   Betrayal   Bloodlines   Bullying   Caring Protagonist   Character Growth   Charming Protagonist   Cheats   Clever Protagonist   Complex Family Relationships   Cooking   Demi-Humans   Demons   Dense Protagonist   Depictions of Cruelty   Discrimination   Dragons   Dwarfs   Elves   Evil Gods   Evolution   Family Conflict   Famous Protagonist   Fantasy Creatures   Fantasy World   Fast Learner   Fat to Fit   Friendship   Game Elements   Gate to Another World   Genetic Modifications   Genius Protagonist   Goblins   Gods   Handsome Male Lead   Hard-Working Protagonist   Harsh Training   Human Weapon   Inferiority Complex   Inheritance   Inscriptions   Level System   Magic   Magic Beasts   Magic Formations   Magical Space   Magical Technology   Male Protagonist   Modern Day   Monster Tamer   Monsters   Mythical Beasts   Naive Protagonist   Onmyouji   Orcs   Overpowered Protagonist   Past Trauma   Poor to Rich   Psychic Powers   Race Change   Royalty   Showbiz   Sibling Rivalry   Skill Assimilation   Skill Creation   Spatial Manipulation   Special Abilities   Spirit Advisor   Spirits   Stoic Characters   Strong to Stronger   Sudden Strength Gain   Sword And Magic   Tragic Past   Twins   Ugly to Beautiful   Unique Weapon User   Unique Weapons   Vampires   Weak to Strong   Wealthy Characters   Wizards   World Travel   Youkai   Younger Brothers   Younger Sisters   ",
	"rating": "(3.5 / 5.0, 111 votes)",
	"author": "Miku   美紅   ",
	"year": "\n2017",
	"ranking": "#2000   #2000   #3033   #3215   #2858   ",
	"reviewcount": "17 Reviews sorted by",
	"description": "Since a long time ago, Tenjo Yuuta has always been bullied.\r\n\r\nHe goes to high school while living alone at his late grandfather’s house.\r\n\r\nAlthough he was always met with severe bullying, he found solace during the long holiday break.\r\n\r\nDuring this time, while cleaning his grandfather’s house, he also decided to clean the room where his grandfather keeps the items he collected throughout his life. A room where Yuuta has never entered before.\r\n\r\nWhile trying to organize the items collected by his grandfather, he found a mysterious door that was seemingly cut out from the wall.\r\n\r\nOut of curiosity, he opened it. And then...>"
}