{
	"url": "https://www.novelupdates.com/series/i-accidentally-entered-the-female-supporting-characters-route/",
	"title": "I Accidentally Entered the Female Supporting Character’s Route - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/10/I-Accidentally-Entered-the-Female-Supporting-Characters-Route.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Fantasy   Josei   Mature   Romance   Smut   ",
	"tags": "Beautiful Female Lead   Carefree Protagonist   C*nnilingus   Early Romance   Female Protagonist   First-time Interc**rse   Handsome Male Lead   Love Interest Falls in Love First   Modern Day   Showbiz   Transmigration   Wealthy Characters   ",
	"rating": "(4.2 / 5.0, 196 votes)",
	"author": "Bottle   瓶子   ",
	"year": "\n2020",
	"ranking": "#843   #1989   #2498   #916   #2151   ",
	"reviewcount": "43 Reviews sorted by",
	"description": "One day, an extremely handsome man handed her a seven-figure cheque.\n\nShe looked at the cheque and then at that handsome man. Sure enough, she agreed!\n\nMoney is desirable, but that man is even more desirable!\n\nThen that night, Yun Shu remembered her past life. She learnt that she transmigrated into an entertainment industry romance novel!\n\nThe domineering CEO, who financially provides for her, is the male lead, but she is not the female lead, let alone the female supporting character of the novel!\n\nQAQ She… She seemed to have accidentally stolen the female supporting character’s part… What should she do…\n\nDeep down, Yun Shu felt like quitting. However, when she looked at the cheque in her hand and then at the handsome man in front of her… She…She chooses to be an obedient lover and automatically back off when the female lead appears! [Obedient.jpg]\n\nWho knew that she would be so successful to the extent where she entered the female supporting character’s route and left the female lead with no recourse.\n\n**********\n\nFu Ran, a domineering president, is young, handsome and a late-in-life virgin. Then, in the twenty-ninth year of his life, his notions were evoked by lust when he saw a young celebrity.\n\nAfter successfully acquiring her, he thought his feelings for her would dwindle. But to his surprise, he became addicted and then failed to quit this addiction for the rest of his life. Instead, he fell deeper and deeper…\n\nIn the end, it turned out she wanted to run away?\n\nFu Ran straightened his cuffs and sneered. She shouldn’t even think about that!\n\nPretty, gentle and sweet but salted fish third-rated female celebrity X Unknowingly fawning domineering president.>"
}