{
	"url": "https://www.novelupdates.com/series/stealing-the-empress-man/",
	"title": "Stealing the Empress’ Man - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/08/Stealing-the-Empress-Man.jpg",
	"noveltype": "(KR)",
	"genre": "Drama   Fantasy   Romance   ",
	"tags": "Abusive Characters   Adultery   Affair   Antihero Protagonist   Arranged Marriage   Beautiful Female Lead   Character Growth   Charismatic Protagonist   Child Abuse   Empires   European Ambience   Female Protagonist   Forced Marriage   Handsome Male Lead   Late Romance   Marriage of Convenience   R-15   Revenge   Secret Relationship   Weak to Strong   ",
	"rating": "(4.1 / 5.0, 12 votes)",
	"author": "윤희사   ",
	"year": "\n2022",
	"ranking": "#6970   #2000   #12723   #10840   #11896   ",
	"reviewcount": "No Reviews",
	"description": "“I didn’t expect you to get lost in the castle before you even took off your mourning clothes.”\r\n\r\n“Seeing you come here in person, I think you remembered that night quite well, Grand Duke.'\r\n\r\nHer first marriage gave her wealth and her second marriage gave her power, but her father's greed did not end there. Even before the funeral of her second husband was over, Eliana's father was determined to push her into the position of the Emperor's concubine.\r\n\r\nIf I have to get married, I will decide for myself.\r\n\r\n\r\nThen Grady Kryver appeared before her eyes.\r\n\r\nA war hero, the previous Emperor's illegitimate son, the Emperor's dog, the greatest scoundrel of the Empire, and a ghost that wanders around the Imperial Palace with love for her sister-in-law, the Empress.\r\n\r\nThere was no way he could stand still at the news of the Emperor was trying to bring in a concubine.\r\n\r\n\r\n“You have to tell me what you want as a Grand Duke. Isn't it the Grand Duke who pays the price?'\r\n\r\nGrady Kryver loves Empress Rosella.\r\n\r\nEliana decided to risk her fate in the love of Grady Kryver.\r\n\r\nYou will never fall in love with a man who loves another woman.\r\n\r\n\r\n*\r\n\r\n\r\nEven when Grady bit his lip, Eliana didn't close her eyes. Rather, she put her hands on his shoulders and hugged him tightly.\r\n\r\n“Ugh!”\r\n\r\nA short moan escaped from Grady's lips.\r\n\r\n'Hey, it hurts if you pull my hair like that.”\r\n\r\nEliana, who smiled broadly with her lips covered in blood dripping, leaned down to his ear.\r\n\r\nShe said, 'You're acting like an uneducated bastard, so I'm just treating you the way you are, Your Highness.'>"
}