{
	"url": "https://www.novelupdates.com/series/hollywood-secret-garden/",
	"title": "Hollywood Secret Garden - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2017/01/Hollywood-Secret-Garden.png",
	"noveltype": "(CN)",
	"genre": "Comedy   Fantasy   Gender Bender   Romance   Shoujo Ai   ",
	"tags": "Acting   Beautiful Female Lead   Celebrities   Child Protagonist   Cute Story   Male to Female   Modern Day   Reincarnation   Showbiz   Wealthy Characters   ",
	"rating": "(4.3 / 5.0, 129 votes)",
	"author": "",
	"year": "\n2009",
	"ranking": "#2000   #2000   #4829   #8371   #5376   ",
	"reviewcount": "8 Reviews sorted by",
	"description": "“As everyone knows, since 1993, you have been nominated for an Oscar for your scripts every year. Why is it that you are rarely seen at the award ceremony?”\r\n\r\n“Having gone to the event with a highly anticipatory mood, only to then wait tensely for several hours before returning disappointed, experiencing this once or twice is enough for me.”——Forcing me to wear a dress that shows off my breasts for reporters to take a picture, to allow the eyes of men to eat their fill? It would be better to kill me!\r\n\r\n“You have written scripts tailored specifically for many stars. What allows you to always write suitable scripts for them?”\r\n\r\n“This is a matter of inspiration. I also have a very hard time explaining this, but generally, the stars have some characteristic that inspires me.”——If you reincarnate at this moment as well, I guarantee that you can also accomplish this.\r\n\r\n“In Hollywood, your sex scandals truly are scarce. People have previously said that you are gay, so I would like to ask, do you have a boyfriend?”\r\n\r\n“I very much believe in fate bringing people together, as people can conclude from the scripts I write. I believe that one day, I will meet my true love.”——To be mentally gay or physically gay? Yeah, I choose the latter!\r\n\r\nA thirty year old male NEET wrecks Hollywood reincarnation romance.\r\n\r\nOur slogan is: Creating the most wicked garden of lilies in Hollywood history!>"
}