{
	"url": "https://www.novelupdates.com/series/my-fiancee-is-a-cool-headed-peerless-angel/",
	"title": "My Fiancee is a Cool-Headed, Peerless Angel - Novel Updates",
	"image": "https://www.novelupdates.com/img/noimagefound.jpg",
	"noveltype": "(JP)",
	"genre": "Comedy   Drama   Romance   School Life   Slice of Life   ",
	"tags": "Arranged Marriage   Beautiful Female Lead   Cohabitation   Engagement   Family   Male Protagonist   Popular Love Interests   Slow Romance   ",
	"rating": "(4.1 / 5.0, 88 votes)",
	"author": "Suzuto   すずと   ",
	"year": "\n2020",
	"ranking": "#931   #2091   #4056   #2114   #4757   ",
	"reviewcount": "No Reviews",
	"description": "There was an angel sitting in front of his house.\n\nWhen Koujiro Isshiki returned home from his school, he found Shiori Nanasegawa sitting in front of the house where he lived alone.\n\nShe has an exceptional figure. She has a beautiful face with long, fine sparkling hair, a slender body that makes you want to protect her, and clear skin that has been described as angelic beauty from the heavens.\n\nHowever, She is an expressionless girl who doesn’t talk much, and you can’t read what’s on her mind. Still, she was extremely popular among the boys.\n\nIn less than half a year since entering high school, the number of confessions she has received is said to be in the double digits.\n\nHowever, all of their confessions have been rejected by her. Thus the nickname given to her is…\n\n‘The Cool-Headed and Peerless Angel’\n\nHer nickname comes from the fact that she calmly analyzes her opponents, breaks down their arguments, and then rejects their confessions, as well as her angelic appearance.\n\n‘Why is the cold-hearted and merciless angel in front of my room?’\n\n“You’re going to live in my house?”\n\n“That’s what I said”.\n\n“I’m going to ask you a simple question. Are you sure?”\n\n“What?”\n\n“You’re going to live with a boy, who’s also part of your class”\n\n“Nothing’s wrong with that- after all, you and I are engaged.”\n\nThis is a girl who’s cool and quiet, and as you spend more time with her, you become more and more attracted to her.\n\nAnd you watch her change little by little. and the ice around her melts down.\n\n-This is a story about such a situation.>"
}