{
	"url": "https://www.novelupdates.com/series/the-laid-back-life-in-another-world-of-the-ex-hero-candidate-who-turned-out-to-be-a-cheat-from-level-2/",
	"title": "The Laid-back Life in Another World of the Ex-Hero Candidate Who Turned out to be a Cheat from Level 2 - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2016/12/6183iE1WwtL._SX349_BO1204203200_.jpg",
	"noveltype": "(JP)",
	"genre": "Action   Adventure   Comedy   Drama   Fantasy   Romance   Slice of Life   ",
	"tags": "Adapted to Manga   Beautiful Female Lead   Carefree Protagonist   Cheats   Confident Protagonist   Crafting   Demi-Humans   Demon Lord   Demons   Devoted Love Interests   Dragons   Early Romance   Elves   Fantasy World   Friendship   Game Elements   Game Ranking System   Godly Powers   Guilds   Hiding True Identity   Human-Nonhuman Relationship   Level System   Male Protagonist   Marriage   Merchants   Monsters   Multiple Transported Individuals   Overpowered Protagonist   Pregnancy   Protagonist Strong from the Start   R-15   R*pe   Secret Identity   Skill Assimilation   S*aves   Strong Love Interests   Sudden Strength Gain   Sword And Magic   Transported to Another World   ",
	"rating": "(3.6 / 5.0, 617 votes)",
	"author": "Kinojo Miya   鬼ノ城ミヤ   ",
	"year": "\n2015",
	"ranking": "#3133   #4744   #335   #1285   #82   ",
	"reviewcount": "64 Reviews sorted by",
	"description": "Banaza was summoned to The Magical Kingdom of Kryrode as a Hero Candidate, however, due to having only the abilities of a regular citizen, he was treated as a disqualified Hero. He, who was originally supposed to be returned to his original world, became unable to return due to the Magical Kingdom’s mistake, and inevitably, had to live in this world.\n\nHowever, the moment he became Lv2, Banaza acquired every attainable skill and magical ability, and he became a Super-Cheat with Stats that transcend normal limits! Even so, Banaza , who does things at his own pace with an easygoing smile, takes Lys of the Demon race as his wife, and fully enjoys his newlywed life. He then changes his name to Furio and leads an even more laid-back life! However, chaos is in store for the Furio household; on top of a strange pet and four, freeloading Female-Knights, even a Devil and Former Demon King join in. Despite his circumstances, even with his life becoming increasingly chaotic, Banaza continues to enjoy his laid-back lifestyle.\n\nPlease enjoy the story of the everyday life of the Furio family, which, with the birth of the twins, gets ever increasingly laid-back. Included is also the story of the man who became a Hero in Banaza’s place!>"
}