{
	"url": "https://www.novelupdates.com/series/the-red-thread/",
	"title": "The Red Thread - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/11/52002983._SX318_.jpg",
	"noveltype": "(TH)",
	"genre": "Drama   Fantasy   Romance   School Life   Slice of Life   Tragedy   Yaoi   ",
	"tags": "Adapted to Drama   Adapted to Manga   College/University   Cooking   Cute Protagonist   Fated Lovers   Lovers Reunited   Past Trauma   Reincarnation   Shy Characters   Suicides   Tragic Past   ",
	"rating": "(4.1 / 5.0, 23 votes)",
	"author": "Lazysheep   ",
	"year": "\n2016",
	"ranking": "#2000   #2000   #8767   #13810   #7698   ",
	"reviewcount": "3 Reviews sorted by",
	"description": "Thirty years ago, Korn and Intouch were university students in Bangkok. Intouch entered Korn's life despite knowing that he was the son of one of the most influential people in Bangkok, the mafia. At first, Korn kept pushing Intouch away, but in the end, he couldn't resist the boy who was so full of life where he was the exact opposite and decided to let him into his heart.\r\n\r\nHowever, in a time where homosexuality was unacceptable and having parents that were against their relationship and each other, Korn and In's love was bound to be doomed. Midst the chaos, while Intouch kept on fighting for their future, Korn could not deal with all the suffering his lover was facing and decided to give up. That day, two sounds of a gunshot rang through the air.\r\nTheir story ended with tragedy, but something had already tied itself between them, binding them together even after they were dead.\r\n\r\nYears later, a freshly returned to Thailand, Pharm (19) who is a freshman in T- University has grown up always feeling like he is waiting for someone. Being riddled with sad dreams that always left him waking up with a wet face, fear of loud noises, and a birthmark on his temple, the boy has always felt like there is someone he is missing.\r\n\r\nDean (21), the third year swimming club's president at T- University has also spent his life searching for someone whose face he can not remember. The red thread of fate that had tied them together in their past life once again pulls the two boys back to each other, tying them to each other and a past that might not be worth remembering, but a love that is unforgettable. Because the red thread that binds the two hearts together will always lead one back to the other. Even though it might tangle or stretch, but it will never break.>"
}