{
	"url": "https://www.novelupdates.com/series/i-am-rich/",
	"title": "I Am Rich - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/09/I-Am-Rich.jpg",
	"noveltype": "(CN)",
	"genre": "Josei   Romance   Slice of Life   ",
	"tags": "Beautiful Female Lead   Childhood Friends   Cute Story   Doting Love Interests   Doting Older Siblings   Familial Love   Famous Protagonist   Female Protagonist   Handsome Male Lead   Hiding True Identity   Modern Day   Protagonist Falls in Love First   Secret Crush   Showbiz   Slow Romance   Wealthy Characters   ",
	"rating": "(4.2 / 5.0, 111 votes)",
	"author": "Liu Mang Xing   六盲星   ",
	"year": "\n2020",
	"ranking": "#3802   #1103   #3405   #1214   #3769   ",
	"reviewcount": "20 Reviews",
	"description": "Guan Zhiyi, a third-tier actress who can’t be popular no matter how hard she tried, eventually listened to her family and obediently went on a blind date.\n\nWhen her small group of fans found out about it, they expressed their sorrow one after another. \n\n“My idol is too miserable. She can’t make any money so she has no other choice but to go on a blind date.”\n\n“Let’s do crowdfunding for her return! Daughter! Mama will support you!”\n\n____\n\nLater, in order to refute the exaggerated news on the Internet, Guan Zhiyi started a live broadcast to meet everyone. \n\n“I’m not poor, I live a good life everyday. You don’t have to worry.”\n\nHer fans wailed and cried bitterly: “Our daughter is just so thoughtful! She’s already that miserable yet still not willing to pass on any negativity!”\n\nGuan Zhiyi: “…” \n\nThe poor persona lasted for a long time, until one day, reporters captured Guan Zhiyi leaving a parking lot after filming late at night, driving a global limited-edition supercar and raced all the way into the most expensive villa area in Imperial Capital, where the financial circle big shot Qi Chengyan live.\n\nNetizen 1: “What happened to her hard working and poor persona?”\n\nNetizen 2: “If your acting is terrible, you just go to climb into a rich family, shameless.”\n\nThe Internet was filled with insults. Guan Zhiyi silently posted on Weibo the next morning: “Uh, the house I entered is my own brother’s house. President Qi’s house is next door…”\n\nA few minutes later, Qi Chengyan commented: “Then when will you be willing to enter my house (family)?”\n\nNetizen: “???”>"
}