{
	"url": "https://www.novelupdates.com/series/the-extra-refuses-excessive-obsession/",
	"title": "The Extra Refuses Excessive Obsession - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/04/The-Extra-Refuses-Excessive-Obsession.jpg",
	"noveltype": "(KR)",
	"genre": "Comedy   Fantasy   Harem   Romance   Shoujo   ",
	"tags": "Adapted to Manhwa   Aristocracy   Beautiful Female Lead   European Ambience   Familial Love   Family   Female Protagonist   Magic   Male Yandere   Mob Protagonist   Nobles   Reverse Harem   Sister Complex   Transmigration   Transported to Another World   Wizards   ",
	"rating": "(4.1 / 5.0, 26 votes)",
	"author": "Gliese   글리제   ",
	"year": "\n2021",
	"ranking": "#2000   #2000   #6254   #7042   #3828   ",
	"reviewcount": "6 Reviews sorted by",
	"description": "I thought I was just a one-liner unnamed commoner extra.\n\nUntil the villainous duke, who was known to kill every town he got into, came to light in pursuit of a single young lady.\n\n“Duke Cedric is already halfway through the Empire. I heard he’s coming to this area this month.”\n\nWhy was the bloody duke looking for his youngest sister who had disappeared five years ago?\n\n“Rose hair and golden eyes.”\n\nThat sister’s description was the same as mine.\n\nI think my life is ruined.\n\n***\n\nI then became the young lady known to be the youngest child of a villainous duke who is planning to kidnap and detain the heroine.\n\nAfter this, I am going to live like calm water silently flowing and then I will run away. Because I don’t want to get involved in this crazy political drama in this damn novel.\n\nBut… why was everything so weird?\n\n“Our Amelle, you don’t look so happy. Do you want me to buy an island and build a villa for you?”\n\nMy first brother, who kills people on a normal day, is so impatient to give me something.\n\n“Our baby, can you just throw that away and live with your brother. I think I don’t like being a wizard better than I thought, no?”\n\nThe second child, who left the house ten years ago to become a wizard without any hesitation, came back again and attached himself to me.\n\n“Don’t turn your eyes on the other one, Amelia.”\n\nEven the world’s worst villain, who decreased the population of the continent in half in the original story, is interested in me.\n\n“I’m sorry, gentlemen, but I’m taking the young lady with me today.”\n\nNo, even the heroine, whom I should kidnap, is kidnapping me instead?\n\nAll these humans must be crazy.\n\nI’m just an extra.\n\nWould you mind getting away from me, please?>"
}