{
	"url": "https://www.novelupdates.com/series/the-sovereigns-ascension/",
	"title": "The Sovereign’s Ascension - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2020/12/tsa_2.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Adventure   Fantasy   Harem   Xuanhuan   ",
	"tags": "Amnesia   Arrogant Characters   Beast Companions   Body Tempering   Cold Love Interests   Cultivation   Discrimination   Eidetic Memory   Enlightenment   Fast Learner   Hard-Working Protagonist   Hated Protagonist   Hidden Abilities   Hot-blooded Protagonist   Loner Protagonist   Male Protagonist   Monsters   Mysterious Past   Pill Based Cultivation   Romantic Subplot   Strength-based Social Hierarchy   Sudden Strength Gain   Sword Wielder   Transmigration   ",
	"rating": "(3.4 / 5.0, 75 votes)",
	"author": "Fiery Moon   Yuè Rú Huǒ   月如火   ",
	"year": "\n2016",
	"ranking": "#159   #146   #742   #203   #4615   ",
	"reviewcount": "15 Reviews sorted by",
	"description": "As a lawyer back on earth, Lin Yun had never lost a case. He owed his success to three things: two blessings he received at birth (a photographic memory and the ability to comprehend anything he studies) and an indomitable will he forged himself.\n\nWhile on a trip in Shandong province, he decided he would pay a visit to Mt. Tai. Just as he was cresting the peak, he felt a sharp pain in his chest and his vision went black.\n\nUpon waking up, he found himself in the world of Profound Amber occupying the body of a sword s*ave who had shared his name. The last thing he remembered before dying was the image of a sword piercing his chest.\n\nThrough the memories his body retained the sword s*ave’s life, Lin Yun came to understand the brutality of this world. If he sought respect, he would have to earn it through strength. The weak found no compassion here.\n\nRefusing to leave his fate in the hands of others, Lin Yun set out to become a sovereign. No man or beast would stop him from achieving his destiny.\n\nWith his sword in hand, he would overcome any obstacle.>"
}