{
	"url": "https://www.novelupdates.com/series/the-villainess-is-sick-of-the-whole-thing-so-she-decides-to-pretend-to-have-amnesia/",
	"title": "The Villainess Is Sick of the Whole Thing, so She Decides to Pretend to Have Amnesia - Novel Updates",
	"image": "https://www.novelupdates.com/img/noimagefound.jpg",
	"noveltype": "(JP)",
	"genre": "Drama   Romance   School Life   Shoujo   ",
	"tags": "Academy   Adapted to Manga   Aristocracy   Assassins   Beautiful Female Lead   Betrayal   Broken Engagement   European Ambience   Female Protagonist   Inheritance   Love Interest Falls in Love First   Naive Protagonist   Nobles   Royalty   Schemes And Conspiracies   ",
	"rating": "(3.1 / 5.0, 53 votes)",
	"author": "Kanon   かのん   ",
	"year": "\n2022",
	"ranking": "#2071   #6375   #5027   #4683   #7897   ",
	"reviewcount": "3 Reviews sorted by",
	"description": "Cecilia Foagat, a duchess with bright red hair and a black, enchanting dress, had her face thickly made up and her bosom bare.\r\n\r\nHer fiancé, the country’s first prince, Hubert Rey Travelia, was chosen for her at an early age. \r\n\r\nA prince with golden hair and blue eyes.\r\n\r\nHer friend Evona taught her about the prince’s tastes and the latest in makeup, and Cecilia has been his fiancée ever since she was a little girl.\r\n\r\nShe says he likes sexy women, so the dress always opens wide around her chest and has a calming shade.\r\n\r\nShe said she liked a woman with a lot of makeup on her face, so she put a lot of makeup on her face.\r\n\r\nShe said she likes women who aren’t too smart, so she pretended to be an idiot.\r\n\r\nShe wore dresses without a shred of class that she didn’t want to wear and thick makeup. Talking like an idiot It was torture for Cecilia, but she still had to do her best to match the prince’s taste as his fiancée.\r\n\r\nAnd the result was…\r\n\r\n“I am breaking off my engagement to a vile, wh*rish woman like you. In exchange, I nominate as my betrothed the beautiful, chaste, and cultured Marquess Evona Randall!”\r\n\r\nCecilia is so fed up with everything after the breakup of her engagement that she feigns amnesia to escape the whole thing. Then, for some reason, everyone around her starts criticizing the prince.>"
}