{
	"url": "https://www.novelupdates.com/series/i-only-treat-villains/",
	"title": "I Only Treat Villains - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/01/I-Only-Treat-Villains.jpg",
	"noveltype": "(KR)",
	"genre": "Adventure   Comedy   Drama   Fantasy   Harem   Romance   Shoujo   ",
	"tags": "Aristocracy   Beautiful Female Lead   Calm Protagonist   Character Growth   Clever Protagonist   Cold Love Interests   Cold Protagonist   Crime   Devoted Love Interests   Different Social Status   Doting Love Interests   European Ambience   Female Protagonist   Glasses-wearing Love Interests   Handsome Male Lead   Hard-Working Protagonist   Healers   Love Interest Falls in Love First   Magic   Multiple Personalities   Nobles   Reincarnated in Another World   Reincarnation   Reverse Harem   Slow Growth at Start   Slow Romance   Store Owner   Strong Love Interests   ",
	"rating": "(3.9 / 5.0, 43 votes)",
	"author": "Moon Sihyun   문시현   ",
	"year": "\n2020",
	"ranking": "#2000   #4718   #4154   #3230   #2567   ",
	"reviewcount": "6 Reviews sorted by",
	"description": "“…Some crazy bas**** is standing in front of my house again.”\n\nMy house is a jewel shop, but someone keeps bringing injured people to my front door. They were so meddlesome that I treated them while swearing at them. Others wished that I would get along well with them.\n\n“Didn’t you save the head of an assassination guild last time?”\n\n“She’s a woman.”\n\n“Oh, what about the vicious loan shark who owns that place worth a billion marks on Second Avenue?”\n\n“She’s a woman too.”\n\n“What about the person who dropped you off in front of your house and left in a noble’s carriage?”\n\n“She’s a young lady as well.”\n\nAnd then the sixth person came. This was the first time a man came, and a handsome one at that.\n\n“Take it off.”\n\n“What? What? WHAT? Oh … oh, you meant my glasses.”\n\nThis man was the final villain of the novel, who had a completely different personality during the day and the night.\n\nDuring the day, he was simply an innocent and naïve young man.\n\nBut at night…\n\n“Why? You asked me to take it off. What should I take off this time?”>"
}