{
	"url": "https://www.novelupdates.com/series/after-i-was-exiled-i-became-a-noble-minister/",
	"title": "After I was Exiled, I Became a Noble Minister - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/08/After-I-was-Exiled-I-Became-a-Noble-Minister.jpg",
	"noveltype": "(CN)",
	"genre": "Comedy   Drama   Fantasy   Josei   Romance   ",
	"tags": "Ancient China   Caring Protagonist   Court Official   Female Protagonist   Handsome Male Lead   Nobles   Power Couple   Reincarnated in Another World   Transmigration   ",
	"rating": "(4.5 / 5.0, 10 votes)",
	"author": "冠滢滢   ",
	"year": "\n2022",
	"ranking": "#2384   #1359   #11505   #7856   #11065   ",
	"reviewcount": "1 Review sorted by",
	"description": "Mu Wan Qing was dressed as cannon fodder playing a female supporting role in a book about a reborn female protagonist.\n\nThe heroine was her amazing and talented cousin. She was reborn on the way to exile, and she devoted all her clan to help her ascend to the backyard of the Emperor.\n\nAnd Mu Wan Qing’s whole family was used as a stepping stone and was destroyed on the road of exile.\n\nMu Wan Qing: I am so tired, let’s destroy it.\n\nIn the chaos of the house raiding scene, Mu Wan Qing hurriedly grabbed the marriage certificate with a swoosh.\n\nDuring the breaking up of the marriage, Mu Wan Qing exchanged the marriage certificate for a mule cart and twenty taels of silver and started a long journey of exile.\n\nIn order to survive, she resorted to roasting pig trotters, making fried chicken, farming cotton, and breeding sheep. \n\nEngaged in building water power, building cities, building cement roads, and creating a prosperous fortress in the south.\n\nAccidentally played a big game, and the plot was really shifted…\n\nThe Reborn Cousin: Everyone is concentrating on building infrastructure, how can I play the script of the palace fight?!\n\nAt the palace banquet, the arrogant and arrogant frontier master sat alone while pouring the drink. There was a commotion at the door, and the beautiful and heroic first female assistant, Mu Wan Qing walked in surrounded by everyone.\n\nThe man put down the wine glass and quickly ran over, with his eyes full of love, he said, “Madam, I can’t eat without you.”\n\nThere was an uproar at the scene.>"
}