{
	"url": "https://www.novelupdates.com/series/survive-gwanggong/",
	"title": "Survive! Gwanggong! - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2022/04/Survive-Gwanggong.jpg",
	"noveltype": "(KR)",
	"genre": "Adult   Drama   Mature   Romance   Smut   Yaoi   ",
	"tags": "Comedic Undertone   Complex Family Relationships   Family Business   Family Conflict   First Love   Love at First Sight   Love Interest Falls in Love First   Love Rivals   Love Triangles   Misunderstandings   Modern Day   Obsessive Love   Office Romance   Reincarnated in a Game World   ",
	"rating": "(4.0 / 5.0, 19 votes)",
	"author": "이설린   ",
	"year": "\n2020",
	"ranking": "#2000   #6152   #11303   #6880   #9787   ",
	"reviewcount": "No Reviews",
	"description": "He possessed a Gwanggong* in a BL game his junior made.\n\nTheir names were the same, but there was nothing similar between Gwanggong ‘Kwak Seon-woo’ and small citizen ‘Kwak Seon-woo’. (곽선우)\n\nA black and white house with no traces of any human presence, a refrigerator containing only EviX and Western liquor.\n\n“Agh, it’s cold!”\n\n\n\nA shower with only freezing cold water pouring from the shower head, but the water temperature couldn’t be adjusted.\n\nHis dear hot chocolate was desperately needed, but the only coffees available were espresso and americano.\n\nHe couldn’t even choose a branded sandwich, let alone dakhanmari, which was his favourite food.\n\nMealtimes were constantly canceled. He needs to keep them somehow.\n\n“How about just one meal… can’t we eat properly?”\n\n\n\n\n\n\n\nIn this harsh world, there was only one person who could help Gwanggong live a human life!\n\n…However, he never wanted to create such a strange atmosphere.\n\nUnexplained love for the main sue** and anger that burst when he saw the sub-gong***.\n\nWith one ear letting out the emotions that the system imposed, Seon-woo was busy choosing options.\n\n‣ “Shut up!”\n\n‣ “Go away!”\n\n‣ “Nonsense!”\n\nIf he could choose…\n\nNote :\n\n*Gwanggong = obsessive gong, obsessive ball, similar to yandere seme\n\n**Main sue = main character sue, MC uke\n\n***Sub-gong = second gong, the second male lead>"
}