{
	"url": "https://www.novelupdates.com/series/kidnapped-by-the-crazy-duke/",
	"title": "Kidnapped By The Crazy Duke - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/09/Kidnapped-By-The-Crazy-Duke.jpeg",
	"noveltype": "(KR)",
	"genre": "Fantasy   Mature   Psychological   Romance   ",
	"tags": "Absent Parents   Anti-social Protagonist   Apathetic Protagonist   Aristocracy   Calm Protagonist   Confinement   Cruel Characters   Engagement   European Ambience   Female Protagonist   Generals   Handsome Male Lead   Kidnappings   Lovers Reunited   Male Yandere   Manipulative Characters   Mercenaries   Military   Mysterious Family Background   Mysterious Past   Nobles   Politics   Possessive Characters   Previous Life Talent   Royalty   Schemes And Conspiracies   Sibling Rivalry   Transmigration   Wars   Yandere   ",
	"rating": "(4.2 / 5.0, 82 votes)",
	"author": "Ianna Kim   이아나킴   ",
	"year": "\n2021",
	"ranking": "#6970   #2000   #3533   #4491   #2665   ",
	"reviewcount": "11 Reviews sorted by",
	"description": "I became a supporting character in a captivity-abduction classic novel set against the backdrop of a world war. Unlike the protagonist’s sister, who was treated coldly and abused at home, as “Diana Claire,” I was abducted in place of the protagonist in order to get out of this hell.\n\n“Don’t leave me, princess. All right? You can’t die.”\n\nThe Duke that abducted me was a beautiful madman, an educated madman. He would visit me from time to time and stare at me as if I were an important piece of art he had carefully stored away. His eyes were ascetic yet strangely decadent, sensual yet full of flavor. I didn’t know why this man, who seemed insane, would do this to me.\n\nWhat was inside the pretty wrapping paper of gentlemanly manners, elegant and graceful appearance, was a kind of madness. The man’s madness gave off a calm, eerie, and bizarre atmosphere like a work of art with a twisted meaning.\n\n“I want to kill everyone except you, my Diana.”\n\nShe tried to control and tame this man, possessed by a cruel demon.\n\nOriginally, the word she always heard in life was “madman”.>"
}