{
	"url": "https://www.novelupdates.com/series/rebirth-of-the-heavenly-empress/",
	"title": "Rebirth of the Heavenly Empress - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/01/Rebirth-of-the-Heavenly-Empress.jpg",
	"noveltype": "(CN)",
	"genre": "Action   Fantasy   Josei   Romance   School Life   ",
	"tags": "Alchemy   Arms Dealers   Beautiful Female Lead   Betrayal   Bloodlines   Broken Engagement   Calm Protagonist   Cold Love Interests   Cold Protagonist   Couple Growth   Doctors   Eidetic Memory   Female Protagonist   Firearms   Genius Protagonist   Handsome Male Lead   Hiding True Abilities   Human Experimentation   Love Interest Falls in Love First   Loyal Subordinates   Medical Knowledge   Mercenaries   Modern Day   Multiple POV   Mutated Creatures   Overpowered Protagonist   Pets   Pill Concocting   Power Couple   Previous Life Talent   Secret Organizations   Smart Couple   Strong Love Interests   Time Skip   Transmigration   ",
	"rating": "(3.4 / 5.0, 26 votes)",
	"author": "Road of Flowers   Yīlù Fán Huā   一路烦花   ",
	"year": "\n2019",
	"ranking": "#2000   #2000   #7896   #13808   #8373   ",
	"reviewcount": "7 Reviews sorted by",
	"description": "She is the legendary queen of mercenaries whose name daunts even the big shots in society. With an ancient jade pendant in her hand, she is great at almost everything, be it seeking the truth or the art of healing. \r\n\r\nHowever, she unexpectedly reincarnates into a dumb good-for-nothing whom everyone loathes and hates. She is even the laughing stock in society! \r\n\r\nThe once legendary genius of the mercenary regiment can't help but express her disapproval. \r\n\r\n——Who are you trying to kid? When I was playing with grenades and explosives, all of you were still playing in the mud! \r\n\r\nA good-for-nothing? Do you feel great after having your arm twisted by a good-for-nothing? \r\n\r\nBottom of the level? Allow me to show you what it means to be a genius! \r\n\r\nDid someone just call her untalented as compared to her younger sister—born from the same father but different mother—who is gifted in business, finance and business management? Humph, do they know that even the man who stands at the top of the corporate world once begged her to take him in as her disciple? \r\n\r\nAnd her father? If she were to mention the name of her biological father, even the world would be shocked... \r\n\r\nA mysterious ancient healer, they said... She is their saving grace in the eyes of countless patients. \r\n\r\nAn annihilator, they claim... She is a force to be reckoned with. \r\n\r\nPossessing both beauty and great acting skills, she is a goddess whom everyone looks up to in the entertainment industry. \r\n\r\nDespite reincarnating into a human again, she still manages to take the world by storm and even accidentally becomes the Missy whom no one dares to trifle. \r\n\r\nOn the one hand, she controls life and death. On the other hand, she controls fate and destiny. She tortures those who deserve it and takes revenge on those who once bullied her. She plays around with influential families and the entertainment industry while casually impressing a certain someone in the process. A legend, indeed.>"
}