{
	"url": "https://www.novelupdates.com/series/civil-servant-hunters-s-class-resignation-log/",
	"title": "Civil Servant Hunter’s S-class Resignation Log - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/07/Civil-Service-Hunters-Slevel-Resignation-Log.jpeg",
	"noveltype": "(KR)",
	"genre": "Action   Fantasy   Romance   ",
	"tags": "Accelerated Growth   Beautiful Female Lead   Cheats   Comedic Undertone   Contracts   Dungeons   Familial Love   Fantasy World   Female Protagonist   Game Elements   Gate to Another World   Hunters   Level System   Magic   Modern Day   Monsters   Overpowered Protagonist   Past Plays a Big Role   Special Abilities   System Administrator   Weak to Strong   ",
	"rating": "(4.5 / 5.0, 97 votes)",
	"author": "Nocta   녹타   ",
	"year": "\n2021",
	"ranking": "#596   #479   #3063   #753   #2818   ",
	"reviewcount": "14 Reviews",
	"description": "A low-level civil servant. An F-class hunter. Yoon Seora thought that’s how she would live for the rest of her life.\n\nUntil one day she was thrown into a dungeon alone.\n\n“System, you f*cking son of a b*tch!”\n\nThe moment death was right around the corner, everything was turned upside down by her cry that burst out unconsciously.\n\n[Checking information about ‘Yoon Seora’, the awakened who uttered abusive language at the system administrator]\n[Do you wish to sign a contract with the system administrator?]\n​\n\nSo I happily signed a contract with the little system administrator who had appeared out of nowhere…\n\n【The overall evaluation value is readjusted.】\n\n【The Awakened ‘Yoon Seora’ (S-class)】\n\n​\n\nWait a minute, Administrator-nim.\n\nYou didn’t mention I would jump from F to S-class.\n\n【Administrator: (´ ε ` ʃƪ)♡】\n\n【Administrator: ♡ (ʃƪ ˘ ³˘)】\n\n【Administrator:  (ง・▽・)ว】\n\nIn addition, this administrator who overuses emoticons is too unreliable.\n\nWhatever. By being an S-class I was going to quit being a dirty civil servant who always works overtime.\n\n“I’ve never seen you in the past. Who are you?”\n\n“Hi, I’m a contractor for the world administrator.”\n\n​“I have never seen you before. Who are you?”\n\n“Hello? I am the world administrator’s contractor.”\n\nSomehow, I ended up in the center of an incident where the world is filled left and right with returnees. Can I really quit?\n\nResignation Difficulty SSS+. Stay alive, office worker!>"
}