{
	"url": "https://www.novelupdates.com/series/after-i-was-reborn-i-was-caught-by-an-actor/",
	"title": "After I Was Reborn, I Was Caught by an Actor - Novel Updates",
	"image": "https://cdn.novelupdates.com/images/2021/10/After-I-was-reborn-I-was-caught-by-an-Actor.jpg",
	"noveltype": "(CN)",
	"genre": "Drama   Romance   Shounen Ai   Slice of Life   ",
	"tags": "Acting   Calm Protagonist   Celebrities   Confident Protagonist   Doting Love Interests   Handsome Male Lead   Love Interest Falls in Love First   Multiple Reincarnated Individuals   Older Love Interests   Reincarnation   Second Chance   Showbiz   Wealthy Characters   ",
	"rating": "(4.1 / 5.0, 48 votes)",
	"author": "合屿   ",
	"year": "\n2020",
	"ranking": "#2686   #883   #5247   #6708   #4995   ",
	"reviewcount": "9 Reviews sorted by",
	"description": "For half of his life, Qin Qing has been fighting in the entertainment circle. He gained fame and fortune but his body also collapsed.\n\nHe was reborn and returned to the age of 18. He just wants to stay away from scumbags, earn some money, read books, enter university, and be a healthy and happy ordinary person.\n\nWho would have thought that not even two months of being an ordinary person he was caught by a film emperor.\n\n……\n\nQin Qing: Carefully work. Work hard to earn money. \n\nFilm Emperor: Do what work. Give you a newly acquired company.\n\nQin Qing: …… \n\nQin Qing: Scheming? deceiving people? once again?\n\nFilm Emperor: My person, who dares move you?\n\nQin Qing: ???\n\nQin Qing: Save money to buy a house. \n\nFilm Emperor: Would you like a duplex with a 500 ft rooftop garden? Or river view villa? \n\nQin Qing: …… \n\nQin Qing: Carefully study. take the college entrance exam. \n\nFilm Emperor: in those days, In the whole city, i was ranked in the top 100 in the college entrance exam. what question is hard, I will teach you. \n\nQin Qing: I’m only eighteen! \n\nFilm emperor: I know. the problem of age difference, I will overcome it myself. \n\nQin Qing: …… \n\n—-\n\nSu Zhihe was very pleased with his new small assistant, he looked pleasing to the eye and was good everywhere.\n\nSince he liked it a lot, Su Zhihe decided to let his iron tree bloom*. Eighteen years was not considered young , the age difference of a few years was just right.\n\nNot human?\n\nHe can be a dog to chase his boyfriend.>"
}